{"authors": [], "date_download": "2020-05-04 20:14:07", "date_modify": "2020-05-04 20:14:07", "date_publish": "2020-04-07 19:32:15", "description": "ORINDA, Calif. (AP) — Coronavirus infections reported at a nursing home in the San Francisco Bay Area increased to nearly 50 from 27 last week and one infected person has died, officials said....", "filename": "_5d753a3f8e000f1492ede764592dab0e_1588623247.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5d753a3f8e000f1492ede764592dab0e_1588623247.html", "title": "Coronavirus cases surge at some California nursing homes", "title_page": "Coronavirus cases surge at some California nursing homes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ORINDA, Calif. (AP) — Coronavirus infections reported at a nursing home in the San Francisco Bay Area increased to nearly 50 from 27 last week and one infected person has died, officials said.\nAt Orinda Care Center, 27 residents and 22 staff members have tested positive for the virus. Four residents have been hospitalized while the rest remained at the facility, according to officials at Contra Costa Health Services.\nOne person in hospice care at the facility who had tested positive for COVID-19 died over the weekend, a health department spokesman said.\nCounty health officials began investigating the outbreak last week, after two staff members sought medical care for coronavirus symptoms. By Friday, test results showed 24 residents and three employees were infected, the East Bay Times reported Tuesday .\nOutbreaks at nursing homes and elder residences have alarmed experts.\nMehrdad Ayati, a doctor of geriatric medicine who teaches medicine at Stanford University, said he and his colleagues have been very worried about the vulnerable populations in nursing homes.\n“We need to be massively testing the skilled nursing facilities. … These are going to be the people overwhelming the acute care centers,” Ayati told the East Bay Times. “Community hospitals will be overwhelmed. Then we’ll have a high number of mortalities.”\nElsewhere, at Canyon Springs Acute Care in San Jose, the number of infections among patients and staff jumped from 11 to 20 since Friday, with 16 people awaiting test results, the newspaper reported.\nIn central California, Tulare County health officials reported 44 people have tested positive for COVID-19 at a Visalia nursing home.\nThe Tulare County Department of Health said last week that six patients and two healthcare workers had tested positive for the virus. That number has increased to 25 residents and 19 staff members, KMPH-TV reported .\nIn Yucaipa in San Bernardino County, eight nursing home residents were hospitalized in a coronavirus outbreak that infected nearly 60 people and killed two of them, officials said last week. Six staff members also tested positive for the virus.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.", "url": "https://apnews.com/5d753a3f8e000f1492ede764592dab0e"}