{"authors": ["Christina A. Cassidy"], "date_download": "2020-05-04 20:04:39", "date_modify": "2020-05-04 20:04:39", "date_publish": "2020-04-08 21:02:35", "description": "New Jersey and Virginia on Wednesday joined at least 15 other states in delaying their primaries amid the coronavirus pandemic so election officials can make preparations to address public health...", "filename": "_0bc66f81f1fdda7b1fdae67218050d90_1588622679.html", "image_url": "https://storage.googleapis.com/afs-prod/media/10f93ce9d53f4eb6a1d20718c2c007b3/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bc66f81f1fdda7b1fdae67218050d90_1588622679.html", "title": "New Jersey, Virginia push back primaries amid outbreak", "title_page": "New Jersey, Virginia push back primaries amid outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "New Jersey and Virginia on Wednesday joined at least 15 other states in delaying their primaries amid the coronavirus pandemic so election officials can make preparations to address public health concerns and deal with a poll worker shortage brought on by the outbreak.\nThe two states were the first to postpone their elections since Wisconsin this week declined to move its primary, meaning some voters had to ignore orders to stay at home to help stem the outbreak so they could cast ballots at busy polling places.\n“Our democracy cannot be a casualty of COVID-19,” Democratic New Jersey Gov. Phil Murphy said, adding that he didn’t want his state to be like Wisconsin, “where folks had to pick between exercising their right to vote on the one hand and protecting their personal health.”\nNew Jersey has been among the states hardest hit by the outbreak. More than 1,500 people have died there, and the state has been on virtual lockdown for weeks.\nIt now plans to hold its presidential and state primaries July 7 instead of June 2, while Virginia will push its June 9 primaries for Congress out two weeks to June 23. Virginia had already held its presidential primary before the outbreak worsened.\nTuesday’s election in Wisconsin highlighted the choices confronting voters on exercising their constitutional rights in a time of a pandemic. The conservative-learning Wisconsin Supreme Court had declined to delay the election, despite a statewide order from the Democratic governor telling people to stay home and avoid crowds.\nIn Milwaukee, thousands of voters who did not receive an absentee ballot in time or who wanted to vote in person had to congregate at a handful of voting sites that were able to open because of staffing shortages. Some endured a two-hour wait to cast ballots in lines that stretched four or five blocks.\nDemocratic Virginia Gov. Ralph Northam said his state’s delay wasn’t ideal but was necessary, giving election officials more time to prepare and make any necessary changes.\n“As other states have shown, conducting an election in the middle of this global pandemic would bring unprecedented challenges and potential risk to voters and those who work at polling places across the Commonwealth,” Northam said.\nVirginia has no marquee primary races this year. The most-high profile race that is affected is the Republican primary for U.S. Senate, although there were no well-known candidates looking to challenge Democratic Sen. Mark Warner.\nMany states are weighing whether or how to expand voting by mail. Among them is Minnesota, where Secretary of State Steve Simon went before a legislative committee Wednesday asking for temporary authority to increase such opportunities.\nThe “ugly scene” of Tuesday’s chaotic election in neighboring Wisconsin provided a glimpse of what could happen in Minnesota without the one-time changes, Simon told the committee, which met remotely and did not vote on the proposal.\n“People were forced in Wisconsin to decide between their health and exercising their right to vote,” he said. “And it’s not just Wisconsin. All over the country, voters are very worried.”\n___\nCassidy reported from Atlanta. Contributing to this report were Associated Press writers Mike Catalini in Trenton, New Jersey, Alan Suderman in Richmond, Virginia, and Steve Karnowski in Minneapolis.", "url": "https://apnews.com/0bc66f81f1fdda7b1fdae67218050d90"}