{"authors": ["Eric Levenson", "Ganesh Setty"], "date_download": "2020-05-04 16:13:46", "date_modify": "2020-05-04 16:13:46", "date_publish": "2020-04-03 12:33:56", "description": "Given the dangers doctors face on the frontlines of the coronavirus pandemic, Dr. Matthew Bai and his wife made a difficult decision over the weekend.", "filename": "2020_04_03_us_coronavirus-new-york-hospital_index_1588608826.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402092126-dr-matthew-bai-mount-sinai-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_coronavirus-new-york-hospital_index_1588608826.html", "title": "A day in the life of one emergency doctor in a New York hospital during coronavirus", "title_page": "New York coronavirus: A day in the life of one emergency doctor in a Queens hospital - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Given the dangers doctors face on the frontlines of the coronavirus pandemic, Dr. Matthew Bai and his wife made a difficult decision over the weekend.\n\"My wife and I decided that it would be safer for our family, for our 17-month-old daughter and my wife, to leave our apartment until this is over, since I'm in and out of this high-risk environment everyday,\" he said to the camera while sitting in his car. \"I don't know how long it's gonna be, but this morning when I left the house and said goodbye to my wife and my daughter for who knows how long. It's gonna be several weeks probably before I see them in person again.\"\nBai, an attending physician in the emergency department at Mt. Sinai Queens hospital, spoke about his difficult decision as part of a video diary documenting his day in the coronavirus pandemic.\nNew York has been the hardest hit state in the U.S. with over 84,000 confirmed coronavirus cases and more than 2,200 deaths. The surge in cases has threatened to overwhelm the health care system, and doctors have warned they are running low on space, ventilators and supplies.\nRead More", "url": "https://www.cnn.com/2020/04/03/us/coronavirus-new-york-hospital/index.html"}