{"authors": ["Priscilla Alvarez", "Jeremy Diamond", "Majlie De Puy Kamp"], "date_download": "2020-05-04 15:59:17", "date_modify": "2020-05-04 15:59:17", "date_publish": "2020-04-01 10:03:26", "description": "Days after the Trump administration enlisted manufacturers to mass-produce medical supplies to address the coronavirus pandemic, medical and ventilator manufacturing companies said they have pressed the federal government to take on the role of deciding where to place their supplies.", "filename": "2020_04_01_politics_coronavirus-manufacturers-ventilators_index_1588607957.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330095106-04-new-york-medical-supplies-0323-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_coronavirus-manufacturers-ventilators_index_1588607957.html", "title": "Companies making medical supplies say feds aren't taking charge", "title_page": "Companies making medical supplies say feds aren't taking charge - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Days after the Trump administration enlisted manufacturers to mass-produce medical supplies to address the coronavirus pandemic , medical and ventilator manufacturing companies said they have pressed the federal government to take on the role of deciding where to place their supplies.\nBut those calls, these companies said, have gone unanswered.\nMeanwhile, the Federal Emergency Management Agency, which hasrecently taken the lead on federal coordination , also appears to be struggling to get supplies where they need to go.\nThat's left states on the front lines, which are still trying to get necessary items to treat patients as the death toll climbs, coming up short.\n\"Time to say to that federal government that the FEMA, the HHS, you have to learn how to do your job and you have to learn how to do it quickly, because time is not our friend. It's about a social stamina,\" the New York Democrat said.\n\"We're desperate for it,\" Connecticut Gov. Ned Lamont told CNN's Wolf Blitzer on \"The Situation Room,\" referring to personal protective equipment.\nIn an advisory to stakeholders this week, FEMA said it will allocate supplies based on \"data-informed decisions\" that will be coordinated between the government and the private sector.\nBut companies are calling on the government to take a more active role and decide which states and counties should receive which types of ventilators\nA spokesperson for Medtronic, one of the world's leading makers of medical devices, said the company wants the federal government in charge.\n\"It is Medtronic's strong preference that the federal government in the form of FEMA and HHS take over the allocation of ventilators,\" the spokesperson said.\nMedtronic is scaling up production at its plant in Ireland to roughly 600 high-performance ventilators a week, up from about 100 a week under regular circumstances.\n\"Our biggest push that we have been continuing to make is for FEMA and HHS ... for them to really take on the role of the allocator,\" one ventilator executive said, adding that the lines of communication with the federal government have been \"completely open.\"\n\"We're doing our best based on what we're hearing from states, from the federal government and from (foreign) ministers of health, but we're only one company with one aspect of the solve,\" the executive said.\nThe Trump administration, under mounting pressure to fill supply shortages, is turning to private companies to manufacture items, like ventilators and personal protective equipment, for hospitals inundated with coronavirus patients. Late last week, after urging from state leaders, President Donald Trump invoked the Defense Production Act to require General Motors to produce more ventilators to deal with increased hospitalizations.\nTrump said Tuesday that there are almost 10,000 ventilators being \"held back\" from distribution because \"the surge is coming.\"\n\"We have to hold them back, because the surge is coming, and it's coming pretty strong and we want to be able to immediately move it into place without going and taking it, so we're ready to go.\"\nTrump previously said he thinks it would be difficult to get equipment back from states and redistributed once it has been issued to hospitals.\nAnother manufacturer said it is trying to scale up production to meet demands but that it's \"not set up to triage orders in terms of severity.\" The spokesperson said the situation can \"become unwieldy quickly,\" as the company tries to work with all 50 states, plus the District of Columbia, Puerto Rico and the federal government at once.\nCNN reached out to FEMA for comment.\nAn agency within the Department of Homeland Security, FEMA at first filled a supporting role for HHS. Its infrastructure and know-how on disaster response put the agency in a unique position to help with the coronavirus outbreak. But facing a quickly evolving nationwide pandemic, FEMA also appears to be in a scramble of its own.\nIn some cases, states have expected shipments only to have them suddenly shifted elsewhere. Lamont reiterated Tuesday that his state had been promised another federal shipment of personal protective equipment , but at the last minute FEMA told him that Connecticut had more than a three-day supply and consequently the agency would reroute the promised shipment elsewhere.\nSimilarly, Democratic Sen. Elizabeth Warren of Massachusetts requested information on how the federal government plans to get equipment to her state in a letter to FEMA Administrator Pete Gaynor , adding that two orders of supplies had been \"seized by federal authorities while en route to the Commonwealth.\"\n\"When we ask for supplies and equipment that they're unwilling to give us, the rationale is because they're more needed elsewhere,\" a Washington state official told CNN.\n\"We're concerned because we've seen increases in deaths and the rate of growth of the virus in many parts of our state outside of King County and believe we have significant needs and growing needs across our state,\" the official added. \"Despite some early signs of improvement, it's clear we have a long way to go.\"", "url": "https://www.cnn.com/2020/04/01/politics/coronavirus-manufacturers-ventilators/index.html"}