{"authors": ["Tom Foreman Jr."], "date_download": "2020-05-04 20:17:42", "date_modify": "2020-05-04 20:17:42", "date_publish": "2020-04-06 18:03:51", "description": "WINSTON-SALEM, N.C. (AP) — When it was apparent there would be no NCAA men's basketball tournament and no Final Four, Max Goren set out to save the one tradition associated with all the hoopla....", "filename": "_f94a49dd825da30611dec625918951cf_1588623462.html", "image_url": "https://storage.googleapis.com/afs-prod/media/31cdc001ce4d4ac1aaffb0adaf216b2d/2400.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f94a49dd825da30611dec625918951cf_1588623462.html", "title": "College student fills void with 'One Shining Moment' video", "title_page": "College student fills void with 'One Shining Moment' video", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 8, 2013, file photo, Michigan guard Trey Burke (3) walks off the court as confetti falls on Louisville players, including Russ Smith (2), Luke Hancock (11), Stephan Van Treese (44) and Zach Price (25), after the NCAA Final Four tournament college basketball championship game in Atlanta. Coronavirus stopped March Madness before it could begin, meaning there would be no men's national college basketball tournament and no championship game. The virus also silenced another long-standing tradition, but Max Goren refused to let that tradition die. (AP Photo/Atlanta Journal-Constitution, Curtis Compton, File)\nFILE - In this April 8, 2013, file photo, Michigan guard Trey Burke (3) walks off the court as confetti falls on Louisville players, including Russ Smith (2), Luke Hancock (11), Stephan Van Treese (44) and Zach Price (25), after the NCAA Final Four tournament college basketball championship game in Atlanta. Coronavirus stopped March Madness before it could begin, meaning there would be no men's national college basketball tournament and no championship game. The virus also silenced another long-standing tradition, but Max Goren refused to let that tradition die. (AP Photo/Atlanta Journal-Constitution, Curtis Compton, File)\nWINSTON-SALEM, N.C. (AP) — When it was apparent there would be no NCAA men’s basketball tournament and no Final Four, Max Goren set out to save the one tradition associated with all the hoopla.\nThe coronavirus pandemic stopped March Madness before it could begin. But Goren, sitting at home after North Carolina State University shut down, put together his own video version of “One Shining Moment,” the CBS Sports tradition that usually follows the national championship game. It always includes the song of the same title written by David Barrett and sung by the late Luther Vandross. It would have played after the final buzzer Monday night, had there been a game.\n“Obviously, I was bummed out,” Goren said, referring to his reaction that postseason basketball was gone, meaning he wouldn’t know if his North Carolina State team would make the field of 68. “I was on YouTube watching just a bunch of the old ‘One Shining Moment’ videos from past tournaments.”\nGoren remembers seeing online a mention that, despite the lack of a tournament, the traditional video should go on.\n“I thought that was something that I could do,” he said. “So, the Saturday morning before what would have been Selection Sunday, I just kind of sat down, and I did it.”\nGoren’s work became something of a sensation, drawing nearly 63,000 views as of Monday, and requests to simulate his work for other sports.\n“I got on my laptop. I downloaded the song. As I went, I searched YouTube for clips to add until I got to the three minutes and five seconds which ‘One Shining Moment’ is,” he said.\nThe video, which Goren said he finished in three and a half hours, features a variety of buzzer-beating shots, including the layup by Nathan Bain that took Stephen F. Austin to an upset victory over then top-ranked Duke on the Blue Devils’ home court. Duke was featured again in its own buzzer beater against North Carolina. There’s Michigan State guard Cassius Winston kissing his home court as he comes out of the last game of college career.\nDayton’s Obi Toppin and his highlight-quality dunks are included, and Goren gave a nod to his own school as he featured the Wolfpack’s Markell Johnson and one of his three half-court shots. He did include highlights from the few conference tournaments that were completed before college basketball was brought to a halt.\n“I think Max did a terrific job,” Barrett said in an email. “I hope he considers that line of work actually, because he has an artist’s eye. There are a lot of young men who worked hard all year for their ‘shining moments.’” Max did his best to celebrate them. Congratulations.”\nGoren posted the video to YouTube on March 14. He didn’t tout his video save for posting the link on his Twitter page and mention from his father on Facebook. He didn’t plan on a lot of people seeing it.\n“I didn’t really say anything about it to anyone, really,” he said. “It was something I just kind of made for fun, I wasn’t really counting on anybody getting any eyes on it. And here we are, a couple of weeks later.”\nGoren was suddenly a guest for podcasts and blogs and the subject of multiple interviews. An NFL agent even reached out to him regarding highlight films.\n“A weird little 15 minutes of fame,” he said.\nBarrett considers Goren’s effort a hit, but despite his suggestion for him to pursue the line of work, the North Carolina State student is done for now. His foray into video production provided a bit of routine in a time when the normal is anything but.\nTo occupy his time out of school, he said he’s done teleconference with classmates and participated in something he called Wikipedia races, in which people go from one page to another by clicking on links. That occupied three hours, he said.\nHowever, Goren doesn’t rule out another video if something hits him.\n“If the inspiration strikes again, it wouldn’t be super unlikely, I guess,” he said. “If it happens again, it happens again.”\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/f94a49dd825da30611dec625918951cf"}