{"authors": ["Arman Azad", "Gina Yu", "Nicky Robertson Cnn"], "date_download": "2020-05-04 16:22:49", "date_modify": "2020-05-04 16:22:49", "date_publish": "2020-04-06 01:24:31", "description": "President Donald Trump on Sunday again doubled down on an unproven therapy for the novel coronavirus: hydroxychloroquine.", "filename": "2020_04_05_politics_coronav_8c51e6a22ebc82148267b98dd48d0161_index_1588609369.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405192138-03-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_coronav_8c51e6a22ebc82148267b98dd48d0161_index_1588609369.html", "title": "Trump doubles down on unproven drugs to treat and prevent coronavirus", "title_page": "Trump doubles down on unproven drug hydroxychloroquine to treat and prevent coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "For people without heart problems, Trump recommended combining hydroxychloroquine with azithromycin, a common antibiotic. He said azithromycin \"will kill certain things that you don't want living within your body.\"\nYet there is little reliable evidence that the drugs -- either alone or in combination -- are effective at treating the novel coronavirus\nStill, Trump said: \"What do you have to lose? What do you have to lose?\"\nWithout evidence, Trump says the drugs can be used to prevent infection\nFor doctors, nurses and first responders, Trump suggested the drugs could be taken as a preventative. \"They say taking it before the fact is good, but what do you have to lose?\"\nExperts do not suggest taking hydroxychloroquine as a preventive for Covid-19 because there is no evidence yet to suggest it protects against contracting the virus.\n\"They say take it,\" said Trump, without citing any experts or sources. \"I'm not looking at it one way or the other, but we want to get out of this. If it does work, it would be a shame if we didn't do it early. But we have some very good signs.\"\nTrump said people would have to go through medical professionals to get approval, \"but I've seen things that I sort of like. So, what do I know, I'm not a doctor. I'm not a doctor. But I have common sense.\"\nThe President said, \"I see people are going to die without it,\" so \"what really do we have to lose.\" He added, \"I am saying to do what you want.\"\nWhen pressed by CNN's Jeremy Diamond on why the President is not letting the science speak for itself, the President said that hydroxychloroquine \"may not work and in which case, hey, it didn't work, and it may work,\" but he said he does not want to wait a \"year and a half\" to find out.\nOne reporter asked whether doctors and hospitals would be free from blame if hydroxychloroquine does not help coronavirus patients. Trump said that the drug can \"help them, but it's not going to hurt them.\"\nExperts say the drug, while generally considered to be safe, can come with side effects -- including nausea, diarrhea, vomiting and skin rashes.\nTrump falsely claims FDA approval of the drugs\nAt the news briefing, Trump also said the US Food and Drug Administration feels good about the drug, adding, \"As you know, they've approved it, they gave it a rapid approval.\"\nIn fact, the FDA has not approved hydroxychloroquine for the treatment of Covid-19.\nThe FDA issued a limited Emergency Use Authorization to facilitate the distribution of the drug from the national stockpile, but the agency explicitly said in its authorization letter: \"Chloroquine phosphate and hydroxychloroquine sulfate are not FDA-approved for treatment of COVID-19.\"\nIn announcing a donation of hydroxychloroquine to the stockpile -- along with chloroquine, a closely-related drug -- the Department of Health and Human Services gave a tempered assessment of their potential benefits.\nA statement said that \"anecdotal reports suggest that these drugs may offer some benefit\" in coronavirus patients, but \"clinical trials are needed to provide scientific evidence that these treatments are effective.\"\nVice President Mike Pence announced Sunday that hydroxychloroquine will be used in a trial of 3,000 patients at Henry Ford Hospital in Detroit, and the results will be tracked in a formal study.\nPence added at the coronavirus task force briefing that they are \"more than prepared\" to make hydroxychloroquine available to doctors' offices and pharmacies in the Detroit area \"as they deem appropriate.\"\nTrump won't let Fauci answer medical question from reporter\nWhen the nation's top infectious disease expert, Dr. Anthony Fauci, was at the podium, CNN's Jeremy Diamond tried to ask him to weigh in on hydroxychloroquine -- but the President jumped in and refused to let Fauci answer.\nOn Saturday, Trump also made comments touting the drug as a preventative for coronavirus. He said that lupus patients -- who are often treated with hydroxychloroquine -- seem less likely to contract Covid-19, and that \"there's a rumor out there\" and \"there's a study out.\"\n\"Maybe it's true, maybe it's not. Why don't you investigate that?\" Trump asked.\nAt the briefing, though, Fauci said, \"We don't have any definitive information to be able to make any comment.\" He also said the relationship between lupus and Covid-19 is currently under investigation.", "url": "https://www.cnn.com/2020/04/05/politics/coronavirus-hydroxychloroquine-trump-briefing/index.html"}