{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:23:37", "date_modify": "2020-05-04 20:23:37", "date_publish": "2020-04-30 03:48:13", "description": "The famous couple both overcame coronavirus infections while in Australia.", "filename": "entry_tom-hanks-rita-wilson-plasma-coronavirus_n_5eaa1f07c5b62eaf043eadf5_1588623817.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa36313000005d12155283.jpeg?cache=yg6xzmqaju&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_tom-hanks-rita-wilson-plasma-coronavirus_n_5eaa1f07c5b62eaf043eadf5_1588623817.html", "title": "Tom Hanks And Rita Wilson Share Photos As They Donate Plasma To COVID-19 Research", "title_page": "Tom Hanks And Rita Wilson Share Photos As They Donate Plasma To COVID-19 Research | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Tom Hanks and Rita Wilson have beaten COVID-19 themselves, and now they’re pitching in on the global fight against the virus.\nThe duo, both 63, shared images on social media Wednesday of their contribution to coronavirus research at UCLA. Hanks showed a bag of plasma that he’d donated to the university, and Wilson showed how she was tested for antibodies prior to making her own donation.\nPlasma from people who have survived COVID-19 can contain antibodies to the disease. Researchers are investigating the use of this plasma to help patients battling severe cases of the virus recover faster.\nHanks said that after the paperwork, the procedure was “as easy as taking a nap.”\nLast week, Hanks had put out a call on Twitter for donations to a study led by the UCLA Fielding School of Public Health and David Geffen School of Medicine.\nIn the latest updates, Hanks and Wilson both shouted out the study’s leader, Dr. Anne Rimoin, an expert in infectious disease epidemiology who serves as public health professor and director of the Center for Global and Immigrant Health at the university.\nIn an interview on the NPR podcast “Wait Wait... Don’t Tell Me” earlier this week, Hanks announced that he and his wife wanted to use their possible immunity to help in any way they could and that they had offered to donate plasma.\nThe couple returned to the U.S. from Australia at the end of March, following two weeks quarantined on the country’s Gold Coast after they tested positive for the virus. During the course of their infection, which saw them both hospitalized for three days initially, they reported fevers, body aches and fatigue, among other symptoms.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/tom-hanks-rita-wilson-plasma-coronavirus_n_5eaa1f07c5b62eaf043eadf5"}