{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 15:59:14", "date_modify": "2020-05-04 15:59:14", "date_publish": "2020-04-01 07:57:35", "description": "Virtual funerals, social isolation and quarantine define grieving for the loss of our loved ones in the age of coronavirus. Here are some expert tips we hope will help.", "filename": "2020_04_01_health_grief-fear-coronavirus-wellness_index_1588607954.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323090347-coronavirus-funerals-new-rules-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_grief-fear-coronavirus-wellness_index_1588607954.html", "title": "Grief and fear after a Covid-19 death: Managing a double trauma", "title_page": "Grief and fear after a Covid-19 death: Managing a double trauma - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In the midst of heartbreak we are alone, unable to reach out and comfort those who mourn, standing a careful six feet from each other.\nThere is no great gathering of family and friends to honor our mothers, fathers, grandparents, spouses, brothers, sisters, children or friends so suddenly and cruelly ripped from our lives. There is no wake, no shiva.\nInstead, we must listen to the tinny sound of the funeral emanating from laptops or smartphones, wishing our sorrow and support could race through digital space and surround those in agony with a hug or a touch -- the most basic of human comforts.\nThis is the grim face of grief and loss in the age of coronavirus.\n\"The rituals around death are so important for healthy grief,\" said David Kessler, who co-authored the book \"On Grief and Grieving,\" with legendary bereavement expert Elisabeth Kübler-Ross.\n\"Grief is a time of connection. We've always been able to be with their bodies, to gather for a funeral. All that is gone,\" Kessler said.\n\"So we're not only robbed of our loved one, but we're also robbed of our ability to gather to honor them. On a national level, this is really unprecedented.\"\nA special type of grief\nMuch of what we are going through is reminiscent of wars and terrorist attacks, said trauma counselor Jane Webber, a professor of counselor education at Kean University in New Jersey.\n\"Similar to 9/11, not being able to say goodbye, not being able to see your loved one's body, imagining what they may have suffered, those memories stay with people, and they often need help to heal,\" said Webber, who counseled survivors and families during 9/11's tragic aftermath.\nWhat's uniquely painful today, she says, is that after a loved one dies, families are trapped in quarantine, unable to touch and comfort each other, living in dread that another family member could fall ill.\n\"Dread is a combination of not knowing, fearing and terror,\" Webber said. \"Do you go pick up groceries? Are gloves enough? Should I touch the mail? Your child sneezes. You're living in fear every moment.\n\"Where we suffer most is that we want to hug someone. We need human touch and we're denied that,\" she added. \"There is no measure of how painful it is or how horrible it is for people right now.\"\nDoing the best we can\nUnique times call for special measures, experts told CNN. Families should immediately connect in the most visual way possible.\n\"Connect through FaceTime, Skype, other social media,\" Webber said. \"We need to see each others' faces to know that the rest of our family is with us in spirit even if they can't be with us physically.\"\nWebber suggests daily check-ins with as many family members as possible, perhaps on a group platform like Zoom. Consider it a \"virtual shiva,\" she says.\nIf that's not possible, use the next best thing, said Tom Dening, who directs the Centre for Old Age and Dementia at the University of Nottingham in the UK.\n\"The main thing is for the key people in the life of the deceased to communicate with each other, to share their grief by whatever medium ... they feel comfortable with,\" he said.\nTry to keep the funeral as visual as possible too, Kessler suggests. It's important to see the faces of the friends and family who have gathered to honor and grieve the deceased.\n\"We are going to have to start gathering virtually with the minister on the Zoom and as many people as possible, instead of pretending we're still doing it at the church,\" he said.\nSome people may decide to put off the memorial service or funeral until after the Covid-19 pandemic passes. Kessler says that while that makes sense, it's his experience that a service of some kind should occur within the first few weeks after death.\n\"I'm concerned if people postpone them,\" he said. \"There's something important about grieving when grief first hits. People who don't have these rituals seem to have more trouble grieving.\"\nCoping with guilt\nGuilt, one of the stages of grief, can begin to plague us as we mourn our inability to say goodbye.\n\"Some degree of guilt is so often present in normal bereavement -- we usually think of things that we might have done or said differently -- but it is likely to be exaggerated with Covid-19,\" Dening said.\n\"Our experience is going to be complicated by the fact that we may feel that our loved one has died isolated and unsupported by us,\" he added. \"On reflection, we might remind ourselves that we couldn't have done more, but this may not be enough to suppress such feelings.\"\n\"If the death is sudden or unexpected, and we did not get a chance to tell them how much they meant to us and how they changed our life for the better, we suffer even more,\" said Barbara Sahakian, a professor of clinical neuropsychology at the University of Cambridge.\nTake time to remember the loved one you lost, Sahakian suggests.\n\"Although in the early stages of grief we can feel overwhelmed by sadness, at that time, it is important to remember that we would not have become the person that we are without having experienced knowing them,\" she said.\nWebber suggests setting up family routines in which two or more loved ones gather visually or on the phone and share photos and tall tales of their loved one who has passed.\n\"Try to remember the happy parts of the person who has died,\" Webber said.\"It keeps the human touch going. Even if it's not physical touch, it's emotional, it's spiritual, it's intellectual touch. We need that kind of relationship and grieving or we are left with unfinished grief -- and that's a scary thing.\"\nWhile it may sound sad, Webber also suggests going through photos and watching old videos of your loved one.\n\"Write letters to your loved ones,\" she suggests. \"Write a letter every day, before you go to bed. Talk to the loved one and just say, 'This is what I wish I could have said to you.'\n\"By doing that, you are finishing some of the business that you weren't able to do,\" she said.\"If you don't do it, I would worry about depression, maybe even suicidal thoughts.\"\nGet support\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nEven if you have the closest, most supportive family and friends in the world, consider joining a support group. Just a few months ago, you would have been able to meet people in person who are experiencing the same grief.\nAnother reality of this surreal time -- support groups are no longer meeting in person. But that doesn't mean you must forgo this very important tool for healing.\nCounselors and therapists are conducting virtual visits and support groups; they are also popping up on social media.\n\"We have virtual support groups now as the only way people can share their fear of death and grief which have all mixed together,\" Webber said. \"We're grieving, but we're also afraid that we might get infected as well. So we have kind of a double tragedy, a double trauma going on here.\"", "url": "https://www.cnn.com/2020/04/01/health/grief-fear-coronavirus-wellness/index.html"}