{"authors": ["Ryan Browne", "Zachary Cohen", "Jamie Crawford"], "date_download": "2020-05-04 16:14:24", "date_modify": "2020-05-04 16:14:24", "date_publish": "2020-04-02 20:46:04", "description": "The commander of a US aircraft carrier that has been hit by a major outbreak of coronavirus has been relieved of command for showing \"poor judgment\" days after writing a memo warning Navy leadership that decisive action was needed to save the lives of the ship's crew, acting Secretary of the Navy Thomas Modly announced on Thursday.", "filename": "2020_04_02_politics_uss-roosevelt-commander-relieved_index_1588608864.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401090515-01-uss-theodore-roosevelt-guam-grab-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_uss-roosevelt-commander-relieved_index_1588608864.html", "title": "Commander of aircraft carrier hit by coronavirus removed for 'poor judgment' after sounding alarm", "title_page": "USS Roosevelt: Commander of aircraft carrier hit by coronavirus removed for  'poor judgment' after sounding alarm - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The commander of a US aircraft carrier that has been hit by a major outbreak of coronavirus has been relieved of command for showing \"poor judgment\" days after writing a memo warning Navy leadership that decisive action was needed to save the lives of the ship's crew, acting Secretary of the Navy Thomas Modly announced on Thursday.\n\"Today at my direction the commanding officer of the USS Theodore Roosevelt, Captain Brett Crozier, was relieved of command by carrier strike group commander Rear Admiral Stewart Baker,\" Modly said during a Pentagon press briefing.\nModly told reporters that Crozier was removed for showing \"extremely poor judgment\" and creating a \"firestorm\" by too widely disseminating the memo detailing his concerns, copying some 20 to 30 people.\nHe said Crozier was not removed because of any evidence suggesting he leaked the memo to the press, but rather for allowing \"the complexity of his challenge with the Covid breakout on the ship to overwhelm his ability to act professionally when acting professionally was what was needed the most at the time.\"\n\"I have no information nor am I trying to suggest that he leaked the information. It was published in the San Francisco Chronicle. It all came as a big surprise to all of us that it was in the paper, and that's the first time I had seen it,\" he added.\nThe information in question was contained in a memo written by Crozier earlier this week to the Navy's Pacific Fleet.\nModly called Crozier's note \"a blast-out email to everyone he knows.\"\n\"We are not at war. Sailors do not need to die. If we do not act now, we are failing to properly take care of our most trusted asset — our Sailors,\" it read, three US defense officials confirmed to CNN.\nModly said Crozier was relieved because he went outside the chain of command and sent his memo over an unsecured system, adding to the chances it could be leaked.\n\"He sent it out pretty broadly, and in sending it out broadly he did not take care to ensure that it couldn't be leaked, and that's part of his responsibility, in my opinion,\" Modly said.\n\"I have received absolutely no pressure. I have had no communication with the White House about this,\" he added. \"I did, when I was arriving closer to this determination yesterday, I called Secretary Esper and told him that this was the direction I was heading and he told me he would support my decision whatever that might be.\"\nTop Democrats on the House Armed Services Committee slammed the move in a statement Thursday.\n\"While Captain Crozier clearly went outside the chain of command, his dismissal at this critical moment -- as the Sailors aboard the U.S.S. Theodore Roosevelt are confronted with the COVID-19 pandemic -- is a destabilizing move that will likely put our service members at greater risk and jeopardize our fleet's readiness,\" they said.\n\"The COVID pandemic presents a set of new challenges and there is much we still do not know. Captain Crozier was justifiably concerned about the health and safety of his crew, but he did not handle the immense pressure appropriately. However, relieving him of his command is an overreaction,\" the lawmakers added.\nModly on Thursday acknowledged Crozier's popularity among the aircraft carrier's crew.\n\"I am entirely convinced that your Commanding Officer loves you, and that he had you at the center of his heart and mind in every decision that he has made. I also know that you have great affection, and love, for him as well,\" he said.\nMany on board gave Crozier a warm and loud send off, clapping and cheering as he left the ship, according to a video taken by a person onboard the ship and obtained by CNN.\nNumber of positive cases continues to increase\nNews of Crozier's removal comes after a US defense official told CNN Friday morning that 137 sailors from the Roosevelt have tested positive for the virus, representing more than 10% of all cases across the US military.\nThe outbreak on the ship is escalating rapidly. Last week the Pentagon confirmed three sailors on the Roosevelt had tested positive, and that number had risen to 25 two days later. It rose to at least 70 on Tuesday and more than 100 on Thursday. On Monday, a US defense official told CNN that a second US aircraft carrier, the USS Ronald Reagan, is facing a \"handful\" of positive cases.\nIn his memo, Crozier implored Navy leaders to take immediate steps to address the situation.\n\"Decisive action is required. Removing the majority of personnel from a deployed US nuclear aircraft carrier and isolating them for two weeks may seem like an extraordinary measure,\" his memo said.\n\"This is a necessary risk. It will enable the carrier and air wing to get back underway as quickly as possible while ensuring the health and safety of our Sailors. Keeping over 4,000 young men and women on board the TR is an unnecessary risk and breaks faith with those Sailors entrusted to our care,\" Crozier added.\nModly said Wednesday that if it turned out the letter was leaked it \"would violate the principles of good order and discipline if -- if -- if he were responsible for that. But, I don't know that. The fact that he wrote the letter of -- to his chain of command to express his concerns would absolutely not result in any type of retaliation. This is what we want our commanding officers to be able to do.\"\nOn Thursday, Modly asserted that the decision to remove Crozier from his post \"is not one about retribution, it's about confidence. It is not an indictment of character, but rather of judgment.\"\n\"While I do take issue with the validity of some of the points in Captain Crozier's letter, he was absolutely correct in raising them,\" he said. \"It was the way in which he did it ... that was unacceptable to me,\" the acting Navy secretary added.\nSailors quarantined\nCNN previously reported that some of the sailors from the USS Theodore Roosevelt will be quarantined in hotel rooms in Guam as the number of coronavirus cases aboard the carrier continues to increase.\nOn Wednesday Modly said 1,273 of the ship's roughly 4,800 crew members have been tested for the virus so far and the Navy was still awaiting the results of some of those tests.\nHe said about 1,000 sailors have been evacuated from the ship and moved ashore to Guam where the ship is currently in port.\n\"We already have nearly 1,000 personnel off the ship right now. And in the next couple of days we expect to have 2,700 of them off the ship,\" Modly told reporters at the Pentagon.\nSome sailors will have to remain on the ship.\nThe Chief of Naval Operations, Adm. Mike Gilday, said that the ship could not be evacuated in its entirety due to the need to continue to perform essential tasks such as the operation of the aircraft carrier's nuclear reactor.\nHe said that about 1,000 sailors would have to remain on the ship to perform, about 500 more than was proposed by Crozier in his recent memo.\n\"This ship has weapons on it, it has munitions on it, it has expensive aircraft, it has a nuclear power plant. It requires a certain amount of people on that ship to maintain the safety and security of the ship,\" Modly said.", "url": "https://www.cnn.com/2020/04/02/politics/uss-roosevelt-commander-relieved/index.html"}