{"authors": [], "date_download": "2020-05-04 21:09:22", "date_modify": "2020-05-04 21:09:22", "date_publish": "2020-04-13 22:27:53", "description": "SEATTLE (AP) — A Seattle-area doctor who got the coronavirus and spent more than two weeks on a ventilator is now at home recovering after receiving experimental treatments. “You realize...", "filename": "_435ee5f25f0abc983637974af0637b9a_1588626562.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_435ee5f25f0abc983637974af0637b9a_1588626562.html", "title": "Doctor recovering from virus after being on ventilator", "title_page": "Doctor recovering from virus after being on ventilator", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — A Seattle-area doctor who got the coronavirus and spent more than two weeks on a ventilator is now at home recovering after receiving experimental treatments.\n“You realize there are times in life that it’s completely out of control and you have to put your trust and faith in another person’s hands,” Dr. Ryan Padgett told The Seattle Times Monday after receiving treatment at EvergreenHealth in Kirkland and another hospital.\nPadgett, an emergency department physician, got sick in early March after becoming infected with the virus that causes COVID-19. Padgett was one of the first front-line health-care workers in Washington to test positive for COVID-19. He believes he likely became infected with the new coronavirus during what he described as an “onslaught” of cases flowing into the emergency department.\n“I presume it was exposure to one of the LifeCare Center patients. I can’t confirm that part, of course,” he said, referring to a nursing home that was the site of Washington’s first outbreak.\nPadgett became ill March 7 with “minor things you can easily blow off” as an emergency department physician like a mild headache and muscle soreness. Two days later, he spiked a fever, and a worsening cough followed. Days later, as symptoms worsened and his oxygen levels dropped, Padgett arrived back to his workplace, EvergreenHealth, as a patient. Padgett was intubated and put on a ventilator on March 13, within about eight hours of his admission.\nDuring that more than two-week stretch, Padgett was taken to Swedish Medical Center for some novel treatments.\nThe physicians who treated him at Swedish Medical Center say the measures they took to help save Padgett’s life could provide anecdotal insight into how the disease works.\nThe physicians used extracorporeal membrane oxygenation (ECMO) to provide life support to Padgett for about a week. The treatment, a form of life support, draws blood out of the body, oxygenates the blood and delivers it back to the body.\nThe physicians also used an immunosuppressive drug to suppress Padgett’s immune system, which was reacting in an out-of-control way to the virus.\nPadgett, 45, left in a wheelchair on April 5. Family members awaited him. “I stood up and gave them all hugs,” he said. “I’ve cried more in the last weeks than in my whole life.”", "url": "https://apnews.com/435ee5f25f0abc983637974af0637b9a"}