{"authors": ["Wilson Ring"], "date_download": "2020-05-04 20:14:20", "date_modify": "2020-05-04 20:14:20", "date_publish": "2020-04-15 13:58:42", "description": "The number of people testing positive for the coronavirus in Vermont appear to be reaching a plateau and the state appears to be headed to a “best-case scenario” from early projections, the...", "filename": "_3ab893a7bd4efb866b524706e5931780_1588623260.html", "image_url": "https://storage.googleapis.com/afs-prod/media/44f935bbb59d44a29a670dbf952e9fb5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3ab893a7bd4efb866b524706e5931780_1588623260.html", "title": "Top doc says Vermont is seeing fewer new coronavirus cases", "title_page": "Top doc says Vermont is seeing fewer new coronavirus cases", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kristin McCarthy, a phlebotomist for the American Red Cross, inserts the needle into Jennifer Garrett, of Greenfield, Mass., vein during a blood drive at the Winston Prouty Center in Brattleboro, Vt., Tuesday, April 14, 2020. (Kristopher Radder/The Brattleboro Reformer via AP)\nKristin McCarthy, a phlebotomist for the American Red Cross, inserts the needle into Jennifer Garrett, of Greenfield, Mass., vein during a blood drive at the Winston Prouty Center in Brattleboro, Vt., Tuesday, April 14, 2020. (Kristopher Radder/The Brattleboro Reformer via AP)\nThe number of people testing positive for the coronavirus in Vermont appear to be reaching a plateau and the state appears to be headed to a “best-case scenario” from early projections, the state’s top public health official said Wednesday.\nOn Tuesday the state reported four new people positive for the virus and on Wednesday the number was nine, well below the numbers the state had been experiencing, Health Commissioner Dr. Mark Levine said during the regular COVID-19 briefing along with Gov. Phil Scott and other officials.\nSeveral states are reporting the number of deaths from COVID-19 are doubling in two to three days, maybe a week. In Vermont the number of deaths is on pace to double in about two weeks, Levine said. There have been a total of 30 deaths in Vermont.\nLevine said he didn’t want to minimize the significance of any deaths, but “as an indicator of how we are doing in the epidemic, we are are doing very well.”\nNevertheless, until medicine can be found that can effectively treat COVID-19 or a vaccine can be developed to prevent it, public health officials are going to need to continue to focus on working to ensure as few people as possible become infected with the virus that causes COVID-19. It will include an emphasis on testing and tracing the contacts of new cases to prevent further spread.\n“It won’t be an end totally to social distancing, it won’t be an end to limitations on large gatherings, it won’t be an end perhaps to facial coverings or all of the public hygiene things that we’ve talked about,” Levine said.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.\nREOPENING THE STATE\nScott said Vermont is going to continue what he calls its methodical approach toward opening the state’s economy, but he won’t rely on Congress to tell Vermont how it should be done.\n“We didn’t have their input in some respects when we got into this and... while we’ll take their advice, but we don’t need them to tell us how to get ourselves out of this either,” Scott said.\nVermont has been communicating with other states about reopening the economy. He said there were conversations between his office and the office of New York Gov. Andrew Cuomo late Tuesday, but he stopped short of saying Vermont had joined a multi-state compact focused on the coordinated reopening of the economies.\n“We will continue to talk just as we have been doing to try to make sure that we’re in touch, that we know what the other state is doing so it doesn’t impact our region in a way that could affect Vermonters,” Scott said.\n____\nSUPPORTING THE FIGHT AGAINST COVID-19\nDuring the Wednesday briefing, Scott thanked a number of organizations that have helped the state confront COVID-19.\nDonna Carpenter of Burton Snowboards told how the company worked with its suppliers in China to produce 500,000 respirators masks and other products that are being distributed across the Northeast.\n“When I challenged my product team about a month ago to see what we could do during this crisis, they not only thought big, but then they were able to execute and get it done,” Carpenter said.\nScott also thanked University of Vermont President Suresh Garimella for the university’s efforts to help and Martti Matheson of JV Air for his team’s efforts to transport test specimens to the Mayo Clinic in Minnesota.\n___\nALTERNATIVE HOUSING\nState officials say the Holiday Inn in South Burlington will be used as a temporary recovery site for individuals who cannot return to their primary home, including those who live in group settings, or for those who don’t have a home.", "url": "https://apnews.com/3ab893a7bd4efb866b524706e5931780"}