{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 16:15:25", "date_modify": "2020-05-04 16:15:25", "date_publish": "2020-04-03 14:10:43", "description": "An estimated 65% of domestic workers, who are mostly women of color and immigrants, do not have health insurance. And 60% spend more than half their income on rent or mortgage payments. An overwhelming majority of them do not have paid sick days or paid time off.", "filename": "2020_04_03_us_social-distan_4d7b267f27c6e45f13dd3e3e2571f9fa_index_1588608925.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403100322-house-cleaner-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_social-distan_4d7b267f27c6e45f13dd3e3e2571f9fa_index_1588608925.html", "title": "The coronavirus pandemic has been catastrophic for house cleaners and nannies", "title_page": "The coronavirus pandemic has been catastrophic for house cleaners and nannies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Before the coronavirus had reached the US, Betania Shephard would clean about six to eight apartments and homes in a normal week. These days, nearly all of her clients have canceled. Some weeks, she hasn't been able to find work at all.\nAs people limit contact with others and stay home as much as possible in the face of the coronavirus , domestic workers like Shephard -- whose livelihoods depend on being in the homes of others or caring for their loved ones -- are being hit particularly hard.\n\"The coronavirus situation makes me feel sad,\" Shephard said. \"But the situation also makes me feel angry. Because of everything that's happening with the virus, I feel that my employers don't take care of me, and they don't go through any measures to protect me or put any effort for me not to get sick.\"\nShephard is one of the roughly 2.5 million domestic workers in the US -- and she is not alone in her struggle to maintain work during the pandemic. Domestic workers provide services in the households of an individual or a family, including childcare, assistance for elderly dependents, house cleaning and other household tasks.\nAn estimated 65% of domestic workers, who are mostly women of color and immigrants, do not have health insurance. And 60% spend more than half their income on rent or mortgage payments, according to a 2017 survey from the National Domestic Workers Alliance. An overwhelming majority of them do not have paid sick days or paid time off.\nNow, those who work as nannies and housekeepers face a new obstacle: Suspended paychecks, as the families they work for have no need for the extra help while they stay at home.\n\"This is a workforce that before the virus was incredibly insecure and vulnerable in terms of earning low wages,\" said Ai-Jen Poo, executive director of the National Domestic Workers Alliance. \"Literally paycheck to paycheck. No savings. No cushion. No ability to withstand any kind of financial emergency. No benefits. No paid time off. No paid sick days.\"\nClients are canceling, but bills keep coming\nFor Shephard, a housekeeper in the Philadelphia area, the pandemic has led to a substantial loss of income.\nThe Airbnb properties and families for whom she provided cleaning services have all but suspended her for the time being, and she's been searching everywhere she can for more work.\nBetania Shephard, who cleans apartments and homes in the Philadelphia area, has had nearly all of her clients cancel on her without pay.\n\"It's so important that as domestic workers, we have paid time off,\" Shephard said. \"In times like this, it shows how we desperately need it and how the expenses keep happening.\"\nShephard, who provides for her husband and their two kids, said she's most worried about paying her cell phone bill, because that's how she coordinates and finds work. There are also bills for water, electricity and gas that are continuing to come in.\nBetania Shephard with her son, 10, and her daughter, 7.\nOne of the families Shephard works for offered to pay her even though she's no longer coming to their home to clean, she said. She told them to hold off on giving her the paycheck until she absolutely needed it. While finances are tough now, she knows things could get worse.\nOther domestic workers said they haven't been offered any assistance from their employers during this time.\nAngélica Martínez said her elderly mother, who asked that her name and age not be disclosed, has been a housekeeper in New York for more than 20 years, ever since she emigrated to the United States from Colombia.\nLast week, her mom's clients, some of whom she had served for more than a decade, abruptly canceled right before she was scheduled to show up to work, Martínez said.\nGiven the vast spread of the virus in the city, Martínez said they told her mom it would be best if she just didn't come. They said they would get back in touch when the crisis subsided.\nNone of them offered to pay her mother, Martínez said.\nWhile she wasn't expecting her clients to pay her indefinitely for work she couldn't perform, Martinez said her mom felt disappointed that they seemed unconcerned about her well-being during this crisis.\nHer housekeeping job is her sole source of income.\n\"If you didn't lose your income, and you hire a regular housekeeper, this is something that's in your budget. You budget for this,\" she said. \"In the middle of a crisis, why don't you continue to pay them? Why is that something that needs to be asked for?\"\nFortunately, Martínez said she and her brother both have full-time jobs that they can do from home. They plan to support their mother, though money will be tight.\n\"This crisis is really unmasking all these ugly parts of our society and how we function and how we treat each other,\" Martínez said.\nWorkers face an impossible choice\nIn the coronavirus era, domestic workers are facing an impossible choice, Poo said.\n\"They're having to make choices between going to work and literally keeping themselves and their families healthy, without any idea of where their income is going to come from if they do decide to stay home,\" she said.\nAdding to their anxieties is the reality that domestic workers often don't receive the same labor protections extended to other workers. They don't get paid time off or paid sick days. Some don't qualify for unemployment. Others are undocumented immigrants, and therefore ineligible for federal benefit programs.\n\"It's an incredibly precarious way of working in our economy, and yet so very important,\" Poo said.\nThe National Domestic Workers Alliance has raised more than $3 million for its Coronavirus Care Fund to support workers through the crisis, according to the organization.\nBetania Shephard said knowing there is such an emergency fund has given her a sense of calm during an otherwise scary and uncertain time.\nAs the people she relied on for her livelihood are no longer supporting her, it's comforting to know that, at least for now, someone is.", "url": "https://www.cnn.com/2020/04/03/us/social-distancing-pandemic-domestic-workers-trnd/index.html"}