{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:23:43", "date_modify": "2020-05-04 20:23:43", "date_publish": "2020-04-30 04:11:51", "description": "New York's governor wants to know “who is bailing out whom\" when it comes to federal aid for coronavirus battle.", "filename": "entry_andrew-cuomo-mitch-mcconnell-rick-scott_n_5eaa2e68c5b62eaf043ebcd8_1588623823.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa45403000003012155285.jpeg?cache=morwkyn45c&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_andrew-cuomo-mitch-mcconnell-rick-scott_n_5eaa2e68c5b62eaf043ebcd8_1588623823.html", "title": "'How Dare They!' Andrew Cuomo Schools Sens. McConnell, Rick Scott With Basic Math", "title_page": "'How Dare They!' Andrew Cuomo Schools Sens. McConnell, Rick Scott With Basic Math | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "New York Gov. Andrew Cuomo ripped into Senate Majority Leader Mitch McConnell (R-Ky.) and Sen. Rick Scott (R-Fla.) on Wednesday for saying they don’t want to send any additional federal aid to his state.\nBoth have described money to help New York in its battle with the coronavirus pandemic as “bailouts.”\nBut Cuomo asked both senators, “Who is bailing out whom?”\nAnd he used some basic math to answer the question, noting that New York gives far more in federal tax dollars than it receives.\n“Every year we put in $29 billion more than we take out,” he noted.\nBut for Florida and Kentucky, it’s the other way around.\nKentucky, he said, gets $37 billion more per year in federal dollars than its taxpayers send to Washington.\n“Sen. Mitch McConnell, you are bailing out New York?” he sarcastically asked. “When every year you take out more from the kitty, the federal pot, $37 billion more than you put in? Who is bailing out whom?”\nAnd he had a similar question for Scott, who this week boasted that his state, Florida, “lives within its means” and shouldn’t have to “bail out” states such as New York.\nExcept his state does not “live within its means,” as Cuomo was quick to point out.\n“Sen. Scott, you’re going to bail us out? You take out $30 billion more every year than you pay in,” he said, adding:\n“How dare they! How dare they when those are the facts. How long are you going to play the American people and assume they’re stupid?”\n“The facts damn everything they’re saying,” Cuomo said.\nMcConnell last week suggested that states hit hardest by the pandemic should declare bankruptcy rather than expect any additional federal aid.\nThe suggestion was quickly panned ― including by members of the Republican Party.\nCuomo noted that allowing states to go bankrupt would require a federal law ― and dared McConnell to try to pass such legislation.", "url": "https://www.huffpost.com/entry/andrew-cuomo-mitch-mcconnell-rick-scott_n_5eaa2e68c5b62eaf043ebcd8"}