{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-05-04 16:00:05", "date_modify": "2020-05-04 16:00:05", "date_publish": "2020-04-01 12:59:30", "description": "Hundreds of thousands of retail workers lost their jobs this week as the coronavirus pandemic continues to decimate the industry.", "filename": "2020_04_01_business_retail-furloughs-coronavirus_index_1588608005.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331130218-closed-gap-store-usa-0326-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_retail-furloughs-coronavirus_index_1588608005.html", "title": "Half a million Americans were furloughed by major department stores this week", "title_page": "Half a million Americans were furloughed by major department stores this week - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Hundreds of thousands of retail workers lost their jobs this week as the coronavirus pandemic continues to decimate the industry.\nIn another effort to preserve money and in a show of solidarity, some of these companies have slashed pay for their executives and paused bonuses or raises this year. If there's some good news for the affected employees, it's that several of these companies are still providing healthcare.\nAscena\nThe owner of Ann Taylor and Lane Bryant announced Monday it made the \"extremely difficult decision\" to furlough all of its store associates and half of its corporate employees. That amounts to roughly 40,000 employees, according to figures from a regulatory filing. remaining corporate employees will have their salaries reduced by as much as 45%.\nGap Inc.\nGap GPS , which owns Old Navy and Athleta, said Tuesday it was putting 80,000 store employees and some of its corporate employees on furlough.\nThe company also said in a press release that Gap executives and its board are taking a \"temporary reduction in pay,\" although it declined to say how much.\nJCPenney\nJCPenney JCP The department store said in a statement Tuesday that it has made the \"difficult decision to temporarily furlough the majority of store hourly associates.\"also said that a \"significant portion\" of its corporate employees will be placed on leave. It had about 90,000 employees as of February 1.\nKohl's\nKohl's KSS Discount department storesaid Monday it was furloughing workers at its stores and distribution centers, as well as some corporate employees. That amounts to roughly 85,000 employees, according to a spokesperson. Kohl's CEO Michelle Gass isn't taking a salary for the time being.\nMacy's\nMacy's M said Monday it was furloughing a \"majority\" of its 125,000 employees. The company said that the coronavirus has taken a \"heavy toll\" on its business, leading it to temporarily close its roughly 775 stores. The changes also affect Bloomingdale's and makeup retailer Bluemercury.\nMacy's CEO Jeff Gennette and the company's board of directors will stop receiving their salaries, according to a regulatory filing.\nNeiman Marcus\nA \"large portion\" of the luxury department stores' 14,000 employees are being placed on furlough. CEO Geoffroy van Raemdonck said he's not taking his salary while employees are on furlough, and his direct reports are also waiving a \"significant amount\" of their salaries.\nUrban Outfitters\nUrban Outfitters URBN The trendy retailer was one of the first companies to shut its doors.said Tuesday that a \"substantial number of store, wholesale and home office employees\" will be put on furlough. It's also not paying rent and is canceling new store openings.\n\"This is the first time in our 50-year history we have furloughed employees,\" CEO Richard Hayne said in a release. \"It's a painful decision that we do reluctantly.\"", "url": "https://www.cnn.com/2020/04/01/business/retail-furloughs-coronavirus/index.html"}