{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:28:01", "date_modify": "2020-05-04 20:28:01", "date_publish": "2020-04-30 09:43:13", "description": "“I will be calling on Australians to do it, frankly, as a matter of national service,\" the country's prime minister said of the effort to rein in the cor...", "filename": "entry_australia-covidsafe-app-coronavirus_n_5eaa72f6c5b62eaf043f0cb2_1588624081.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa7620250000b111eb0993.jpeg?cache=csl0shcbhb&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_australia-covidsafe-app-coronavirus_n_5eaa72f6c5b62eaf043f0cb2_1588624081.html", "title": "Australia Wants 10 Million People To Download A Coronavirus App. So Far, It's Working.", "title_page": "Australia Wants 10 Million People To Download A Coronavirus App. So Far, It's Working. | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "SYDNEY — Australia unveiled a dramatic initiative to trace new cases of the coronavirus within its borders this week: An app government officials hope 40% of the population will soon download.\nThe government hopes its effort, called COVIDsafe, will help officials effectively trace many of the contacts a person infected with the virus may have had while they were contagious, a step deemed essential by health professionals to contain any new outbreak.\nUsers are asked to provide a name (or pseudonym), age range, area code and phone number. Each time a phone comes within 5 feet from another device with the app, the two share a digital, encrypted “handshake.” If someone using the app later tests positive for the virus, the anonymized handshakes from the previous 14 days are uploaded with permission and then used for contact tracing. Those that were near the infected person can then be notified and tested themselves.\nOfficials have said just under half the population would need to download it to make it a success. Prime Minister Scott Morrison, who has stressed downloads will not be mandatory, has likened the effort to citizens buying war bonds in an appeal to an Australia homing in the potential elimination of local cases.\n“I will be calling on Australians to do it, frankly, as a matter of national service, to do it in the same way that people used to buy war bonds back in the war times, to come together to support the effort,” he said earlier this month. “I know this would be something they might not normally do in an ordinary time, but this is not an ordinary time.”\nASSOCIATED PRESS Surfers prepare to enter the water at Bondi Beach in Sydney on April 28, 2020, as coronavirus pandemic restrictions are eased. The beach is open to swimmers and surfers to exercise only.\nSo far, the appeals appear to be working. COVIDsafe was released Sunday, and within 24 hours a million people had downloaded the application onto their phones. That number has since risen above 3 million, the country’s health minister said Wednesday.\n“3m in 3 days is a great result, but there’s work to be done to protect our doctors & nurses, & help us get back to the life we love,” Minister for Health Greg Hunt wrote on Twitter.\nWe’ve ticked past 3️⃣ million registrations of the COVIDSafe App\n3m in 3 days is a great result, but there’s work to be done to protect our doctors & nurses, & help us get back to the life we love\nHaven’t registered yet? Make it your Wed night mission https://t.co/vn3NoeQpal pic.twitter.com/zZtSVFZHpn — Greg Hunt (@GregHuntMP) April 29, 2020\nThe app has raised several major questions surrounding privacy, as well as some hesitation that it can reach the 40% milestone touted by officials. Singapore released a similar app called TraceTogether last month, but has struggled to get downloads above 20%.\nHunt has moved to assuage fears that any of the data gathered by the app could be misused, noting it can only be used for contract tracing by proper authorities and will not be accessible to police. Anyone can delete the app at their leisure, erasing all of the gathered digital handshakes. The minister also said anyone who illegally accesses the data faces up to five years in jail.\n“In terms of privacy, no person can access what is on the phone, no other person can access what is on your phone,” Hunt said. “It cannot leave the country. It cannot be accessed by anybody other than a state public health official. It cannot be used for any purpose other than the provision of the data for the purposes of finding people with whom you have been in close contact with and it is punishable by jail if there is a breach of that.”\nThere have also been issues with iPhone users and it’s unclear how well the app works in the background when users have their devices locked (a fix is in the works).\nAustralia has one main benefit over many other countries that has helped it manage its relatively low caseload: Thousands of miles of ocean separate it from the nation’s nearest neighbor. The country effectively shut its border to all international travel last month with exceptions for citizens and permanent residents. Any traveler into the country is now required to self-isolate at designated facilities for two weeks before they can go home.\nLoren Elliott / Reuters A handful of tourists stand atop the mostly deserted steps of the Sydney Opera House, where scheduled public performances have been cancelled due to the coronavirus disease (COVID-19), in Sydney on March 18, 2020.\nThe measures have led to a dramatic flattening of the curve, and after an initial spike in infections, 6,753 people have tested positive for the virus and 91 have died. Many states have had several days in recent weeks with infections in the single-digits, and some have seen days with no new infections at all. Testing is widespread and many with even minor symptoms are being encouraged to visit a clinic.\nThose efforts have paid off by some measures, and many states are preparing to lift some of the social distancing guidelines in effect for weeks. In New South Wales, home to Sydney, small gatherings with up to two visitors will be allowed, and many states are preparing to send kids back to school in phases.\nThe situation in the United States, however, is much different. More than 1 million people have tested positive for the virus, and more than 60,000 have died. Despite the bleak numbers, a majority of Americans said in a poll this week they either don’t have smartphones or wouldn’t download such an app, citing skepticism about Google and Apple, two companies working on similar efforts.\nPublic health agencies have said the nation would need to figure out an effective way to trace any new hot spots of coronavirus infections to squash the outbreaks before they spread, potentially leading to a second wave of infections. Doing so could take tens of thousands of investigators diligently tracing who patients have come into contact with in the previous weeks, a daunting task for a nation of 328 million.\nIn Australia, Morrison said that the country was “on the road back” to normality. But he stressed that citizens could not be complacent, and urged the uptake of COVIDsafe.\n“I would liken it to the fact that if you want to go outside when the sun is shining, you have to put sunscreen on,” he said this week, per the ABC. “If you want to return to a more liberated economy and society, it is important that we get increased numbers of downloads when it comes to the COVIDSafe app.”", "url": "https://www.huffpost.com/entry/australia-covidsafe-app-coronavirus_n_5eaa72f6c5b62eaf043f0cb2"}