{"authors": ["Jeremy Diamond", "Michael Warren"], "date_download": "2020-05-04 16:16:31", "date_modify": "2020-05-04 16:16:31", "date_publish": "2020-04-03 17:44:02", "description": "For days, executives at the industrial company 3M gave Trump administration officials shifting explanations for why they couldn't send a larger share of the company's global production of N95 masks to the US. Export restrictions prevented them from shipping to the US, they said at first, before explaining they didn't want to jeopardize foreign business relationships.", "filename": "2020_04_03_politics_kushner_a83fbcb6929d2356e30624c72f1d9f94_index_1588608991.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191024090436-peter-navarro-0924-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_kushner_a83fbcb6929d2356e30624c72f1d9f94_index_1588608991.html", "title": "Can Peter Navarro and Jared Kushner save the White House's coronavirus response?", "title_page": "Can Peter Navarro and Jared Kushner save the White House's coronavirus response? - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) For days, executives at the industrial company 3M gave Trump administration officials shifting explanations for why they couldn't send a larger share of the company's global production of N95 masks to the US. Export restrictions prevented them from shipping to the US, they said at first, before explaining they didn't want to jeopardize foreign business relationships.\nAs the executives resisted, the top White House officials handling the case, senior adviser Jared Kushner and trade adviser Peter Navarro, grew exasperated. On Thursday, they went to the Oval Office to urge President Donald Trump to invoke the Defense Production Act and force the company to ship tens of millions of additional masks to the US in response to the coronavirus outbreak that had already killed more than 6,000 Americans.\n\"We've had some issues making sure that all of the production that 3M does, enough of it is coming back here to the right places,\" Navarro said from the White House podium alongside the President. \"We can't afford to lose days or hours, even minutes, in this crisis.\"\nWatching from the wings was the 39-year-old Kushner, who in recent weeks has swooped in to manage the government's response to shortages of everything from ventilators to personal protective equipment for health-care workers -- the latest instance in which he's stepped in to manage the crisis of the moment.\nKushner and Navarro have formed an unlikely tag team. The 70-year-old Navarro has spent much of his time in the White House clashing with other officials over his protectionist policies and being kept out of key meetings. A longstanding critic of globalized supply chains, Navarro is now the closest thing the country has had to an industrial policy czar since World War II, with the authority and influence to compel companies to shift their production and supply of key products back to the US.\nPerhaps most importantly, he has the backing of Kushner, who has assembled a team of business-minded government officials and outside consultants, working to marshal government resources and help companies speed up production and delivery of critical medical supplies.\n\"It's all hands on deck,\" Kushner told CNN. \"I think what I'm able to do is just get everybody in the same room and just drive people towards decisions.\"\nThose efforts, though, didn't begin until the situation was already dire. And while Kushner has gotten some praise from key players, some administration officials have knocked his actions as haphazard, contending that his team \"parachuted in\" with little understanding of the issues at the heart of the pandemic, driving a chaotic effort that threw out the government's pandemic playbook and confused lines of authority.\nOn Friday morning, 3M's CEO Mike Roman was on CNBC complaining about the heavy-handed federal approach, saying it was \"absurd\" to claim his company wasn't doing everything it could to help combat the coronavirus.\nIn a statement on Friday , the company said it is willing to comply with President Trump's order to manufacture and supply more critically needed N95 masks for the US, but cautioned about being forced to halt exports of those masks to other parts of the world.\nLast week, an influential trade group of medical device manufacturers sent an urgent letter to FEMA administrator Peter Gaynor calling on the administration to \"centralize procurement through a lead agency\" a move that struck some on Capitol Hill as an indictment of Kushner and Navarro's work so far. The Trump administration has pointed to Adm. John Polowczyk, a Joint Chiefs of Staff officer who has been detailed to run the operational aspect of the supply chain effort.\nA few House Democrats are calling on House Speaker Nancy Pelosi to push for legislation calling for the creation of an emergency supply-chain czar within the executive, something that would need the President's signature. New York's Chuck Schumer, the top Democrat in the Senate, has called out Navarro by name in an interview with CNN's Anderson Cooper on Wednesday.\nNavarro \"is not up to the job,\" Schumer said. \"He's a very nice man, but he has had no experience doing things like this, and they have no one, that I can best tell, in charge of the distribution.\"\nGood cop, bad cop\nFor weeks, Navarro urged the President to sign an executive order invoking the DPA, while other aides advised against it. Once Trump did sign it , he put Navarro in charge. And while the executive order gives Navarro specific authorities, other aides have minimized Navarro's power, saying that process still goes through multiple channels in the West Wing before being approved.\nStill, Kushner and his team are increasingly leaning on Navarro, a former economics professor, who has gleefully taken on the 'bad cop' role in dealing with companies. If Kushner's role is to facilitate cooperation between government and industry, Navarro's is to make it clear how tough the administration is willing to get if industry doesn't get on board.\nWhite House trade adviser Peter Navarro is now running the government's Defense Production Act\nNavarro has at times taken a heavy-handed approach, threatening companies with the onerous exercise of certain authorities under the DPA if they do not comply with speeding up their production capacity and committing to delivering their supply to the US -- rather than foreign countries.\n\"They do more than light threats,\" one ventilator company executive told CNN.\nIn interviews with CNN, executives in the ventilator industry praised open lines of communication with federal agencies and White House officials, including Navarro, working on supply chain issues. One of those executives told CNN the administration is \"pounding on people\" to get in line.\n\"You can call that strong-arm, but they're doing what you'd expect them to do\" in a crisis, the executive said.\nIt's an open question about whether Navarro's tactics have been effective, but three administration officials said Kushner has sought to deploy Navarro to deal with problematic companies -- often In tandem with officials on his team.\n\"I always think of Peter a little bit like a cruise missile,\" said one senior administration official. \"Like a missile, you just gotta make sure the missile is well-guided.\"\nKushner swoops in\nJared Kushner, senior adviser, has taken over large swaths of the White House's coronavirus response eforts.\nWhile Navarro plays the heavy hitter with the private sector, Kushner has focused on bolstering the government's supply chains. Working with the Federal Emergency Management Agency and the Department of Health and Human Services, Kushner has arranged several flights of critical supplies from China to the US. He's also become a top liaison to New York Gov. Andrew Cuomo, whose state accounts for more than a third of the US's coronavirus cases.\nKushner became involved in the administration's coronavirus efforts in early March -- more than two months after the coronavirus first hit the US government's radar -- at the request of Vice President Mike Pence and his chief of staff Marc Short, who were struggling to marshal the West Wing into action in the power vacuum between acting White House chief of staff Mick Mulvaney's impending exit and Rep. Mark Meadows stepping in to replace him.\n\"We didn't have the latitude to direct different functions of the White House in response. It was important to have Jared's help with that,\" a senior administration official said.\nIn that first week, Kushner pushed an indecisive Trump to ban foreigners from traveling to the US from 26 European countries and helped draft Trump's primetime Oval Office address to announce the travel restrictions -- remarks that required several corrections and sparked confusion after Trump failed to note that Americans were exempt from the travel suspension.\nFrom there, Kushner began assembling a team of officials to address the most problematic issue at the time: the availability of testing. But that role quickly expanded, even though the testing issue has been far from resolved. Kushner and his team have since worked on everything from testing capacity, ventilator production, transportation of protective equipment, blood-based coronavirus testing and doing case-studies on how to begin re-opening the economy.\nKushner's role has drawn eyerolls from some inside the White House who say that he was among those urging the President to downplay the coronavirus threat in February when the markets started tanking. A senior administration official insisted that Kushner took the threat of the virus seriously all along.\nWhile Kushner brought his position of influence in the West Wing to the effort, he unleashed a team of officials to embed with FEMA and HHS officials including Adam Boehler, a former HHS official who is now the head of the of the US International Development Finance Corporation, and Brad Smith, the director of the Center for Medicare and Medicaid Innovation -- both of whom previously came from the private sector. A coterie of McKinsey consultants are also helping Kushner's team.\nRecently, the officials have been splitting their time between the White House grounds and FEMA headquarters, where Kushner has made several appearances at the National Response Coordination Center -- the nerve center of FEMA's supply chain efforts.\nWhile corporate executives have largely praised Kushner's efforts to help cut through red tape, inside the government, he has rankled some officials. They argue Kushner is circumventing protocols that ensure all states' requests are handled appropriately, instead directing FEMA and HHS officials to prioritize specific requests from people who are able to get Kushner on the phone. They also say his team has approached every problem with the view that \"if you put an MBA on it, you can solve it\" and that he has jumped from one shiny object to the next: first testing, then supply chain issues.\nA senior administration official argued that Kushner's team sees its job as establishing a \"prototype, then getting things up and running and then turn it over to the right agencies.\" After about a week of working on expanding testing, Kushner and his team handed off the bulk of the work to Adm. Brett Giroir, the assistant secretary for Health at the HHS.\n\"It is leaping from thing to thing, but it's not because it's shiny, it's because it's important,\" the official said.\nBut the approach puts Kushner at risk of appearing pompous and condescending toward some of the states that are desperately trying to get more supplies. Despite running supply chain efforts for just two weeks, Kushner was quick to downplay states' needs and claim to know more about the situation than they do.\nAt the Thursday White House briefing, he claimed the federal stockpile of essential equipment was \"not supposed to be states' stockpiles that they then use\" and took a shot at governors for not knowing their own inventories of supplies.\n\"The states should know how many ventilators they have in their states. And by the way, some governors you speak to, or senators, and they don't know what's in their state,\" Kushner said. \"You know, some governors I'll speak to, and they'll know to the number how many ventilators they have in their state, because that's the first thing a good manager will do.\"\nFor Navarro, meanwhile, the coronavirus crisis is also an opportunity to press his advantage on rolling back liberalized trade policy in general. At Thursday's press briefing, he took the chance to voice his viewpoint in front of the TV cameras.\n\"One of the things this crisis has taught us is that we are dangerously overdependent on a global supply chain,\" Navarro said. \"If we learn anything from this crisis, It should be, never again should we have to depend on the rest of the world for essential medicines and countermeasures.\"", "url": "https://www.cnn.com/2020/04/03/politics/kushner-navarro-defense-production-act-coronavirus/index.html"}