{"authors": [], "date_download": "2020-05-04 20:14:41", "date_modify": "2020-05-04 20:14:41", "date_publish": "2020-04-29 08:15:02", "description": "The Bollywood actor was also known for his roles in \"Life Of Pi,\" \"The Amazing Spider-Man\" and \"Jurassic World.\"", "filename": "entry_irrfan-khan-star-of-slumdog-millionaire-dead-at-53_n_5ea9355ec5b6123a17648dbd_1588623281.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9280e240000ae008e9ea7.jpeg?cache=afvubm67dh&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_irrfan-khan-star-of-slumdog-millionaire-dead-at-53_n_5ea9355ec5b6123a17648dbd_1588623281.html", "title": "Irrfan Khan, Star Of 'Slumdog Millionaire,' Dead At 53", "title_page": "Irrfan Khan, Star Of 'Slumdog Millionaire,' Dead At 53 | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Irrfan Khan, best known internationally for roles in “Slumdog Millionaire” and “Jurassic World,” has died at the age of 53.\nThe Bollywood star died in a hospital in the western city of Mumbai, his agency said.\nIn 2018, the actor posted on Twitter to say that he had been diagnosed with an endocrine tumor, a rare illness affecting cells that release hormones into the bloodstream.\nTaylor Jewell/Invision/AP\nHe later underwent treatment in a London hospital and recovered well enough to shoot “Angrezi Medium,” the film which would turn out to be his last.\nIt was due to be released last month but was cut short because of the coronavirus pandemic.\nHis breakthrough role came in 2002’s “The Warrior,” which was selected for the prestigious San Sebastian film festival and won a Bafta for Best British Film.\nHe went on to have success in mainstream Indian films, including “Maqbool,” an adaptation of Shakespeare’s “Macbeth” set in the Mumbai underworld.\nMore Bollywood roles followed, such as “Rog” and the musical “Life In A... Metro.”\nVittorio Zunino Celotto via Getty Images\nThe actor was best known to English-speaking audiences as the police inspector in “Slumdog Millionaire,” which went on to win eight Oscars.\nHe also starred in big-budget Hollywood productions including “The Amazing Spider-Man” (2012), “Jurassic World” (2015) and “Inferno” (2016).\nIn 2012 he played the adult version of the lead character in Ang Lee’s Oscar-winning “Life of Pi.”\nIn a statement, a spokesperson said: “‘I trust, I have surrendered’; These were some of the many words that Irrfan expressed in a heartfelt note he wrote in 2018 opening up about his fight with cancer. And a man of few words and an actor of silent expressions with his deep eyes and his memorable actions on screen.\n“It’s saddening that this day, we have to bring forward the news of him passing away. Irrfan was a strong soul, someone who fought till the very end and always inspired everyone who came close to him.\n“After having been struck by lightning in 2018 with the news of a rare cancer, he took life soon after as it came and he fought the many battles that came with it. Surrounded by his love, his family for whom he most cared about, he left for heaven abode, leaving behind truly a legacy of his own.\n“We all pray and hope that he is at peace. And to resonate and part with his words he had said, ‘As if I was tasting life for the first time, the magical side of it.’”\nHe is survived by his wife Sutapa Sikdar, and sons Babil and Ayan.", "url": "https://www.huffpost.com/entry/irrfan-khan-star-of-slumdog-millionaire-dead-at-53_n_5ea9355ec5b6123a17648dbd"}