{"authors": ["Lindsey Tanner"], "date_download": "2020-05-04 20:11:25", "date_modify": "2020-05-04 20:11:25", "date_publish": "2020-03-31 18:02:07", "description": "Some pregnant women fear giving birth with no loved ones by their side. Others worry about getting sick with COVID-19 and not being able to hold their newborns. The coronavirus pandemic has...", "filename": "_3a1716b6795dd06a38722a53a492a86c_1588623085.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c7971ca54fc54e1987b3c26a5da58a6e/2473.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3a1716b6795dd06a38722a53a492a86c_1588623085.html", "title": "Virus disrupts pregnancy plans, raises anxiety and questions", "title_page": "Virus disrupts pregnancy plans, raises anxiety and questions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This Feb 1, 2020 photo provided Maureen Nicol shows her in Harlem, N.Y. Nicol, a single Columbia University PhD student pregnant with her first child, will be giving birth out of state, not as planned. She spent months planning to give birth in April at a Manhattan hospital with the assistance of a doula. But during a visit this month to her family's Maryland home, New York became the nation's coronavirus epicenter and she canceled plans to return. (Courtesy of Maureen Nicol via AP)\nThis Feb 1, 2020 photo provided Maureen Nicol shows her in Harlem, N.Y. Nicol, a single Columbia University PhD student pregnant with her first child, will be giving birth out of state, not as planned. She spent months planning to give birth in April at a Manhattan hospital with the assistance of a doula. But during a visit this month to her family's Maryland home, New York became the nation's coronavirus epicenter and she canceled plans to return. (Courtesy of Maureen Nicol via AP)\nSome pregnant women fear giving birth with no loved ones by their side. Others worry about getting sick with COVID-19 and not being able to hold their newborns. The coronavirus pandemic has injected anxiety and uncertainty to an already stressful time and while science about risks is mostly reassuring, doctors want clearer answers too.\n“There is very limited information available,” said Dr. Leana Wen, a George Washington University public health specialist. She wants answers as a physician and as a patient — Wen is pregnant and due to give birth to her second child any day.\nHer greatest fear is developing a COVID-19 infection or symptoms that would force her to be separated from her newborn for days or weeks.\n“I would only be able to see my baby through a glass window,” said Wen, former Baltimore health commissioner. “That’s the one that gives me nightmares.”\nTo help provide answers, the University of California, San Francisco last week started the first U.S. registry of COVID-19 infected or exposed pregnant women. At least 60 women have enrolled so far.\nNot all have confirmed cases. Women who turn out not to be infected will remain in the registry as a comparison group.\nThe more women in the registry “the more quickly we can provide the answers,” said Dr. Vanessa Jacoby, who heads the effort.\nThe big questions include: Are pregnant women more likely than others to become infected and to develop complications? Preliminary evidence suggests no.\nThere is also no definitive evidence that the virus can be transmitted from mother to fetus during pregnancy, although three small and preliminary studies from China published last week raised that possibility. One paper in JAMA Pediatrics included 33 infants born to infected women; only three babies tested positive, two days after birth, and developed symptoms including pneumonia. All three recovered.\nIt’s likely their mothers transmitted the disease during or after birth, not during pregnancy, said Dr. David Kimberlin, a pediatric infectious disease specialist at the University of Alabama at Birmingham.\n“The numbers are too small to make any conclusions” about how often infants become infected or how sick they become, Kimberlin said.\nGuidance from the American College of Obstetricians and Gynecologists and Society for Maternal-Fetal Medicine says pregnant women with COVID-19 should be considered high-risk patients. That’s because pregnant women who develop flu or other respiratory infections caused by related viruses face increased risks for complications from those illnesses, including premature births and certain birth defects. There a few reports of babies born prematurely but there is no evidence that the coronavirus was the cause.\nTo limit the risk of infection, some doctors are doing prenatal checkups by phone or video conference. Some are implementing or considering limits on visitors in the delivery room. At some New York City hospitals, that meant no spouses or partners either, until the state said one person was allowed.\nFederal recommendations say hospitals should consider separating infected mothers from newborns until the mother tests negative for the virus, but that is not a mandate, said Dr. Brenna Hughes, a Duke University specialist who helped write the obstetric groups’ guidance.\nSome pregnant women are seeking to have labor induced early to avoid hospitals during a possible surge of COVID-19 cases, and others are suddenly deciding to give birth at home. Mainstream medical groups advise against both.\n“We believe that planned hospital birth is the safest option for pregnant women,” Hughes said.\nShe added that for women who are planning to become pregnant, there’s no specific advice against it during the pandemic.\nSome hospitals are seeing pregnant women from out-of-state virus hotspots, who are seeking to give birth in a safer environment. These include Greenwich Hospital in Greenwich, Connecticut, 35 miles from New York City, and Tufts Medical Center, 200 miles away, in Boston.\nTufts is not accepting any routine OB/GYN transfers from any COVID-19 surge areas that advise against travel, said spokesman Jeremy Lechan. “If a pregnant patient from one of these areas shows up in the clinic, they will be asked to self-quarantine for 14 days before receiving care.” Women in labor will accepted but without anyone else.\nMaureen Nicol, a single Columbia University doctoral student in early childhood education, will be giving birth to her first child out of state, not as planned. She expected to give birth in April at a Manhattan hospital with the assistance of a doula. But during a visit in March to her family’s Maryland home, New York became the nation’s coronavirus epicenter. She canceled plans to return.\nNow she’s racing to find a new doctor and hospital, buy new baby supplies, and considering the possibility of giving birth with her doula on the phone.\n“I’m just wishing for a healthy and safe delivery,” Nicol said. “And feeling I have some control in a time and situation where I feel like no one feels like they have control.”\n___\nFollow AP Medical Writer Lindsey Tanner at @LindseyTanner.\n___\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://apnews.com/3a1716b6795dd06a38722a53a492a86c"}