{"authors": ["Gina Yu"], "date_download": "2020-05-04 17:00:56", "date_modify": "2020-05-04 17:00:56", "date_publish": "2020-04-09 17:23:47", "description": "As researchers scramble to find new drugs and vaccines for Covid-19, a vaccine that is more than a century old has piqued researchers' interests. The Bacillus Calmette-Guerin vaccine -- which was first developed to fight off tuberculosis -- is being studied in clinical trials around the world as a way to fight the novel coronavirus.", "filename": "2020_04_09_health_tuberculosis-bcg-vaccine-coronavirus_index_1588611656.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409070241-01-bcg-vaccine-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_tuberculosis-bcg-vaccine-coronavirus_index_1588611656.html", "title": "BCG: How a 100-year-old vaccine for tuberculosis could help fight Covid-19", "title_page": "BCG: How a 100-year-old vaccine for tuberculosis could help fight Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As researchers scramble to find new drugs and vaccines for Covid-19, a vaccine that is more than a century old has piqued researchers' interests. The Bacillus Calmette-Guerin vaccine -- which was first developed to fight off tuberculosis -- is being studied in clinical trials around the world as a way to fight the novel coronavirus.\nTuberculosis and Covid-19 infection are two very different diseases -- TB is caused by a type of bacteria while Covid-19 is caused by a virus, for starters. But the BCG vaccine might help people build immune responses to things other than TB, causing \"off-target effects,\" according to Dr. Denise Faustman, director of immunobiology at Massachusetts General Hospital and associate professor of medicine at Harvard Medical School.\n\"In other words, in clinical trial format, people started picking up positive benefit from getting the vaccine that had nothing to do with tuberculosis,\" she said. Faustman has studied how the BCG vaccine affects people with Type 1 diabetes for many years. She is interested in how its off-target effects change the immune system in beneficial ways for people with autoimmune diseases such as Type 1 diabetes.\nThough the exact mechanism for these off-target effects of the BCG vaccine isn't clear, it's believed that the vaccine can cause a nonspecific boost of the immune response.\nThere is currently no vaccine or treatments approved by the US Food and Drug Administration for the novel coronavirus. While hopeful that the BCG vaccine will prove to be effective against Covid-19 -- as with any of the treatments and vaccines under development -- Dr. William Schaffner, an infectious disease specialist at the Vanderbilt University School of Medicine, admits the concept is a bit unconventional.\nRead More", "url": "https://www.cnn.com/2020/04/09/health/tuberculosis-bcg-vaccine-coronavirus/index.html"}