{"authors": ["Haley Byrd", "Manu Raju"], "date_download": "2020-05-04 16:16:05", "date_modify": "2020-05-04 16:16:05", "date_publish": "2020-04-03 17:29:27", "description": "House Speaker Nancy Pelosi said Friday that Democrats could put on hold a host of their infrastructure priorities and instead advance a new stimulus measure that mirrors the historic $2.2 trillion stimulus package President Donald Trump signed into law last week.", "filename": "2020_04_03_politics_pelosi-cnbc-infrastructure_index_1588608965.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327140410-nancy-pelosi-speaks-after-wiping-down-podium--super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_pelosi-cnbc-infrastructure_index_1588608965.html", "title": "Pelosi says infrastructure may have to wait past fourth coronavirus bill", "title_page": "Nancy Pelosi says infrastructure may have to wait past fourth coronavirus bill - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) House Speaker Nancy Pelosi said Friday that Democrats could put on hold a host of their infrastructure priorities and instead advance a new stimulus measure that mirrors the historic $2.2 trillion stimulus package President Donald Trump signed into law last week.\nHer comments signal Democrats' willingness to collaborate on emergency legislation yet again — even if it doesn't include some of their key priorities. Congressional Republicans have resisted moving forward with Democratic proposals for a fourth coronavirus package, but the White House is now signaling it could be open to supporting a targeted bill that would extend the emergency provisions enacted in the third response measure.\n\"We've had three bills that have been bipartisan. I think right now we need a fourth bipartisan bill . And I think the bill could be very much like the bill we just passed,\" Pelosi said during an interview on CNBC. She specified that she would want to see more money for state and local governments, small businesses, more direct payments to individuals, and extensions of some of the other provisions in the recently-enacted $2.2 trillion stimulus bill.\n\"I'm very much in favor of doing some of the things that we need to do to meet the needs of clean water, more broadband, and the rest of that. That may have to be for a bill beyond this,\" she said. \"Right now, I think that we have a good model. It was bipartisan, it was signed by the President, but it's not enough.\"\nA senior administration official indicated the White House is open to this approach.\n\"POTUS has been clear that if we need to do more from Phase 3, he won't hesitate to ask, and expects Congress to act,\" the official said, adding that the other ideas Pelosi and House Democrats put forward \"aren't relevant to the challenges we face right now.\"\nThe official said the focus now is on \"making sure Phase 3 works and being prepared to restock and reload: Phase 3.5.\"\nPelosi's comments came after House Democrats spent much of the week advocating for their infrastructure priorities to be wrapped into a fourth coronavirus response package, including funding for broadband, water systems, roads, and public transit. Democratic lawmakers gained optimism about the possibility of addressing infrastructure when Trump on Tuesday called for a $2 trillion infrastructure package to boost the economy.\nTop congressional Republicans, including Senate Majority Leader Mitch McConnell and House Minority Leader Kevin McCarthy, have not only pushed back on the idea of an ambitious infrastructure effort, but they have also taken issue with the notion that a fourth coronavirus stimulus bill is even needed yet.\nOn Thursday, McCarthy told reporters that a fourth response measure \"is not appropriate at this time.\" Republicans say Congress should instead wait and see how the third package plays out before crafting new legislation.\nPelosi on Friday urged quick action on a new stimulus bill, saying lawmakers \"don't need a long time to figure out what we need to do next. ... We know, and we have a model.\"", "url": "https://www.cnn.com/2020/04/03/politics/pelosi-cnbc-infrastructure/index.html"}