{"authors": ["General Assignment Reporter"], "date_download": "2020-05-04 20:20:28", "date_modify": "2020-05-04 20:20:28", "date_publish": "2020-04-29 14:26:49", "description": "\"When Nike says just do it, they don't mean mass murder,\" the \"Late Night\" host snapped in a bit shaming runners during lockdown.", "filename": "entry_seth-meyers-joggers_n_5ea97525c5b6fb98a2b5cd32_1588623628.html", "image_url": "https://img.huffingtonpost.com/asset/5ea97e03220000c80c827db6.png?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_seth-meyers-joggers_n_5ea97525c5b6fb98a2b5cd32_1588623628.html", "title": "Seth Meyers Savagely Puts Coronavirus Pandemic Joggers In Their Place", "title_page": "Seth Meyers Savagely Puts Coronavirus Pandemic Joggers In Their Place | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Seth Meyers gleefully shamed careless joggers venturing too close during the coronavirus pandemic. (See the video above.)\nIn a “Hey!” segment on “Late Night” Tuesday, the host ripped fitness enthusiasts for not wearing masks and barreling up from behind without regard for social distancing guidelines.\n“It’s like a horror movie, except Jason had the decency to wear a mask,” he said, adding that hard-breathing runners “could be crop dusting us with corona.”\n“When Nike says just do it, they don’t mean mass murder,” he sniped.\nMeyers noted that for once, joggers had the perfect excuse not to jog and suggested they run in place at home ― “like you do at every red light.”\nThe comedian, who acknowledged he’s a runner, implored the shuffling masses to cover their faces if they must get in their miles.\n“I know it makes it harder to breathe but you know what else make it harder to breathe? Jogging.”\nThe Centers for Disease Control and Prevention advises everyone to wear a face mask in public. Experts advise joggers and cyclists to seek places, if possible, where they can maintain a safe distance from others so they don’t need to wear a face covering.", "url": "https://www.huffpost.com/entry/seth-meyers-joggers_n_5ea97525c5b6fb98a2b5cd32"}