{"authors": [], "date_download": "2020-05-04 20:24:52", "date_modify": "2020-05-04 20:24:52", "date_publish": "2020-04-16 17:59:55", "description": "SIOUX FALLS, S.D. (AP) — South Dakota health officials on Thursday announced one new death from the coronavirus, and the confirmed number of cases in the state rose to 1,311 — up 143 from the day...", "filename": "_6c11cc63a0a9b4a6d12c9ff4d1a8d9d5_1588623892.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6c11cc63a0a9b4a6d12c9ff4d1a8d9d5_1588623892.html", "title": "One new South Dakota COVID-19 death; 143 new cases confirmed", "title_page": "One new South Dakota COVID-19 death; 143 new cases confirmed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX FALLS, S.D. (AP) — South Dakota health officials on Thursday announced one new death from the coronavirus, and the confirmed number of cases in the state rose to 1,311 — up 143 from the day before.\nOver half of the total cases have been tied to an outbreak at a Smithfield pork processing plant in Sioux Falls. The plant is one of the largest known clusters of COVID-19 cases in the country. A total of 598 employees have confirmed infections, plus 135 of their close contacts.\nOne 64-year-old employee of the company died on Tuesday, according to his pastor. Health officials did not say if the death they reported Thursday was the Smithfield employee, but the death matches the age range and county of the employee.\nGov. Kristi Noem has said the plant is important to the nation’s food supply and that getting it up and running is a “national security issue.”\nOfficials from the U.S. Centers for Disease Control and Prevention walked through the plant Thursday. Noem said she would release their findings in the coming days.\nThe new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death.\n___\nThis story has been corrected to show that 143 new coronavirus cases were confirmed, not 131.", "url": "https://apnews.com/6c11cc63a0a9b4a6d12c9ff4d1a8d9d5"}