{"authors": ["Costas Lapavitsas", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Nick French", "David Harvey", "Jedediah Britton-Purdy"], "date_download": "2020-05-04 19:56:43", "date_modify": "2020-05-04 19:56:43", "date_publish": "2020-03-27 00:00:00", "description": null, "filename": "2020_03_coronavirus-pandemic-great-recession-neoliberalism_1588622203.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/27125519/GettyImages-1208287411.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-pandemic-great-recession-neoliberalism_1588622203.html", "title": "This Crisis Has Exposed the Absurdities of Neoliberalism. That Doesn’t Mean It’ll Destroy It", "title_page": "This Crisis Has Exposed the Absurdities of Neoliberalism. That Doesn’t Mean It’ll Destroy It", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "The COVID-19 public health emergency has rapidly turned into a crisis at the core of the world economy, which also threatens developing countries in the periphery. It has changed the balance between state and market, once again exposing the emptiness of neoliberal ideology. This economic crisis casts a harsh light on contemporary capitalism — and is likely to prove even more important than the blow to public health. Indeed, this crisis has deeper roots, in the diseased workings of financialized and globalized capitalism over the past decade. The Great Crisis of 2007–9 brought an end to the 1990s-2000s “golden era” of finance, and the years that followed were marked by poor growth at the core of the world economy. Profitability was weak, productivity growth was low, and investment showed no dynamism at all. Finance was also in trouble, exhibiting lower profitability and none of the extraordinary dynamism of the previous decade. Where the historically unprecedented crisis of 2007–9 marked the peak of financialization, the equally novel coronavirus crisis crystallizes its deterioration. Of course, the immediate spur for the crisis owed to nation-states’ actions faced with the epidemic. Having initially ignored the medical emergency, several states then frantically locked down entire countries and geographical areas, restricting travel, closing schools and universities, and so on. This hit hard the already weakened core economies by inducing a wholesale collapse of demand, disruption of supply chains, falling production, millions of worker layoffs and loss of corporate revenue. All this spurred an unprecedented nosedive of major stock markets and panic conditions in the money markets. It is as if the Black Death of the fourteenth century had staged a return, and twenty-first century societies responded with a similar mix of blind fear and isolation of communities. Yet the plague killed a third of Europe’s population back when its states were poor and backward feudal monarchies. In contrast, the coronavirus appears to have a low mortality rate and has struck advanced capitalist states of peerless technological accomplishments. There is already an intense debate among epidemiologists on whether wholesale lockdown was an appropriate and sustainable response, or if states should instead have focused on intensive testing of the population. It is not for political economists to assess epidemiological policies. But there is little doubt that several states’ reactions and the ensuing collapse of economic activity are of a piece with the fundamentally flawed nature of neoliberal financialized capitalism. An economic system based on competition and naked profit-seeking — both guaranteed by a powerful state — proved incapable of dealing calmly and effectively with a public health shock of unknown severity. Several advanced countries lacked the basic health infrastructure to treat those who became seriously ill, while also being short of equipment to test the population on a large scale and to protect those most likely to catch the disease. The lockdown and wholesale isolation of huge sections of society are, moreover, likely to have very severe implications for wage workers as well as the poorest, the weakest, and the most marginal layers. The mental and psychological repercussions will also be devastating. The social organization of contemporary capitalism was shown to be dysfunctional even from an engineering point of view. Equally striking, however, have been even powerful states’ actions after the magnitude of the unfolding economic collapse became clear. In March, the central banks of the United States, the European Union, and Japan engaged in massive liquidity injections and brought interest rates down to zero, attempting to stabilize stock markets and assuage the shortage of liquidity. The US Federal Reserve, for instance, announced that it would buy unlimited volumes of government bonds and even freshly issued private corporate bonds. Governments in the United States, the European Union, and elsewhere, meanwhile, planned massive fiscal expansions, taking the form of loan and credit guarantees for companies, income subsidies for affected workers, tax deferrals, social security deferrals or subsidies, debt repayment holidays, and so on. In an extraordinary move, the Trump administration announced plans to provide $1,200 per adult, or $2,400 per couple, with additional payments for children, starting with the poorest families. This disbursement was part of a package which could exceed $2 trillion — roughly 10 percent of US GDP — further providing $500 billion of loans to stricken businesses, $150 billion to hospitals and health care workers, and $370 billion of loans and grants to small and medium enterprises. In an equally extraordinary move, Britain’s Tory government declared its intention effectively to become the employer of last resort by paying up to 80 percent of workers’ salaries, if companies kept them on their payroll. These payments would be worth up to a maximum of £2,500 per month — just above the median income. Not content with this, the British government also effectively nationalized the railways for six months and there was talk of nationalizing airlines. Just days earlier, even left-wing academics would have considered these measures to be radical. The shibboleths of the neoliberal ideology of the last four decades were rapidly swept aside, and the state emerged as the regulator of the economy commanding enormous power. It was not difficult for many on the Left to welcome such state action, thinking that it indicated the “return of Keynesianism” and the death knell of neoliberalism. But it would be rash to come to such conclusions. For one thing, the nation-state has always been at the heart of neoliberal capitalism, guaranteeing the class rule of the dominant corporate and financial bloc through selective interventions at critical moments. Moreover, these interventions were accompanied by strongly authoritarian measures, shutting people inside their homes en masse and locking down enormous metropoles. The state has also demonstrated its vast power to police society by collecting information through big data. For instance, Israel’s right-wing government approved the tracking of cell phones by the security police with the aim of messaging people who had unwittingly come into contact with confirmed coronavirus patients. Not only do we know where you are, but we know better than you whom you have met. This authoritarianism is fully in line with the dominant neoliberal ideology of the last four decades. State fiat is combined with the fragmentation of society as people are shut in their own homes and huge stress is placed on the “individual responsibility” to maintain social distancing. At the same time, large numbers of people are still required to go to work using public transport, while working rights are demolished, not least as layoffs rocket without concern for due process and as remote working destroys all limits to the working week. It thus remains unclear what direction global capitalism will take as it reels under the shock of coronavirus — even as we still endure the long aftermath of the Great Crisis of 2007–9. The colossal power of the state and its ability to intervene in both economy and society could result, for instance, in a more authoritarian form of controlled capitalism in which the interests of the corporate and financial elite would be paramount. This demands that socialists assess carefully and critically the actions that states are taking to deal with the coronavirus crisis.\nThe Crisis So Far The first step is to have a simple analytical summary of the course of the crisis so far. Crises are always highly concrete historical events reflecting the institutional development of capitalism. The major steps in the coronavirus crisis can be gleaned from a raft of (sometimes rapidly outdated) publications by multilateral organizations, the press, and elsewhere. Thus: COVID-19 emerged in China in late 2019, but the response of the Chinese state was initially slow, which could perhaps be ascribed to lack of knowledge about the severity of the virus. However, other states were slow to respond even after the full eruption of the epidemic in China. Until early March 2020, for instance, the number of daily confirmed cases in the United Kingdom was in the low double digits. Yet even with the Chinese experience to draw on, the UK government did next to nothing. Eventually the Chinese state locked down huge areas of the country, and other states followed with their own lockdowns, restricting the movement of hundreds of millions of people. Demand for tourism, air travel, hospitality, restaurants, and pubs, collapsed totally. Demand for food, clothing, household goods, and so on, was also significantly affected, although the overall impact is still unclear. The uncertainty created by the retreat of consumption inevitably hit investment plans but, again, it is impossible to assess the overall impact at this early stage. The lockdown and the restricted movement of workers severely disrupted supply chains, initially in China, which provides a large volume of production inputs across the world, and then in other parts of Asia, Europe, and the United States. Together with the blow to demand, this led to the curtailing of production. Falling production, shrinking demand, and growing uncertainty destroyed company revenues. A wave of bankruptcies loomed. The jobs of millions of workers came under threat, especially in the service sector, and millions were laid off in March. Loss of employment worsened consumption and further undermined production. As revenues declined, enterprises became less able to pay their debts, trade credit vanished, and by mid-March liquidity (that is, hard cash) was at a premium. The crisis acquired a severe credit dimension, further compounding the effect on production and output. A taste of the potential economic devastation can be gained from China. According to official statistics, value added in production in January and February dropped by 13.5 percent compared to the same period in 2019 (manufacturing declining by 15.7 percent). Moreover, investment, exports, and imports fell by, respectively, 24.5, 15.9, and 2.4 percent. The Chinese contraction alone would have had a severe impact on the world economy. With many other core countries in effective lockdown, the fallout will be huge, particularly in sectors like airlines and tourism. The repercussions on working people will be shattering. Especially vulnerable are the sections weakened by years of neoliberal policies, for instance, those on flexible contracts, informal workers, and the self-employed. Also vulnerable are highly indebted workers (or those with no savings) who have limited access to benefits and public services. Women will probably be affected worse because they are overrepresented in those groups but also because of the increased care work that comes with health distress, children not going to school, and so on. Global conditions worsened further as the crisis triggered a gigantic stock-market collapse. For years the main stock markets across the world had been greatly inflated, and the risk of a severe crisis became apparent already in 2018. The coronavirus shock led to a spectacular fall of more than one-third from February to March. The result was a dramatic tightening of liquidity that spurred a money-market crisis in the United States, the center of world finance, by mid-March. The shock had morphed into a full-blown capitalist crisis. As fear gripped world markets, the flow of capital across borders, especially from the core to the periphery of the world economy, was also affected. Existing evidence does not allow for firm conclusions, but there is a distinct possibility of a “sudden stop” that would make developing countries unable to pay for imports and service debts, thus raising the prospect of currency crises. Amidst the turmoil, an unfolding price war among oil producers brought the price of Brent crude down by roughly 50 percent from late February to late March. This gigantic fall directly threatened the viability of a raft of producers across the world, including in the US fracking industry. This chain of crisis phenomena makes analytical sense only within the aftermath of the Great Crisis of 2007–9. In the wake of that crisis, financialized capitalism lost dynamism in core countries, though it continued in subordinate form in developing countries. Our estimates based on World Bank data suggest that average growth rates in 2010–19 were at their lowest for forty years: 1.4 percent in Japan, 1.8 percent in the European Union, 2.5 percent in the United States, and 8.5 percent in China (where growth weakened strikingly in the second half of the decade). These rates point to the exhaustion of the driving forces of capitalist accumulation particularly during the last decade. To gain insight into the deeper roots of the crisis, therefore, it suffices to consider some key aspects of the performance of the US economy — the mother lode of globalization and financialization.\nWeak Accumulation The simplest way to sum up the underlying performance of US capitalism is to consider the profit rate of nonfinancial enterprises, shown in Figure 1: Fig. 1 Profit rate of nonfinancial enterprises, US, 1980–2018 The trajectory of the profit rate was strongly cyclical and broadly in line with the overall fluctuations of the US economy. After the Great Crisis of 2007–9, the profit rate recovered weakly, peaking in 2014, and then declining. Clearly, the coronavirus shock hit the US economy at a time when it was already weak, and accumulation showed signs of exhaustion. The underlying weakness is also apparent from a variety of other data. Thus, after 2007–9, labor productivity grew at barely 1 percent per annum; investment remained flat and low at around 18 percent of GDP; and the real capital stock shrunk. Instructive, here, is a comparison with China, the world’s second-largest economy. After the 2007–9 crisis the estimated average profit rate in China rose for several years but began to decline in 2014. The underlying weakness of accumulation also appears in other data, though China’s performance remained substantially stronger than that of the United States. Thus, after 2007–9, labor productivity rose at around 7–8 percent per annum, investment was broadly flat at 45 percent of GDP, and industrial-capacity utilization fell rapidly. The coronavirus hit the Chinese economy at one of its weakest moments since the start of its capitalist transformation. Comparison with the European Union, which is collectively larger than China but smaller than the United States, adds further insight. After 2007–9 productivity growth was worse than in the United States, particularly for states in the European Monetary Union (EMU), with the leading countries hovering below 1 percent per annum (Poland, which is not in the EMU, stood out with productivity growth above 3 percent). Industrial production increased substantially in Germany, despite its weak productivity growth, as capitalists continued to take advantage of the competitive edge gained from a long period of wage suppression. However, in 2019 it fell, revealing Germany’s underlying weakness. The European Union, weighed down by the austerity framework of the euro, was lodged in stagnation during the last decade. During the same period a new industrial complex began to emerge in Eastern Europe, as in Poland, closely associated with German industry. The labor share of GDP remained stagnant as capital defended its interests, except for Germany, where wage growth was significant for the first time in decades. Given the absence of sustained productivity growth, German competitiveness declined. All in all, coronavirus has thus hit the European Union at a time of great economic weakness. The roots of the economic crisis caused by the coronavirus lie in the weakening of capitalist accumulation in the preceding period, which is evident in the United States, China, and the European Union. The impact of the crisis will, moreover, probably be very different in these economies because of their different structures. China has become the workshop of the world, with value added in manufacturing accounting for roughly 30 percent of GDP — the corresponding figure for the United States is just over 10 percent. Value added in services has risen substantially in China as the economy has become more mature, but it is still only at 50 percent of GDP, while in the United States it is above 75 percent. Since the shock of the lockdown falls disproportionately on services, it is likely that the United States will be worse affected than China, at least in the first instance. The same holds broadly for the European Union, whose economy is heavily based on services, particularly in southern-periphery countries like Spain, Portugal, and Greece which have weak industry and are dependent on tourism. The shock will probably be even greater for Italy, which has been stagnant for two decades, and since 2010 never far from defaulting on its debt. The EU leadership are thus right to perceive the coronavirus crisis as an existential threat. That is the reason for the European Central Bank’s (ECB) massive intervention, but also the actions of several nation-states, whose crisis expenditure has in practice lifted the iron cage of austerity over Europe.\nThe Travails of Finance The weakness of financialized capitalism in the United States can be further gauged by considering the profit rate of US commercial banks in Fig. 2: Fig. 2 Rate of profit of commercial banks (return on equity), US, 1980–2018 The profitability of US commercial banks — the pivot of the financial system — reached historic highs from the early 1990s until shortly before the crisis of 2007–9. This was the “golden era” of US financialization. Two factors explain the banks’ exceptional profits: first, their ability to secure a sizeable spread between the interest rate on loans and the interest rate on deposits, and second, their ability to earn large fees and commissions by mediating financial transactions among enterprises, households, and other financial firms. After 2007–9, bank profitability never reached the same heights. This was because the Federal Reserve drove interest rates close to zero, thus compressing bank spreads, and also because income from fees and comissions declined as the volume of financial transactions declined. Bank profitability had a brief spurt in 2018 but that was mostly due to the Federal Reserve gently raising interest rates in 2017–8. Further light can be cast on the decade after 2007–9 by considering the trajectory of debt in the United States in Fig. 3, split into the debt of i) nonfinancial enterprises, ii) households, iii) government, and iv) domestic financial enterprises, all relative to GDP: Fig. 3 US Sectoral Debt to GDP US private debt (in proportion to GDP) fell after 2007–9, contrary to much breathless commentary about a “debt explosion.” Mortgage debt declined substantially as households were badly hit during the Great Crisis. Debt among domestic financial enterprises also declined, thus leaving less scope for banks to earn fees and commissions. In contrast, the debt of nonfinancial corporations began to rise in 2015, eventually exceeding its previous peak before the Great Crisis. The rise in corporate debt has facilitated the survival of a multitude of weak enterprises with low profitability which are very vulnerable to shocks. These “zombie firms” were estimated in 2017 to represent 12 percent of all companies in fourteen developed economies. It remains to be seen how the coronavirus crisis will affect their ability to service their debts, bearing in mind that zero interest rates bring down servicing costs. The real increase during this period, however, was in state debt, leaving the US government more indebted than at any time since World War II. Financialization after the Great Crisis, insofar as it showed any dynamism at all, became a process of exploding state indebtedness that was also connected to enterprise indebtedness in open financial markets — including the stock market.\nThe Role of the State and the Bursting of the Stock Bubble After the Great Crisis, the US government stepped into the breach and used its massive strength to defend financialized and globalized capitalism. Above all, it run a large fiscal deficit throughout the decade — but especially in 2009–2012 and again in 2018–19 — thus supporting GDP growth, while enormously increasing its debt. The rise in public debt made it possible for the Federal Reserve to sustain a tremendous bout of money creation, while keeping interest rates close to zero. The money supply (M3) increased from 50 percent of GDP in 2007 to 70 percent in 2017–19. Low-interest rates and abundant liquidity allowed non-financial enterprises to borrow cheaply in open markets and engage in the classic financialization game of “share buy-backs,” securing high profits for shareholders and pushing up stock prices. With money easily available, other stock-market operators, above all, Exchange-Traded Funds (ETFs) and Hedge Funds, also expanded their activities. The result was a sustained and gradual rise in the stock market, with the Standard and Poor’s (S&P) index rising from 735 in February 2009 to 3,337 in February 2020. In short, after 2007–9, the US state’s intervention to buttress financialized capitalism led to a stock-market bubble that bore no relation to the underlying weakness of profitability, growth rates, productivity growth, and so on. All this makes the financial shock caused by coronavirus easier to understand. It was apparent already in 2017–18 that the stock-market bubble would not last, as the Fed began to raise interest rates slowly above zero, attempting to retrieve more normal conditions in financial markets. In December 2018 the S&P index collapsed briefly to 2,416, but the Fed rapidly reversed the increase in interest rates, and the bubble resumed. For reasons already explained, however, the coronavirus struck a blow of a quite different order and the stock market collapsed spectacularly, dropping to 2,237 on March 23 2020. The Trump administration’s subsequent announcement of a huge fiscal intervention led the S&P to bounce back, though volatility remains very high. The stock-market collapse revealed further speculative operations that dramatically worsened conditions in the financial markets. Plummeting prices put enormous pressure on exchange-traded funds (ETFs) and Investment Funds, forcing them to seek hard cash to meet their obligations. It then transpired that speculative chains had been set up whereby these Funds borrowed in the repo market (the main market for liquidity among financial institutions) by selling US Treasury Bills and then used the money to buy Treasury Bills in the futures markets, thus profiting from minor price discrepancies. The sums were huge. As stock prices collapsed, the Funds sold Treasury Bills increasingly desperately, and in effect drove up interest rates. The Federal Reserve was thus confronted with the bizarre situation of a rapidly developing shortage of liquidity and rising interest rates in money markets, even though the US economy had been flooded with dollars for more than a decade. Capitalist absurdity has rarely been more vividly demonstrated. The Fed had to intervene urgently by promising to buy unlimited volumes of public bonds and even private bonds, thus further increasing the supply of money. Its massive intervention was soon matched by the equally massive fiscal package of the US government. Once again, the US state put props under collapsing financialized capitalism. It is important, in this connection, to note the difference between the USA and the EU. The Commission has tacitly allowed member states to ignore the Stability and Growth Pact, while the ECB has abandoned its bond buying rules in an effort to avoid an Italian default, which would immediately catalyze a new crisis for the euro. These are important actions which have allowed EU nation-states to operate without unnecessary hindrances. But there has not been any coordinated fiscal intervention by EU institutions that is remotely comparable to the USA, or even the UK. In effect, the crisis has forced the EU to engage in economic policy that side-steps its own rule book. Nation-states have been doing the running so far, with very little cooperation or mutual discipline. The long-standing problem of conflicts and hierarchy among them has not gone away, and that is why proposals to issue EU “coronabonds” to fund fiscal expenditure are meeting with strong resistance. If money is to be made available to stricken states, it might be through the European Stability Mechanism, with various conditions attached. There is simply no comparison with the response by the US state.", "url": "https://www.jacobinmag.com/2020/03/coronavirus-pandemic-great-recession-neoliberalism"}