{"authors": ["Jennifer Hansler", "Kylie Atwood"], "date_download": "2020-05-04 16:11:30", "date_modify": "2020-05-04 16:11:30", "date_publish": "2020-04-02 23:50:44", "description": "Former State Department officials were \"mystified\" and \"bemused\" by the United States' purchase of medical supplies from Russia amid the coronavirus pandemic -- a move that experts say is a propaganda win for the Kremlin.", "filename": "2020_04_02_politics_russia-medical-supplies-us-propaganda_index_1588608690.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402184016-russia-plane-medical-equipment-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_russia-medical-supplies-us-propaganda_index_1588608690.html", "title": "Russian coronavirus aid delivery to US prompts confusion and criticism", "title_page": "Russian coronavirus aid delivery to US prompts confusion and a backlash - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Former State Department officials were \"mystified\" and \"bemused\" by the United States' purchase of medical supplies from Russia amid the coronavirus pandemic -- a move that experts say is a propaganda win for the Kremlin.\nA Russian plane with the equipment touched down in New York City on Wednesday, with an air traffic controller thanking the pilot \"for all the assistance you are bringing in.\" The delivery came days after President Donald Trump spoke by phone with his Russian counterpart, Vladimir Putin.\n'A very nice offer'\nAccording to State Department spokesperson Morgan Ortagus, the US purchased the supplies, which included ventilators and personal protection equipment.\n\"Both countries have provided humanitarian assistance to each other in times of crisis in the past and will no doubt do so again in the future,\" she said. \"This is a time to work together to overcome a common enemy that threatens the lives of all of us.\"\nA State Department spokesperson on Thursday evening said, \"The United States is purchasing the supplies and equipment outright, as with deliveries from other countries.\"\n\"We appreciate Russia selling these items to us below market value,\" they said.\nIt is unclear if the Trump administration also bought supplies from other countries below market value, and how this specific deal was established.\nThe spokesperson for the Russian Foreign Ministry, Maria Zakharova, said Thursday that half of the cargo was paid for by the Russian Direct Investment Fund -- a state-owned sovereign wealth investment fund -- and half by the US.\nTrump, speaking from the White House Thursday, did not mention the supplies being purchased. He instead touted the delivery as \"a very nice offer\" and said he would be open to future aid.\n\"It was a very nice gesture on behalf of President Putin and I could have said 'no, thank you' or I could have said 'thank you.' And it was a large plane of very high-quality medical supplies. And I said, 'I'll take it,'\" Trump said.\n'Hard to understand why they are not being clear'\nThe decision to buy supplies from one of the US' traditional adversaries -- and the lack of transparency around that choice -- was met with confusion by a number of former officials.\n\"Maybe this is a case of the bureaucracy being worried and having to fill in behind a decision Trump made on his own, but not wanting to get too far into the details to avoid backlash,\" said one of the former officials.\nThe other official struggled to find any sort of justification for the Trump administration allowing Russia to be a trusted source for the goods, which are in short supply in the United States.\n\"It is really hard to understand why they are not being clear. It should be easy to explain,\" they said. \"It also highlights the issues with how much aid the US is giving to other countries and how much is coming in.\"\nRussia is subject to numerous US sanctions, including for its aggression in Ukraine and its attempts to interfere in the 2016 US election.\nDaniel Fried, a former diplomat specializing in Russia and sanctions policy, told CNN that \"it shows the complexity of dealing, in a humanitarian area, with Russian institutions when we are pushing back at the same time against their aggressions.\"\n'Propaganda bonanza'\nFormer diplomat Brett McGurk described the delivery, which was touted by Moscow as a humanitarian gesture, as a \"propaganda bonanza.\"\nGraham Brookie, the Director and Managing Editor of the Atlantic Council's Digital Forensic Research Lab, told CNN that they're seeing \"a huge amount of that kind of 'Russia is here to help,' that positive messaging, positive propaganda.\"\n\"The Russians will fly in as many planes as possible to create the perception that we are reliant on Russia,\" a third former official said. \"If we keep accepting it, this makes us look weak and them look strong.\"\nAndrew Weiss, the Vice President for Studies in the Russia and Eurasia Program at the Carnegie Endowment for International Peace, said the move played into Russia's broader foreign policy goals.\n\"There's this constant effort to basically say that anything the West might be concerned about is unfounded,\" he told CNN.\n\"In many respects, the Russian handling of Donald Trump has taken on aspects of trolling, where they're using Trump's attempts to turn the page to push core elements of Russia's foreign policy view, which is US policy is a joke,\" Weiss said. \"I think it's just one more of these incidents that we've seen where the Russians outfoxed the Trump White House.\"", "url": "https://www.cnn.com/2020/04/02/politics/russia-medical-supplies-us-propaganda/index.html"}