{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:52:13", "date_modify": "2020-05-04 16:52:13", "date_publish": "2020-04-08 14:14:53", "description": "During his daily coronavirus briefing on Tuesday, President Donald Trump made very clear that voting by mail -- an alternative many are suggesting to deal with the ongoing stay-at-home directives -- is a very bad thing. And more than that, he suggested, it's deeply corrupt.", "filename": "2020_04_08_politics_donald-trump-vote-by-mail-absentee_index_1588611133.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406181702-01-wisconsin-voting-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_donald-trump-vote-by-mail-absentee_index_1588611133.html", "title": "Donald Trump's blatant hypocrisy on voting by mail", "title_page": "Donald Trump's blatant hypocrisy on voting by mail  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) During his daily coronavirus briefing on Tuesday , President Donald Trump made very clear that voting by mail -- an alternative many are suggesting to deal with the ongoing stay-at-home directives -- is a very bad thing. And more than that, he suggested, it's deeply corrupt.\n\"No, mail ballots, they cheat,\" said Trump. \"OK, people cheat. Mail ballots are a very dangerous thing for this country because they are cheaters.\"\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\nMoments later, a reporter noted that Trump himself had voted absentee -- by mail! -- in the Florida primary last month. (Trump also voted absentee in New York in the 2018 election.) Here's the exchange that followed:\nTRUMP: Well sure, I could vote by mail for the...\nREPORTER: But how do you reconcile that?\nTRUMP: Because I'm allowed to. Well that's called out of state -- you know why I voted? Because I happened to be in the White House and I won't be able to go to Florida and vote.\nUh huh.\nLet's deal with the obvious hypocrisy first. Florida, where Trump voted earlier this year, is a no-excuse absentee vote state -- meaning that a voter can request an absentee ballot (aka one you fill out at home and mail back to the election authority) without offering any excuse for why they want to do so. (As of 2018, there were 27 no-excuse absentee states .) So, convenience is, under Florida law, a perfectly acceptable reason to vote absentee.\nWhich is what Trump did. Being president is a more than full-time job, and he couldn't make time to travel to Florida to cast a vote in person. So he voted absentee. Perfect! This is an example of the system working as it was designed to!\nThe problem is that Trump thinks absentee voting is good for him but not for other people. Because of, er, fraud.\n\"Well there's a big difference between somebody that's out of state and does a ballot and everything's sealed, certified and everything else,\" he said Tuesday. \"You see what you have to do with the certifications. And you get thousands and thousands of people sitting in somebody's living room signing ballots all over the place.\"\nHe echoed that sentiment in a tweet on Wednesday morning -- apparently while watching \"Fox & Friends:\n\"Republicans should fight very hard when it comes to state wide mail-in voting. Democrats are clamoring for it. Tremendous potential for voter fraud, and for whatever reason, doesn't work out well for Republicans. @foxandfriends\"\nWhile Trump has long been fixated on so-called voter fraud by Democrats -- he formed (and then disbanded) a commission early in his presidency to examine voting irregularities -- there is very, very little evidence of any sort of widespread voter fraud in the country\nNow, what Trump is right about is that absentee voting and vote-by-mail have been the places in the recent past where the small amount of voter fraud that exists has been discovered. (Nota bene: The only difference, effectively, between absentee voting and vote-by-mail is that in the former you have to request a ballot while in the latter a ballot is sent to you.)\nWhat he's wrong about -- or, more accurately, one of the things he is wrong about -- is in his suggestion that Democrats are the ones committing the absentee/vote-by-mail fraud. In fact, the most recent case was in North Carolina's 9th district when a Republican political consultant working for a GOP candidate named Mark Harris was charged with a slew of violations for making massive amounts of absentee ballot requests and, in one county in the district, personally turning in more than half of all absentee ballots cast.\nThe result of the 2018 election was thrown out and a special election to fill the seat was held in September 2019, with a different Republican candidate -- Dan Bishop -- winning the seat.\nIn the late 1990s, a major absentee vote fraud was exposed in Georgia Democratic primaries for local offices like sheriff. As The New York Times wrote back then\n\"Many of the absentee voters were assisted in voting by supporters of various candidates after claiming that they could not read (sometimes despite high school or college degrees) or that they suffered from physical maladies (one saying he had been kicked in the head by a mule).\"\nSo, there's no question that past history has suggested that absentee balloting and vote-by-mail are more likely than in-person voting to be subject to bad actors. Which makes sense since the vote is being cast, usually, in the privacy of your home, as opposed to at a polling place with official poll watchers and election officials not only keeping an eye out for any irregularities but also taking the ballot from you as soon as you cast it.\nThat said, voter fraud -- absentee or otherwise -- remains hugely rare. A five-year study on voter fraud commissioned by George W. Bush -- a Republican -- found that same conclusion . Wrote The New York Times at the time : \"The Justice Department has turned up virtually no evidence of any organized effort to skew federal elections.\"\nThen you must consider the reasons behind the push of late for an increased emphasis on absentee and vote-by-mail programs: The very real concern that the sort of close contact required to vote in-person might well further the spread of the coronavirus pandemic.\nIt remains to be seen whether Wisconsin's indefensible decision to hold in-person voting in its primary on Tuesday will lead to a spike in coronavirus cases, but we know from medical experts that the only truly effective means of limiting the spread of the virus right now is via social distancing and staying at home -- both of which are very difficult when you are going to a polling place to vote.\nWhile it's not yet clear what the health landscape will look like in the run-up to the November election, it's hard to imagine that the medical guidance for older people and those with some sort of underlying condition will be to expose themselves to large groups of people, like, say, waiting in a line to cast a ballot.\nWhen you combine the relative lack of demonstrated cases of purposeful fraud in absentee and vote-by-mail with the very real health risks likely to be present for at least some Americans this fall, Trump's personal hypocrisy on it looks even worse. If possible.", "url": "https://www.cnn.com/2020/04/08/politics/donald-trump-vote-by-mail-absentee/index.html"}