{"authors": ["Jeff Amy"], "date_download": "2020-05-04 20:12:13", "date_modify": "2020-05-04 20:12:13", "date_publish": "2020-04-07 18:06:01", "description": "ATLANTA (AP) — With her husband's Veterans Affairs nursing home closed to visitors to guard against the coronavirus, Linda McCall hadn't seen him for weeks but at least took comfort that he was...", "filename": "_fcece894041b4652dbc6155c5ce0da03_1588623133.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f25b97371ce449708fada60bfb5e1bef/2000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fcece894041b4652dbc6155c5ce0da03_1588623133.html", "title": "Families protest as veterans nursing home emptied for virus", "title_page": "Families protest as veterans nursing home emptied for virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Oct. 12, 2019 photo provided by Linda McCall, Army veteran Ralph McCall, is poses in Decatur, Ga. Ralph McCall is one of dozens of veterans who are being moved from a U.S. Department of Veterans Affairs nursing home in Decatur, Georgia, to other VA facilities. The agency said the veterans will be safer in other VA locations less affected by the coronavirus. The agency is also trying to clear out space in the facility in case the adjacent hospital needs it for a surge of COVID-19 patients. Family members are protesting the move. (Linda McCall via AP)\nIn this Oct. 12, 2019 photo provided by Linda McCall, Army veteran Ralph McCall, is poses in Decatur, Ga. Ralph McCall is one of dozens of veterans who are being moved from a U.S. Department of Veterans Affairs nursing home in Decatur, Georgia, to other VA facilities. The agency said the veterans will be safer in other VA locations less affected by the coronavirus. The agency is also trying to clear out space in the facility in case the adjacent hospital needs it for a surge of COVID-19 patients. Family members are protesting the move. (Linda McCall via AP)\nATLANTA (AP) — With her husband’s Veterans Affairs nursing home closed to visitors to guard against the coronavirus , Linda McCall hadn’t seen him for weeks but at least took comfort that he was nearby in suburban Atlanta.\nNow, 78-year-old Ralph McCall has been moved to a facility two hours away, and she’s fuming.\n“It’s like my husband is property, or a piece of meat, and we don’t have a say,” said Linda McCall, a Roswell resident. “Whoever made this decision in Washington, they don’t care about my husband at all.”\nMcCall and other veterans’ families said the U.S. Department of Veterans Affairs gave them insufficient notice of the decision to move dozens of residents from the Atlanta nursing home and worry they won’t receive adequate care in their new facilities.\nThe agency said the veterans, many with multiple medical conditions, will be safer in other VA locations less affected by the coronavirus than the Eagles’ Nest community living center adjoining the Atlanta VA Medical Center in Decatur. The agency is also trying to clear out space in the facility in case the adjacent hospital needs it for a surge of COVID-19 patients, spokesman Gregory Kendall said.\nThe transfers were interrupted when one of the nursing home residents tested positive for COVID-19, Kendall wrote Tuesday in an email to The Associated Press. The ill patient was removed and is being cared for separately, Kendall said, and the transfers to facilities elsewhere in Georgia, Alabama and South Carolina have resumed. He said patients previously transferred were tested just before being moved.\nKendall wrote that the VA is “taking every action to prioritize the health and safety of our residents and employees and reduce the risk of spreading COVID-19.”\nRalph McCall was moved Friday to a facility in Dublin, Georgia, about 140 miles (225 kilometers) southeast of Atlanta. His wife said he has a range of medical conditions, including Parkinson’s disease, heart disease, diabetes and dementia.\n“He’s slowly dying from the Vietnam War,” Linda McCall said, noting that he was repeatedly exposed to the toxic herbicide Agent Orange while he served from 1964 to 1966.\nHe’s been living at the Eagles’ Nest for six years. McCall hasn’t seen him since the facility locked down at the end of February but fears he won’t receive high quality care in a location where workers don’t know him or her.\n“I’m really afraid my husband is not going to survive this,” she said.\nIt’s unclear if other Veterans Affairs nursing homes nationwide are also transferring patients. Kendall didn’t respond Friday or Monday to that question. The VA has more than 100 nursing homes — what it calls community living centers — in 46 states, the District of Columbia and Puerto Rico.\n“We reached out to the families of our residents to explain the reasons for this move and will continue to provide timely updates until the Veterans return to their CLC home in Atlanta,” Kendall said.\nBut family members of residents dispute that. Joyce Jamison of Loganville said the VA has been reluctant to say when veterans would be moving and where. She learned Friday that her husband, 79-year-old Stuart Jamison, would move to Dublin on Monday.\n“Strangers are going to be taking care of them. They’re not going to know their wants or their needs,” Jamison said. “They’re not going to understand or get the care that they’re getting right now.”\nHer husband, who also was exposed to Agent Orange while serving in Vietnam, has Parkinson’s disease and is on a feeding tube, she said.\n“Leave our guys alone,” she said. “They know each other. They recognize each other. Why uproot people who are probably in the last stages of life?”\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .\n___\nFollow Jeff Amy on Twitter at http://twitter.com/jeffamy", "url": "https://apnews.com/fcece894041b4652dbc6155c5ce0da03"}