{"authors": ["Susan Montoya Bryan"], "date_download": "2020-05-04 20:04:22", "date_modify": "2020-05-04 20:04:22", "date_publish": "2020-04-09 18:19:20", "description": "ALBUQUERQUE, N.M. (AP) — While it pains him, the head of one of the oldest Catholic dioceses in the United States says this Holy Week will be different for tens of thousands of parishioners in New...", "filename": "_cf5cfd35ed82e525d2ecbc7039866511_1588622662.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d1568c6e7ad5441db97701b870984f0a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf5cfd35ed82e525d2ecbc7039866511_1588622662.html", "title": "Holy Week: New Mexico faithful find God beyond church walls", "title_page": "Holy Week: New Mexico faithful find God beyond church walls ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The doors at San Felipe de Neri Catholic Church in the Old Town historic district of Albuquerque, New Mexico, remain closed Thursday, April 9, 2020. The Archdiocese of Santa Fe is urging parishioners to stay home during Holy Week as state public health orders prompted by the coronavirus outbreak limit gatherings and social contact. (AP Photo/Susan Montoya Bryan)\nThe doors at San Felipe de Neri Catholic Church in the Old Town historic district of Albuquerque, New Mexico, remain closed Thursday, April 9, 2020. The Archdiocese of Santa Fe is urging parishioners to stay home during Holy Week as state public health orders prompted by the coronavirus outbreak limit gatherings and social contact. (AP Photo/Susan Montoya Bryan)\nALBUQUERQUE, N.M. (AP) — While it pains him, the head of one of the oldest Catholic dioceses in the United States says this Holy Week will be different for tens of thousands of parishioners in New Mexico. It has to be.\nThere will be no pilgrimages to holy sites and no parishioners packing the pews to celebrate Mass as the Archdiocese of Santa Fe has been pleading with the faithful to heed public health orders and stay home.\nDespite New Mexico’s rich centuries-old traditions that culminate with Easter weekend, Archbishop John Wester said the new coronavirus is nothing to play around with: “You don’t get any do-overs, you know. It doesn’t take a day off for Good Friday or Easter Sunday.”\nAmong Catholics in New Mexico, there has been a wave of emotions from disappointment and sadness to a renewed sense of purpose. Wester said in an interview with The Associated Press that the crisis is resulting in people finding God in new places — beyond the church walls.\n“Now that we can’t engage in these beautiful ancient ceremonies, we miss them and absence makes the heart grow fonder,” Wester said. “So maybe that’s what God’s grace is to us this year — telling us, giving us an opportunity to deepen in our appreciation of God’s presence.”\nOne priest within the archdiocese has tested positive for COVID-19. That priest, who the archbishop describes as young, is in self isolation and doing fine.\nFor most, the virus causes mild to moderate symptoms like fever and cough. But for some, especially older adults and the infirm, it can cause pneumonia and result in death. Nearly 1,000 cases and 17 deaths have been reported in New Mexico.\nWester said clergy members feel badly about not being able to gather with parishioners. Instead, they’re live-streaming Mass, organizing teams of volunteers to check up on parishioners by phone and hearing confessions.\nFor Holy Week, they’re urging people to pray, follow the readings and do the stations of the cross at home and look for opportunities to call a friend who might be isolated, write a letter to a loved one or text somebody.\n“There are many ways for us to perform acts of charity and to feel and be conscious of Christ’s presence in our lives,” the archbishop said.\nAfter suspending church services, Catholic leaders cancelled the annual pilgrimages to Chimayo and Tome Hill. State officials joined in urging people not to make the journey, citing the limits on public gatherings to keep from taxing the health care system.\nGov. Michelle Lujan Grisham described the social separation as a terrible hardship for the faithful but said public health should be the first consideration. She reiterated the archbishop’s guidance: “This week, home is the holy place.”\nWhile the pandemic is forcing cultural shifts, Wester said it has helped deepen his understanding that he really is in God’s hands. He’ll turn 70 this year. He feels like he could live forever but the idea that life is fragile has taken on a more visceral meaning now.\n“One little, teeny, tiny virus that’s so microscopic can bring me down,” he said. “So it’s like thank you Lord for the gift of life, thank you for all those antibodies that are working every day that I’m not aware of, thank you for all the ways in which you’re protecting me and watching over me and helping me live each day as fully as I can.”", "url": "https://apnews.com/cf5cfd35ed82e525d2ecbc7039866511"}