{"authors": ["Paul Leblanc"], "date_download": "2020-05-04 15:55:56", "date_modify": "2020-05-04 15:55:56", "date_publish": "2020-04-19 22:07:43", "description": "A group of US officials working at the World Health Organization headquarters transmitted real-time information about the novel coronavirus directly to the Trump administration, US and international officials told the Washington Post.", "filename": "2020_04_19_politics_white-h_1a6580f916d129f06252b647b289022a_index_1588607756.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200419093350-01-trump-presser-0418-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_19_politics_white-h_1a6580f916d129f06252b647b289022a_index_1588607756.html", "title": "Washington Post: US officials at WHO relayed real-time coronavirus information to Trump administration", "title_page": "Washington Post: US officials at WHO relayed real-time coronavirus information to Trump administration - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A group of US officials working at the World Health Organization headquarters transmitted real-time information about the novel coronavirus directly to the Trump administration, US and international officials told the Washington Post.\nThe reported line of communication undercuts President Donald Trump's assertion that the virus' spread in the US largely stems from a lack of communication from WHO.\nA spokesperson for the US Department of Health and Human Services, Caitlin Oakley, confirmed to CNN on Sunday that 17 staff members from HHS were working at WHO in the outbreak's early days. In January 2020, she said, HHS had 17 staffers at WHO -- including 16 from the US Centers for Disease Control and Prevention.\nSome of these \"embedded\" experts, but not all of them, were working on Covid-19, Oakley said.\nShe pushed back on the Washington Post reporting, however, calling it \"misleading.\" Oakley said that the Americans at WHO \"were not the decision makers\" and appeared to suggest that WHO leadership was withholding information from US technical experts -- or providing inaccurate information, sourced from China.\nRead More", "url": "https://www.cnn.com/2020/04/19/politics/white-house-world-health-organization-coronavirus/index.html"}