{"authors": ["Associate Reporter"], "date_download": "2020-05-04 21:06:30", "date_modify": "2020-05-04 21:06:30", "date_publish": "2020-04-30 19:35:58", "description": "Texas has administered fewer coronavirus tests per capita than almost every other state, providing an incomplete picture of the virus that could endanger...", "filename": "entry_texas-reopening-coronavirus-black-latino-health_n_5eaafcfec5b65920e5a21d74_1588626390.html", "image_url": "https://img.huffingtonpost.com/asset/5eab0421220000640d827f2d.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_texas-reopening-coronavirus-black-latino-health_n_5eaafcfec5b65920e5a21d74_1588626390.html", "title": "Despite Warnings About Potential Harm To Black People And Latinos, Texas Will Reopen", "title_page": "Despite Warnings About Potential Harm To Black People And Latinos, Texas Will Reopen | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Ronald Martinez via Getty Images A restaurant employee cleans a outdoor patio table at Benny's Cafe prior to the Texas' scheduled reopening of businesses during the coronavirus pandemic on April 27, 2020, in Colleyville, Texas.\nEarlier this week, Texas Gov. Greg Abbott issued multiple executive orders that will effectively open the state for in-person business on May 1, relaxing social distancing guidelines amid the coronavirus pandemic.\nSoon, employees will trickle back into businesses as relaxed travel restrictions bring more people into the state. But experts fear that the state hasn’t done its due diligence in testing for COVID-19, the disease caused by the coronavirus, and doesn’t have a strong enough plan to mitigate risk for returning workers, who are disproportionately Black and Latino.\nAlthough President Donald Trump’s administration released guidelines for businesses to reopen in mid-April, a number of experts ― including Dr. Anthony Fauci, the top infectious disease expert ― have warned states would need robust programs in place to test and track the disease in order to avoid another outbreak after reopening. Texas currently ranks among states with the fewest coronavirus tests administered per capita, according to the COVID Tracking Project, an organization launched by The Atlantic to track coronavirus data. Although much of Texas remains untested, there have been more than 27,000 reported cases.\nOn Monday, Abbott announced three executive orders pertaining to reopening the state. One will allow some businesses to open and call employees back to work on May 1, another will loosen restrictions on travel from New Orleans to Texas, and another order reserves hospital space for patients who contract the virus. In a press release, the governor said the orders are “part of the safe, strategic plan to Open Texas in response to the COVID-19 disaster.”\nBut the governor’s language doesn’t comport with the evidence in a state with an inadequate testing program, leading several legislators and health officials to sound the alarm in recent weeks.\nA “safe, strategic plan” cannot truly be safe, they argue, if it lacks critical information needed to save lives. And if, during a global pandemic, a plan isn’t safe, then it cannot truly be considered “strategic.” And if a plan isn’t strategic, then it isn’t actually a plan at all.\nXinhua News Agency via Getty Images Staff work at a drive-through COVID-19 testing site in Dallas, Texas, March 21, 2020.\n“Without robust testing, we don’t really know the magnitude of the problem,” Rep. Veronica Escobar (D-Texas) said in a conference call with press on Monday. “Testing is like having a flashlight in the darkness. It helps you find your way. It helps you find your path.”\nOne consequence of inadequate testing in Texas has been incomplete data concerning the disparate impact coronavirus has had on Black and Latino communities compared to predominantly white ones. In early April, the Texas Tribune reported, “limited testing of Texans in general — and of residents of color in particular — is also impeding the efforts of public health workers and epidemiologists to get a firm grasp on the virus’ impact across different demographics and communities.”\n“We’ve not had enough tests to administer, and we don’t have enough locations [to administer them]. I don’t think my neighborhood, my city and my region are ready for an opening.\nDuring the call with press on Monday, Rep. Sylvia Garcia (D-Texas), whose district includes much of Houston, said Black people account for 55 to 60% of deaths in the city, while Latinos account for about 20% of deaths.\n“We’ve not had enough tests to administer, and we don’t have enough locations [to administer them],” she said. “I don’t think my neighborhood, my city and my region are ready for an opening.”\nWith more than 4.5 million people, Harris County, where Houston is located, is the most populous county in Texas. The Texas Department of Health and Human Services reported that around 6,000 cases have been discovered in the county, but Texas officials have said cases would likely be undercounted in counties with insufficient testing programs.\nStill, on Gov. Abbott’s orders, Texas will effectively open on Friday in spite of any technical or moral headwinds. Starting at 12:01 Friday morning, Abbott is giving business including retail stores, restaurants, bowling alleys, shopping malls, movie theaters and museums permission to open and welcome up to 25% of their maximum occupancy. It’s unclear whether, or how, the state will enforce the cap on patrons.\nPool via Getty Images Texas Governor Greg Abbott arrives for his COVID-19 press conference at the Texas State Capitol in Austin.\nThroughout the pandemic, Black and Hispanic workers have been less likely than workers of any other race or ethnicity to be able to work from home, according to the Economic Policy Institute, in part because the former are overrepresented in jobs the government has deemed essential.\nAs employers in Texas gradually call their employees back to work, it is likely a large number of the employees asked to work in proximity to one another during this deadly pandemic will be from minority groups. Some health institutions around the country are already prepared to hold states accountable for maintaining detailed breakdowns of any new contractions of the coronavirus.\nAt Johns Hopkins University, for example, researchers recently unveiled a “Racial Data Transparency” tool designed to inform users which states are breaking down the numbers of tests administered as well as confirmed cases and deaths by race.\nDr. Keshia Pollack Porter, an epidemiologist and Associate Dean of Faculty at Johns Hopkins, said the interactive tool is meant to hold states accountable for racial data, but also to urge states like Texas to improve the quality of their data and testing capabilities before they consider reopening businesses.\n“It’s not just about collecting the data; it’s about the quality of the data,” Dr. Porter said. “And we know that in some of these states, how these data are being collected are not consistent.”\nDr. Porter said any efforts to reopen must take into account the idea of “health equity,” or the belief every person ― regardless of race or wealth ― is entitled to humane health treatment.\n“Lots of potential workers may not own cars, maybe they’re taking public transit to get to work. In many instances, these people are putting themselves at risk because they can’t socially distance appropriately,” she said, calling for empathy. Dr. Porter said those are those people ― those at the greatest risk ― who need to be centered in any plans.\n“I think the framing on the issue is critical here,” she said. “The narrative is critical.”", "url": "https://www.huffpost.com/entry/texas-reopening-coronavirus-black-latino-health_n_5eaafcfec5b65920e5a21d74"}