{"authors": ["Analysis Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:27:10", "date_modify": "2020-05-04 16:27:10", "date_publish": "2020-04-07 16:52:30", "description": "The Federal Reserve has quickly responded to the Covid-19 pandemic in the United States. That's why presidential candidates should acknowledge the Fed's efforts and pledge to keep current chair Jerome Powell on the job.", "filename": "2020_04_07_investing_jerome-powell-federal-reserve-reappoint_index_1588609630.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316101101-04-jerome-powell-0303-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_investing_jerome-powell-federal-reserve-reappoint_index_1588609630.html", "title": "Trump and Biden should agree on this: Fed Chair Powell deserves a second term", "title_page": "Trump and Biden should agree on this: Fed Chair Jerome Powell deserves a second term - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The Federal Reserve has responded quickly and forcefully to the Covid-19 pandemic in the United States. That's why presidential candidates should acknowledge the Fed's efforts and pledge to keep current chair Jerome Powell on the job so he can help manage the economic recovery from the coronavirus.\nThe Fed has slashed interest rates to zero , relaunched several lending programs last used during the Great Recession and has committed to buy an unlimited amount of bonds in order to boost the economy. And in a new twist, the Fed is even using emergency powers to buy corporate debt.\nPowell has essentially written a blank check. This is, to quote former European Central Bank chief Mario Draghi, his \" whatever it takes\" moment, referring to Draghi's famous 2012 speech in which he said he would do exactly that to end the Eurozone crisis.\nAnd this is also why whoever wins the United States presidential election in November must quickly voice support for Powell, whose term as Fed chair ends in February 2022, and nominate him for another four-year stint as head of the Fed.\n\"We should celebrate the Fed's fight back against one of the symptoms of this crisis. It's almost three weeks since the Fed announced...that it was further enhancing the provision of liquidity through swap lines with other central banks,\" said Kit Juckes, macro strategist with Societe Generale, in a report.\nThe Fed has announced a series of actions that it is taking to increase access to credit and liquidity, both at home and abroad, as well as some significant policy moves. \"And it's working,\" Juckes added.\nTrump has changed his tune and has praised Powell lately\nThe White House had no comment about whether President Trump, if re-elected, would reappoint Powell, whom he has frequently bashed on Twitter.\nThe Federal Reserve also had no comment about the possibility of a second term for Powell as Fed chair. Powell will speak at the Brookings Institution Thursday and may be asked about his future.\nJUST WATCHED Federal Reserve cuts interest rates to zero Replay More Videos ... MUST WATCH Federal Reserve cuts interest rates to zero 01:07\nThe campaigns of Democratic candidates Joe Biden and Bernie Sanders did not immediately respond for requests for comment.\nTrump has softened his tone lately.\n\"I am happy with him,\" Trump said of Powell in a press briefing on March 23. \"He's done the right thing. And I think, ultimately, we will be rewarded.\"\nTrump added that Powell has \"stepped up\" and that he even has called Powell to tell him that he's done a good job.\nIf Trump fails to win a second term as president, the Democrat who replace him could choose to stick with Powell for continuity's sake. That's exactly what Biden's former boss, President Barack Obama, did in 2009 when he repointed Ben Bernanke as Fed chair as the Great Recession was beginning.\nGiven that Repubicans currently control the Senate, it also might be politically simpler to simply stay with Powell. The last thing the nation needs is a partisan battle over who leads the Fed at a time when the economy is in freefall.\nBiden stopped short of explicitly endorsing Powell in a December interview with CNBC . But the former vice president also has been critical of how Trump has questioned Powell's decisions.\n\"The president should not be trying to pressure the Fed. That's supposed to be an independent entity out here,\" Biden told CNBC.\nSenator Sanders has expressed his concern about Fed policies under Powell though, even going so far to agree with Trump that rate hikes in 2018 were a mistake.\n\"Raising rates should be done as a last resort, not to fight phantom inflation,\" Sanders told the Washington Post in November\nSanders added that \"the Fed must become a more democratic institution that represents the needs of ordinary Americans and small businesses, not Wall Street billionaires.\"\nBut given how sharply the stock market has snapped back in the past two weeks, some think that Powell deserves a lot of credit for stabilizing financial conditions.\n\"Buying corporate bonds is a groundbreaking measure that the Fed didn't even implement during the equally tumultuous times of the global financial crisis,\" said David Norris, head of US credit and portfolio manager with TwentyFour Asset Management, in a blog post late last month.\n\"The Fed cannot create demand but it has provided an unprecedented liquidity backstop, and this latest package...has sent an important signal to the corporate debt markets that the central bank's ammo, and its willingness to use it, remains plentiful,\" Norris added.\nIn other words, Powell needs to remain in charge to see through what he started.", "url": "https://www.cnn.com/2020/04/07/investing/jerome-powell-federal-reserve-reappoint/index.html"}