{"authors": ["Cnn Staff"], "date_download": "2020-05-04 16:27:46", "date_modify": "2020-05-04 16:27:46", "date_publish": "2020-04-07 16:30:14", "description": "As coronavirus cases continue to overwhelm hospitals, resources such as ventilators are in short supply. CNN's Chief Medical Correspondent Dr. Sanjay Gupta speaks to NYU's director of medical ethics about some of the tough questions facing health care providers.", "filename": "2020_04_07_health_sanjay-gu_4d8db6e42919046d64c521e35dfe32fd_index_1588609666.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_sanjay-gu_4d8db6e42919046d64c521e35dfe32fd_index_1588609666.html", "title": "Doctors' difficult decisions: Dr. Gupta's podcast 4/7", "title_page": "Doctors' difficult decisions: Dr. Gupta's podcast 4/7 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As coronavirus cases continue to overwhelm hospitals, resources such as ventilators are in short supply. CNN's Chief Medical Correspondent Dr. Sanjay Gupta speaks to NYU's director of medical ethics about some of the tough questions facing health care professionals on the front line.\nDr. Darria Long: I'm definitely concerned once we see that peak, we won't have enough of the ventilators, masks, medications, doctors, any number of things, and we have to decide where to allocate those resources. Which is not a decision that I or any doctor wants to be making.\nGupta: That's Dr. Darria Long, an ER physician in Tennessee. Like many other doctors around the world, she's facing some difficult decisions about how to best care for her patients.\nUnfortunately, resources are finite, so how do doctors decide who gets potentially lifesaving treatment ... And who doesn't?\nIt's a terrible situation to be in. One we've seen some doctors in Italy already face. And a scene we may see in the United States as health care workers now warn they are running low on supplies.\nI'm Dr. Sanjay Gupta, CNN's chief medical correspondent. And this is \"Coronavirus: Fact vs. Fiction.\"\nVice President Mike Pence: They call it modeling, Wolf, where they look at what's happened around the world. We think Italy may be the most comparable area to the United States at this point.\nGupta: Last Wednesday, Vice President Mike Pence told my colleague Wolf Blitzer that the United States looks set to follow the same trajectory as Italy.\nThat is grim news.\nSome hospitals in Italy were so overwhelmed with patients, they reported having to choose which patients to prioritize.\nYou may be wondering how they make those tough decisions.\nMy friend Arthur Caplan is a CNN medical analyst and director of the medical ethics division at NYU's Langone Medical Center. He's the guy everyone turns to when there are thorny questions to answer.\nI asked him for his thoughts on the situation in Italy.\nCaplan: I hear in Italy, they've been cutting out people based on age, and I don't think that's the right thing to do. Age is an indicator, as you know, of likelihood to do well if you get a treatment, but it's not an absolute indicator. You can have a very sick 25-year-old with underlying diseases and a pretty healthy 55-year-old with not much else wrong except, say, respiratory failure from the virus. So co-morbidity -- meaning underlying disease, trying to make a prediction of who will recover -- that's the first cut, I think, in trying to decide how to allocate beds and ventilators and personnel. Then you probably move on to age.\nGupta: You know, I think as people have been watching the news lately, for some people to hear that we have to be thinking about the value, actually placing a value on human life, is horrifying to them. I get a lot of e-mails and comments on social media about it. But in a way, government and economists, we already do this, right?\nCaplan: Every day. I know people find it terrifying. Some find it disgusting or repugnant. But if you're building a road and you decide how you're going to put out your signage and what kind of barriers are out there, I've seen the engineers sit down and say, \"Well, we're going to accept a $9 million value on a human life and we're going to accept X number of deaths due to truck and car accidents.\" Even if you will, we say in our health care system, \"Here's the insurance, and this is what it costs for you get access to a heart transplant.\nThis is what it cost for you to get access to a lung transplant.\" And you might be thinking, well, that's not really putting a value on human life. But de facto, when you look at the business side of health care, you are pricing things. And those who can't pay, well, they fall out of the system. They're rationed away.\nGupta: And if you take that a step further, we're hearing about doctors who are having to make difficult decisions about who's going to be able to get treatment and who doesn't. Who gets a ventilator, who does not. That's not the kind of decision, thankfully, Art, that I've ever had to make. But I imagine as a bioethicist, you think about that all the time. How do you navigate through it?\nCaplan: I was around when we decided to set up a system to ration access to organs for transplantation. Before about 1985, we didn't really have a system. Some organs were going to waste because people weren't sharing them. There were people coming from overseas who were very rich, who were buying access to organs ahead of Americans. And finally, politicians, Congress, decided they wanted a system, and I was asked to help design it. And very briefly, what we did was we said, \"Look, in distributing organs, we ought to try and maximize the number of lives saved with these scarce resources.\" So we've been rationing those organs, decades.\nVery difficult decisions, miserable decisions. But Americans will accept rationing if they think the system is fair. That's what I've learned. Meaning if everybody gets an equal opportunity to be considered, people understand that not everyone can live. They don't want to see bias. They don't want to see discrimination. They don't want us to give all the organs to rich people or celebrities. They don't want us to give all the organs to people who are white or people who are heterosexual. Everybody wants to get a chance. If they feel that's there, that's what I call fairness. Then you can come up with a rule of justice, like maximize your chance to save a life.\nGupta: You talk about organs specifically, but that could be as it is, a discussion point replaced with ventilators. It could be replaced with even testing, it sounds like, in terms of navigating through these tough decisions.\nCaplan: Correct.\nGupta: A lot of people were struck by the idea that some NBA players, senators, many of whom didn't even have symptoms, were able to get a test, whereas a lot of people who have symptoms are still waiting. People were very upset by that. Is that for the same reasons you're saying, just a obvious lack of fairness?\nCaplan: Absolutely. So one issue is, well, who do you want to give testing priority to? A lot of people might say health care workers. You don't want an infected person working on you. You don't want them infecting each other. And there are other groups you can think of, too. You might give priority, for example, to people who are trying to do research on cures. You might pay attention to food handlers and so on. When you see the rich or celebrities, basketball stars, politicians getting tested, sometimes even asymptomatically, you start to think this is inequitable. This will not be accepted by the American people, nor should it.\nGupta: You know, it's interesting, I've traveled to so many places around the world, and it always strikes me that, many Americans are not really used to dealing with scarce resources when it comes to things like that. I mean, there are obviously people who don't have adequate access to health care and all that. But from a resource standpoint, for many people, they are sort of hearing about this and grappling with this for the first time.\nCaplan: I think that's true. I think the majority of Americans are used to abundance. And in a weird way, some of our major health problems have been due to abundance. Too much food, too much opportunity to sit at the desk and see the world through the Internet. Not enough exercise. You know, the lifestyle diseases, if you will, of having too much, of having resources that are everywhere. So switching around drastically and starting to tell someone, \"It may not be there for you. It may be that we have to ration. It may be that you have to wait and wait in line.\" That does not go over well. And I think that's going to reverberate with political consequences as well as health consequences.\nGupta: I don't want to minimize this at all but I always imagine that a from a science fiction perspective, that a common threat to the world would galvanize the world in some way, you know, break down barriers and end sort of infighting. Is there anything that you think good will come out of all this?\nCaplan: I do. Surprisingly, I do, and I'm not trying to deny the fact that there are people now worrying about getting on a ventilator or health care workers thinking, \"Should I go to work? It's dangerous there, and I have kids at home, or I'm pregnant.\" I get that. But changes longer term: we're all going to see more telemedicine. The fact that we're using it now as a way to do primary care. It's just ... It was happening, but slowly. Now I think it's going to explode and become the way many of us get primary care, maybe even other kinds of care.\nYou can see other things happening. Better pre-deployment of resources in the health care system undoubtedly will happen. I don't think we'll ever get stuck this way. I think we're going to get the idea that having a little bit in the bank, having a little bit surplus, whether it's ingredients for drugs, manufacturing capability to make vaccines, a bigger national reserve not just of oil, but of medical supplies, ventilators, equipment, hospital ships. I would be very surprised if we didn't go in that direction.\nGupta: As you heard Art explain, the situation facing doctors and health care professionals around the world right now is heart-wrenching.\nHere in the United States, medical professionals are putting plans in place, knowing a surge on resources will strike. And this isn't just in cities like New York but in nearly every state across the country.\nThe only way we can help them is by staying home and adhering to social distancing guidelines. That will help flatten the curve and reduce the burden they will face.\nIt really is essential.\nAll of us have a part to play in getting this situation under control. We need to do it for ourselves, and do it for our health care workers.\nIf you have questions, you can record them as a voice memo and email them to asksanjay@cnn.com -- we might even include them in our next podcast.\nWe'll be back tomorrow. Thanks for listening.\nYou can also head to cnn.com/coronavirus and sign up for our daily newsletter, which features the latest updates on this fast-moving story from CNN journalists around the globe.", "url": "https://www.cnn.com/2020/04/07/health/sanjay-gupta-podcast-coronavirus-april-7-wellness/index.html"}