{"authors": ["Gregory Krieg", "Eric Bradner", "Melissa Alonso"], "date_download": "2020-05-04 16:04:27", "date_modify": "2020-05-04 16:04:27", "date_publish": "2020-04-01 18:51:31", "description": "Sen. Bernie Sanders has called on Wisconsin to postpone its primary next Tuesday amid concerns that voters and poll workers could be exposed to coronavirus.", "filename": "2020_04_01_politics_bernie-sanders-wisconsin-primary_index_1588608267.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200315230029-bernie-sanders-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_bernie-sanders-wisconsin-primary_index_1588608267.html", "title": "Bernie Sanders calls on Wisconsin to delay primary over coronavirus concerns", "title_page": "Bernie Sanders calls on Wisconsin to delay primary over coronavirus concerns - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Sen. Bernie Sanders has called on Wisconsin to postpone its primary next Tuesday amid concerns that voters and poll workers could be exposed to coronavirus.\n\"People should not be forced to put their lives on the line to vote, which is why 15 states are now following the advice of public health experts and delaying their elections,\" Sanders said in a statement on Wednesday. \"We urge Wisconsin to join them.\"\nHe also called on the state to extend early voting, once the election has been pushed back, and \"work to move entirely to vote-by-mail.\" In the meantime, Sanders encouraged his supporters to cast their ballots through the mail.\nSanders trails former Vice President Joe Biden in the race for the Democratic presidential nomination, which has been thrown into limbo by the coronavirus crisis. Neither candidate has been able to hold live rallies or \"get out the vote\" drives, but Biden has not called on Wisconsin to delay its election. In a statement Wednesday touting a new endorsement, the Biden campaign called on \"all voters to follow social distancing guidelines to slow the spread of COVID-19\" and linked to state-issued guidelines.\nWisconsin is one of the few remaining states not to push back its primary in response to worries that in-person voting locations could become hot spots for the transmission of the virus. Democratic Gov. Tony Evers issued a stay-at-home order last week and, with poll workers increasingly dropping out, revealed in a court filing first reported by the Milwaukee Journal Sentinel that he plans to use the National Guard to help staff Election Day poll sites.\nThe Guard will assist as poll workers, \"but it is anticipated that the assistance of the National Guard will not satisfy all of the current staffing needs,\" court documents say.\nThe brief, filed in a federal lawsuit, detailed other measures taken ahead of the election, including a push toward absentee ballots, which would \"mitigate many of the concerns about direct contact between groups of people at polling places,\" the brief said.\nAs of Wednesday morning, 1,053,556 absentee applications had been received by Wisconsin municipal clerks, according to a release from the Wisconsin Elections Commission. \"In comparison, there were 819,316 absentee ballots cast in the November 2016 Presidential Election,\" the release said.\nWisconsin has approximately 30,000 poll workers and a \"significant number of them are in their 60s and 70s, and many may have other health conditions,\" according to the elections commission.\nOn March 23, two weeks before the election, the commission said it was in need of volunteers \"to replace older poll workers who are unable to serve due to health concerns and the coronavirus\" pandemic.\n\"We all stand ready to adjust as directed to ensure the safety of clerks, poll workers and voters,\" said Meagan Wolfe, Wisconsin's chief elections official.\nOn Wednesday evening, Ben Wikler, the chairman of the Wisconsin Democratic Party, endorsed postponing the primary.\n\"The Democratic Party of Wisconsin endorses the call by civil rights groups & mayors across Wisconsin to postpone our April 7 election & remove barriers to safe voting by mail. We're in court NOW. If judge doesn't act, legislature must,\" Wikler said on Twitter.\nOther states with April primaries have postponed them or shifted those contests to vote-by-mail only. But Evers so far has stopped short of calling for similar measures. Republicans who control the state Legislature and have enacted strict voter-identification laws in recent years, meanwhile, are refusing Evers' request -- made last week, 11 days before the election -- to quickly enact a law that would send absentee ballots to every voter in the state.\nWisconsin law gives the state's Department of Health Services the power to \"authorize and implement all emergency measures necessary to control communicable diseases\" and the authority to \"close schools and forbid public gatherings in schools, churches, and other places to control outbreaks and epidemics.\"\nBut any move to push back the election would likely be met with court challenges, and Evers has not yet shown any inclination to follow fellow Gov. Mike DeWine, an Ohio Republican, in bulling forward despite legal efforts to maintain the current date.", "url": "https://www.cnn.com/2020/04/01/politics/bernie-sanders-wisconsin-primary/index.html"}