{"authors": ["Randall Chase"], "date_download": "2020-05-04 21:07:18", "date_modify": "2020-05-04 21:07:18", "date_publish": "2020-04-09 20:02:53", "description": "DOVER, Del. (AP) — Delawareans are continuing to file unemployment claims in huge numbers amid the coronavirus outbreak that has forced businesses to close and lay off workers. The Delaware...", "filename": "_289fa5c7ed9cf4ae3ae912c83fa0c5a0_1588626438.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_289fa5c7ed9cf4ae3ae912c83fa0c5a0_1588626438.html", "title": "Unemployment filings continue to surge in Delaware", "title_page": "Unemployment filings continue to surge in Delaware", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DOVER, Del. (AP) — Delawareans are continuing to file unemployment claims in huge numbers amid the coronavirus outbreak that has forced businesses to close and lay off workers.\nThe Delaware Department of Labor reported Thursday that more than 18,800 unemployment filings were made last week. That’s down slightly from almost 19,000 unemployment claims filed in the previous week.\nIn the past three weeks, however, more than 48,000 Delawareans have filed for unemployment benefits, including more than 30,000 in March.\nThe previous monthly record for unemployment claim filings in Delaware in the past three decades was a little more than 9,600 in January 2020.\nThe huge spike in unemployment claims comes after hundreds of Delaware businesses including restaurants, bars, theaters and fitness centers, were forced to close or severely restrict operations under an emergency declaration by Democratic Gov. John Carney.\n“All of Delaware’s restrictions are intended to prevent a surge in cases that would overwhelm our hospital system,” Carney spokesman Jonathan Starkey said in an email Thursday.\n“The governor understands the tremendous impact this crisis has had on Delaware workers, families, and small businesses,” Starkey added. “This is a very difficult time.”\nHe also pointed out that Delaware, like other states and the federal government, has expanded access to unemployment benefits and provided additional support for small businesses.\nMeanwhile, Carney noted at a news conference Thursday that a statistical model that has been widely used around the country for projecting the spread of the coronavirus and its impact on the health care system has proven wrong in its estimates for Delaware.\nCarney noted that while the numbers of deaths and coronavirus cases in Delaware continue to increase, the model from the Institute for Health Metrics and Evaluation at the University of Washington predicted that the number of hospital beds needed for coronavirus patients in Delaware was expected to peak Wednesday at 87.\n“That is just not true,” said Carney. As of Thursday, 177 coronavirus patients were hospitalized. That number is expected to grow to more than 550 by April 14.\nState officials said the percentage of cases requiring hospitalization has averaged about 15 percent but is projected to grow to 20 percent by next week.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death. The vast majority of people recover.", "url": "https://apnews.com/289fa5c7ed9cf4ae3ae912c83fa0c5a0"}