{"authors": ["Amanda Jackson"], "date_download": "2020-05-04 15:59:52", "date_modify": "2020-05-04 15:59:52", "date_publish": "2020-04-01 02:43:33", "description": "Across the nation, people are under strict orders to follow social distancing guidelines in order to lower the risk of coronavirus spreading.", "filename": "2020_03_31_us_violating-coronavirus-orders-trnd_index_1588607992.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330152111-river-church-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_us_violating-coronavirus-orders-trnd_index_1588607992.html", "title": "Police are arresting and fining people for violating social distancing orders", "title_page": "Police are arresting and fining people for violating coronavirus distancing orders - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Across the nation, people are under strict orders to follow social distancing guidelines in order to lower the risk of coronavirus spreading.\nTo comply with new stay-at-home orders, many people have postponed their planned celebrations, everything from birthdays to weddings . Others have canceled big trips. Theaters have closed their doors, concerts and festivals have been delayed , and restaurants have moved to delivery or takeout only\nBut, some people have ignored the Trump administration and Centers for Disease Control and Prevention's recommendation to avoid mass gatherings and maintain distance from others. As a result, some local officials are cracking down.\nChurch services\nIn Tampa, Florida on Sunday, a large group of people gathered at River at Tampa Bay Church for Pastor Rodney Howard-Browne's services.\nThe pastor, who was arrested on Monday and charged with unlawful assembly and a violation of health emergency rules, hosted the services despite public orders urging residents to stay home.\n\"His reckless disregard for human life put hundreds of people in his congregation at risk,\" Hillsborough County Sheriff Chad Chronister said at a news conference. \"As well as put thousands of residents who may interact with them in danger.\"\nHoward-Browne isn't the only pastor to defy orders to flatten the curve of the pandemic.\nSpell, who told CNN he believes the coronavirus pandemic is \"politically motivated,\" said his March 22 services at Life Tabernacle Church drew in about 1,000 people.\n\"Instead of showing the strength and resilience of our community during this difficult time, Mr. Spell has chosen to embarrass us for his own self-promotion,\" Central Police Chief Roger Corcoran said in a statement Tuesday.\nWeddings\nSeveral people in New Jersey continued with their wedding festivities even after the state restricted large gatherings, according to the New Jersey Attorney General.\nIn Lakewood, police broke up two separate weddings a day apart from each other. The wedding hosts, Shaul Kuperwasser and Eliyohu Zaks, were both charged with maintaining a nuisance for holding a wedding in violation of the emergency order prohibiting large gatherings.\nJust days after the state enacted a stay-at-home order, another wedding host, Meir Gruskin , was charged after holding the gathering at his home on March 24.\nIn New Jersey, there are at least 18,696 confirmed cases of Covid-19, and at least 267 coronavirus-related deaths, according to CNN's tally\nHouse parties\nPolice are also cracking down on house parties. In New Jersey, police broke up a party of more than 30 people after responding to a noise complaint in Penns Grove last weekend, the state's Attorney General said in a news release.\nPartygoers were seen making videos and posting them on social media, according to the New Jersey Attorney General. The party host, Jacquon Jones, was charged with disorderly conduct for holding a large party in violation of the emergency order prohibiting large gatherings.\nThe fines and punishment for violating orders differ by state.\nIn Maryland, Gov. Larry Hogan said that those who violate the stay-at-home order could face a misdemeanor and be jailed for up to one year or fined $5,000.\nIn New York City, residents who violate social distancing rules face fines ranging from $250 to $500, according to Mayor Bill de Blasio.", "url": "https://www.cnn.com/2020/03/31/us/violating-coronavirus-orders-trnd/index.html"}