{"authors": ["Author", "Former Head Of Communications To Tony Blair"], "date_download": "2020-05-04 20:31:32", "date_modify": "2020-05-04 20:31:32", "date_publish": "2020-04-30 14:41:59", "description": "In the midst of this global crisis, my hypochondriac daughter is calmer than ever, writes Alastair Campbell.", "filename": "entry_coronavirus-has-shown-millennials-are-more-resilient-than-we-think_n_5eaae379c5b633a85446837a_1588624292.html", "image_url": "https://img.huffingtonpost.com/asset/5ea70776220000030c827b8d.png?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-has-shown-millennials-are-more-resilient-than-we-think_n_5eaae379c5b633a85446837a_1588624292.html", "title": "Coronavirus Has Shown Millennials Are More Resilient Than We Think", "title_page": "Coronavirus Has Shown Millennials Are More Resilient Than We Think | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "I was never worried about being in lockdown with my partner, Fiona. I was, however, a little worried that our daughter Grace chose to join us.\nGrace has taken occupancy of the granny flat attached to our house, which neither of the grannies ever felt a need to use.\nTwenty-six this week, she is a very bright, funny, challenging, hard-working comedian and socially committed campaigner, who is never afraid to say what she thinks, and I love her to bits.\nHowever, she can also be majorly attention-seeking, infuriatingly loud and she and I can turn a polite disagreement into a Roy Keane-Patrick Vieira tunnel bust-up in seconds. Hence the worry.\nShe is also a hypochondriac. This is someone who recently burst into our bedroom as we slept at 3AM to tell us she was on the phone to 999, as she was having a heart attack. “No you’re not,” I said, taking the phone and apologising to the operative.\nSo I was bracing myself for a never ending chorus of “I’ve got the virus, this is definitely it, take me to the Royal Free...”\nBut there has been none of it. I have been impressed by the way she has coped with the Covid-19 crisis.\nA GP friend tells me that surgeries have been packed with healthy millennials for years, reporting non-ailments. Her theory is that without something like a world war, or an existential threat on the horizon, youngsters find lesser things to worry about as much as the previous generations worried about those rather bigger things.\nGrace has done it so often her GP once suggested there should be an NHS equivalent of the crime of wasting police time, and Grace should be the first arrest.\nBut looking at her now, in the midst of a real crisis for the country and the world, she seems to be worrying less than ever.\nShe has not had a single meltdown since the lockdown, which is definitely a record. She has been unfailingly helpful as I have struggled with the technological challenges of doing live interviews and ‘meetings’ on a laptop. A non-football fan, she has even been sympathetic about my yearning for football to come back.\nOur podcast, Football, Feminism and Everything In Between, was her idea a while back, and in the two series we recorded, we spoke to former prime ministers, football managers, rugby internationals, famous actors and TV stars.\nWe were about to start the interviews for Series 3 when lockdown scuppered our plans, and we decided to put it all on hold until life gets back to some kind of normality.\nBut at the weekend, Grace, who rivals me in her terror of boredom, said: “Let’s just do one anyway, without guests.”\nListening back to the recording, it struck me just how much it is possible to cover in a free-flowing conversation: football, comedy, relationships, how many of Grace’s friends have fallen out with their boyfriends, our shared concern about the dog having separation anxiety when lockdown ends.\nShe announces that Fiona and I are now “officially old” because we have a birdsong recognition app – she calls it “Shazam for birds”. She takes the mickey out of my idea for a Tree Olympics. She tells me she likes wearing a mask, not for health reasons but so she can talk to herself without people staring at her. We agree that having my bagpipes insulted on social media by John Cleese, who then called me “one of my favourite Scottish gits”, was “really f―-ing cool.”\nThe longest part of the discussion is on Misbehaviour, the new film starring Keira Knightley and Jessie Buckley, about women’s liberation activists taking on the Miss World Pageant in 1970. I made the mistake of telling Grace I had covered Miss World for the Daily Mirror long before she was born. She raced upstairs to find my cuttings, and I was expecting an eruption of feminist fury when she came across a two-page spread with this kind of thing: “MISS PARAGUAY: If there were a separate title for Miss Sexy, it would go to flirty ANTONELLA MONTUORI, 21. She’s the cream of the South American beauties. Her constant flashing smile, sexy laugh and bubbling personality give her an edge over the others. STATISTICS: 34-23-34.”\nI admitted I really fancied Miss Paraguay. I admitted I loved covering Miss World, and I admitted I was slightly ashamed not to have seen at the time that it was a dreadful part of the patriarchy, that I should have been campaigning against, not enjoying because I got to hang out with gorgeous young women for two weeks.\n“Don’t beat yourself up, Dad,” she said. “Times were very different then. That’s what the film is about.”\nThis is what we call a personality transplant. Remarkable.\nBut let’s see how far it goes. I noticed that there is an advert for the Halifax at the start and one for Lloyd’s Bank at the end of the podcast. Does this mean we are making money? News to me if so. Is that why she is being nice to me? I thought I was supposed to be The Great Manipulator...\nAlastair Campbell is a writer and strategist.", "url": "https://www.huffpost.com/entry/coronavirus-has-shown-millennials-are-more-resilient-than-we-think_n_5eaae379c5b633a85446837a"}