{"authors": ["Eddie Pells"], "date_download": "2020-05-04 20:05:06", "date_modify": "2020-05-04 20:05:06", "date_publish": "2020-04-08 14:14:07", "description": "The Burton snowboard company is donating 500,000 respirator masks to hospitals across the Northeast, harnessing the company's worldwide footprint to help put a dent in the country's lagging...", "filename": "_068c436bdd84484b0c1e5a97b7c0c1bb_1588622706.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f86dbd8c31734fac8fb57b482847e097/1449.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_068c436bdd84484b0c1e5a97b7c0c1bb_1588622706.html", "title": "Burton to donate 500,000 respirator masks across Northeast", "title_page": "Burton to donate 500,000 respirator masks across Northeast", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 14, 2018, file photo, Shaun White, of the United States, jumps during the men's halfpipe finals at the 2018 Winter Olympics in Pyeongchang, South Korea. The Burton snowboard company is donating 500,000 respirator masks to hospitals across the Northeast, harnessing the company's worldwide footprint to help put a dent in the country's lagging stockpile of personal protective equipment for the coronavirus pandemic. (AP Photo/Lee Jin-man, File)\nFILE - In this Feb. 14, 2018, file photo, Shaun White, of the United States, jumps during the men's halfpipe finals at the 2018 Winter Olympics in Pyeongchang, South Korea. The Burton snowboard company is donating 500,000 respirator masks to hospitals across the Northeast, harnessing the company's worldwide footprint to help put a dent in the country's lagging stockpile of personal protective equipment for the coronavirus pandemic. (AP Photo/Lee Jin-man, File)\nThe Burton snowboard company is donating 500,000 respirator masks to hospitals across the Northeast, harnessing the company’s worldwide footprint to help put a dent in the country’s lagging stockpile of personal protective equipment for the coronavirus pandemic.\nDonna Burton Carpenter said her company’s largest binding manufacturer, Fudakin in China, directed her to a nearby factory that was making FDA-approved KN95 respirator masks. The price of masks were increasing almost by the hour as competing bidders sought to increase their supplies.\nShe ended up paying about $1.25 per mask — more than double what they usually cost — then set about finding a way to ship them directly from China to Vermont, where Burton is headquartered.\nThe first 48,000 masks have been delivered and are earmarked for hospitals across Vermont and for Dartmouth-Hitchcock Medical Center in New Hampshire, where Burton Carpenter’s late husband, Jake, spent two months in 2015 while fighting a rare nerve disorder. The rest of the masks are scheduled to arrive within the next two weeks and will be distributed along the East Coast; at least half will go to particularly hard-hit areas of New York and Boston.\n“It’s absolutely insane that a snowboard company has to do this because we’re the ones who have the relationships in China,” Burton Carpenter said. “But it’s something we’re more than glad to be doing.”\nThe government’s Health and Human Services Department recently surveyed 323 hospitals around the country and they reported widespread shortages of personal protective equipment and uncertainty about their availability from federal and state sources.\nVermont Gov. Phil Scott called the Burton donation “a prime example of how Vermonters are rising to the occasion and uniting around a common purpose during these unprecedented times.”\nBurton Carpenter said she’s using her own funds for the masks. Like so many companies across so many industries, Burton is suffering. The company has been forced to lay off about 250 of its 1,000 or so employees worldwide, and everyone making more than $60,000 a year has taken a pay cut.\nOver the years, Burton has shouldered its share of criticism for moving production of some of its products overseas. The company has responded by saying that in many cases — for instance, the case of bindings and some outerwear — it has virtually no options in the United States.\n“The world is globalized, period,” Burton Carpenter said. “We can’t go back. That’s one thing I hope comes out of this, is embracing globalization. It may have spread the virus, but it’s also going to spread the help, and that’s what we need right now.”\nThe company has long been an advocate for fighting climate change, and Burton Carpenter said she hopes another lesson that comes out of the tragedies playing out is a new embrace of science — regardless of political affiliation.\n“The epidemiologists and scientists who are being trolled right now — that’s been happening for the last 10 years to the climate scientists,” she said. “I hope this sparks a renewed commitment to science.”\nShe made no predictions as to how her business will respond once the pandemic eases.\n“But I think there will be a new appreciation for getting outside, and I think what brands are doing right now, in this minute, will define who they are going forward,” she said.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/068c436bdd84484b0c1e5a97b7c0c1bb"}