{"authors": ["Michael R. Blood"], "date_download": "2020-05-04 20:23:38", "date_modify": "2020-05-04 20:23:38", "date_publish": "2020-04-20 04:06:24", "description": "LOS ANGELES (AP) — The unofficial holiday celebrating all things cannabis arrives Monday as the nation’s emerging legal marijuana market braces for an economic blow from the coronavirus crisis,...", "filename": "_63e131bb84eaef281c3ec2e0a44e79ce_1588623818.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c713cca2c952456c9848b62b940037a6/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_63e131bb84eaef281c3ec2e0a44e79ce_1588623818.html", "title": "4/20 uncertainty: Marijuana industry tested in virus crisis", "title_page": "4/20 uncertainty: Marijuana industry tested in virus crisis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Thursday, April 16, 2020, photo, wearing a protective mask and gloves, budtenders prepare orders for customers to pick-up at The Higher Path cannabis dispensary in the Sherman Oaks section of Los Angeles. Monday is April 20, or 4/20. That’s the code for marijuana’s high holiday, which is usually marked with outdoor festivals and communal smoking sessions. But this year, stay-at-home orders have moved the party online as the marijuana market braces for an economic blow from the coronavirus crisis. (AP Photo/Richard Vogel)\nIn this Thursday, April 16, 2020, photo, wearing a protective mask and gloves, budtenders prepare orders for customers to pick-up at The Higher Path cannabis dispensary in the Sherman Oaks section of Los Angeles. Monday is April 20, or 4/20. That’s the code for marijuana’s high holiday, which is usually marked with outdoor festivals and communal smoking sessions. But this year, stay-at-home orders have moved the party online as the marijuana market braces for an economic blow from the coronavirus crisis. (AP Photo/Richard Vogel)\nLOS ANGELES (AP) — The unofficial holiday celebrating all things cannabis arrives Monday as the nation’s emerging legal marijuana market braces for an economic blow from the coronavirus crisis, with many consumers reducing spending or going underground for deals.\nIt was supposed to be a long weekend of festivals and music culminating on April 20, or 4/20, the code for marijuana’s high holiday. Instead, it has been reduced to an online replica because of stay-at-home orders to curb the pandemic.\nVirtual parties and video chats are replacing vast outdoor smoking sessions to mark the rise of legalization and celebrate cannabis culture. The origins of the annual celebration are believed tied to a group of Northern California high school friends, who used the code as slang for smoking pot in the early 1970s.\n“Stay home,” the National Organization for the Reform of Marijuana Laws, or NORML, said bluntly. San Francisco Mayor London Breed threatened arrests: “We will not tolerate anyone coming to San Francisco for 4/20 this year.”\nFor businesses, 4/20 is usually their once-a-year Black Friday, when sales soar. Instead, they are reporting up-and-down buying and pondering an uncertain future.\nThe pandemic means the world economy could face its worst year since the Great Depression in the 1930s. In a sign of what’s to come, U.S. retail sales overall dropped nearly 9% in March — a record. Millions are out of work.\nAs for the holiday, “there’s a somber feeling to this one,” said Jordan Lams, CEO of Pure CA, which specializes in marijuana extracts and does business as Moxie brand products. Before the outbreak, “it was going to be the biggest 4/20 in history,” Lams said.\nSteve White, CEO of Arizona-based Harvest Health & Recreation, said he’s watching to see if consumers treat marijuana more like beer or toilet paper when money runs short.\nWhen the economy tumbles, beer sales traditionally spike. With toilet paper, panic-buying might empty shelves but people do not use more of it. They just buy less later.\nIt will be a telling year, because no one in the relatively new industry knows if sales will plunge, stay flat or even rise.\n“Do people buy less cannabis, or does it become more ingrained as part of their daily life?” White said.\nThe uncertainty in the market poses the latest challenge for an industry that’s expanded in some form to all but a handful of states.\nThe risks are spotlighted in California, where businesses contend with hefty taxes, an illicit market that still dwarfs the legal one and a tourism-reliant economy that’s crippled by virus restrictions.\nBecause cannabis remains illegal at the federal level, most banks don’t want to do business with pot companies and they aren’t included in the coronavirus rescue package that will help other businesses.\nFull Coverage: Marijuana\nBefore the virus, “we were already teetering on ... an edge of a cannabis collapse,” said Los Angeles dispensary owner Jerred Kiloh, who heads the United Cannabis Business Association. “It’s going to be very difficult for cannabis businesses to make it through this pandemic.”\nThat’s despite the onset of stay-at-home orders in March that sent marijuana sales rocketing; some businesses reported single-day records as customers stocked up. New York, San Francisco and Los Angeles were among the cities that labeled dispensaries essential businesses that could remain open.\nBut since then, business generally has flattened or tapered off, even with deliveries and curbside pickups growing to reduce health risks. Marijuana data trackers BDS Analytics documented sales surges through much of March, but then consumers pulled back in late March and early April, with sales mostly below average.\nIn recent days, some sellers reported sales jumps as government assistance checks began reaching consumers.\nIn Oregon, cannabis retailers saw a huge spike last month — a 30% increase in average sales per retailer compared with March 2019. Sales increases mid-month were even larger.\nHowever, the peak has leveled off and customers are coming in less frequently but buying more, said David Alport, who owns two Bridge City Collective stores in Portland. He’s hired three more employees to handle home deliveries.\nIn Illinois, marijuana businesses can keep operating under Gov. J.B. Pritzker’s stay-at-home order. Companies made sweeping changes that included appointment-only sales and online ordering.\nThe Mission dispensary on Chicago’s South Side saw an initial spike in purchases before the lockdown took effect, but that’s leveled off.\n“We’ve never faced an economic downturn when cannabis was legal,” said Kris Krane, president of Mission dispensaries. “This is completely unprecedented.”\nSome customers could be especially vulnerable during an economic downturn. Among cannabis users in states where its legal, 32% have incomes below $35,000 and only 54% have full-time employment, according to BDS Analytics. Anyone on a tight budget might be more apt to avoid taxes that go with legal purchases and buy from illicit market dealers.\nSteve DeAngelo, co-founder of Harborside dispensaries in California, said it’s difficult to predict what’s next, with no template for how cannabis consumers will react in a deep economic downturn.\nStill, he notes that the industry has endured for years through times good and bad, even when consumers had only one option — illegal purchases. Consumers who see marijuana as part of their daily routine will keep coming back, he predicted.\nBut, for businesses, there will be a “sorting out,” DeAngelo said. Companies with strong brands and cash reserves are likely to fare better in a poor economy; those saddled with heavy debt who made too-rosy promises to investors will face challenges.\n“There is not going to be an extinction moment,” DeAngelo said. “It’s going to prove more resilient than many, many other industries.”\n___\nAssociated Press writers Gillian Flaccus in Portland, Oregon, and Kathleen Foody in Chicago contributed. Blood, Flaccus and Foody are members of AP’s marijuana beat team. Find complete AP marijuana coverage here: https://apnews.com/Marijuana . Follow Blood on Twitter at http://twitter.com/MichaelRBloodAP .", "url": "https://apnews.com/63e131bb84eaef281c3ec2e0a44e79ce"}