{"authors": ["Joan Biskupic", "Cnn Legal Analyst", "Supreme Court Biographer"], "date_download": "2020-05-04 17:02:46", "date_modify": "2020-05-04 17:02:46", "date_publish": "2020-04-10 12:06:58", "description": "When a US appeals court ruled this week that Texas could prevent physicians from performing abortions because of the Covid-19 pandemic, the judges leaned heavily on a 1905 Supreme Court decision against a Massachusetts man who had refused vaccination during a smallpox outbreak.", "filename": "2020_04_10_politics_pandemi_150473a6412d12350d6fbeb550a54e0c_index_1588611766.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140613173815-scotus-supreme-court-summer-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_pandemi_150473a6412d12350d6fbeb550a54e0c_index_1588611766.html", "title": "The 115-year-old Supreme Court opinion that could determine rights during a pandemic", "title_page": "The 115-year-old Supreme Court opinion that could determine rights during a pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) When a US appeals court ruled this week that Texas could prevent physicians from performing abortions because of the Covid-19 pandemic , the judges leaned heavily on a 1905 Supreme Court decision against a Massachusetts man who had refused vaccination during a smallpox outbreak.\nThat case could be invoked more in the months ahead. It is the high court's touchstone for state power during public health crises. But it is a decision with limits. The 1905 court warned against \"arbitrary\" or \"oppressive\" regulation and expressly connected mandatory vaccination to ending the spread of smallpox.\nToday, the question is how bluntly the case, known as Jacobson v. Massachusetts , might be wielded to justify curbing individual liberties without caveat.\nIn the first decision of its kind during the coronavirus crisis, the 5th US Circuit Court of Appeals relied wholly on the 1905 case to permit Texas to include abortion clinics in its ban on non-essential medical services and surgeries. The panel, ruling by a 2-1 vote, rejected arguments regarding the right to abortion ingrained by the Supreme Court's 1973 Roe v. Wade and subsequent rulings.\n\"Jacobson instructs that all constitutional rights may be reasonably restricted to combat a public health emergency,\" wrote Judge Stuart Kyle Duncan for the majority\nThe 5th Circuit has a record of decisions against abortion access, including in a Louisiana dispute over physician regulations, begun long before the current pandemic and now pending at the US Supreme Court.\nDissenting in the new case, Judge James Dennis argued that the majority had taken the Jacobson precedent too far. Unlike in the early 1900s, Dennis wrote , when vaccination would stop the smallpox outbreak, \"the thread connecting (the Texas measure) to combatting COVID-19 is more attenuated—premised not on the idea that abortion providers are spreading the virus, but that their continuing operation requires the use of resources that should be conserved and made available to healthcare workers fighting the outbreak.\"\nTexas Republican Gov. Greg Abbott's order was intended to save medical resources, including personal protective equipment (PPE). Other federal judges ruling in similar controversies over non-essential services and abortion access, including in Oklahoma, have rejected the broad interpretation of Jacobson adopted by the 5th Circuit majority. (Abortion providers who challenged the Texas order are continuing to press their case in lower court, and the matter may soon end up before the nine justices of the US Supreme Court.)\n\"The 5th Circuit used Jacobson in a very wooden way and without appreciating everything that has happened, doctrinally and constitutionally, in the 115 years since,\" said Northeastern University law professor Wendy Parmet, who specializes in public health law. \"They cherry-picked from Jacobson.\"\nProfessor Dorit Reiss, an expert on vaccination and public health issues at University of California Hastings Law School, said the 1905 case has until now been largely \"under the radar,\" relied on mostly for local outbreaks such as a New York city order for a measles vaccination last year. Declaring a limited public health emergency, Mayor Bill de Blasio's order focused on children in Orthodox Jewish communities in areas of Brooklyn that had experienced a spike in measles infections.\nSupreme Court rulings over the past century have established greater substantive protections for individual liberties, including reproductive rights, Reiss said.\n\"It's clear that Jacobson is still relevant,\" she said, \"but there's no good grounds for ignoring the other jurisprudence that we have had since.\"\nAnother era of law, disease\nThe Supreme Court decided the case of Jacobson v. Massachusetts during the early 20th century when the court was generally favoring economic rights over individual liberties. (The same year, it struck down a law limiting worker hours and declared a freedom of contract.)\nThe early 20th century also experienced widespread threats of smallpox and other infectious diseases, leading to vaccination mandates.\nHenning Jacobson, a minister, refused to be vaccinated by the Cambridge board of health, saying he had had bad reactions to previous vaccinations. He was fined $5 under Massachusetts law. Jacobson argued the penalty violated his personal liberty to care for his own health.\nIn its 7-2 ruling, the Supreme Court acknowledged individual liberty rights but emphasized the state's police powers to handle a health emergency. The justices highlighted concerns for the \"common good\" and compared vaccinations that can halt an outbreak with quarantines of ships arriving at American ports with cases of yellow fever aboard.\n\"Whatever may be thought of the expediency of this statute, it cannot be affirmed to be, beyond question, in palpable conflict with the Constitution,\" the opinion stated. \"Nor, in view of the methods employed to stamp out the disease of smallpox, can anyone confidently assert that the means prescribed by the State to that end has no real or substantial relation to the protection of the public health and the public safety.\"\nThat means, says Columbia University constitutional law professor Gillian Metzger, that government measures today must be grounded in public health needs and tailored to address the specific problems.\nMetzger and other legal experts say Jacobson has not played a major role in other Covid-19 disputes, but it could influence cases as the pandemic deepens and other controversies emerge.\nMetzger speculated that \"shelter in place\" rules would generally pass constitutional muster but blanket travel restrictions, for example keeping all New Yorkers from crossing state borders, would not. She said the 1905 opinion should be interpreted in combination with subsequent high court decisions on individual rights.\n\"Jacobson stands for the proposition that (government) can take significant measures for public health,\" Metzger said. \"But it doesn't give a free pass to regulation. There has to be a real or substantial relation\" between problem and solution.\nIn its arguments to the 5th Circuit in the abortion case, Texas argued that Supreme Court cases involving the right to abortion are superseded by state interests in public health.\n\"In the dire emergency we now face, a State's police powers and interest stand at their apex, and nothing in the Constitution protects an absolute right to an elective abortion on demand in the circumstances presented here,\" the Texas attorney general wrote, leaning on Jacobson.\nWhen it ruled, the 5th Circuit went farther in its use of the 1905 case, referring to it dozens of times. As the court rejected arguments from state abortion providers, it asserted that three of the Supreme Court's principal abortion cases \"cite Jacobson with approval and without suggesting that abortion rights are somehow exempt from its framework.\"\nBut in those three instances, in fact, the Jacobson citations are minor and offer no suggestion that Jacobson would dictate the breadth of reproductive rights.\nDissenting Judge Dennis did not reject the salience of Jacobson in these times, rather he pointed out its limits. Referring to a US judge's earlier ruling against Texas in the dispute, Dennis said, \"The district court's result was supported by nearly 50 years of Supreme Court precedent protecting a woman's right to choose.\"\nConcluded Dennis, \"In a time where panic and fear already consume our daily lives, the majority's opinion inflicts further panic and fear on women in Texas by depriving them, without justification, of their constitutional rights, exposing them to the risks of continuing an unwanted pregnancy, as well as the risks of travelling to other states in search of time-sensitive medical care.\"", "url": "https://www.cnn.com/2020/04/10/politics/pandemic-coronavirus-jacobson-supreme-court-abortion-rights/index.html"}