{"authors": ["Sandra Gonzalez"], "date_download": "2020-05-04 16:24:02", "date_modify": "2020-05-04 16:24:02", "date_publish": "2020-04-06 21:26:49", "description": "Phoebe Waller-Bridge and Amazon, home to \"Fleabag,\" are making the theater production available for streaming for a limited time as part of a fundraising effort for multiple charities providing Covid-19 relief.", "filename": "2020_04_06_entertainment_fleabag_index_1588609442.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190305142924-fleabag-phoebe-waller-bridge-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_entertainment_fleabag_index_1588609442.html", "title": "'Fleabag' stage production to stream on Amazon for charity", "title_page": "'Fleabag' stage production to stream on Amazon for charity - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) If you never had a chance to see \"Fleabag\" while it was gracing the stage, here's your chance.\nPhoebe Waller-Bridge and Amazon, home to the acclaimed TV series, are making the theater production available for streaming for a limited time as part of a fundraising effort for multiple charities providing Covid-19 relief.\n\"I hope this filmed performance of 'Fleabag' can help raise money while providing a little theatrical entertainment in these isolated times,\" Waller-Bridge said in a statement. \"Thank you to all our partners and to the creative team who have waived their royalties from this production to raise money for such vital causes in this unbelievably challenging situation. All money raised will support the people throughout our society who are fighting for us on the frontlines and those financially devastated by the crisis, including those in the theatre community.\"\n\"Fleabag,\" which began as a one-woman show, has two seasons currently streaming on Amazon. Waller-Bridge did select revival dates of her stage production following the success of the TV program, and the filmed version was screened in select UK theaters for a period of time through National Theater Live.\nThe stage show is available starting Monday via Soho Theater's On Demand streaming site in the UK and Ireland. On April 10, it will be available for two weeks on Amazon for residents of the UK and United States.\nRead More", "url": "https://www.cnn.com/2020/04/06/entertainment/fleabag/index.html"}