{"authors": ["Mike Fitzpatrick"], "date_download": "2020-05-04 21:06:47", "date_modify": "2020-05-04 21:06:47", "date_publish": "2020-04-13 07:46:46", "description": "NEW YORK (AP) — Anthony Causi, a highly skilled and exceedingly popular sports photographer for The New York Post who covered the city’s teams for 25 years, died Sunday from the new coronavirus....", "filename": "_3089d815dce1b586a86f433288df773a_1588626407.html", "image_url": "https://storage.googleapis.com/afs-prod/media/56b94533139443558ea653c742757150/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3089d815dce1b586a86f433288df773a_1588626407.html", "title": "Popular NYC sports photographer dead at 48 from COVID-19", "title_page": "Popular NYC sports photographer dead at 48 from COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Aug. 2, 2016, photo provided by Christopher Pasatieri, New York Post photographer Anthony J. Causi is shown before a New York Mets baseball game in New York. Causi, a highly skilled and exceedingly popular sports photographer for The New York Post who covered the city’s teams for 25 years, died Sunday, April 12, 2020, from the new coronavirus. He was 48. (Christopher Pasatieri via AP)\nIn this Aug. 2, 2016, photo provided by Christopher Pasatieri, New York Post photographer Anthony J. Causi is shown before a New York Mets baseball game in New York. Causi, a highly skilled and exceedingly popular sports photographer for The New York Post who covered the city’s teams for 25 years, died Sunday, April 12, 2020, from the new coronavirus. He was 48. (Christopher Pasatieri via AP)\nNEW YORK (AP) — Anthony Causi, a highly skilled and exceedingly popular sports photographer for The New York Post who covered the city’s teams for 25 years, died Sunday from the new coronavirus. He was 48.\nThe newspaper reported Causi’s death on its website Sunday night and included an image of Monday’s back page. It featured a photo of Causi holding a camera with a long lens and the words “Our Eyes, Our Heart” and then below: “And our city’s loss.”\nCausi was married with two young children. Many of New York’s professional teams and several players posted messages on Twitter expressing sadness, condolences and paying tribute to him.\n“Do you know how many athletes reached out when they heard he was sick?” said Stephen Lynch, editor-in-chief at the Post. “Players from every team, sending thoughts, hoping he was going to be all right.”\nMajor League Baseball called Causi a “sports photojournalist extraordinaire” and said he “brought out the best in the players and the people of our National Pastime.”\nCausi was a smiling and friendly fixture at venues from Yankee Stadium to Madison Square Garden and others all over the New York area. His action shots often popped impressively on The Post’s sports pages, and he was well-liked not only by media colleagues but also the famous players he chronicled.\n“What a great man. So sorry to hear,” tweeted Texas Rangers infielder Todd Frazier, who played for both the Yankees and Mets. “God found his angel photographer that’s for sure.”\nCurtis Granderson, former Yankees and Mets outfielder, wrote: “New York baseball won’t be the same without him in the photo pit.”\nPhiladelphia Phillies shortstop Didi Gregorius, who played for the Yankees from 2015-19: “Anthony was a great, funny and awesome guy to talk to and learn from about sports photography ... may he Rest In Peace.”\nAmong Causi’s most noted photos was a picture showing Hall of Famer Derek Jeter heading down the tunnel from the New York clubhouse to the field at the previous Yankee Stadium.\n“Anthony was an amazingly talented photographer, and he was an even better person. The sports world feels his loss,” Jeter posted on Facebook.\nLynch called Causi “a brilliant journalist.”\n“He was, quite simply, one of the best sports photographers in New York City, capturing all the major moments of the past 25 years. Soft-spoken, funny, but most of all kind — he was respected by those he photographed and admired by those with whom he worked,” Lynch said.\n“The Post that you read, and the newsroom that we work in, are less colorful today because of his absence. Our hearts go out to his family, and we share their grief.”\nCausi was born and raised in Brooklyn and he graduated from Pace University. He joined The Post in 1994 as a photo messenger before advancing to photo editor and then full-time journalist photographer, the newspaper said.\nHis uncle, Joe Causi, an on-air personality for WCBS-FM Radio, said his nephew often took photos at Little League events pro bono, the Post said.\nThe Post said Causi is survived by his wife, Romina, and their children, John, 5, and Mia, 2, as well as his parents, Lucille and John Causi, and sisters Maria Marangelli and Dianna Marotto.", "url": "https://apnews.com/3089d815dce1b586a86f433288df773a"}