{"authors": ["Edith M. Lederer"], "date_download": "2020-05-04 20:09:21", "date_modify": "2020-05-04 20:09:21", "date_publish": "2020-04-09 21:03:13", "description": "UNITED NATIONS (AP) — U.N. Secretary-General Antonio Guterres warned Thursday that the coronavirus pandemic is deepening already existing inequalities and “is having devastating social and...", "filename": "_a8ceacd304ac55a8af77fdc681ff8259_1588622961.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8ff46594f44c44e0a1b6e1e30ab6ff51/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a8ceacd304ac55a8af77fdc681ff8259_1588622961.html", "title": "UN chief warns COVID-19 is increasing inequality for women", "title_page": "UN chief warns COVID-19 is increasing inequality for women", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "U.N. Secretary-General Antonio Guterres addresses his statement, during the opening of the High-Level Segment of the 43rd session of the Human Rights Council, at the European headquarters of the United Nations in Geneva, Switzerland, Monday, Feb. 24, 2020. (Salvatore Di Nolfi/Keystone via AP)\nU.N. Secretary-General Antonio Guterres addresses his statement, during the opening of the High-Level Segment of the 43rd session of the Human Rights Council, at the European headquarters of the United Nations in Geneva, Switzerland, Monday, Feb. 24, 2020. (Salvatore Di Nolfi/Keystone via AP)\nUNITED NATIONS (AP) — U.N. Secretary-General Antonio Guterres warned Thursday that the coronavirus pandemic is deepening already existing inequalities and “is having devastating social and economic consequences for women and girls” that could reverse limited progress toward gender equality over the last 25 years.\nThe U.N. chief said in a video message and policy paper that “across every sphere, from health to the economy, security to social protection, the impacts of COVID-19 are exacerbated for women and girls simply by virtue of their sex.”\nWhile early data indicates that the mortality rates from COVID-19 may be higher for men, Gutterres said “nearly 60 per cent of women around the world work in the informal economy, earning less, saving less, and at greater risk of falling into poverty.”\nHe said millions of women’s jobs have been lost at the same time that their unpaid work has “increased exponentially” as a result of school closures and children being at home, and the increased needs of older people.\n“These currents are combining as never before to defeat women’s rights and deny women’s opportunities,” Guterres said.\nThe secretary-general said the year 2020 marks the 25th anniversary of the U.N. conference in Beijing that adopted a 150-page road map to achieve gender equality and was intended to be “ground-breaking” in promoting progress toward that goal.\n“Instead, with the spread of the COVID-19 pandemic even the limited gains made in the past decades are at risk of being rolled back,” he said.\nGuterres warned that “progress lost takes years to regain,” citing as an example teenage girls who are out of school and may never return.\nThe U.N. chief urged governments “to put women and girls at the center of their efforts to recover from COVID-19.”\nHe called for women to be put in leadership roles, with equal representation and decision-making power.\nGuterres also called for expanded social safety nets, unpaid care work to be recognized and valued, and measures to stimulate the economy — from cash transfers to credits and loans — to be targeted at women.\nThe secretary-general warned that as the COVID-19 pandemic deepens, “economic and social stress coupled with restricted movement and social isolation measures, gender-based violence is increasing exponentially.”\nHe said nearly one in five women worldwide experienced violence in the past year and many of those women are now trapped at home with their abusers, “struggling to access services that are suffering from cuts and restrictions.”", "url": "https://apnews.com/a8ceacd304ac55a8af77fdc681ff8259"}