{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 20:25:55", "date_modify": "2020-05-04 20:25:55", "date_publish": "2020-04-29 23:33:38", "description": "The pandemic has hit Native American communities particularly hard.", "filename": "entry_department-of-interior-indian-affairs-coronavirus-death_n_5ea9e6d4c5b6e7f685ac2041_1588623955.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9e93e220000700d827e28.jpeg?cache=thg3ihbn92&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_department-of-interior-indian-affairs-coronavirus-death_n_5ea9e6d4c5b6e7f685ac2041_1588623955.html", "title": "Indian Affairs Employee Is Interior Department’s First COVID-19 Death", "title_page": "Indian Affairs Employee Is Interior Department’s First COVID-19 Death | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A Bureau of Indian Affairs employee is the first Interior Department staffer to die from COVID-19, according to internal numbers obtained by HuffPost.\nThe death, reported Tuesday, comes as the number of cases at the Interior Department has continued to increase. The unnamed Bureau of Indian Affairs employee died in the night between April 23 and 24, according to Interior’s account.\nAs of Wednesday, 12 Bureau of Indian Affairs officials and one Bureau of Indian Education official have tested positive for COVID-19, according to the internal Interior numbers. BIA has the second highest number of positive cases across the Interior Department; the National Park Service has 29 confirmed cases. The Interior Department has reported 84 cases overall.\nBut the pandemic has hit Native American communities particularly hard, because they have high levels of preexisting health conditions, inadequate access to running water, and live in compact, shared spaces.\n“I just fear for their safety and their well-being — not just the employees, but their families,” said Sue Parton, president of the Federation of Indian Service Employees, the government union that represents BIA employees. “You know, traditionally most Native American families live in groups. So in one household you’ll have elders and then all the way down to infants.”\nIndian affairs officials are largely integrated within the communities where they work. Parton estimates that nearly 80% of employees are affiliated with a tribe themselves, and their offices are often located in the field, on or near the reservations they work with.\nAccording to Parton, the communication she’s received from the Bureau of Indian Affairs and the White House’s Office of Management and Budget has been the bare minimum. She has struggled to get an accurate accounting of the number of COVID-19 cases among staff.\n“I have not seen numbers,” Parton said. “We can’t get answers.”\nShe has been fielding calls from agency employees for weeks asking about school closures, what reservation services are open and whether their jobs are considered essential. Parton said the fear is palpable, and she feels helpless.\n“They would contact us at the union, you know, because they weren’t getting answers from supervisors, they weren’t getting any guidance,” she said. “Wherever they were located, they were hearing different things from the governor of that state. But nothing coming from the federal government, from their supervisors, all the way up the chain of command.”\nShe notes that many reservations are very rural and don’t have health care facilities. The Indian Health Service, which is the main provider of health care on reservations, has been chronically underfunded.\nParton noted that OMB sent out guidance about additional types of sick leave employees could use during the crisis. “But one of the requirements is that they get some kind of certification from a medical provider,” she said. “Well, there are no medical providers in a lot of the reservation areas, you know, or you would have to travel miles and miles to get it.”\nOne coronavirus case within the Bureau of Indian Affairs was on the Ute Mountain Ute Tribe reservation in Colorado. According to internal data, an Ute Mountain law enforcement assistant tested positive on April 9. Another correctional officer on the reservation was put on quarantine awaiting test results after “possible exposure.”\nParton’s union represents law enforcement officers, which she noted do not currently qualify for hazard pay, though the union has been fighting for it for all essential employees who are working during the pandemic.\nThe Bureau of Indian Affairs and Bureau of Indian Education did not respond to multiple requests for comment on coronavirus cases across the agencies. They referred all questions to the Interior Department. The Interior Department also did not respond to requests for comment.\nParton said she’s especially concerned about employees who work at the various Bureau of Indian Education boarding schools off reservations. She worries that essential employees there such as cooks, cleaners and maintenance workers are still at risk of contracting the virus.\n“The employees are very concerned about their well-being and their safety,” she said.\nThere have been 3,106 recorded cases of COVID-19 across 55 tribes in the U.S., according to Interior and Indian Health Service data. But it’s estimated that those numbers offer only a snapshot of the ongoing crisis on reservations, many of which are remote and lack testing capacity.\nThe Navajo Nation, which extends across Arizona, New Mexico and Utah, has had 60 deaths and 1,873 positive cases.\nThe Navajo Times reported that at least five employees across three Native boarding schools on the reservation have tested positive for the virus, and at least two employees have died. According to the Arizona Republic, at least six people inside one of the schools — Rocky Ridge Boarding School near Hard Rock, Arizona — have been ill with COVID-19 symptoms. One longtime employee of the school died, but it remains unclear if her death was due to the virus, and whether she was a federal employee.\nThe Bureau of Indian Education has not publicly confirmed those numbers.\n“Definitely, it’s getting worse,” said an official within the Navajo Nation who spoke on the condition of anonymity, who added that tribes have also not received conclusive numbers pertaining to the boarding schools.\nParton said she is concerned about the safety of all those federal employees.\n“A federal job is one of the most lucrative jobs in the rural Native American communities,” she said. “Just like most Americans these days, they want to work, they have to work. They got to pay the bills, but at what risk?”\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/department-of-interior-indian-affairs-coronavirus-death_n_5ea9e6d4c5b6e7f685ac2041"}