{"authors": [], "date_download": "2020-05-04 21:09:08", "date_modify": "2020-05-04 21:09:08", "date_publish": "2020-04-08 13:45:04", "description": "The federal government will buy 30,000 ventilators from General Motors by the end of August for $489.4 million. GM says it will cover its costs but won’t make a profit on the devices, which...", "filename": "_6d7cb264d43a54ac24854ae87004cf18_1588626548.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6d7cb264d43a54ac24854ae87004cf18_1588626548.html", "title": "US to buy 30,000 ventilators from General Motors", "title_page": "US  to buy 30,000 ventilators from General Motors", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The federal government will buy 30,000 ventilators from General Motors by the end of August for $489.4 million.\nGM says it will cover its costs but won’t make a profit on the devices, which will cost the Department of Health and Human Services just over $16,300 each. That includes the parts that hook the ventilators to patients.\nHHS says in a statement that the ventilators will go into the Strategic National Stockpile for distribution to where they are needed most to treat coronavirus patients. GM will start by delivering 6,132 ventilators by June 1.\nOn March 18, GM began working with Seattle-area ventilator maker Ventec Life Systems to increase the company’s production. A short time later the automaker began lining up parts suppliers and retooling an electronics factory in Kokomo, Indiana, to build the devices.\nThe ventilators that GM will sell to the government are capable of caring for critically ill coronavirus patients, GM said. They’re a more basic version of one sold by Ventec to distributors for around $18,000.\nPresident Donald Trump invoked the Defense Production Act on March 27 telling GM to build the ventilators even though work was well under way. GM said it didn’t change anything because of the act and couldn’t move any faster than it was going.\nGM is planning to start production in Kokomo next week, eventually hitting a rate of 10,000 per month.", "url": "https://apnews.com/6d7cb264d43a54ac24854ae87004cf18"}