{"authors": ["David Sharp"], "date_download": "2020-05-04 20:21:05", "date_modify": "2020-05-04 20:21:05", "date_publish": "2020-04-17 14:04:55", "description": "PORTLAND, Maine (AP) — The state is planning a phased-in reopening of the economy, but decisions will be driven “first and foremost by the need to protect the public health,” Gov. Janet Mills said...", "filename": "_856a41cc4c826069bb0ffe8822b80f6f_1588623665.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_856a41cc4c826069bb0ffe8822b80f6f_1588623665.html", "title": "Mills to put health first as Maine plans economic reopening", "title_page": "Mills to put health first as Maine plans economic reopening", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Maine (AP) — The state is planning a phased-in reopening of the economy, but decisions will be driven “first and foremost by the need to protect the public health,” Gov. Janet Mills said Friday.\nMills said she wants to be sure that the state doesn’t act too swiftly and cause another spike in illnesses.\n“We all know that reopening too soon and too aggressively will likely cause a secondary surge in COVID-19 cases, jeopardizing the lives of Maine people and further destabilizing the economy,” she said. “None of us want that.”\nMaine’s plans will be specific to the state’s economy and demographics, she said. But expanded tests, personal protective gear and contact tracing will require help from the federal government, she said.\nThe Maine Center for Disease Control is in the process of doubling the number of disease detectives, or contact tracers, to 30 within about a week, Dr. Nirav Shah, the agency’s director, told reporters.\nThe state also needs help when it comes to boosting testing. The state lab gets its chemical reagents from the federal government and only has enough for a few thousand tests. The state also needs more rapid-testing kits and, eventually, antibody testing, he said.\nIn general, Shah said he agrees with the Trump administration’s phased approach of reopening the economy.\n“The document appears to be a good start. It provides a skeleton and like all skeletons it needs more meat on the bones. So that’s what we’re working on now,” Shah told reporters.\n___\nTHE NUMBERS\nThere were two more deaths and several dozen more positive tests, bringing the total number of deaths to 29 and the number of people who’ve tested positive to 827 in Maine, Shah said.\nAll told, 112 residents and 52 staff members have tested positive at five long-term care facilities with outbreaks in Falmouth, Portland, Augusta, Belfast, Scarborough and Portland, he said.\nFifty-five people were being treated for COVID-19 in hospitals, with 28 individuals in intensive care units, he said.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, or death.\n___\nSECRET MEETINGS\nThe Democratic governor agreed to change the policy for online and telephone meetings after getting called out for meeting secretly with lawmakers and others in recent weeks.\nMills and members of her cabinet have held multiple online or telephone briefings with large groups of state lawmakers during the pandemic, the Portland Press Herald reported.\n“The administration is temporarily postponing any further meetings until it is able to work with the Legislature to determine the best process to respond to their questions in a transparent way as we all work to adapt to changes driven by the virus,” said spokeswoman Lindsay Crete.\nMaine lawmakers modified the Freedom of Access Act to allow for remote meetings of state, county and local government during a civil emergency declared because of the pandemic. But the new law also requires that the public be able to observe such proceedings.\n—\nThis story has been corrected to show that 55 people, not 50, were hospitalized as of Friday.", "url": "https://apnews.com/856a41cc4c826069bb0ffe8822b80f6f"}