{"authors": ["Analysis Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:13:33", "date_modify": "2020-05-04 16:13:33", "date_publish": "2020-04-03 11:29:43", "description": "Governments are launching one rescue package after another in hopes of preventing economic catastrophe as the coronavirus pandemic rampages around the world, shutting down entire industries and costing tens of million of people their jobs.", "filename": "2020_04_03_economy_coronavirus-debt-deficits_index_1588608813.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402115052-us-capitol-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_economy_coronavirus-debt-deficits_index_1588608813.html", "title": "Coronavirus stimulus will take national debt to wartime levels", "title_page": "Coronavirus stimulus will take national debt to wartime levels - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Governments are launching one rescue package after another in hopes of preventing economic catastrophe as the coronavirus pandemic rampages around the world, shutting down entire industries and costing tens of million of people their jobs.\nIn most countries, political opposition to spending increases funded by borrowing has vanished in the face of a potential global depression. But the trillions of dollars in support promised to households and businesses will push up budget deficits to their highest levels since the global financial crisis.\nAnd the borrowing binge could result in national debt mountains to rival those last seen in the late 1940s.\nThe amount of stimulus already committed ranges as high as 20% of GDP in some countries, but economists warn that even more will likely be needed to support workers and companies harmed by the pandemic. At the same time, tax revenue will decline along with economic activity, blowing out deficits even further.\nDeficits in many developed economies are already expected to rise by 4% to 8% of GDP this year, with Germany and the United Kingdom near the top of the scale, according to Vicky Redwood, a senior economic adviser at Capital Economics. The United States, Canada, Italy and France are also among the big spenders.\nRedwood said that deficits could widen further because \"government measures are still rising by the day,\" and national shutdowns designed to prevent the spread of coronavirus could go on longer than assumed. Government guarantees on loans to struggling businesses could also prove more costly than expected.\nMario Draghi, a former president of the European Central Bank who is credited with saving Europe's single currency during the continent's debt crisis, said recently that governments must absorb, wholly or in part, the loss of income suffered by the private sector.\n\"Much higher public debt levels will become a permanent feature of our economies,\" he wrote in the Financial Times\nDraghi argued that countries have always deployed their balance sheets during emergencies to protect citizens and absorb economic shocks that the private sector cannot. Wars — the best precedent for the coronavirus pandemic — are almost always financed by increases in public debt, he added.\nDebt levels not seen since World War II\nIn the United States, the wave of stimulus spending could push debt as a share of the economy to levels not seen since the end of the World War II. Congress has already approved three rescue packages, the most recent of which came with a $2 trillion price tag, and more may be needed.\nSpending increases and tax cuts have already pushed US government debt up to $17 trillion, doubling the country's debt to GDP ratio to nearly 80% since 2008. According to Commerzbank, the coronavirus relief packages approved so far will push that figure to 96% by 2022.\n\"Should Congress pass further aid packages and should the economic damage be greater than previously assumed, the previous record set in 1946 (106%) could be surpassed,\" Bernd Weidensteiner, one of the German bank's economists, wrote recently.\nOther countries are rushing to secure funding for their pandemic rescue plans. Britain intends to auction £45 billion ($56 billion) in government debt in April alone. That's the highest monthly total on record, according to the Institute for Fiscal Studies.\nMujtaba Rahman, managing director for Europe at the Eurasia Group, said that coronavirus has quickly ended a debate within Prime Minister Boris Johnson's Conservative Party over whether he should increase spending after years of austerity. Ministerial aides admit privately the country is likely to emerge from the crisis with government debt at more than 100% of GDP, according to Rahman.\nBringing down the debt\nFinancial markets should easily absorb this new wave of debt, especially because central banks have committed to buying huge amounts of government bonds as part of their own stimulus efforts.\nEconomists aren't worried about the short-term effects of this massive splurge. The prospect of rising inflation caused by waves of stimulus, for example, isn't much of a concern because consumer demand is likely to remain subdued during the recession, even when lockdowns are eased or lifted.\nBut once the crisis passes, the accumulated debt will remain on government balance sheets. The more debt a country has, the more it has to spend to service that debt, leaving less money for other things. Low interest rates have helped the US government to keep its bills down, but rates could rise in the future.\nCountries that want to reduce their debt levels will likely have to do so over decades. In the United States, debt levels came down quickly after World War II because the economy was growing rapidly and annual deficits were kept low. A growing workforce helped, too.\nThe children born during those boom times are now growing older, meaning that demographics are working against the United States, as well as countries such as Italy. Government spending on health care, for example, will need to increase drastically in the coming years. Another limiting factor: The coronavirus could leave deep scars on the economy, suggesting that even modest growth might not return for years\n\"This will not be a recovery that resembles anything like what we saw after World War II, unfortunately,\" said Maya MacGuineas, president of the Committee for a Responsible Federal Budget, a group that tracks federal spending from Washington. MacGuineas said that lawmakers should make tough choices now to help bring down the deficits of the future.\nTough choices ahead\n\"If we give everyone checks, we should pair that with raising the retirement age starting 10 years from now,\" she said. \"If we start to engage in infrastructure, we should pair that with raising the gas tax ... once certain metrics in the economy show we're strong enough to do it.\"\nCountries with similar levels of debt to the United States but more limited growth prospects will have an even tougher time, according to Capital Economics' Redwood.\nShe said those countries might be forced to heavily cut spending after the crisis in order to reduce their deficits. Another option for some would be to allow inflation to rise, which can spur growth and reduce the real value of debt. A third route is default.\n\"We expect some emerging markets to go down this route, and Italy may end up doing this eventually too,\" said Redwood.", "url": "https://www.cnn.com/2020/04/03/economy/coronavirus-debt-deficits/index.html"}