{"authors": ["Opinion Michael D'Antonio"], "date_download": "2020-05-04 16:25:44", "date_modify": "2020-05-04 16:25:44", "date_publish": "2020-04-07 10:26:50", "description": "It's no surprise that President Donald Trump says he won't follow CDC recommendations to wear a mask to stop the spread of coronavirus, writes Michael D'Antonio. Ever the defiant and self-involved Baby Boomer, Trump's response is the expression of both a political idea -- anti-governmentism -- and of a kind of morality that surged as he was making his name as a property developer.", "filename": "2020_04_07_opinions_trump-mask-coronavirus-dantonio_index_1588609544.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405190737-02-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_opinions_trump-mask-coronavirus-dantonio_index_1588609544.html", "title": "Why Trump doesn't want to wear a mask", "title_page": "Why Trump doesn't want to wear a mask - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author with Peter Eisner of \"The Shadow President: The Truth About Mike Pence.\" The opinions expressed in this commentary are those of the author. View more opinion articles on CNN.\nAnd no surprise that President Donald Trump -- ever the defiant and self-involved Baby Boomer -- says he would only wear one if he \"thought it was important.\" At a press Friday, he said \"I think wearing a face mask as I greet presidents, prime ministers, dictators, kings, queens, I don't know. Somehow, I don't see it for myself,\" adding, \"I just don't.\"\nThe larger historical and political context of the President's remarks should be unpacked, but let's stop for a moment and reflect on the personal mindset Trump revealed with them. Under his watch, the pandemic is running out of control in the US. America has perhaps been among the worst in the world in its response, even as he demands praise and appreciation.\nAs death, grief, and suffering pooled around him, Trump's thoughts turned to the optics of meeting people \"sitting in the Oval Office behind that great resolute desk.\"\nWho, in his right mind, would pause in the face of this pandemic to consider visiting dignitaries -- including dictators, mind you -- and how a medical mask might spoil his look?\nAside from anything else, we all know that foreign delegations won't be arriving at the White House any time soon. And if, by chance, it happened, the president should insist he be photographed wearing a mask if only to show his solidarity with and concern for, others. (The first lady, perhaps less concerned about a mask mussing her hair, encourages their use ).\nThe president's remarks came as he announced the US Centers for Disease Control and Prevention (CDC) recommendation that we cover our mouths and noses to give just-in-case protection for others. Though we may not feel sick, we could have the virus and transit it with our breath. The mask is not about me, but rather we. And our reaction to the recommendation signals whether we feel connected to our fellow Americans or regard ourselves as disconnected free agents, competing ad nauseum to be special.\nRaised by a father who told his sons to be king, Trump has long regarded his instinct as more valid than others' expertise. As he once said , \"I have a gut, and my gut tells me more sometimes than anybody else's brain can ever tell me.\"\nNow confronted with one of American history's biggest threats to civilian lives, Trump's response has been to avoid a unified national response -- no stay-at-home orders, no rapid mobilization of medical aid -- while hyping whatever unilateral actions he takes.\nThe one thing Trump did right, if late, was restrict flights to the US from China, where the virus first appeared. However, his bragging about this move neglects the truth that he followed the airlines' own moves to stop flights and his policy was so full of holes that 430,000 travelers have come from China to the US since.\nAll of the president's failures reflect his inability to think of America as a community in need of a responsive government. His administration, on the initiative of John Bolton, closed the National Security Council's pandemic office and neglected to replenish emergency supplies, which had dwindled due to policies pushed by Congressional Republicans in the Obama years. (Much as he loves to blame his predecessors, a President in his fourth year should own the government and not look like a weakling ducking responsibility.)\nAs other nations marshaled more effective defenses, Trump denied reality. We had the wealth and the expertise to take advantage of the weeks we had to prepare while Asia and Italy were stricken. However, we lack leaders whose concept of America includes a sense that we live in a national community that needs a competent government.\nThe gap between what we need now, and what we have, developed over the years since Ronald Reagan's famous campaign line : \"The nine most terrifying words in the English language are: I'm from the Government, and I'm here to help.\" Reagan ushered in an era in which many politicians ran with the expressed intent of cutting back on government. Privatization drained manpower and expertise out of federal, state, and local governments. Taxes poured into corporations that slashed wages and benefits to turn prisons, health care facilities, water companies and schools into profit centers. Contractors replaced citizen soldiers in the military and with each of these developments a cord that bound the people to its government was severed.\nWith Trump's response to the pandemic we see the expression of both a political idea -- anti-governmentism -- and of a kind of morality that surged at the same time . In his lifetime, individualism has grown while community attachments have withered. This point of view makes every success and failure a personal matter while ignoring circumstances -- like poverty and abuse -- beyond the individual's control. Helping would only foster dependence.\nBorn into extreme wealth in 1946, the first year of the Baby Boom, Trump has, at every turn, embodied the worst of its impulses, including narcissism, greed, and self-indulgent irresponsibility. He avoided wartime military service with a series of questionable medical deferments -- bones spurs, really? -- and then embraced the self-indulgence in that writer Tom Wolfe first famously described in 1976 and which Christopher Lasch elaborated on three years later in his National Book Award-winning Culture of Narcissism.\nLasch's work lacerated boomers for their selfishness and spiritual emptiness. As he reported, style was eclipsing substance as a claim to prominence and fame was replacing achievement as a goal for the nation's young. The book was published in the era Trump was starting to cultivate the tabloids and develop Trump Tower\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nTrump's lifelong commitment to the manufacture of his own myth, which he sold well enough to become president, has brought us to this tragic moment. Only time will tell whether we will recognize that in many ways he represents the worst of a generational ethos that needs to be replaced. But at least now he, and the cultural mindset he represents, have been unmasked.", "url": "https://www.cnn.com/2020/04/07/opinions/trump-mask-coronavirus-dantonio/index.html"}