{"authors": ["Steve Karnowski"], "date_download": "2020-05-04 20:25:02", "date_modify": "2020-05-04 20:25:02", "date_publish": "2020-04-15 14:32:25", "description": "MINNEAPOLIS (AP) — The growing capacity of the Mayo Clinic and University of Minnesota to provide a new type of COVID-19 testing provides a reason to believe that the state will soon be able to...", "filename": "_3f7e78a10dcb51a5e7a8823d6bb84b79_1588623902.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bc799e7d9e514f3d9d5ca1a6c4b8c75b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3f7e78a10dcb51a5e7a8823d6bb84b79_1588623902.html", "title": "Walz stands by goal of 40,000 coronavirus tests per month", "title_page": "Walz stands by goal of 40,000 coronavirus tests per month", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Minnesota Gov. Tim Walz provides an update on the state's next steps to respond to COVID-19 during a news conference on Wednesday, April 8, 2020 in St. Paul, Minn. Walz is extending Minnesota’s stay-at-home order until May 4 as the number of COVID-19 deaths in the state continues to rise. The original order was scheduled to end Friday. Walz said Wednesday that the order has bought Minnesota needed time to slow the spread of the coronavirus but must continue. (Glen Stubbe/Star Tribune via AP, Pool)\nMinnesota Gov. Tim Walz provides an update on the state's next steps to respond to COVID-19 during a news conference on Wednesday, April 8, 2020 in St. Paul, Minn. Walz is extending Minnesota’s stay-at-home order until May 4 as the number of COVID-19 deaths in the state continues to rise. The original order was scheduled to end Friday. Walz said Wednesday that the order has bought Minnesota needed time to slow the spread of the coronavirus but must continue. (Glen Stubbe/Star Tribune via AP, Pool)\nMINNEAPOLIS (AP) — The growing capacity of the Mayo Clinic and University of Minnesota to provide a new type of COVID-19 testing provides a reason to believe that the state will soon be able to test up to 40,000 people per month for whether they’ve had the disease, Gov. Tim Walz and state health department officials said Wednesday.\nThe Democratic governor set that ambitious goal Monday, saying it’s a crucial condition for safely easing his stay-at-home order and restarting the state’s economy as Republicans are increasingly demanding. But he’s faced questions since then about how he plans to hit that target because state and private labs have tested just over 40,000 Minnesotans since the pandemic began.\n“We’re going to at least shoot for it,” Walz said on a conference call with reporters. Testing will be critical to staying on top of the pandemic over the next 12 to 18 months before a vaccine becomes available, he added. “Basically, this is a wildfire that is still going to have some hot embers burning, and when those start to flare up again, we’re going to have the fire department there to put them out immediately.”\n“This is an achievable goal,” Health Commissioner Jan Malcolm said.\nEight more Minnesota residents have died of COVID-19, raising the state’s toll to 87, while 114 new confirmed cases pushed the state’s total up to 1,809, the Minnesota Department of Health reported Wednesday. The deaths raised the state’s total to 87 from the coronavirus. As of Wednesday, 197 patients were hospitalized, an increase of 20 from Tuesday, while 93 of them were in intensive care, a jump of 18. But 940 patients have recovered and no longer need isolation.\nMayo and the university in recent days have rolled out “serology” tests that look at a person’s blood sample to see if they’ve produced antibodies to the new coronavirus. While the tests can’t diagnose an active or recent infection, they could indicate whether a person has been exposed and developed at least some immunity, and therefore might be able to return to work safely. The tests contrast with the older “molecular” tests that use nasal swabs to see if a person has an active infection. National supply shortages of specialized chemicals and swabs have severely limited the capacity for using them.\nThe new serology tests largely avoid those supply bottlenecks, though they still require personal protective equipment, said Kris Ehresmann, the state’s infectious disease director. The projected capacity for conducting them is “a magnitude of order greater than what we currently have for the molecular testing, so that’ll make a big difference,” she added.\nWalz said he’s not expecting federal help for ramping up testing to meet his goal of 40,000 per week, or around 5,000 per day, hence the need for local partners like Mayo and the university, which he said are resources other states don’t have.\n“I think Minnesota is going to have to go it alone,” he said. “The president made that very clea r yesterday, that the states are responsible for this.”", "url": "https://apnews.com/3f7e78a10dcb51a5e7a8823d6bb84b79"}