{"authors": [], "date_download": "2020-05-04 20:22:17", "date_modify": "2020-05-04 20:22:17", "date_publish": "2020-04-16 17:13:30", "description": "OMAHA, Neb. (AP) — An overwhelming majority of bankers in rural parts of 10 Plains and Western states expect the coronavirus outbreak to push their local areas into recession, according to a new...", "filename": "_df2d8076ff7964b13c4b4e547e583256_1588623737.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_df2d8076ff7964b13c4b4e547e583256_1588623737.html", "title": "Pandemic sends rural bankers survey index to all-time low", "title_page": "Pandemic sends rural bankers survey index to all-time low", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OMAHA, Neb. (AP) — An overwhelming majority of bankers in rural parts of 10 Plains and Western states expect the coronavirus outbreak to push their local areas into recession, according to a new survey released Thursday.\nThe overall index for the region plummeted from March’s already anemic 35.5 to 12.1 in April — the lowest index recorded since the survey began in January 2006. Any score below 50 suggests a shrinking economy, while a score above 50 suggests a growing economy, survey organizers say.\nCreighton University economist Ernie Goss, who oversees the survey, said more than nine in 10 bankers surveyed expect the measures being taken to fight the coronavirus to lead to a recession.\n“This is up significantly from March when 61.3% of bankers anticipated such a recession,” Goss said.\nStates and local leaders have issued stay-at-home orders or have limited the size of public gatherings to try to slow the spread of the virus , prompting some businesses to close. Many restaurants have been forced to close their dining rooms and only handle take-out or delivery orders.\nAbout 94% of bankers surveyed this month reported a decline customer visits over the past two weeks, and nearly one-third surveyed said their bank had experienced higher loan delinquency rates as a result of the coronavirus threat, Goss said.\nThe survey’s confidence index, which measures how bankers feel about the economy over the next six months, sank to 27.4 from March’s 28.3.\nThe borrowing index rose to 75.8 from March’s 66.1 as more farmers took out loans, and the employment index fell to a record-low 9.4, down from 48.3 in March.\nBankers from Colorado, Illinois, Iowa, Kansas, Minnesota, Missouri, Nebraska, North Dakota, South Dakota and Wyoming were surveyed.", "url": "https://apnews.com/df2d8076ff7964b13c4b4e547e583256"}