{"authors": ["Brian Fung", "Sara Ashley O'Brien", "Cnn Business"], "date_download": "2020-05-04 16:10:00", "date_modify": "2020-05-04 16:10:00", "date_publish": "2020-04-02 18:28:12", "description": "Amid mounting criticism of its pandemic response, Amazon on Thursday said it is rapidly expanding temperature checks for its employees and that it has nearly completed its hiring spree of 100,000 additional workers at its distribution centers.", "filename": "2020_04_02_tech_amazon-coronavirus-safety-measures_index_1588608600.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130144342-amazon-distribution-center-1217-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_tech_amazon-coronavirus-safety-measures_index_1588608600.html", "title": "Amazon says it's taking coronavirus seriously. Workers say the company is endangering their health", "title_page": "Amazon says it's taking coronavirus seriously. Workers say the company is endangering their health - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN Business) Amid mounting criticism of its pandemic response, Amazon on Thursday said it is rapidly expanding temperature checks for its employees and that it has nearly completed its hiring spree of 100,000 additional workers at its distribution centers.\nThe announcements illustrate the pressureis under as it grapples with a tidal wave of delays for sold-out items and complaints from employees about workplace safety during the pandemic. Despite Amazon's expressions of support for its workforce, some Amazon employees and applicants told CNN Business that the company's messaging doesn't always match what they have seen inside the company's warehouses, and that they remain concerned about crowded hiring events and training sessions, limited access to disinfectant wipes and the company's overall ability to follow through on its commitments.\nConfirmed cases of the coronavirus are known to have hit more than a dozen Amazon facilities in recent weeks, prompting calls for multiple fulfillment centers to be closed for deep cleaning. Employees of at least three sites have staged walkouts this week protesting Amazon's decision to keep the centers open for business. Workers at Amazon's LGB3 facility in Eastvale, Calif., have created a petition to close the building, saying the demands of their job make it impossible to comply with the company's social distancing guidelines.\nOne of the changes Amazon mentioned in its blog post Thursday is daily temperature checks for employees in the United States and Europe, which the company said it began on Sunday. More than 100,000 employees per day are now receiving temperature checks, the blog post said.\nAs part of a response to several questions from CNN Business, an Amazon spokesperson declined to provide a list of facilities where temperature checks have begun.\nThe company previously told CNN Business that it is piloting the temperature checks in \"in select sites in New York City and Seattle,\" including its Staten Island facility, JFK8.\nBut two Amazon employees who spoke with CNN Business portrayed an effort at JFK8 that is less comprehensive than the company is admitting.\nEmployees of JFK8 were notified on Sunday via a message in the employee \"A to Z\" app that beginning that day, the company would \"begin conducting a daily temperature check for everyone entering the building for the first time that day at the start of their shift,\" according to a screenshot viewed by CNN Business.\nBut the two employees at JFK8 who spoke with CNN Business about the checks said the company did not check their temperatures, or the temperatures of other workers, when they were entering the facility at certain times this week. One of the employees said they started experiencing symptoms during a shift this week and that a manager instructed them to go home. On the way out of the facility, security took their temperature, and found a fever above the 100.4F threshold recommended by the Centers for Disease Control. When asked why some workers did not have their temperature checked upon arriving, an Amazon spokesperson could not explain it, but claimed that all employees at the facility have been receiving the temperature screenings every day since Sunday.\nThe mixed messaging continued on Thursday, when employees at JFK8 saw a new message in the employee app, also viewed by CNN Business, that suggested daily temperature checks had not yet begun as previously claimed.\n\"In the next few days, we will begin conducting a daily temperature check,\" the message read. \"You'll be notified when this is starting at your site.\" Amazon told CNN Business that the message was delivered to JFK8 employees as part of a wider communication to company associates.\nAmazon declined to provide an updated count of the number of coronavirus cases at its Staten Island facility, where employees have claimed that as many as 10 workers have been diagnosed but only three cases have been disclosed.\nIn Thursday's blog post, Amazon also described disinfectant wipes and hand sanitizer as \"standard\" across the company, but several employees told CNN Business that supplies were extremely limited at the facilities where they work. At the DTW1 facility in Romulus, Michigan, Amazon issues just three disinfecting wipes per shift -— one at the beginning of each shift and one after each of two breaks, Mario Crippen, an employee at the facility who led one of the strikes this week, said.\n\"One person walks around handing it out so you got to wait until they come around to you to get a disinfectant wipe,\" he said.\nHand sanitizer is limited, too, according to Crippen.\n\"They have one person outside the break room squirting hand sanitizer on people's hands because we're running so low,\" he said.\nTwo Amazon employees at SDF4, a facility in Kentucky, told CNN Business that hand sanitizer bottles at the site are empty, disinfecting wipes are being rationed and Clorox wipes are unavailable.\n\"We Amazon employees work hard every day, the least [the company] could do is be honest about the condition of things inside the belly of this beast,\" one of the SDF4 employees told CNN Business.\nAmazon acknowledged to CNN Business the possibility of cleaning supply shortages at some sites, but said it has added 450,000 containers of disinfecting wipes and tens of thousands of hand sanitizer containers to its facilities.\nIn Thursday's blog post, Amazon also said that face masks it has ordered for workers are finally becoming available and will be distributed in the coming days, and that the company is conducting daily audits of the new safety measures it has implemented since the outbreak began. Those measures include more aggressive cleaning, policies designed to keep employees separated, and requirements that delivery drivers wipe down their vehicles with disinfectants at the beginning and end of every shift.\nAmazon added that it has hired 80,000 of its planned surge of 100,000 workers , reflecting how quickly the company has had to adjust to spikes in customer demand. But the need to hire so many people so quickly has created some potentially dangerous situations.\nOne job applicant told CNN Business she arrived for her interview with Amazon only to discover what she estimated as 30 to 40 applicants crammed into a single waiting room, with many people having to stand because all the chairs were taken. The company had provided a solitary bottle of hand sanitizer for the room, and some people were coughing and sneezing. The person, who spoke on condition of anonymity for fear of jeopardizing her employment prospects, said she took one look at the situation and fled. She has not rescheduled her interview.\n\"I'm never applying for Amazon again,\" she told CNN Business.\nAccording to Crippen, new hires are being packed closely together in training rooms at the facility where he works. Last week, he said, the facility hired 86 new workers who needed on-boarding.\n\"Some of the people that do the new-hire training are afraid to do it,\" Crippen said. \"There are so many people at one given time and there's no way to social distance in one room.\"\nAmazon said that its recruitment centers follow social distancing guidelines, with markers laid out on floors to separate job candidates.\nDave Clark, Amazon's senior vice president of worldwide operations, said in Thursday's blog post that the company has made more than 150 changes to its processes to enhance worker safety.\n\"With over 1,000 sites around the world, and so many measures and precautions rapidly rolled out over the past several weeks, there may be instances where we don't get it perfect,\" Clark wrote, \"but I can assure you that's just what they'll be — exceptions.\"", "url": "https://www.cnn.com/2020/04/02/tech/amazon-coronavirus-safety-measures/index.html"}