{"authors": [], "date_download": "2020-05-04 20:10:53", "date_modify": "2020-05-04 20:10:53", "date_publish": "2020-04-09 17:18:10", "description": "SEATTLE (AP) — More than 100 people have contracted hepatitis A in the Seattle area since the beginning of January, coinciding with the coronavirus pandemic, public health officials...", "filename": "_58e00c1e4153f33b1c0a583f72512b8a_1588623053.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_58e00c1e4153f33b1c0a583f72512b8a_1588623053.html", "title": "Seattle area Hepatitis A cases up amid coronavirus pandemic", "title_page": "Seattle area Hepatitis A cases up amid coronavirus pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — More than 100 people have contracted hepatitis A in the Seattle area since the beginning of January, coinciding with the coronavirus pandemic, public health officials said.\nPublic Health — Seattle & King County previously recorded no more than 16 cases annually over the last decade, The Seattle Times reported .\nHepatitis A is a highly infectious liver disease transmitted through fecal matter and about 50% of the cases this year have been detected among people experiencing homelessness, including more than a dozen cases in Seattle’s Ballard neighborhood last month, health officials said.\nAdvocates have argued not enough preventive measures are being taken for homeless people who do not stay in shelters.\n“What we are seeing unfold in our city is a truly shocking experience,” Coalition on Homelessness executive director Alison Eisinger told the Seattle City Council at a meeting when homelessness was discussed on Wednesday.\nAdvocates have warned the city that people with lack of access to running water and bathrooms run an increased risk of contracting the disease as businesses close or reduce hours to combat the spread of COVID-19.\nThe city has distributed hygiene kits and information about the two outbreaks, encouraged people to get vaccinations and cleaned infected areas. But homeless services providers argue there is a disparity in available resources.\nThe city has faced difficulties supplying and operating additional resources, some new hygiene resources have been vandalized, operating staff has been hard to coordinate and the cost of additional mobile bathrooms and hand-washing stations has increased, Deputy Mayor Casey Sixkiller told the council.\nMayor Jenny Durkan made repeated requests for federal and state resources, including letters to the Federal Emergency Management Agency and Vice President Mike Pence, her office said.\n“There are solutions out there, so we just have to make it a priority,” Hepatitis Education Project executive director Michael Ninburg said.", "url": "https://apnews.com/58e00c1e4153f33b1c0a583f72512b8a"}