{"authors": ["Sara Ashley O'Brien", "Kaya Yurieff", "Cnn Business"], "date_download": "2020-05-04 16:59:00", "date_modify": "2020-05-04 16:59:00", "date_publish": "2020-04-09 18:54:30", "description": "In late March, Instacart worker Annaliisa Arambula accepted a grocery order that came with a big tip: $55. The store was just down the street, everything the customer wanted was available, and the order seemed to go off without a hitch.", "filename": "2020_04_09_tech_instacart-shoppers-tip-baiting_index_1588611540.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409080314-instacart-shopper-delivery-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_tech_instacart-shoppers-tip-baiting_index_1588611540.html", "title": "People are luring Instacart shoppers with big tips -- and then changing them to zero", "title_page": "People are luring Instacart shoppers with big tips -- and then changing them to zero - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) In late March, Instacart worker Annaliisa Arambula accepted a grocery order that came with a big tip: $55. The store was just down the street, everything the customer wanted was available, and the order seemed to go off without a hitch.\nBut an hour later, Arambula checked her earnings on the Instacart app and the entire tip was gone, with a message saying the \"customer modified the tip post-delivery.\" She ended up makingjust $8.95 from Instacart on the order.\n\"I was flabbergasted. I couldn't believe it,\" Arambula told CNN Business.\nDemand for grocery delivery is surging amid the Covid-19 pandemic , and many customers are struggling to get the items they want or even a time slot for a delivery. Some people are dealing with that by offering big tips, as high as $50 or more, to entice Instacart workers to pick up their orders. But some of those people have turned the tactic into a bait-and-switch, offering up the big tip and then taking it away as soon as the person who risked their health to get them their groceries has made the delivery.\nBefore accepting a \"batch\" -- which can consist of one or a few orders from different customers -- workers can see the items requested, the store location, the payment Instacart provides workers for the job, and the tip being offered. Instacart allows customers to change a tip for up to three days. Some workers told CNN Business tips can make up half of their income or more.\n\"It's very demoralizing,\" said Arambula, who lives in the Portland, Oregon, area and has worked full-time for Instacart since June 2017. \"I don't pretend to be a hero, like a nurse in a hospital ... but I literally am exposing myself [to coronavirus] and when I return home, exposing my own family to the possibility of transmitting this disease. When you know that it's somebody who's just doing it to game the system and to get their order when they want it, it's really frustrating.\" Arambula's husband is currently unemployed and at high risk for Covid-19 because he has diabetes, so they are relying on her work for Instacart to pay their bills.\nInstacart is one of several delivery companies now expanding rapidly due to demand spurred by the pandemic. Last month, the company announced plans to bring on another 300,000 full-service shoppers in North America to service the increased demand.\nAn Instacart spokesperson told CNN Business the vast majority of people in March adjusted their tip upward or did not adjust their tip after delivery. Moreover, the spokesperson said, the company recently removed the \"none\" tip option for people, so users who want to tip nothing must manually change a tip to $0. The spokersperson said this could deter users from doing so. People can also leave feedback and rate a worker in the app, something Instacart claims typically happens if and when a person removes a tip.\n\"It's a crapshoot\"\nJenifer G., who became a \"full service shopper\" for Instacart about a month ago and asked to be identified by her first name and last initial for fear of retribution, said she has already experienced a handful of bait-and-switch tippers in Pennsylvania. She said one person originally put a $32.94 tip on a 27-item order from Sam's Club, only to replace it with a $0 tip after delivery. Another person changed a $13.31 tip on a 38-item order from a different store to nothing after delivery.\n\"It's a crapshoot,\" said Jenifer G., who noted half her earnings come from tips, either in cash or through the app. \"These are affluent communities that I'm delivering to. There's almost no need to not tip, especially because not only is this a convenience for you but we're in a pandemic right now.\"\nAn Instacart spokesperson said that tips are always left up to a customer's discretion and would not comment on specific instances of tip baiting occurring. In an email to Instacart customers provided to CNN Business, the company encourages people to \"please consider tipping above and beyond to reflect the extra effort of your shopper.\"\nUber UBER Being able to change a tip is not uncommon for on-demand delivery platforms. But other services such asEats and Postmates, which offer on-demand meal deliveries, allow customers to change tips for shorter windows of time, between one and 10 hours.\nBryant Greening, an attorney and co-founder of Chicago-based law firm LegalRideshare, told CNN Business that a few dozen Instacart shoppers and drivers have reached out to his firm to voice concerns over the practice. His law firm has discussed the possibility of litigation against Instacart, or even individual customers.\n\"It's truly evil to bait and switch in this type of environment,\" said Greening. \"Their livelihood and well-being are on the line. When these shoppers and drivers see a high tip, it's an opportunity for them to put food on the table, so they're more willing to take a risk on their health to achieve that goal.\"\nWhile Instacart is benefiting from a surge in customer orders in recent weeks, workers have criticized the company for not doing enough to ensure they're adequately protected and paid during the pandemic. For more than a week, some workers have been on strike until Instacart meets their demands including hazard pay, an expansion of its coronavirus pay to include those with underlying health conditions and a default tip of 10%. One day before the planned strike, Instacart said it would change its default tip setting from 5% to the most recently used percentage a customer chose to tip.\nJenifer G., the Instacart worker, said she feels the company should mandate a 10% tip \"that sticks no matter what\" on all orders until stay-at-home guidance is lifted and only allow people to tip above that should they choose.\n\"I can't strike, I literally cannot afford to, but I'll [only] shop during 'boost times,'\" she said, referring to high-demand times of day when Instacart pays a few dollars more to workers.\nDetached customers\nIn addition to having their tips slashed at the last minute, some Instacart workers are also the target of seemingly tone-deaf remarks from customers. Carilyn, who started working for Instacart about one month ago and asked to be identified by first name only for fear of retribution, told CNN Business she also had a recent experience with tip baiting. When dropping off an order recently, she said the customer told her it was \"unethical\" that she wasn't able to find toilet paper and updated her tip to $0.\n\"I tried my best. A lot of people are detached from the situation going on,\" said Carilyn, who is based in Florida. \"They really don't see what we see. We know things are a no-no, like soap, and toilet paper, you barely find eggs if you're lucky.\"\n(Because workers tend to be tipped a percentage of the total order cost, when high-demand items can't be found in store -- in this case, toilet paper -- the tip shrinks accordingly. But in other cases, customers enter a custom tip amount and then take it back after the delivery.)\nFortunately for some, like Carilyn and Jenifer G., the majority of recent tips have been authentic. Carilyn said she took home more than $360 in cash and in-app tips last week alone -- a good week for her. Jenifer G. also noted that she's had people leave cash tips in envelopes at their door.\nWhile some workers said they have grown wary of large tips because of tip baiting, others sometimes risk picking up low tip orders in the hopes the person will pay more in cash. It doesn't always work, though. Jenifer G. said she recently picked up a 112-item order from Aldi for a person who put a $1 tip in the app and there was no cash tip waiting.\n\"We always say: No matter what, never trust a tip,\" she said.", "url": "https://www.cnn.com/2020/04/09/tech/instacart-shoppers-tip-baiting/index.html"}