{"authors": ["Analysis Brad Lendon"], "date_download": "2020-05-04 16:26:03", "date_modify": "2020-05-04 16:26:03", "date_publish": "2020-04-07 05:24:40", "description": "As the United States military was embroiled in controversy over its handling of an outbreak of coronavirus on one of its Pacific aircraft carriers, China was resuming operations in the South China Sea.", "filename": "2020_04_07_asia_coronavirus_2784d01fdf693ceda0bf476c7dbbaee9_index_1588609563.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181022135742-china-navy-intl-1022-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_asia_coronavirus_2784d01fdf693ceda0bf476c7dbbaee9_index_1588609563.html", "title": "South China Sea: Coronavirus may be giving Beijing an opening", "title_page": "South China Sea: Coronavirus may be giving Beijing an opening - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN) As the United States military was embroiled in controversy over its handling of an outbreak of coronavirus on one of its Pacific aircraft carriers , China was resuming operations in the South China Sea.\nIn the past week, the English language website of the People's Liberation Army has posted stories on large-scale naval exercises and the sinking of a Vietnamese fishing boat . In addition, it also announced the ramping up of military industries in Wuhan, the original epicenter of the Covid-19 pandemic.\nThe South China Sea drills came after the US aircraft carrier USS Theodore Roosevelt passed through those waters on its way to Guam, where it is now docked after more than 170 cases of coronavirus have been reported aboard the ship.\nTrump says it was inappropriate of commander to write memo\nTrump says it was inappropriate of commander to write memo 01:32\nTrump says it was inappropriate of commander to write memo\nThe Roosevelt's commander, Capt. Brett Crozier, was stripped of his command last week after a memo he wrote warning that urgent action was needed to protect the lives of his crew was leaked to the media.\nThe US Navy's other aircraft carrier in the Pacific, the USS Ronald Reagan, is also facing a \"handful\" of positive cases, a defense official told CNN last week. That ship is docked in Yokosuka, Japan, undergoing maintenance.\nLate last week, a second US Navy installation in Japan, Sasebo Naval Base, reported its first case of coronavirus. Other virus cases have been reported at US installations in South Korea.\nIn total the US Defense Department reports more than 1,500 coronavirus cases within its ranks.\nThe Pentagon has taken steps to control the spread of the virus within the services, including stopping the movement of troops between installations worldwide and canceling training exercises and even delaying some basic training for recruits.\nAll that comes at a cost, including weariness among troops who were expecting to be rotated back to the States, or lack of familiarity with missions or equipment because training cannot take place.\nChanging strategies\nJonathan Hoffman, US assistant secretary of defense for public affairs, told reporters last week the Pentagon makes daily risk assessments with an eye to regaining \"full operational capability more quickly.\"\nBut some analysts have suggested that in the South China Sea, even short-term pullbacks can create an opening the PLA could take advantage of.\nJUST WATCHED Defense secretary defends removal of Navy captain Replay More Videos ... MUST WATCH Defense secretary defends removal of Navy captain 03:32\n\"I think China is exploiting the US Navy's coronavirus challenges to improve its position in the South China Sea by giving the appearance it can and will operate there at will while the US is hamstrung,\" said Carl Schuster, a retired US Navy captain and a former director of operations at the US Pacific Command's Joint Intelligence Center.\nChina claims almost the entire 1.3 million square mile South China Sea as its sovereign territory, and it has aggressively asserted its stake in recent years in the face of conflicting claims from several Southeast Asian nations. The US has long accused Beijing of militarizing islands there via the deployment of military hardware and construction of military facilities.\nSchuster used the recent sinking of a Vietnamese fishing boat to illustrate how China will push its position.\nThe fishing boat sank last Thursday in water near the Paracels, also known as the Xisha islands, in the northern part of the sea. Both China and Vietnam claim sovereignty over the island group.\nChina said the boat sank after it rammed a China Coast Guard vessel that intercepted it in Chinese waters. Vietnam said its fishing boat was operating legally and blamed the sinking on the Chinese. Both sides acknowledge the fishing boat's crew was rescued by the Chinese ship.\nMany analysts have noted that Vietnam appears to moving closer to the US as a result of tensions in the South China Sea. In fact, the Roosevelt was on a port visit to Da Nang before the coronavirus cases turned up on board.\nThe five-day port visit in early March, only the second by a US aircraft carrier to Vietnam since the Vietnam War, was in commemoration of 25 years of US-Vietnam diplomatic relations. It involved cultural and sports exchanges as well as, ironically, a professional exchange focused on cooperating on infectious disease prevention.\nHowever, Schuster noted that the incident with the fishing boat may send a message to Hanoi that \"it has cozied up to the US at a time when the US is not in a position to respond to Chinese actions.\"\nIn a story posted on its English-language website Friday, the PLA said that \"the outbreak of Covid-19 has significantly lowered the US Navy's warship deployment capability in the Asia-Pacific region.\"\nAircraft carriers, with their complement of 90 warplanes and helicopters, are the US Navy's most visible and among its most imposing assets.\nBut with the Roosevelt quarantined in Guam for an indefinite period, it is unclear how easily it can be replaced in its South China Sea role. While the US has 11 aircraft carriers in its fleet, the nuclear-powered ships require extensive overhauls and long-term maintenance at regular intervals, making few available to deploy at any one time.\nThe US Naval Institute's fleet tracker showed only five carriers available as of March 30. One of those is the Roosevelt, another is the Reagan, two others are deployed in to the Persian Gulf to respond to possible threat from Iran and the fifth is on the US East Coast.\nMoving a carrier from one spot on the world's oceans to another can leave vulnerabilities in the area it departed.\nAccording to Schuster, the perception that US readiness has been impacted could embolden China, as to carry out an increased number of exercises in the South China Sea, such as those carried out in March.\n'Not a geopolitical weapon'\nChina has consistently pushed back at the suggestion it is attempting to use the pandemic to gain geopolitical influence.\nAt at press briefing on April 3, China's Foreign Ministry spokeswoman, Hua Chunying, described the spread of the virus as a war. \"(But) when fighting an intense battle, does anyone think of how much prize they will get after the war? The most important thing is doing your best and racing against time to achieve the final victory,\" said Hua.\nJUST WATCHED CNN's rare view of contested South China Sea Replay More Videos ... MUST WATCH CNN's rare view of contested South China Sea 02:43\n\"We would like to share China's good practice and experience with other countries, but we will not turn it into any kind of geopolitical weapon or tool,\" she added.\nThe US State Department has taken issue with that. In a statement Monday, spokeswoman Morgan Ortagus called the incident with the Vietnamese fishing boat just \"the latest in a long string of PRC (People's Republic of China) actions to assert unlawful maritime claims and disadvantage its Southeast Asian neighbors in the South China Sea.\"\n\"We call on the PRC to remain focused on supporting international efforts to combat the global pandemic, and to stop exploiting the distraction or vulnerability of other states to expand its unlawful claims in the South China Sea,\" the statement said.\nMeanwhile, the PLA has consistently maintained that it doesn't face the same kind of coronavirus concerns the US does, noting a month ago that not a single soldier, sailor or airman had been infected with Covid-19.\nThere is widespread international skepticism about that claim. But according to Schuster, China enjoys some advantages in controlling, or at least concealing, the number of infections it has in its naval forces.\nWhile the US Navy fleet is scattered across the Pacific, far from its home shores and operating longer patrols, most PLA Navy ships are at sea under 30 days at a time and operating close to their bases, said Schuster, enabling them to \"replace known infected crewmen off the ship with known healthy sailors from other ship.\"\nJUST WATCHED Xi visits Wuhan as China inches back to 'new normal' Replay More Videos ... MUST WATCH Xi visits Wuhan as China inches back to 'new normal' 01:07\n\"Nor do their South China or East China Sea deployments include foreign port visits. The ships go out, do a five- to 10-day exercise and return to a military home port, where security limits if not prevents any public reporting of potential infections,\" he added.", "url": "https://www.cnn.com/2020/04/07/asia/coronavirus-china-us-military-south-china-sea-intl-hnk/index.html"}