{"authors": ["Reporter"], "date_download": "2020-05-04 20:21:35", "date_modify": "2020-05-04 20:21:35", "date_publish": "2020-04-29 18:38:36", "description": "As the U.S. COVID-19 death toll surpassed that of the Vietnam War, the president's son-in-law went on \"Fox & Friends\" for some self-congratulation.", "filename": "entry_jared-kushner-mocked-great-success-story_n_5ea9b26ac5b61c645b83bcd5_1588623695.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9b624220000410d827df7.jpeg?cache=mcyqs3ygiw&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jared-kushner-mocked-great-success-story_n_5ea9b26ac5b61c645b83bcd5_1588623695.html", "title": "Jared Kushner Mocked For Calling Coronavirus Response 'A Great Success Story'", "title_page": "Jared Kushner Mocked For Calling Coronavirus Response 'A Great Success Story' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "White House senior adviser Jared Kushner seems to have the same affinity for hyperbole, exaggeration and outright falsehoods as his father-in-law, President Donald Trump.\nKushner made that obvious on Wednesday during a “Fox & Friends” appearance where he praised the Trump administration’s handling of the coronavirus outbreak.\nAlthough the virus has now killed more Americans than the Vietnam War, Kushner said the country is on “the other side of the medical aspect of this,” and claimed the federal government’s response to the challenge “is a great success story.”\nHe apparently didn’t feel the need to mention that the U.S. now has more confirmed cases of the coronavirus than any other country in the world. Or that the president and his underlings downplayed the virus threat, fumbled the distribution of supplies and failed to provide a convincing plan for states.\nYou can see Kushner make his dubious claim below:\nJared Kushner, the morning after we hit 1 million cases and more deaths than in the Vietnam War:\n“We’re on the other side of the medical aspect of this. The federal government rose to the challenge, and this is a great success story.”pic.twitter.com/sRGDR4rNsl — Ian Sams (@IanSams) April 29, 2020\nPeople on Twitter mocked Kushner’s attempt at spin control by citing other “great success stories.”\nJARED ON THE END OF HAMLET: \"Denmark's really turned a corner. Classic happy ending.\nJARED ON DEATH OF A SALESMAN: \"Our free-market system proved extraordinarily resilient.\"\nJARD ON THE HINDENBERG: \"Within minutes, the fatality rate fell to zero. A huge win for blimping.\" https://t.co/B37EFdOYmI — David Litt (@davidlitt) April 29, 2020\nToday was a great success story.\n~ Ray Lafferty, coach of Washington Redskins, December 8, 1940, after losing 73-0 to the Chicago Bears in the NFL Championship game https://t.co/GnBvZBt2BH — The Cheese Kitty (@WhoFdTheStork) April 29, 2020\nMy home school teaching career is also a “Great Success Story” — Scott Wolf (@scottwolf) April 29, 2020\nand i am a supermodel ... https://t.co/TwzVRRySt7 — ROSIE (@Rosie) April 29, 2020\nTo others, Kushner’s claim had echoes of the past.\n\"This is a great success story\" pic.twitter.com/Czlw59frDG — Lee Aronsohn (@BennyAce) April 29, 2020\nJared’s “this is a great success story” is like Bush's “Heck-of-a-job” except it’s exponentially more ridiculous and detached from reality. https://t.co/ssIn8B58H7 — Sam Stein (@samstein) April 29, 2020\nOr course, there were questions. Lots of questions.\nI wonder what he would consider to be a failure? — Joyce Alene (@JoyceWhiteVance) April 29, 2020\nJared: “This is a great success story.”\nHow fucking tone deaf, clueless, and uncaring can one person be? https://t.co/T0cZTyi1nG — Joe Walsh (@WalshFreedom) April 29, 2020\nSome people thought Kushner had a point, but not necessarily in the way he intended.\nIn an incredibly tragic way, Kushner isn’t lying. This has been a success for the Trump Administration. They’ve refused to help anyone while undermining confidence in government and enriching themselves by trafficking life-saving supplies like an organized crime family. https://t.co/T9wne6tED0 — Jared Yates Sexton (@JYSexton) April 29, 2020\nJared has always been almost entirely surrounded by people who tell him the bad job he's doing is actually a good job, either because they're suck ups or they're being paid to stroke his ego. I'm sure that's true here and he really believes he's over-performing. https://t.co/t0Sh2PbU4n — Elizabeth Spiers (@espiers) April 29, 2020", "url": "https://www.huffpost.com/entry/jared-kushner-mocked-great-success-story_n_5ea9b26ac5b61c645b83bcd5"}