{"authors": [], "date_download": "2020-05-04 16:06:35", "date_modify": "2020-05-04 16:06:35", "date_publish": "2020-03-19 13:45:41", "description": "Schools shutting down to help reduce the spread of coronavirus became a reality for millions of families these past few weeks. Here's everything you need to make sure your kids are never bored at home.", "filename": "2020_03_19_cnn-underscored_how-to-entertain-kids_index_1588608395.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318102402-entertainkidslead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_19_cnn-underscored_how-to-entertain-kids_index_1588608395.html", "title": "Keep kids entertained and educated with these 20 activities", "title_page": "Activities for kids at home: 20 activities to keep kids entertained and educated - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nSchools shutting down to help reduce the spread of coronavirus has become reality for millions of families these past few weeks. Unlike a finite, planned school vacation, this unexpected limbo can throw off even the most organized parents. In other words, we're in uncharted territory here, folks.\nAnd with loads of us working remotely or choosing to stay home as much as possible, entertaining (and even educating) our kids is now ten times as difficult. Not only are the kids getting stir crazy, but you need to be on that video conference. We feel you, so we went to work sourcing solid ideas for keeping the kids occupied — in a positive, not mindless, way. Even if your school or daycare is still open, you're still venturing out of the house less often now. You can put together a cabin-fever toolkit with this list of finds that your kids (and you) will love.\nAges 3-4\nDuckDuckMoose (Free; duckduckmoose.com)\nDuckDuckMoose\nA great source of educational tablet apps, this platform is especially rich in maps, puzzles and music-based lessons. It's all geared directly to preschoolers and kindergarteners. (DuckDuckMoose is the partner site of the free learning resource renowned for older kids, Khan Academy.)\n_______________________________________________________________________________\nLego Classic Bricks and Houses Starter Set ($15.99, originally $19.99; target.com)\nLego Classic Bricks and Houses Starter Set\nWhen it comes to starter construction sets to foster STEM skills, it hardly gets any better than Lego. This set is ideal for this age range, giving budding builders a chance to create a big family home, a lighthouse, a castle, an igloo, a small house and a windmill.\n_______________________________________________________________________________\nBanana Panda Suuuper Size Animal Match Puzzle ($21.99; amazon.com)\nBanana Panda Suuuper Size Animal Match Puzzle\nThis tot-teaching plaything pulls double duty. It's a huge, vibrant puzzle as well as a matching game. It encourages logical thinking and supports visual-spatial reasoning ability. Little problem-solvers can assemble six individual puzzles or combine them into one picture. They can also match baby animals to their mommas. So cute!\n_______________________________________________________________________________\nMelissa & Doug Abby & Emma Magnetic Dress-Up Set ($17.46; amazon.com)\nMelissa & Doug Abby & Emma Magnetic Dress-Up Set\nWe adore these modern dress-up dolls! Unlike the flimsy paper ones you may remember, this set features two wooden figurines and more than 50 pieces of clothing to mix and match outfits with magnets. This sweet throwback will have your little one flexing that budding imagination, even while preschool is closed.\n_______________________________________________________________________________\nLovevery The Block Set ($90; amazon.com)\nLovevery The Block Set\nWe think every child should have a quality wooden block set. If your preschooler doesn't yet, this may be the perfect time to invest in one. This 70-piece set will keep your child learning while playing; its activity guide was drafted by child development experts. The blocks come packed in a wooden storage box that converts into a pull car, for an extra burst of play value.\nAges 5-7\nNeo Kids (Free for 30 days, subscription packages vary; neoufitness.com)\nNeo Kids\nHelp them burn off their excess energy with streaming, age-specific exercise \"classes.\" They're lively, short (10 to 20 minutes), and totally kid-appropriate. Bonus: You can get in on the action too as a welcome break from your laptop. And the company is giving a 30-day free subscription to those impacted by the novel coronavirus. (No need for a credit card.)\n_______________________________________________________________________________\nBicycle Playing Cards ($3.89; target.com)\nBicycle Playing Cards\nYes, this may seem obvious — but do you even know what happened to that deck of cards you had? This is the perfect age for kids to start learning to play. Remember your very first card game? Maybe it was Go Fish. Or Crazy Eights? Now, when most of us have less to do than usual, seems the ideal time to pass on the tradition, with the classic brand of cards.\n_______________________________________________________________________________\nCreativity for Kids Grow 'N' Glow Terrarium ($12.99, originally $14.99; amazon.com)\nCreativity for Kids Grow 'N' Glow Terrarium\nOver the course of a two-week school closure, your curious kid can have the satisfaction of watching a little ecosystem come to life. This complete tabletop garden kit comes with plenty of extras, including river stones and translucent stickers that glow at night. The habitat starts to grow in three or four days.\n_______________________________________________________________________________\nMetkids (Free; metmuseum.org)\nMetkids\nNo need to get on a plane for your kids to experience New York City's most famous museum. Fight boredom with a healthy dose of culture and art via a virtual tour of the Metropolitan Museum of Art. Housebound kids can explore the museum's vast collections in the \"time machine,\" which will whisk them back to 8000 B.C., then bring them back to today via video and engaging pop quizzes.\n_______________________________________________________________________________\nBaketivity Kids Baking DIY Activity Kit ($29.99, originally $32.99; amazon.com)\nBaketivity Kids Baking DIY Activity Kit\nWith each kit including everything you need to make chocolate chunk cookies, cupcakes or granola bars and more, this is a gift both you and your kids will enjoy.\nAges 8-12\nThe One Smart Piano Keyboard ($299.99; amazon.com)\nThe One Smart Piano Keyboard\nPiano lessons are a great way to develop musical ability and interest in kids. But not everyone has the room (or the budget) for a full-on piano. Plus it can be tough to squeeze lessons into our kids' extracurricular-packed schedules. Now that their schedules have been temporarily cleared, look to this smart keyboard. It uses an app to make learning to play piano easier for kids, with interactive games, simple \"crash\" courses and more than 4,000 pieces of LED-guided sheet music.\n_______________________________________________________________________________\nJolly Time Popcorn Ball Maker ($6.02; amazon.com)\nJolly Time Popcorn Ball Maker\nWe predict plenty of movie-watching over the next few weeks, so let's put a fresh spin on the popcorn. With this easy kit, creating Insta-worthy (and then, yummy) popcorn balls is as much fun as watching the movie. Maybe more.\n_______________________________________________________________________________\nCelestron Microscope Kit ($39.63, originally $47.95; amazon.com)\nCelestron Microscope Kit\nOver the last month or so, teachers have been talking more than usual about biology and science to help kids get a grasp on what the coronavirus is (and isn't). So with your tween's interest in science primed, keep it going with this starter microscope kit. It magnifies from 40x to 600x and comes with lots of accessories, including slides of a rock, honeybee wing and brine shrimp.\n_______________________________________________________________________________\nOur Moments: Kids Edition ($18.95; amazon.com)\nOur Moments: Kids Edition\nThis is a great tool for reconnecting with your tween while you both have some unexpected time on your hands. Each card in this parent-guided game has a question that gets kids talking. Think: \"What three words describe you?\" and \"What scares you the most and why?\"\n_______________________________________________________________________________\nEat2explore Box ($24.95; amazon.com)\nEat2explore Box\nIf your kid is a foodie in the making (or just likes to help out in the kitchen), pick up an eat2explore box. They're stuffed with the (nonperishable) makings of dishes, such as arroz con pollo or beef shawarma, from your kid's pick of nine different countries. This sure beats the food in the school cafeteria.\n_______________________________________________________________________________\nFantasma Astounding Magic Set of 150 Tricks ($19.99; target.com)\n3 Bees & Me Deluxe Magic Kit Set\nPacked with some of the most popular classic magic tricks — from the magic cup and ball to the levitating wand — this is sure to occupy their time for hours and hours.\nAges 13-17\nRosetta Stone Homeschool ($65.94, originally $109, for a six-month subscription; rosettastone.com)\nRosetta Stone Homeschool\nForeign language classes may well be the ones where high school students are most prone to backslide after weeks away. Help them retain what they've already learned and keep progressing with an online Rosetta Stone subscription. The lessons (available in more than 25 languages) are easily downloaded on any mobile device. Your student can start the lessons at any level, and will build fluency through an immersive, proprietary plan combining photos, spoken words and written words.\n_______________________________________________________________________________\n'Better with Books: 500 Diverse Books to Ignite Empathy and Encourage Self-Acceptance' ($11.79; originally $19.95; amazon.com)\n\"Better with Books: 500 Diverse Books to Ignite Empathy and Encourage Self-Acceptance\"\nReading for pleasure is shown to decrease anxiety, and even stoic teens can be uneasy in times like this. Hand your high schooler a copy of this compilation of reviews and snippets of modern, diverse, youth-geared novels to read during the school hiatus. The titles — including such favorites as \"The Hate U Give,\" \"Dumplin',\" \"The Miseducation of Cameron Post\" and \"The One and Only Ivan\" — tackle topics including race, mental health, religion, LGBTQIA issues and disabilities.\n_______________________________________________________________________________\nBuild Your Own Pinball Game ($49.95; uncommongoods.com)\nBuild Your Own Pinball Game\nSure, video games are cool, but have your kids ever created a game of their own? This kit includes everything you need to create your own fully functional, rubber-band-powered cardboard pinball machine.\n_______________________________________________________________________________\nHunt a Killer Immersive Murder Mystery Experience ($25.46 for one box, subscriptions available; amazon.com)\nHunt a Killer Immersive Murder Mystery Experience\nThis is perfect for when you need a break from pandemic updates or when you want an activity that the family can do together. It's like an Escape Room experience delivered to your door. In each box are cleverly crafted clues that require collaboration to decipher. The group goes through six \"episodes\" before the killer is finally caught. An online forum has teens exchanging hunches and speculating on the next twist in the narrative.\n_______________________________________________________________________________\nSTMT DIY Custom Candles ($16.99; target.com)\nSTMT DIY Custom Candles\nCrafty younger teens will love creating sweetly scented candles in personalized tins, either for themselves or their besties. They can come up with their own \"recipes\" for fragrances, with options that include sweet orange and rose. Lavender, too, which is known to be relaxing — just the scent we all want wafting through our homes right about now.\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/19/cnn-underscored/how-to-entertain-kids/index.html"}