{"authors": [], "date_download": "2020-05-04 20:07:40", "date_modify": "2020-05-04 20:07:40", "date_publish": "2020-04-08 13:26:37", "description": "JONESBORO, Ark. (AP) — Arkansas State University was placed on lockdown for several hours after a student was shot in the leg early Wednesday in the parking lot of a campus apartment complex,...", "filename": "_411e794ca175b7a4ff71e75459c7f4b0_1588622860.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_411e794ca175b7a4ff71e75459c7f4b0_1588622860.html", "title": "Arkansas State University student injured in campus shooting", "title_page": "Arkansas State University student injured in campus shooting", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JONESBORO, Ark. (AP) — Arkansas State University was placed on lockdown for several hours after a student was shot in the leg early Wednesday in the parking lot of a campus apartment complex, officials said.\nUniversity police issued a shelter-in-place warning following the shooting, then lifted it at about 5 a.m., Chancellor Kelly Damphousse said in a letter to students, faculty and staff.\nA student was shot in the leg “by an unknown assailant,” the chancellor said. The student is being treated for an injury that isn’t considered life-threatening, he said.\nAuthorities didn’t immediately say what led to the shooting. No arrests have been made.\nIn-person classes were previously canceled because of the coronavirus pandemic but about 700 of the school’s roughly 14,000 students remain on campus, Jonesboro TV station KAIT reported.\nArkansas State is in Jonesboro, which was struck last month by an EF3 tornado. The campus itself did not sustain major damage but hundreds of homes were damaged or destroyed in the city.\n“I know that this news is frightening, especially given all that our campus has gone through the past month,” Damphousse’s letter said. “I mourn the fact that we all have one more burden to bear.”", "url": "https://apnews.com/411e794ca175b7a4ff71e75459c7f4b0"}