{"authors": ["Matthew Barakat"], "date_download": "2020-05-04 20:05:14", "date_modify": "2020-05-04 20:05:14", "date_publish": "2020-04-09 21:35:36", "description": "FALLS CHURCH, Va. (AP) — A judge in southwest Virginia on Thursday ejected a lawsuit that sought to carve ought a religious exemption to Gov. Ralph Northam's executive order requiring people to...", "filename": "_743bc0bfb46bcbd6d121921bffc33838_1588622714.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8ef070aa104d44ee9228b3bfafce44ea/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_743bc0bfb46bcbd6d121921bffc33838_1588622714.html", "title": "Judge rejects lawsuit over order; no religious exemption", "title_page": "Judge rejects lawsuit over order; no religious exemption", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "An empty sanctuary awaits parishioners on Palm Sunday at Saint Mary's Catholic Church Sunday April 5, 2020, in Richmond, Va. The church is not holding Mass but is opening the sanctuary for prayer. (AP Photo/Steve Helber)\nAn empty sanctuary awaits parishioners on Palm Sunday at Saint Mary's Catholic Church Sunday April 5, 2020, in Richmond, Va. The church is not holding Mass but is opening the sanctuary for prayer. (AP Photo/Steve Helber)\nFALLS CHURCH, Va. (AP) — A judge in southwest Virginia on Thursday ejected a lawsuit that sought to carve ought a religious exemption to Gov. Ralph Northam’s executive order requiring people to stay at home.\nRussell County resident Larry Hughes filed the lawsuit this week. He said the governor’s stay-at-home order to combat the spread of the coronavirus infringed on his religious freedom and sought, at a minimum, an exception that would allow attendance at Easter services this Sunday.\nDemocratic Attorney General Mark Herring’s office defended the executive order during a hearing Thursday.\nRussell County Circuit Court Judge Michael Moore left the executive order intact after a hearing Thursday and denied the request for an injunction. The hearing was conducted by phone and was not open to the public.\nHerring’s office argued that the order should remain intact because carving out an exemption “would seriously undermine the Commonwealth’s efforts to slow the spread of a once-in-a-century pandemic.”\nHerring’s brief also noted that the order allows for gatherings of 10 or fewer people, and that many churches and religious groups are conducting services online or by other creative means.\nHughes’ lawyer, Terrence Shea Cook, said the executive order treated religion unfairly by explicitly excluding religious gatherings of more than 10 people while imposing no such explicit restraint on media organizations.\n“It contains the value judgment that freedom of religion is less important than freedom of the press,” Cook wrote.\nAmericans United for Separation of Church and State filed a brief supporting the governor as well. Lawyer Victor Glasberg wrote that granting an exemption for churches “would elevate the religious beliefs of some over the health of the entire community.”\nIn a written statement, Herring said he was pleased with the ruling.\n“We are all having to sacrifice right now to keep ourselves, our loved ones, and our communities safe and our win today maintains these crucial safety measures,” he said.\nTwo similar lawsuits have been filed in federal court in Alexandria. One seeks a religious exemption to the order similar to what was sought in the Russell County case. Another lawsuit challenges the executive order in its entirety.\nMost states are now under stay-at-home orders because of the coronavirus pandemic ; some states carved a religious exemption, but most did not.", "url": "https://apnews.com/743bc0bfb46bcbd6d121921bffc33838"}