{"authors": ["Alaa Elassar"], "date_download": "2020-05-04 15:57:12", "date_modify": "2020-05-04 15:57:12", "date_publish": "2020-04-12 10:01:08", "description": "Like most mothers of health care workers whose children are on the frontlines of the dangerous battle against the pandemic, Norton felt like she had no way of helping her daughter. That was until a quick, spur of a moment decision led her to cover Kerr in a bed sheet and give her a big hug.", "filename": "2020_04_12_us_mom-nurse-daughter-sheet-hug-coronavirus-trnd_index_1588607832.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409105523-mom-daughter-hug-coronavirus-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_us_mom-nurse-daughter-sheet-hug-coronavirus-trnd_index_1588607832.html", "title": "A mom of an ICU nurse covered her daughter with a bed sheet to give her a hug", "title_page": "A mom of an ICU nurse covered her daughter with a bed sheet to give her a hug  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Millions of people around the world are wishing for something they took for granted before the coronavirus pandemic changed life as we know it. For Cheryl Norton, that something is a hug from her daughter.\nNorton's daughter, Kelsey Kerr, is an ICU nurse at Christ Hospital in Ohio. Although Kerr hasn't had to interact with any coronavirus patients yet, she is still afraid of an uncertain future.\nLike most mothers of health care workers whose children are on the frontlines of the dangerous battle against the pandemic, Norton felt like she had no way of helping her daughter. That was until a quick, spur of a moment decision led her to cover Kerr in a bed sheet and give her a big hug.\n\"For a single second, everybody else was gone and I was just hugging my daughter,\" Norton told CNN. \"It was like she was safe for that one minute and I could take it all away from her.\"\nCheryl Norton (left) and her daughter, Kelsey Kerr (right).\nKerr had been visiting her mom to pick up prayer shawls to give to her patients at the ICU as a way to ease the pain of being at the hospital alone due to the hospital's visitor restrictions.\nRead More", "url": "https://www.cnn.com/2020/04/12/us/mom-nurse-daughter-sheet-hug-coronavirus-trnd/index.html"}