{"authors": ["Jordan Valinsky", "Cnn Business"], "date_download": "2020-05-04 16:26:44", "date_modify": "2020-05-04 16:26:44", "date_publish": "2020-04-07 15:44:37", "description": "Not even a nearly $40 billion divorce can topple Amazon founder and CEO Jeff Bezos from being the world's richest person.", "filename": "2020_04_07_business_forbes-billionaire-list-2020_index_1588609604.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190703143717-02-jeff-bezos-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_forbes-billionaire-list-2020_index_1588609604.html", "title": "Jeff Bezos tops Forbes list of billionaires, again", "title_page": "Forbes' 2020 billionaires list: See who tops this year's roundup - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Not even a nearly $40 billion divorce can topple Amazon (AMZN) founder and CEO Jeff Bezos from being the world's richest person.\nFor the third year in a row, Bezos landed the top spot on Forbes' rank of global billionaires . His net worth fell $18 billion last year to $113 billion, according to Forbes, partially due to his high-profile split from MacKenzie Bezos. Amazon's stock rose 15% last year, helping offset some of that loss.\nMacKenzie Bezos also made her first appearance on the list, thanks to the $38 billion divorce settlement. As part of the settlement, she got 25% of the couple's Amazon stock . She now ranks 22nd on Forbes' list.\nForbes revealed the 34th edition of list Tuesday. The list takes into account some of the coronavirus pandemic, which has thrown global markets into a panic over the past few months. For the first half of March, 226 people lost their billionaire status and there are 58 fewer billionaires compared to the same time last year. In total, Forbes counted 2,095 billionaires.\n\"Of the billionaires who remain, 51% are poorer than they were last year. In raw terms, the world's billionaires are worth $8 trillion, down $700 billion from 2019,\" Forbes said.", "url": "https://www.cnn.com/2020/04/07/business/forbes-billionaire-list-2020/index.html"}