{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:25:28", "date_modify": "2020-05-04 20:25:28", "date_publish": "2020-04-20 07:12:06", "description": "The Latest on the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can...", "filename": "_7dd7d778e8a3fe1df478f9b5270c1a0c_1588623928.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c5a2237941d8400dbf6f0eb88833b925/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7dd7d778e8a3fe1df478f9b5270c1a0c_1588623928.html", "title": "The Latest: Massachusetts becoming new virus hotspot", "title_page": "The Latest: Massachusetts becoming new virus hotspot", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People wear masks to protect against the spread of the coronavirus keep safe distance as they queue in front of a shopping mall to by food at La Defense business district in Paris, Monday, April 20, 2020. A flood of new research suggests that far more people have had the Covid-19 without any symptoms, fueling hope that it will turn out to be much less lethal than originally feared. (AP Photo/Michel Euler)\nPeople wear masks to protect against the spread of the coronavirus keep safe distance as they queue in front of a shopping mall to by food at La Defense business district in Paris, Monday, April 20, 2020. A flood of new research suggests that far more people have had the Covid-19 without any symptoms, fueling hope that it will turn out to be much less lethal than originally feared. (AP Photo/Michel Euler)\nThe Latest on the coronavirus pandemic. The new coronavirus causes mild or moderate symptoms for most people. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nTOP OF THE HOUR:\n— France surpasses 20,000 coronavirus deaths.\n— Mexican president asks drug cartels to stop handing out aid packages.\n— Number of daily deaths in New York state continues to drop.\n— WHO chief says “worst is yet ahead of us” in virus outbreak.\n___\nBOSTON — Massachusetts has become a hotspot of coronavirus infections, drawing the concern of federal officials and promises of aid from hard-hit New York.\nThe state’s death toll is expected to surpass 2,000 this week, doubling in less than a week. Officials are scrambling to boost hospital capacity and trace new infections to curb the spread of the disease.\nVice President Mike Pence has said the White House is closely watching the Boston area. The coordinator of the federal coronavirus task force, Dr. Deborah Birx, said officials are “very much focused” on Massachusetts. There were 146 new deaths reported in Massachusetts on Sunday, bringing the state’s death toll to more than 1,700.\n___\nPARIS — France has reported more than 20,000 deaths attributed to the new coronavirus since the pandemic began, surpassing the deadly heat wave that hit the country in 2003.\nThe head of the national health agency, Jerome Salomon, said France passed a “very painful, symbolic mark” by registering 12,513 deaths in hospitals and 7,752 in nursing homes as of Monday.\nThe country has not been counting people who die with the virus at home.\nSalomon said the virus has killed more people than have died from the flu in any single winter in the country and more than the 2003 heat wave that left 19,000 people dead.\nHe said that the epidemic in France has reached a high “plateau” that’s trending slowly downward.\nThere were 5,683 patients in intensive care across the country, a number that dropped for the 12th straight day.\n___\nMEXICO CITY — Mexico’s president acknowledged Monday that drug cartels have been handing out aid packages during the coronavirus pandemic, and called on them to stop.\nPresident Andrés Manuel López Obrador said such handouts have occurred “in several places,” but said the government can’t stop the practice.\n“It is something that happens, it cannot be avoided,” López Obrador said.\n“I don’t want to hear them saying, ‘We are handing out aid packages,’” he said. “No, better that they lay off, and think of their families, and themselves, those that are involved in these activities and who are listening to me now or watching me.”\nVideos posted on social media have shown one of the daughters of imprisoned drug lord Joaquin “El Chapo” Guzman handing out boxes of rice, pasta, cooking oil and toilet paper with Guzman’s image printed on them.\n___\nANKARA, Turkey — Turkish President Recep Tayyip Erdogan has announced a four-day curfew in 31 provinces to stem the spread of the coronavirus.\nIn an address to the nation following a Cabinet meeting on Monday, Erdogan said the curfew will take effect on April 23, which is a public holiday in Turkey, and end at midnight on Sunday, April 26.\n“The aim is to reduce the spread of the outbreak in a way that will make a return to normal after the Ramadan holiday possible,” Erdogan said, in reference to a four-day holiday that starts on May 24 in Turkey and marks the end of the holy Muslim month of fasting.\nErdogan’s government has not imposed a total lockdown, fearing its negative impacts on the already frail economy. It has opted for piecemeal measures instead, including weekend curfews and banning people above the age of 65 and below the age of 20 from leaving homes.\nTurkey’s confirmed coronavirus cases rose by 4,674 in the past 24 hours to reach a total of 90,980. The reported death toll rose by 123 for a total of 2,140.\nErdogan also said Turkey plans to repatriate as many as 25,000 Turks in several countries before the Ramadan holiday.\n___\nBELGRADE, Serbia — Serbia’s defense minister says the army has been guarding 20 camps for asylum seekers in the Balkan country. The military presence is intended to make sure all migrants stay inside as part of strict measures against the new coronavirus.\nDefense minister Aleksandar Vulin said Monday there are some 8,000 migrants in Serbia who are faced with a 24-hour daily curfew. Vulin says migrants occasionally attempt to leave the camps but are stopped by the army.\nSerbia has imposed a state of emergency and deployed the army to help contain the virus. Troops have been deployed outside hospitals and took part in setting up emergency facilities.\nSerbia has reported 6,630 cases of COVID-19 while 125 people have died. Health authorities have said the situation has stabilized in the past several days, allowing for easing of some restrictions.\nMigrants from the Middle East, Africa or Asia travel through Serbia while trying to reach Western Europe after fleeing violence and poverty in their home countries.\n___\nSARAJEVO, BOSNIA-HERZEGOVINA — More people appear to be joining a hunger strike in Bosnia over alleged failure by the authorities to protect them from the new coronavirus while forcing them to quarantine in government-run facilities.\nAccording to hunger strikers, close to 80 people currently held in quarantine in a hotel in the central town of Zenica started refusing food Monday and were soon joined by 150 others who have been quarantined in a student dormitory in Sarajevo.\nHundreds of Bosnians who rushed home amid the coronavirus pandemic were ordered to quarantine in those and other facilities for anywhere between 14 and 28 days.\nHunger strikers said they were refusing food to pressure authorities into allowing them to self-isolate in their homes.\n“Here, we all mix in hallways and if one of us is infected, we will all get infected,” Mirsad Susic, a hunger striker in Zenica, told the Associated Press by phone.\nSusic claimed the the people who are currently quarantined in Zenica, some of them for over two weeks, have yet to be tested for COVID-19.\n___\nPRAGUE — The Czech government has approved a record high budget deficit as it tries to cope with the impact of the coronavirus pandemic.\nFinance Minister Alena Schillerova says the deficit for this year should reach 300 billion Czech crowns ($11.9 billion).\nPreviously, the biggest deficit was 192 billion crowns ($7.6 billion) in 2009 during the global economic downturn.\nThe government had already increased the deficit to 200 billion crowns, five times more than originally predicted.\nMonday’s announcement comes amid the easing of restrictive measures adopted in response to the outbreak. Outdoor farmers markets and car dealerships reopened on Monday, while professional athletes were allowed to return to outdoor training in small groups of eight. Also, weddings with up to 10 people can take place.\nThe Czech Republic has 6,838 infected people and 194 have died, according to Health Ministry figures released Monday.\n___\nTIRANA, Albania — Albania has sent a second group of 60 nurses to help nearby Italy care for COVID-19 patients in its hospitals.\nHealth Minister Ogerta Manastirliu said the nurses will serve in the most virus-hit zones in northern Italy.\nMentioning words from Mother Teresa, who is of Albanian origin, she said that Albania is a tiny country, “but the ocean would be smaller without that drop of water.”\nAt the end of March, Albania sent 30 doctors and nurses, a move hailed in Italy and internationally. They are serving in the Italian region of Brescia.\nAlbania has reported 584 cases of the coronavirus, with 26 deaths.\n___\nNEW YORK — The number of people dying from COVID-19 in New York state continues to slowly drop, with 478 fatalities tallied on Sunday. It was a third straight day of decreases and the lowest death toll since April 1, when 432 people died.\nThe state tally excludes more than 4,000 New York City deaths that were blamed on the virus but weren’t confirmed by a lab test.\nThe total number of hospitalizations remained largely unchanged at more than 16,000 and the number of new admissions remained largely flat at above 1,300, Gov. Andrew Cuomo said Monday at his daily briefing.\nAfter weeks of increases in deaths and hospitalizations in the epicenter of the U.S. outbreak, Cuomo said the big question now is how fast the descent will be if New Yorkers continue to abide by social distancing restrictions.\n“Does it take two weeks for it to come down? Some projections say that. Does it take a month? Some projections say that,” Cuomo said. “The projections are nice, but I wouldn’t bet the farm on it.”\n___\nMILAN — The Venice Biennale has confirmed the dates for this year’s international film festival, from Sept. 2-12, despite the ongoing coronavirus pandemic.\nThe Biennale postponed and curtailed this year’s architectural biennale show, which will run from Aug. 29-Nov. 29. The Venice Biennale is the oldest among the world’s premier film festivals, and usually overlaps with the Toronto Film Festival. Cannes, which usually runs in May, has postponed but not canceled this year’s edition.\n___\nBRATISLAVA, Slovakia — Slovakia’s prime minister has unveiled a plan to gradually ease restrictions imposed to contain the coronavirus pandemic.\nPrime Minister Igor Matovic says the plan set to go ahead on Wednesday will relax the restrictive measures in four stages.\nAt the same time, Matovic said on Monday the rules on social distancing, an order for everyone to wear face masks in public and a limited number of customers in stores will remain in place.\nThe first stage will include the reopening of stores with a surface of up to 300 square meters (3,230 square feet), car dealerships and outdoor markets.\nThe other stages should take place in two-week intervals, depending on the development of the outbreak.\nSlovakia has recorded 1,173 cases of the virus, though a relatively low number of people have been tested. Thirteen people have died.\n___\nGENEVA — The head of the World Health Organization has warned that “the worst is yet ahead of us” in the coronavirus outbreak, raising new alarm bells about the pandemic just as many countries are beginning to ease restrictive measures.\nWHO Director-General Tedros Adhanom Ghebreyesus didn’t specify why he believed that the outbreak that has infected nearly 2.5 million people and killed over 166,000, according to figures compiled by Johns Hopkins University, could be even worse.\nTedros also alluded to the so-called Spanish flu in 1918 as a reference for the coronavirus outbreak.\n“It has a very dangerous combination and this is happening in hundred years for the first time again, like the 1918 flu that killed up to 100 million people,” he told reporters in Geneva. “But now we have technology, we can prevent that disaster, we can prevent that kind of crisis.”\n“Trust us. The worst is yet ahead of us,” he said. “Let’s prevent this tragedy. It’s a virus that many people still don’t understand.”\n___\nLONDON — British treasury chief Rishi Sunak says some 140,000 firms have applied to take part in a government program meant to help companies keep paying workers who have been furloughed amid the COVID-19 crisis.\nThe program, the Coronavirus Job Retention Scheme, opened Monday. The grants will help pay the wages of more than a million people.\nSunak says that “a million people who if they hadn’t been furloughed would have been at risk of losing their job. Firms applying today should receive their cash in six working days.”\nThe program allows employers to claim cash grants worth up to 80% of wages, capped at 2,500 pounds ($3,100) a month per worker.\n___\nROME — Italy has marked the two-month anniversary of its coronavirus outbreak by registering its first-ever drop in the number of currently infected patients.\nCivil protection chief Angelo Borrelli said Monday the 108,237 currently infected was 20 fewer than a day earlier, “another positive point” in Italy’s general trend of easing pressure on the health care system.\nOverall, Italy has had a total of 181,228 confirmed cases, up just 1.2% from a day earlier in one of the lowest day-on-day increases. Another 484 people died, bringing its toll to 24,144, the highest in Europe and second only to the U.S.\nItaly’s outbreak began two months ago when a 38-year-old Unilever employee tested positive in the Lombardy city of Codogno. After the test was confirmed Feb. 21, the man spent weeks in intensive care as his pregnant wife tested positive and his father died. He was released from the hospital in time to be home to welcome baby Giulia.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/7dd7d778e8a3fe1df478f9b5270c1a0c"}