{"authors": ["Reporter"], "date_download": "2020-05-04 20:25:31", "date_modify": "2020-05-04 20:25:31", "date_publish": "2020-04-29 22:35:36", "description": "North Carolina Sen. Thom Tillis' remarks came the same day Vice President Mike Pence refused to wear a mask while visiting the Mayo Clinic as required.", "filename": "entry_gop-senator-elected-officials-lead-example-follow-coronavirus-guidelines_n_5ea9f75bc5b633a85444d5c7_1588623931.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9fa1a220000640d827e36.jpeg?cache=jz88bwafmo&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_gop-senator-elected-officials-lead-example-follow-coronavirus-guidelines_n_5ea9f75bc5b633a85444d5c7_1588623931.html", "title": "GOP Senator Calls On Elected Officials To 'Lead By Example' And Follow Coronavirus Guidelines", "title_page": "GOP Senator Calls On Elected Officials To 'Lead By Example' And Follow Coronavirus Guidelines | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The North Carolina Republican’s comments were part of an interview with Adam Morgan, co-founder of North Carolina-based talent-recruiting company SC, which has created a webinar series about leadership during the coronavirus pandemic.\n“I’m trying to lead by example, do what I’m asking others to do. And I think that’s what every, every elected official must do,” Tillis said of guidelines meant to slow the spread of COVID-19, the disease caused by the virus. “The last thing I want to do is see an elected official who is responsible for imposing a stay-at-home order, or a wear-a-facial-mask order, out in public and not with a mask on.”\nThe interview was released the same day Pence decided against wearing a face mask during a visit to the Mayo Clinic’s campus in Minnesota, flouting the organization’s mandatory masking policy amid the pandemic. The vice president defended his choice later during Tuesday’s coronavirus briefing.\n“As vice president of the United States, I’m tested for the coronavirus on a regular basis, and everyone who is around me is tested for the coronavirus,” Pence told White House pool reporters. “And since I don’t have the coronavirus, I thought it’d be a good opportunity for me to be here, to be able to speak to these researchers, these incredible health care personnel and look them in the eye and say thank you.”\nA spokesperson for Tillis’ office did not immediately respond to HuffPost’s request for comment on whether the senator was referring to Pence in his remarks, and if he wanted to say anything now about the vice president’s Mayo Clinic visit.\nEarlier this month, President Donald Trump announced guidelines from the Centers for Disease Control and Prevention that recommended people wear cloth face masks while carrying out essential activities in public places where social distancing may be difficult to maintain. Trump said he did not plan to follow the guidance, saying: “I just don’t see it.”\nTillis stressed in his interview Tuesday that protecting Americans from getting infected and potentially killed by COVID-19 is a nonpartisan issue, and that Democrats and Republicans alike must be doing all that they can to prevent further spread of the virus.\n“You never forget your ideology, but right now so much of what we’re dealing with is based on a crisis response where you kind of check your red jersey or your blue jersey at the door, and do what you have to do to solve the problem,” he said.\nOn Wednesday, Trump said that the federal government’s coronavirus social distancing guidelines will be “fading out” when they expire Thursday, relying solely on states to take responsibility as they look toward when and how to safely reopen the economy.\nThe White House said its cautionary guidance issued 45 days ago has been incorporated into recommendations given to states on how they can start gradually easing restrictions.\nMany mostly Democratic governors who have coronavirus hotspots in their states are hesitant to immediately reopen the economy, creating phased plans to open up businesses and public spaces while making sure the rate of infections and deaths continue moving downward. But some GOP governors are already reopening their states on their own terms, which doesn’t always include social distancing requirements.\nTillis himself has evolved when it comes to taking public health precautions seriously. In 2015, the then-freshman senator said he believed that restaurant employees should not be required to wash their hands.", "url": "https://www.huffpost.com/entry/gop-senator-elected-officials-lead-example-follow-coronavirus-guidelines_n_5ea9f75bc5b633a85444d5c7"}