{"authors": ["Matt Egan", "Cnn Business", "Former Fdic Chair Sheila Bair"], "date_download": "2020-05-04 16:54:16", "date_modify": "2020-05-04 16:54:16", "date_publish": "2020-04-08 15:56:14", "description": "The Federal Reserve is temporarily letting Wells Fargo out of the penalty box, freeing the troubled bank to aggressively lend to small businesses struggling to survive the coronavirus crisis.", "filename": "2020_04_08_business_wells-fargo-small-business-coronavirus_index_1588611256.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408112156-wells-fargo-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_wells-fargo-small-business-coronavirus_index_1588611256.html", "title": "Fed lifts restrictions on Wells Fargo", "title_page": "Fed lifts restrictions on Wells Fargo - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The Federal Reserve is temporarily letting Wells Fargo out of the penalty box, freeing the troubled bank to aggressively lend to small businesses struggling to survive the coronavirus crisis.\nThe Fed said in a statement Wednesday it is easing the growth restrictions , first imposed onin 2018, because of the \"extraordinary disruptions from the coronavirus.\"\nThe change will allow Wells Fargo to participate only in emergency programs designed to help companies harmed by the health crisis, including a forgivable loan program for small businesses. The Fed said the so-called asset cap will be snapped back on once those emergency programs are inactive.\nIn response, Wells Fargo said it will immediately expand its participation in the forgivable loan program, known as the Payroll Protection Program , by offering loans to a broader set of small businesses and nonprofits. Wells Fargo, one of the nation's largest lenders to small businesses, said it received more than 170,000 indications of interest in the program during the first two days alone.\nThis will add much needed capacity to the government's small business lending efforts.\"\n\"This action by the Federal Reserve will enable Wells Fargo to provide additional relief for our customers and communities,\" Wells Fargo CEO Charlie Scharf said in a statement.\nWells Fargo said customers will be able to begin the process Wednesday afternoon through the bank's PPP website. It is open only to customers with a Wells Fargo business checking account as of February 15 who are enrolled in business online banking.\nThe Fed won't allow Wells Fargo to profit from these loans. Instead, the bank will be required to donate benefits from the emergency programs to the US Treasury or Fed-approved nonprofits.\n'Common sense' move by the Fed\nThe asset cap was imposed to punish Wells Fargo for a series of scandals and did not restrict the bank's specific activities. Still, some say those tough sanctions were unintentionally penalizing small businesses hurt by the health crisis.\nThat's because before the coronavirus crisis, Wells Fargo was brushing up against the $2 trillion cap to its assets. That limited the bank's flexibility to make new loans -- without selling existing ones. And Wells Fargo customers may have struggled to get these loans from banks they didn't previously have a relationship with.\nsuggested the asset cap was limiting its ability to participate in the . Wells Fargo previouslysuggested the asset cap was limiting its ability to participate in the forgivable loan program\nEven some critics of big banks, such as former FDIC chief Sheila Bair, urged the Fed in recent days to temporarily take the shackles off Wells Fargo.\n\"I applaud the Fed's decision,\" Bair, who led the FDIC during the 2008 financial crisis, told CNN Business on Wednesday. \"This will add much needed capacity to the government's small business lending efforts.\"\nDennis Kelleher, CEO of financial reform nonprofit Better Markets, called the Fed's move \"common sense\" and applauded the temporary and targeted nature of the relief.\n\"In the extraordinary circumstances caused by the pandemic, whatever gets help to Main Street businesses the fastest should be done,\" said Kelleher, who last month called for the Fed to lift the asset cap. \"The Fed, to its credit, recognizes that Wells Fargo was ideally situated to provide that relief to Main Street, but for the cap.\"\nThis doesn't end Wells Fargo's troubles\nWells Fargo has been mired in scandal since September 2016, when the bank admitted its workers created millions of fake bank and credit card accounts to meet wildly unrealistic sales goals.\nBut that was just the tip of the iceberg. Wells Fargo has since admitted to charging thousands of customers for auto insurance they didn't need, causing some of them to have their vehicles wrongfully repossessed . The bank also imposed unwarranted mortgage fees on potential homebuyers and has been accused of mistreating workers, i ncluding whistleblowers.\nThe Fed's moves Wednesday do not mean Wells Fargo's regulatory troubles are over. The Fed's statement said it \"continues to hold the company accountable\" for addressing the \"widespread breakdowns\" that harmed consumers. Under the 2018 consent order, Wells Fargo must fix these breakdowns before the Fed will lift the sanctions.\nScharf, who in 2019 became Wells Fargo's fourth CEO in as many years, acknowledged the bank's work is not nearly over.\n\"The Federal Reserve's action does not -- and should not -- in any way relieve us of our obligations under the consent order,\" Scharf said. \"The consent order exists because of deficiencies that have existed at Wells Fargo for years.\"\nScharf said that although fixing these problems is Wells Fargo's \"top priority,\" he acknowledged \"we still have much to do.\"\nAlthough Wells Fargo won't profit directly from the Fed moves, the developments are a win for a bank hurting from years of scandal and a public relations nightmare.\n\"This is still positive for Wells Fargo,\" Jaret Seiberg, analyst at Cowen Washington Research Group, wrote in a note to clients Wednesday.\nIn particular, Wells Fargo can strengthen its relationship with existing customers -- instead of sending them away to rival banks.\n\"That preserves the value of its small business franchise,\" Seiberg said.", "url": "https://www.cnn.com/2020/04/08/business/wells-fargo-small-business-coronavirus/index.html"}