{"authors": ["Hadas Gold", "Cnn Business"], "date_download": "2020-05-04 16:14:21", "date_modify": "2020-05-04 16:14:21", "date_publish": "2020-04-03 13:32:06", "description": "Countries across Europe are looking to launch tracking apps to fight the spread of the coronavirus, without raising the kinds of privacy concerns that surround similar technology used elsewhere.", "filename": "2020_04_03_tech_coronavirus-tracing-app-uk-europe_index_1588608861.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402113533-woman-smartphone-germany-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_tech_coronavirus-tracing-app-uk-europe_index_1588608861.html", "title": "Can you use apps to track coronavirus and protect data? Europe's going to try", "title_page": "Can you use apps to track coronavirus and protect data? Europe's going to try - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Countries across Europe are looking to launch tracking apps to fight the spread of the coronavirus, without raising the kinds of privacy concerns that surround similar technology used elsewhere.\nWhile the apps will be optional, developers and policymakers hope the region's strict data laws will encourage widespread adoption by members of the public and help prevent a new wave of cases once lockdowns are lifted.\nSingapore has already successfully launched such an app. It notifies users via bluetooth connection if they have been in the vicinity of someone who has tested positive for the virus.\nBut Singapore has fewer privacy protections in place — though the government says the information on the app is encrypted and deleted after 21 days. China has utilized similar tracking apps or apps monitoring people in quarantine, which mark down their exact locations and information, all of which is shared with authorities.\nAcross Europe, developers and medical experts are looking to launch opt-in apps that they say will help health officials stem the spread of the virus while protecting personal privacy.\nThe United Kingdom's National Health Service told CNN it is \"looking at whether app-based solutions might be helpful in tracking and managing coronavirus, and we have assembled expertise from inside and outside the organization to do this as rapidly as possible.\"\nExperts at Oxford University are helping the NHS develop the app. Professor Christophe Fraser from Oxford University's Big Data Institute, said in a statement the app would control transmission rates even more effectively than the social distancing rules currently in place.\n\"Our analysis suggests that about half of transmissions occur in the early phase of the infection, before you show any symptoms of infection,\" Fraser said. \"Traditional public health contact tracing approaches provide incomplete data and cannot keep up with the pace of this pandemic.\"\nSky News reported on Tuesday that the app could launch after the UK lockdown has lifted, on a voluntary basis.\nThe German government is also exploring the use of digital technology, such as a contact tracking app, to help break the chain of infection. Chancellor Angela Merkel said she would be prepared to use one herself.\n''It's clear that it would be on a voluntary basis, but if the testing of these apps shows them to be good... I would certainly be in favor of recommending this to citizens,\" Merkel told reporters.\nHow apps track the virus\nHere's how the smartphone app would work. Using bluetooth, it establishes a list of devices that have been in close contact with each other for a pre-defined period of time set by the country's health officials, such as 10 or 15 minutes. (Walking by someone on the street would not count as a connection).\nIf a person is subsequently diagnosed with coronavirus, they note that in the app and their status is verified by a health professional. The app then notifies all the connections listed in the patient's device, giving them the chance to self isolate or get tested.\nA group of 130 researchers, developers and scientific experts calling themselves the Pan-European Privacy Preserving Proximity Tracing (PEPP-PT), are volunteering their time to develop the backbone of an app that would be open for any country to use. By using the same backend technology, national apps could connect across borders to further strengthen contact tracing, while observing strict European data protection rules.\nChristian Boos, founder of German technology firm Arago, told CNN Business that for such apps to be successful, they need a large data set. That means 60% adoption and the ability to work across borders.\n\"We are providing this backbone in a trustworthy and well controlled, certified way,\" said Boos, who is helping to lead the initiative. The German data protection agency is advising the team on this project, he added.\nThe app is already being tested in an army barracks in Berlin and should be ready for launch on April 7, Boos said. The team has been working with several governments, with the aim of having every European country incorporate it into their health systems.\nKeeping it private\nBoos said the European version will anonymize user data and the smartphone's identifying information. If you test positive for Covid-19, your contacts won't know that it's you, only that they have been in sustained contact with someone who tested positive. Unless you choose to identify yourself, that is, perhaps at the request of a health care professional.\nAnd rather than hindering adoption, Europe's sweeping data privacy and processing rules under the General Data Protection Regulation (GDPR), in place since 2018, could help.\n\"GDPR has a clause excepting work in the overwhelming public interest. No one should constrain work on responding to coronavirus due to data protection law,\" UK Health Secretary Matt Hancock, who has recovered from the virus, tweeted last month. \"We are all having to give up some of our liberties; rights under GDPR have always been balanced against other public interests.\"\nSubhajit Basu, professor in Information Technology Law at the University of Leeds, said GDPR could encourage people to opt in because the legislation promises transparency in how and where your data is being processed, if not total privacy.\n\"It will give people the confidence that now we have a robust legal framework in place so whenever government chooses, even if it is a Chinese-style individual level location tracking of people, it will comply with the law, within GDPR,\" Basu told CNN Business.\nBut Basu warned that because of the GDPR caveat allowing data processing without the user's explicit consent in an emergency situation, governments would need to be \"much more transparent and ensure this data is kept securely.\"\n\"When you are facing a situation like this, it is critical that we trust our government that people trust the steps our government takes and protection of privacy is critical for that trust,\" he said. \"If our government takes disproportionate measures it will undermine our trust, it will not work, people will not download the app and won't update it.\"\n— Nadine Schmidt in Berlin contributed to this article.", "url": "https://www.cnn.com/2020/04/03/tech/coronavirus-tracing-app-uk-europe/index.html"}