{"authors": ["Alicia Wallace", "Cnn Business"], "date_download": "2020-05-04 17:02:26", "date_modify": "2020-05-04 17:02:26", "date_publish": "2020-04-10 18:11:45", "description": "Every week, Dr. Bronner's pumps out 110,000 gallons of liquid soap — about four or five backyard swimming pools' worth — and churns out about 150,000 handheld spray bottles of organic hand sanitizer.", "filename": "2020_04_10_business_dr-bron_37b6eccd8c7fe184f533fd326f9b1412_index_1588611746.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409142823-20200409-dr-bronners-lavender-tray-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_business_dr-bron_37b6eccd8c7fe184f533fd326f9b1412_index_1588611746.html", "title": "Dr. Bronner's had a hand sanitizer hangup: Not enough bottles", "title_page": "Dr. Bronner's had a hand sanitizer hangup: Not enough bottles - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "San Francisco (CNN Business) Every week, Dr. Bronner's pumps out 110,000 gallons of liquid soap — about four or five backyard swimming pools' worth — and churns out about 150,000 handheld spray bottles of organic hand sanitizer.\nNow the company's liquid soap production is 70% higher than average and hand sanitizer output is up 550% in response to consumers buying more hygiene products during the coronavirus pandemic.\nAs the Dr. Bronner's operations went into overdrive, the company encountered a surprise supply problem: It was running out of bottles.\n\"You get to a point where it's not how much they order, it's how much you can make,\" said Michael Bronner, president of the Vista, California-based company known for castile soaps and organic personal care products.\nHow much can be made is wholly dependent upon the integrity of the supply chain and the ability of that interconnected channel of businesses and goods to withstand sudden shocks.\nFor Dr. Bronner's, the past few weeks have included making adjustments on the fly, integrating past lessons-learned and adapting forecasting models for an unforeseen situation.\n\"A crisis is not the time to plan and build,\" said Michael Milam, Dr. Bronner's chief operating officer. \"The crisis is the time when the extraneous falls away and you see how strong your base systems work.\"\nOne effort that proved critical for Dr. Bronner's was an inventory forecasting and stress test system developed by Milam.\nThe first sign of a potential supply chain bottleneck came in February, when Dr. Bronner's international sales soared 790% and Pacific Rim distributors put in order requests for more hand sanitizer, Milam said.\nAlthough Dr. Bronner's recently invested in infrastructure upgrades for its liquid soap assembly line, scaling production for hand sanitizer wasn't a simple task. The products are required to be made at a US Food and Drug Administration-approved facility.\nAdding some complexity was the product itself: The liquid organic hand sanitizer is typically packaged in a two-fluid-ounce, bullet-shaped spray bottle with round shoulders. The eye-catching bottles are custom-colored in either purple or blue to reflect the essential oils of lavender or peppermint, respectively.\n\"Any production system is simply a descending stack of constraints,\" Milam said. \"I first thought that our constraint would be production capacity (blending and filling) at our primary contract manufacturer.\"\nBut when Milam scaled his inventory management model to account for a potential 250% increase in hand sanitizer orders, he saw how quickly Dr. Bronner's would draw down its supply of bottles.\nThe potential problem was flagged to Jonathan Landworth, the company's packaging broker.\nDr. Bronner's exhausted Plans A, B and C, getting whatever bottles it could from primary, secondary and tertiary suppliers.\nSo when Landworth had a line of 200,000 black, 2-ounce spray bottles with sharp shoulders, Milam and his crew pulled the trigger.\n\"It was under the auspices of 'better to ask forgiveness than permission' [of the Dr. Bronner's marketing team],\" Milam said, noting the black bottles are destined for a newly opened retail channel.\n\"I have to make a product,\" he said. \"I don't care what it looks like.\"\nEven though Dr. Bronner's spotted its potential bottle shortage early, its requests came amid heightened competition for machine time and packaging materials.\n\"Everybody was not just needing quantities but needing massive quantities and needing it soon,\" said Landworth, whose J. Landworth Company represents 30 clients and works with five dozen suppliers.\nThe demand pushed out lead times for packaging supplies. Now, it can take two months or more for some orders to be completed, Landworth said.\nAs the bottle scavenger hunt was under way, Milam continued a delicate volley of locking up machine time for production and ensuring the company had enough of the liquid assets of denatured alcohol and essential oils.\n\"We actually got through March,\" Milam said. \"We kind of ended on fumes, but we got through March.\"\nThrough the first three months of 2020, Dr. Bronner's hand sanitizer sales have outpaced their 2019 sales by 25%. And although production levels are up more than fivefold, the company is meeting just over half of its open orders, bringing the outstanding balance to 550,000 bottles.\n\"I'm still hopeful we'll get a few more kinks out and get to a more consistent 200,000 units per week,\" Milam said, noting he ordered bottles and pumps to meet that trajectory through at least September.\nHe continued: \"If I don't end up needing them immediately, that's OK. They have a pretty long shelf life, and the downside is holding some extra inventory for longer.\"", "url": "https://www.cnn.com/2020/04/10/business/dr-bronners-coronavirus-hand-sanitizer-bottles/index.html"}