{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:29:19", "date_modify": "2020-05-04 20:29:19", "date_publish": "2020-04-16 02:34:22", "description": "NEW YORK (AP) — Chris Cuomo, who late last month revealed he had tested positive for the coronavirus, said his wife Cristina has now also been infected. The CNN anchor made the announcement...", "filename": "_87016072b2afe15dc60fd82c010ab375_1588624159.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ecaacd25c711411997ab5abd885fc2a9/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_87016072b2afe15dc60fd82c010ab375_1588624159.html", "title": "Chris Cuomo says his wife, like him, has the coronavirus", "title_page": "Chris Cuomo says his wife, like him, has the coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chris Cuomo says his wife, like him, has the coronavirus\nFILE - This May 15, 2019 file photo shows CNN news anchor Chris Cuomo at the WarnerMedia Upfront in New York. Cuomo has announced that he has tested positive for the coronavirus. The prime-time host is one of the most visible media figures to come down with the disease. He said he's experienced chills, fever and shortness of breath. He promised to continue doing his show while in quarantine in the basement of his home. (Photo by Evan Agostini/Invision/AP, File)\nFILE - This May 15, 2019 file photo shows CNN news anchor Chris Cuomo at the WarnerMedia Upfront in New York. Cuomo has announced that he has tested positive for the coronavirus. The prime-time host is one of the most visible media figures to come down with the disease. He said he's experienced chills, fever and shortness of breath. He promised to continue doing his show while in quarantine in the basement of his home. (Photo by Evan Agostini/Invision/AP, File)\nNEW YORK (AP) — Chris Cuomo, who late last month revealed he had tested positive for the coronavirus, said his wife Cristina has now also been infected.\nThe CNN anchor made the announcement on the network Wednesday night during an interview with his brother, New York Gov. Andrew Cuomo.\n“Cristina now has COVID(-19). She is now positive. And it just breaks my heart,” Chris Cuomo said. “It is the one thing I was hoping wouldn’t happen, and now it has.”\nCuomo has continued to appear on air and has documented his health struggles with the coronavirus. He had quarantined himself at home in Long Island, New York, and said he was staying in the basement to make sure his wife and children did not get it.", "url": "https://apnews.com/87016072b2afe15dc60fd82c010ab375"}