{"authors": ["Opinion John Maa"], "date_download": "2020-05-04 16:22:22", "date_modify": "2020-05-04 16:22:22", "date_publish": "2020-04-06 12:00:54", "description": "Dr. John Maa writes that as Covid-19 has spread across the country, smokers and vapers are facing particular risks as the side effects caused by these habits are the factors which put individuals at high risk of coronavirus complications. Moreover, the act of smoking puts one's hands in constant contact with their face and mouth -- a pandemic era no-no.", "filename": "2020_04_06_opinions_smoking-vaping-covid-19-coronavirus-maa_index_1588609342.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190618070500-cigarette-smoking-0103-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_smoking-vaping-covid-19-coronavirus-maa_index_1588609342.html", "title": "Why Covid-19 might make you rethink your smoking habits", "title_page": "Why Covid-19 might make you rethink your smoking habits - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "John Maa, MD, is a past president of the San Francisco Marin Medical Society. The opinions expressed in this commentary are his own. Read more opinion at CNN.\n(CNN) A college friend who is now a physician first introduced me to an electronic cigarette in 2008. He purchased his online from China with the hope of transitioning from smoking to vaping but found himself using both instead. A few years later, he shared a pleasant surprise -- he had succeeded in quitting both vaping and smoking.\nThe breakthrough came one winter while he was recovering from a cold. As he reached for the e-cigarette, he realized the hazard of exposing his recovering lungs to a cloud of smoke. He gave his e-cigarette away, and never vaped or smoked again. His success story highlights the power of a second event to break the nicotine addiction. The current Covid-19 pandemic may serve as a similar warning call to smokers and vapers to stop promptly.\nOver the past 10 months, three serial waves of severe acute respiratory illnesses have strained the American emergency care delivery system from 1) e-cigarette, or vaping product use associated lung injury (EVALI), 2) the influenza season, and 3) Covid-19. Around June 2019, US hospitals first noted a rise in respiratory illnesses linked to e-cigarettes. The US Centers for Disease Control and Prevention tracked this EVALI outbreak into early 2020, ultimately counting 2,807 hospitalized patients in all 50 US states, with 68 deaths as of February. Overlapping with the EVALI crisis has been the influenza season, which runs from October through May. So far, the CDC estimated there have been at least 39 million US cases of the flu , leading to 400,000 hospitalizations, and 24,000 deaths. The third stress has been the worldwide pandemic of Covid-19, totaling, at the time of writing , 337,933 cases in the US and 9,653 deaths.\nSmoking has many negative effects on respiratory health, and the possibility of a relationship between smoking (both traditional cigarettes and marijuana) or vaping with Covid-19 were raised by early observations in China. One report, looking at 1,099 laboratory confirmed cases in China, revealed that 12.4% of smokers either died, required ICU admission or needed intubation, compared to 4.7% among never smokers. Another study found that among Chinese patients diagnosed with Covid-19 pneumonia, the odds of disease progression (including death) were an order of magnitude higher among smokers compared to non-smokers. The World Health Organization has noted that cigarette smokers are likely to have more serious illness if infected with Covid-19.\nThe FDA has advised that cigarette smoking and vaping may leave users with underlying health conditions and increase the risk of coronavirus pneumonia and increase its severity. Further research should be undertaken to determine the extent. The US Surgeon General has reported that smoking is strongly linked to asthma, chronic obstructive pulmonary disease (COPD), pneumonia and coronary artery disease, all of which impair the immune response and the ability to fight Covid-19.\nActive research is ongoing to assess the long-term health risks of marijuana use and vaping, including pediatric chronic bronchitis. New York City Mayor Bill de Blasio highlighted a possible connection between the coronavirus and vaping after noting a healthy 22-year-old New York City man, whose only risk factor appeared to be a history of vaping, was hospitalized for Covid-19. The CDC has reported that up to 20% of patients hospitalized for Covid-19 in the US are between ages 20 and 44, and California Gov. Gavin Newsom noted that half of the Covid-19 cases in California are in younger adults aged 18 to 49. Michigan Gov. Gretchen Whitmer speculated that the popularity of vaping might explain the increased incidence of Covid-19 among youth and young adults, and the National Institute on Drug Abuse has included vapers on the list of groups who could be most impacted by Covid-19.\nA related question is whether previous vaping-related lung injuries may predispose to a higher risk of contracting Covid-19. EVALI patients who survived may develop long term respiratory issues. If they were to contract Covid-19, they might also be at greater risk for respiratory failure, prolonged intubation and mortality.\nAs they recover from the coronavirus, smokers and vapers should make every effort to stop to protect their lung health. Repeatedly inhaling from an e-cigarette (possibly coated with viruses or bacteria) violates the principle of minimizing contact with one's mouth and face to reduce the risk of contracting Covid-19. Sharing an e-cigarette with others only increases that risk further. While the cigarette butt is discarded after each use, e-cigarette devices are used repeatedly. Perhaps e-cigarettes should be designed to be disposable, to minimize the risk of infection transmission. Another area to study further is whether the plume of vaping aerosol generated might deposit virus particles on surfaces in the environment.\nThe majority of cases from the EVALI outbreak were associated with vaping of marijuana/THC contaminated with vitamin E acetate. But the CDC did not exclude that other causes might exist, as 14% of the EVALI patients \"exclusively used nicotine-containing products.\"\nPerhaps some of the mysterious EVALI cases from the winter of 2019 should now be re-analyzed, to determine if the coronavirus may have played a role. Bronchoscopy biopsies and lung specimens stored in pathology labs across America could be assessed to see if coronavirus RNA is present. Similarly, reanalyzing influenza cases from the winter may reveal if the current cases of infection we are witnessing are actually a second wave.\nThe initial impact of Covid-19 on the e-cigarette industry was an interruption of the supply chain. About 90% of the world's e-cigarette hardware is produced in China , and many factories in Shenzhen were closed during the coronavirus outbreak there. More recently, many vape shops across America have closed, having been defined as non-essential services. This likely made it more difficult for youth to acquire vaping devices from peers or older siblings, or at school. Another unintended benefit of mandatory school closures has been the opportunity for parents to monitor, and have conversations with their children while they are at home to curb youth vaping.\nGiven the adverse effect on respiratory health, the current coronavirus pandemic should serve as a message to both smokers and vapers to quit promptly and take immediate action to reduce their risks of viral transmission.\nAnd if doing so immediately seems like too big of a task, at the very least, other measures like regularly sanitizing e-cigarettes and cannabis smoking devices should be taken.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nSmokers and vapers should also be more mindful of the secondhand smoke and clouds generated, avoid generating large clouds in public from vape tricks, and follow clean indoor air laws. Social distancing could be extended to the vapor generated to maintain a 6-foot distance from others when in public spaces, or to smoke and vape only in confined spaces. Active research is ongoing but difficult to conduct while simultaneously treating a pandemic, and many questions about the risks to smokers and vapers and those around them will be answered over time.\nUltimately, Covid-19 presents a teachable moment to break the cycle of nicotine addiction and accelerate our nation towards the dual goals of smoking and vaping cessation.", "url": "https://www.cnn.com/2020/04/06/opinions/smoking-vaping-covid-19-coronavirus-maa/index.html"}