{"authors": [], "date_download": "2020-05-04 20:24:21", "date_modify": "2020-05-04 20:24:21", "date_publish": "2020-04-07 12:54:49", "description": "NAIROBI, Kenya (AP) — The U.S. military said Tuesday it has killed a high-ranking leader of the al-Qaida-linked al-Shabab extremist group with an airstrike in Somalia. A statement by the...", "filename": "_843b1414c26f1eefcd240258dcfd4d4b_1588623861.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_843b1414c26f1eefcd240258dcfd4d4b_1588623861.html", "title": "US says airstrike in Somalia kills an al-Shabab leader", "title_page": "US says airstrike in Somalia kills an al-Shabab leader", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NAIROBI, Kenya (AP) — The U.S. military said Tuesday it has killed a high-ranking leader of the al-Qaida-linked al-Shabab extremist group with an airstrike in Somalia.\nA statement by the U.S. Africa Command said Yusuf Jiis was one of three extremists killed in Thursday’s airstrike near Bush Madina in the Bay region.\nThe U.S. called Jiis a “foundational member” of al-Shabab, which controls parts of central and southern Somalia and frequently carries out attacks in the capital, Mogadishu.\n“While we might like to pause our operations in Somalia because of the coronavirus, the leaders of al-Qaida, al-Shabaab and ISIS have announced that they see this crisis as an opportunity to further their terrorist agenda so we will continue to stand with and support our African partners,” AFRICOM commander Gen. Stephen Townsend said.\nThe U.S. in a separate statement said an airstrike on Monday killed five al-Shabab members near Jilib.\nThe statement said the U.S. was aware of reports alleging that the airstrike killed civilians but that AFRICOM assesses none were killed.\nThis isn’t the first time the U.S. been accused of killing civilians with airstrikes in Somalia. AFRICOM last week announced it would publish a quarterly report addressing allegations, the same day Amnesty International released its latest investigation into airstrikes and said two strikes in February had killed two civilians and injured three others.", "url": "https://apnews.com/843b1414c26f1eefcd240258dcfd4d4b"}