{"authors": ["Erica Orden"], "date_download": "2020-05-04 16:08:04", "date_modify": "2020-05-04 16:08:04", "date_publish": "2020-04-02 15:32:28", "description": "A federal judge on Thursday granted former New York Rep. Chris Collins's request to delay the start of his prison sentence for securities fraud by two months after Collins cited concerns about the coronavirus pandemic and its threat to inmates.", "filename": "2020_04_02_politics_chris-collins-jail-coronavirus-delayed_index_1588608484.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180811103104-01-chris-collins-insider-trading-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_chris-collins-jail-coronavirus-delayed_index_1588608484.html", "title": "Chris Collins' prison term delayed due to coronavirus", "title_page": "Chris Collins' prison term delayed due to coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN) A federal judge on Thursday granted former New York Rep. Chris Collins's request to delay the start of his prison sentence for securities fraud by two months after Collins cited concerns about the coronavirus pandemic and its threat to inmates.\nCollins, a Western New York Republican who had been scheduled to report to prison for a 26-month sentence on April 21, is now set to begin his sentence June 23.\nCollins's request came as many inmates and those facing prison sentences have asked to be released from confinement or to delay their sentences out of fear that incarceration creates particularly ripe conditions for the rapid spread of the virus. Those requests have yielded mixed results.\nAttorneys for the 69-year-old former congressman, who pleaded guilty in October 2019 to one count of conspiracy to commit securities fraud and one count of making a false statement, had told the court they believe he is in a high-risk category to contract the virus, due to his age and \"additional\" factors.\n\"It would be particularly dangerous for an elderly person with underlying health conditions like Mr. Collins to report for incarceration right now in the middle of the COVID-19 pandemic that is ravaging the United States,\" his lawyers wrote to US District Court Judge Vernon Broderick\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/chris-collins-jail-coronavirus-delayed/index.html"}