{"authors": ["Lisa Respers France"], "date_download": "2020-05-04 16:54:09", "date_modify": "2020-05-04 16:54:09", "date_publish": "2020-04-08 18:51:39", "description": "As African Americans are being disproportionately infected with and dying from the coronavirus, the network founded to serve that community is stepping up.", "filename": "2020_04_08_entertainment_bet-coronavirus-benefit_index_1588611249.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408142241-bet-coronavirus-relief-split-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_entertainment_bet-coronavirus-benefit_index_1588611249.html", "title": "BET addresses coronavirus racial disparity with 'Saving Our Selves'", "title_page": "BET addresses coronavirus racial disparity with 'Saving Our Selves'   - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As African Americans are being disproportionately infected with and dying from the coronavirus, the network founded to serve that community is stepping up.\nBET has started a series of initiatives to provide educational and financial resources to the black community\nThe \"Saving Our Selves: A BET COVID-19 Relief Effort\" broadcast special will be co-hosted by Grammy Award-winning singer and actress Kelly Rowland; TV personality Terrence J and actress Regina Hall. It will air at 8 p.m. ET on April 22.\nThe benefit will include virtual guest appearances and performances from several celebs including DJ Khaled, Charlie Wilson, Chance the Rapper, Kirk Franklin, and Fantasia.\n\"The COVID-19 pandemic is savagely compounding the profound health and financial vulnerabilities many Black Americans face. Every day, there are new reports of how this pandemic is killing African Americans at much higher rates than other communities.\" Scott Mills, president of BET, said in a statement. \"BET is using all of our resources -- our capital, our media platforms, our relationships with the creative community, sponsors, businesses and charitable organizations to support our community in this time of crisis.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/entertainment/bet-coronavirus-benefit/index.html"}