{"authors": ["Ivana Kottasová", "Eliza Mackintosh"], "date_download": "2020-05-04 17:01:11", "date_modify": "2020-05-04 17:01:11", "date_publish": "2020-04-10 11:57:12", "description": "New York state now has more cases than any country in the world except the United States, but there is a glimmer of hope: the number of people hospitalized in the state is going down as deaths have gone up.", "filename": "2020_04_10_world_coronavirus-newsletter-04-10-20-intl_index_1588611671.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_world_coronavirus-newsletter-04-10-20-intl_index_1588611671.html", "title": "What you need to know about coronavirus on Friday, April 10", "title_page": "What you need to know about coronavirus on Friday, April 10 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 10 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) Workers dressed in hazmat suits and protective gear dig long, narrow trenches, shoveling dirt aside to make room for simple wooden caskets. That scene was captured in drone footage over New York's Hart Island , east of the Bronx, which has been used for decades to lay to rest those who died unclaimed. Amid a mounting death toll and waning morgue space, it's interring the city's coronavirus victims — burials have jumped from 25 a week, to 25 a day.\nMuch has changed in the nation's strategy since President Donald Trump said he wanted the US \"raring to go\" and churches \"packed\" by Easter. But, against the backdrop of mounting unemployment numbers and a widening economic crisis, the President is still pushing for a return to business as usual. Yesterday, Trump expressed interest in a \"big bang\" reopening , with the entire country coming back online at once, perhaps as soon as May 1.\nBut, for now, much of the US and the world remains on lockdown. And as officials urge people to stay at home for the long holiday weekend, many families celebrating Passover and Easter are rethinking their rituals and religious practices.\nYOU ASKED. WE ANSWERED\nQ: What is herd immunity?\nA: The World Health Organization's Dr. Maria Van Kerkhove said we should not seek to achieve The World Health Organization's Dr. Maria Van Kerkhove said we should not seek to achieve \"herd immunity\" — a strategy of building immunity in a population through exposure — in the absence of a vaccine. But, without a better understanding of why the virus kills some, and not others, it's too risky to let it spread through communities unabated. \"We want to prevent as many infections as possible — full stop. The goal is never to let this go. We want to prevent as many infections as we can, and thereby reducing the number of people who would advance to severe disease critical disease and die,\" Van Kerkhove said during CNN's Global Town Hall\nMore than 50,000 people have asked us questions about the outbreak. Send yours here . Are you a health care worker fighting Covid-19? Message us on WhatsApp about the challenges you're facing: +1 347-322-0415.\nWHAT'S IMPORTANT TODAY\nThe US economy is crumbling\nThe United States is already in a recession and will remain that way for the first half of the year, according to a new influential survey of 45 economists.\nAmerican companies have been shedding jobs at a worrying rate. Another 6.6 million people filed for unemployment benefits last week — bringing the number to 16.8 million for the past three weeks alone.\nEconomists are hoping that the government's economic relief package and policies by the Federal Reserve — including an additional $2.3 trillion in loans announced yesterday — will soften the blow a little bit.\nWhat it's like inside a Hong Kong quarantine camp\nLife in Hong Kong government quarantine feels like a mix of school, camp and prison, Tara Mulholland writes from Lei Yue Mun Park, a leafy holiday village that has been turned into an isolation center.\nUntil recently, swift public health measures appeared to have brought the epidemic under control in the city, with fewer than 10 new cases being recorded each day. But when the long-dreaded \"second wave\" broke out, measures were tightened again.\nEU finally agrees aid package\nEuropean finance ministers have finally approved an aid fund of up to €500 billion to tackle the economic crisis.\nBut the process of getting here has been fraught: Countries like Italy, Spain, and Portugal have criticized other members for not facilitating access to joint funds, while the Italian Prime Minister has said the future of the European project was at \"risk\" over the bloc's bungled response.\nAnd, in the end, the agreement is something of a fudge, Luke McGee writes\nSweden is refusing to lock down\nSweden has adopted a controversial strategy, described by the country's foreign minister Ann Linde as: \"No lockdown.\" Restaurants, playgrounds and schools remain open, and the country is relying on Swedes to take \"responsibility themselves,\" Linde said.\nThe approach has drawn Trump's attention. The US President said Sweden was \"suffering very, very badly\" and suggested the Nordic country was following the \"herd immunity\" theory. Swedish officials pushed back against the criticism, saying Trump was \"factually wrong.\"\nON OUR RADAR\nSome scientists are now studying a 100-year-old vaccine for tuberculosis as a possible way to fight the novel coronavirus.\nThe lack of air pollution caused by the lockdown means people in India can see the Himalayas for the first time in \"decades.\"\nBritish Prime Minister Boris Johnson is in \"extremely good spirits\" after being moved out of intensive care at a London hospital, where he was admitted on Sunday for worsening coronavirus symptoms.\nTen million students in China are facing the toughest test of their lives — a grueling college entrance exam — amid the pandemic.\nFirst lady Melania Trump shared a photo of herself wearing a cloth face mask — a CDC recommendation that the President himself has chosen not to adhere to.\nFormer President Barack Obama had this warning for mayors dealing with the outbreak: \"The biggest mistake any (of) us can make in these situations is to misinform.\"\nTOP TIPS\nNot sure how to make, wear or clean your own masks at home? Dr. Sanjay Gupta demonstrates.\nThere's no need to cancel holidays just because of the pandemic. Here are some tips on how to celebrate Easter and Passover this weekend.\nIt's easy to feel helpless in the face of widespread suffering and hardship. Here is a guide on how to help safely from home.\nTODAY'S PODCAST\n\"Take a deep breath. For this is a disease that is literally trying to steal our breath. And to be reminded of that breath is to again be reminded that we are human and that we are surviving.\" — Rev. Jennifer Bailey, Founder, Faith Matters Network", "url": "https://www.cnn.com/2020/04/10/world/coronavirus-newsletter-04-10-20-intl/index.html"}