{"authors": ["Aj Willingham"], "date_download": "2020-05-04 15:59:19", "date_modify": "2020-05-04 15:59:19", "date_publish": "2020-04-01 10:10:43", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "filename": "2020_04_01_us_five-things-april-1-trnd_index_1588607959.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330234211-coronavirus-maryland-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_five-things-april-1-trnd_index_1588607959.html", "title": "5 things to know for April 1: Coronavirus, census, prisons, election, Venezuela", "title_page": "5 things to know for April 1: Coronavirus, census, prisons, election, Venezuela - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN) It's April Fools' Day, but understandably, not many people are in a joking mood .\nHere's what you need to know to Get Up to Speed and On with Your Day.\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\nPresident Trump issued a grave, sobering warning during a coronavirus briefing, preparing the country for 100,000 to 240,000 coronavirus deaths in the coming weeks. It is the first time the administration has laid the numbers bare in such a straightforward way. Dread is spreading in other parts of the world as well, like in Hong Kong, where beauty parlors, night clubs and karaoke rooms have been shut down as the region contends with a second wave of coronavirus cases. The CDC now says that as many as one-fourth of those infected with the virus could be walking around with no symptoms and transmitting it, which makes social distancing measures all the more crucial. This growing public concern has led China to start counting asymptomatic cases in its official tally. There are now more than 860,000 coronavirus cases worldwide and more than 42,000 deaths. Follow here for live updates.\n2. Census\nIt's Census Day in the US, when local leaders encourage people to complete and return their census forms . That part's not optional -- participation in the census is required by law -- but there are plenty of reasons to comply. Census numbers determine how many representatives each state gets in Congress and how billions of dollars in federal funding get spent. Schools, roads and other crucial community components will gain -- or lose -- money over the next 10 years depending on this official population tally. This is also the first time the census can be completed online. If you don't complete the forms, expect a visit from a census taker later in the year who may interview you to make sure everyone is counted.\nJUST WATCHED Why Roberts voted against Trump's citizenship question Replay More Videos ... MUST WATCH Why Roberts voted against Trump's citizenship question 01:42\n3. Prisons\n4. Election 2020\nJUST WATCHED Pelosi said Trump is responsible for American deaths. Watch Biden's answer Replay More Videos ... MUST WATCH Pelosi said Trump is responsible for American deaths. Watch Biden's answer 01:24\n5. Venezuela\nThe Trump administration has launched a new effort to oust embattled Venezuelan President Nicolas Maduro in hopes of facilitating a democratic transition in the ailing socialist state. The plan points to Venezuela's coronavirus response as a reason to get rid of Maduro. Under the plan, Venezuela's National Assembly would create a Council of State to serve as the governing body until presidential elections are held. This new strategy comes less than a week after the US Justice Department announced narco-terrorism charges against Maduro and senior Venezuelan leaders.\nBREAKFAST BROWSE\nA 112-year-old British pensioner is the world's oldest man\nA few tips to survive working at home with your spouse\nJUST WATCHED Here's how to make the most of working from home Replay More Videos ... MUST WATCH Here's how to make the most of working from home 01:03\nWild goats have taken over a Welsh town amid coronavirus lockdown\nThis is what you get if you observe coronavirus rules: A visit from wild goats!\nSomeone may be sabotaging Houseparty, one of the video calling apps keeping people connected\nESPN is airing its Michael Jordan documentary early because there are no sports to watch\nWhat we wouldn't give for a single pitch of baseball ! A single layup! A single shot on goal!\nJUST WATCHED Michael Jordan documentary release moved up to April Replay More Videos ... MUST WATCH Michael Jordan documentary release moved up to April 00:36\nTODAY'S NUMBER\n11 million\nThat's how many people the coronavirus crisis could push into poverty in East Asia and the Pacific, according to the World Bank.\nJUST WATCHED Oil prices plunge on coronavirus fears Replay More Videos ... MUST WATCH Oil prices plunge on coronavirus fears 01:50\nTODAY'S QUOTE\n\"We've seen all too terribly the consequences of those who denied warnings of a pandemic. We can't afford any more consequences of climate denial.\"\nBarack Obama, in a rare rebuke of President Trump after the Trump administration announced it's Former President, in a rare rebuke of President Trump after the Trump administration announced it's rolling back Obama's signature fuel standards aimed at combating the climate crisis\nAND FINALLY\nAn enchanted forest cake", "url": "https://www.cnn.com/2020/04/01/us/five-things-april-1-trnd/index.html"}