{"authors": [], "date_download": "2020-05-04 20:09:27", "date_modify": "2020-05-04 20:09:27", "date_publish": "2020-04-08 17:31:50", "description": "PORTLAND, Maine (AP) — The chief justice of Maine's highest court is stepping down to take a position as the dean of the University of Maine School of Law, state officials said...", "filename": "_949dd2bcece1ae602718b2ca2d5e4009_1588622967.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_949dd2bcece1ae602718b2ca2d5e4009_1588622967.html", "title": "Chief justice leaving to be dean of Maine's only law school", "title_page": "Chief justice leaving to be dean of Maine's only law school", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Maine (AP) — The chief justice of Maine’s highest court is stepping down to take a position as the dean of the University of Maine School of Law, state officials said Wednesday.\nLeigh Ingalls Saufley has served as the chief justice of the Maine Supreme Judicial Court since 2001 and will leave on April 14, according to the University of Maine System. A spokeswoman for the Maine court system confirmed that Saufley is leaving for the law school post.\nSaufley will not address her new role at the law school until she resigns from her chief justice role, according to the UMaine system.\nDemocratic Gov. Janet Mills said the judiciary “is fortunate to have had such a dynamic and thoughtful leader” as the chief justice.\n“While she will be missed on our highest court, her leadership and experience will be a significant asset to the University of Maine School of Law and the next generation of legal professionals in Maine,” Mills said.\nMills said her office will begin reviewing candidates to become the new chief justice. The office said Mills hopes to nominate a new chief justice in the months to come, but it’s unclear when the Maine Senate confirmation hearing could happen because of the coronavirus outbreak.\nThe interim dean of the UMaine law school, which is the only law school in Maine, has been Dmitry Bam.\nUMaine system chancellor Dannel Malloy said Saufley “is nationally renowned for her accomplishments as a jurist and her commitment to public service.” Her salary at the school will be $240,000.", "url": "https://apnews.com/949dd2bcece1ae602718b2ca2d5e4009"}