{"authors": ["Ryan Prior"], "date_download": "2020-05-04 16:15:27", "date_modify": "2020-05-04 16:15:27", "date_publish": "2020-04-03 09:17:03", "description": "With the novel coronavirus well into its global pandemic phase, the science on quitting smoking offers welcome news if you're looking to do what you can to build up your defenses against Covid-19.", "filename": "2020_04_03_health_coronavirus-quitting-smoking-wellness_index_1588608927.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401132842-01-cigarettes-ash-tray-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_coronavirus-quitting-smoking-wellness_index_1588608927.html", "title": "Qutting smoking could help you fight Covid-19", "title_page": "Qutting smoking could help you fight Covid-19 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) If you've been thinking about quitting smoking, there's no time like the present pandemic.\nWith the novel coronavirus sweeping the globe, the science on quitting smoking offers welcome news for smokers who want to build up their defenses in case they contract Covid-19.\nThough it may still take many months for a smoker's lungs to heal from damage caused by long-term smoking, your health can noticeably improve in the days and weeks after quitting in ways that could make a difference against the virus.\nAlthough you can't reverse scarring to your lungs caused by smoking, there are a number of ways your lung health can improve in the short term, according to the US Centers for Disease Control and Prevention\nTime to strengthen your lungs\n\"Every lung doctor in America will be preaching that everyone should quit smoking.\" Dr. Brian Christman, a volunteer spokesman with the American Lung Association and a professor of medicine at Vanderbilt University, told CNN.\nWhile this message isn't new, it's more relevant than ever.\nCovid-19 creates an added sense of urgency, and there's ample reason to believe that quitting smoking during the pandemic could increases your odds of fighting off the virus.\nIf you make the decision to quit, the cilia in your lungs are one of the first parts of your body to heal. These hair-like projections wave back and forth like a brush as air moves in and out of your lungs.\nThey help your body fight off colds and infection, the CDC says. They also help clear mucus, so if they're not functioning as well as they should, mucus can build up in the lungs.\nYour body's inclination to cough during an infection helps activate the bodily process of clearing out mucus, called the mucociliary escalator. That's vital in fighting the Covid-19 condition.\nThe elderly are at a greater risk for excessive lung fluid that often limits breathing following coronavirus infection because \"old folks don't have a strong enough cough to clear it up,\" Christman said.\nQuitting can reduce inflammation\nA second short-term gain from quitting smoking comes from reducing ongoing inflammation in your body, which can predispose you to Covid-19.\n\"If you quit smoking, the chronic inflammation goes away after a few weeks,\" Christman said.\nYou'll notice you won't have as many symptoms of being short of breath when walking or climbing stairs, the CDC says.\nChristman noted that smokers tend to need several months to stop producing higher levels of mucus, which their lungs create in order to clear out tar and other particulates contained in cigarettes.\n\"In terms of structural change, it takes a little while to clear the whole space,\" he said.\nHaving your lungs in as good of shape as you can in case of a coronavirus infection is key.\nCovid-19 patients frequently experience acute lung injury, which can cause leakiness in mucus membranes, leading to what's called acute respiratory distress syndrome, Christman said. This condition can result in patients drowning in their own mucus.\nFor smokers, \"at baseline you're set up for chronic bronchitis,\" Christman said. \"With Covid, it gets worse.\"\nAnd even if you're not living in an area where there are numerous coronavirus cases, your decision to quit smoking might pay off down the road. That's because public health authorities have projected multiple waves of cases over the next 18 months could be possible.\n\"It's an investment in the future,\" he said. \"Covid might circulate in the Southern Hemisphere and then come back. Someone quitting now might really help themselves in the second wave.\"\nRespiratory failure is a common cause of death\nFor those who are diagnosed with Covid-19 and either fall seriously ill or die from it, respiratory failure or significant lung damage is common.\nAccording to the CDC's Morbidity and Mortality Weekly Report through March 28, 78% of US Covid-19 cases requiring intensive care unit admission came from patients who self-reported a recognized risk factor or a diagnosis of at least one underlying medical condition.\nCurrent or former smoking status was among the shortlist of risk factors, along with other traits known to put people at risk for respiratory illness, including pregnancy.\nThe most commonly reported underlying conditions included diabetes, chronic lung disease, cardiovascular disease, and immune compromised conditions.\nQuitting smoking helps with blood circulation\nBesides lung-related issues, smoking cessation can also deliver healthy benefits to the heart that could help stave off the possibility of cardiac arrest. Heart attacks are another cause of death in Covid-19 cases.\nAfter you quit smoking, your blood becomes thinner and less susceptible to clotting, the CDC says . Heart attacks are less likely.\nOne reason this happens is because smokers inhale carbon monoxide, and thereby diminish their capacity to carry oxygen and make it harder for the heart to distribute blood throughout the body.\n\"There is the occasional patient with Covid who dies from heart failure,\" Christman says. He noted that in some cases, clinicians were seeing patients with elevated levels of troponins -- a sign of heart attack that can be triggered by a severe infection.\nYou may already be practicing social distancing, washing your hands frequently and avoiding touching your face. In addition to all these, limiting or quitting smoking is yet another important aspect of your anti-coronavirus arsenal.\n\"Now is the time to take care of yourself,\" Christman said.", "url": "https://www.cnn.com/2020/04/03/health/coronavirus-quitting-smoking-wellness/index.html"}