{"authors": ["Howard Fendrich"], "date_download": "2020-05-04 20:29:00", "date_modify": "2020-05-04 20:29:00", "date_publish": "2020-04-20 18:56:41", "description": "Ever wondered what a chat between Roger Federer and Rafael Nadal might sound like? How about Novak Djokovic and Andy Murray or Stan Wawrinka? Fans got the rare chance to watch the Big Three...", "filename": "_5b02ea2b345a5c936f9a9631eb084d47_1588624140.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2ff71644e64240f4aac6cab377cb491d/2156.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5b02ea2b345a5c936f9a9631eb084d47_1588624140.html", "title": "Federer, Nadal, Djokovic let fans eavesdrop on their convos", "title_page": "Federer, Nadal, Djokovic let fans eavesdrop on their convos", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Thursday, Jan. 30, 2020 file photo, Switzerland's Roger Federer makes a backhand return to Serbia's Novak Djokovic during their semifinal match at the Australian Open tennis championship in Melbourne, Australia. Roger Federer offered stuck-at-home amateurs the ultimate online fantasy camp, a chance to get tennis tips from a GOAT. While people all over the world are cooped up because of the new coronavirus -- social distancing while trying to stay healthy and help others do the same -- a bunch of athletes have been posting workouts and drills on social media with suggestions for staying in shape. Federer did that sort of thing, too, on Tuesday, April 7, 2020. (AP Photo/Andy Brownbill, File)\nFILE - In this Thursday, Jan. 30, 2020 file photo, Switzerland's Roger Federer makes a backhand return to Serbia's Novak Djokovic during their semifinal match at the Australian Open tennis championship in Melbourne, Australia. Roger Federer offered stuck-at-home amateurs the ultimate online fantasy camp, a chance to get tennis tips from a GOAT. While people all over the world are cooped up because of the new coronavirus -- social distancing while trying to stay healthy and help others do the same -- a bunch of athletes have been posting workouts and drills on social media with suggestions for staying in shape. Federer did that sort of thing, too, on Tuesday, April 7, 2020. (AP Photo/Andy Brownbill, File)\nEver wondered what a chat between Roger Federer and Rafael Nadal might sound like? How about Novak Djokovic and Andy Murray or Stan Wawrinka?\nFans got the rare chance to watch the Big Three — and two other owners of multiple Grand Slam titles — casually interact with each other in recent days via Instagram Live, a sort of electronic eavesdropping on some of the greatest male tennis players in history.\nLike a peek into a private conversation between Rafael Nadal — who had some trouble figuring out how to get IG Live to work — and Roger Federer.\nNadal also chatted with Andy Murray and Marc Lopez. pic.twitter.com/uzNI0Br01S — Howard Fendrich (@HowardFendrich) April 20, 2020\nOnce Nadal got some technical issues worked out, that is. The owner of 19 major championships, second only to Federer’s 20 among men, had some trouble figuring out how to connect with his long-time rival on Monday.\nEventually, Federer asked something he said he’s always wanted to know about Nadal, “because it’s been bothering me, you know?”: If Nadal is right-handed, why does he play tennis lefty, something that has helped give him a head-to-head edge over the righty-racketed Federer?\nNadal, who said he was at home on the Spanish island of Mallorca, explained that while he does everything else right-handed — from shooting a basketball to writing — he’s always played tennis and soccer as a lefty. Although he noted that he began tennis by hitting forehands and backhands with two-handed grips.\nDjokovic, third on the men’s Grand Slam list with 17 trophies, started the trend of tennis superstars talking among themselves by going live one-on-one with Murray on Friday and with Wawrinka on Saturday.\nNone has any matches to play, or even a need to practice right now, because the COVID-19 outbreak led to the suspension of all professional tennis until at least mid-July.\n“Just trying to be positive, because during this period of time, (it’s) so difficult to stay positive,” Nadal told Federer. “A lot of people suffering a lot.”\nNadal said he hasn’t touched a racket since the tournament in Indian Wells, California, was called off in early March.\n“Perfect,” Federer joked. “You won’t be ale to play tennis anymore when you come back.”\nNadal laughed and responded, “I hope to remember something.”\nWhen Nadal asked how Federer’s surgically repaired right knee is doing, Federer said that it’s OK and he is glad he doesn’t need to worry about rushing back to compete.\nOnce their conversation — which drew more than 50,000 viewers within the first five minutes — was done, Nadal again was a bit flummoxed while trying to get Murray, a three-time major champion and two-time Olympic gold medalist, to join in.\n“Andy, where are you, man?” Nadal said, furrowing his brow.\nOnce Murray, who said he was in London and appeared to be laying in bed, did join, Nadal acknowledged, “I’m going crazy with this.”\nMurray replied that “it was very amusing watching you” fiddle with it.\nAfter some more issues, including a close-up look at his fingerprint-smudged laptop screen instead of his face, Nadal wrapped up his half hour on Instagram Live with Marc Lopez, his partner while winning a men’s doubles gold medal for Spain at the 2016 Rio Olympics.\nWhen they finished, Nadal tried to offer a sincere farewell to all those who watched — but he got cut off in the middle of a sentence, when the session ended.\nStar athletes: They’re just like us!\n___\nFollow Howard Fendrich on Twitter at https://twitter.com/HowardFendrich\n___\nMore AP Tennis coverage: https://www.apnews.com/apf-Tennis and https://twitter.com/AP_Sports", "url": "https://apnews.com/5b02ea2b345a5c936f9a9631eb084d47"}