{"authors": [], "date_download": "2020-05-04 20:14:50", "date_modify": "2020-05-04 20:14:50", "date_publish": "2020-04-07 19:24:58", "description": "BRISTOL, Conn. (AP) — Obi Toppin of Dayton won the John R. Wooden Award as the nation’s outstanding college basketball player. Toppin, along with Saddiq Bey of Villanova, Luka Garza of Iowa,...", "filename": "_afee7c7306246a63a817821db17e2c2a_1588623290.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1426ef34e637435b94606900a18996ab/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_afee7c7306246a63a817821db17e2c2a_1588623290.html", "title": "Dayton's Obi Toppin wins Wooden Award as top hoops player", "title_page": "Dayton's Obi Toppin wins Wooden Award as top hoops player", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 11, 2020, file photo, Dayton's Obi Toppin (1) reacts in the first half in an NCAA college basketball game against Rhode Island in Dayton, Ohio. Toppin was selected to The Associated Press All-America first team, Friday, March 20, 2020. (AP Photo/Aaron Doster, File)\nFILE - In this Feb. 11, 2020, file photo, Dayton's Obi Toppin (1) reacts in the first half in an NCAA college basketball game against Rhode Island in Dayton, Ohio. Toppin was selected to The Associated Press All-America first team, Friday, March 20, 2020. (AP Photo/Aaron Doster, File)\nBRISTOL, Conn. (AP) — Obi Toppin of Dayton won the John R. Wooden Award as the nation’s outstanding college basketball player.\nToppin, along with Saddiq Bey of Villanova, Luka Garza of Iowa, Myles Powell of Seton Hall and Peyton Pritchard of Oregon, also won positional awards from the Basketball Hall of Fame.\nThe winners were announced Tuesday on ESPN’s “SportsCenter” broadcast. They are usually honored at the College Basketball Awards in Los Angeles, which was scheduled for Friday, but got canceled because of the coronavirus pandemic.\nToppin is the first player from Dayton to win the Wooden Award and the first Atlantic-10 Conference player to do so since Jameer Nelson of St. Joseph’s in 2004. Toppin averaged 20 points, 7.0 rebounds and shot 60% from the field. He led the nation in dunks with a school-record 107 and his 190 career slams also set a school mark.\nWooden Award voting took place from March 16-23.\nToppin also received the Karl Malone Power Forward of the Year.\nBey received the Julius Erving Small Forward of the Year award. He averaged 16.1 points, 4.7 rebounds, 2.4 assists and shot 45% from 3-point range.\nGarza was named the Kareem Abdul-Jabbar Center of the Year. He averaged 23.9 points, 9.8 rebounds and 1.8 blocks.\nPowell earned the Jerry West Shooting Guard of the Year. He averaged 21 points, 4.3 rebounds and 2.9 assists.\nThe Bob Cousy Point Guard of the Year went to Pritchard, who averaged 20.5 points, 5.5 assists and shot 82% from the free-throw line.\nEach award’s namesake headed his own selection committee to evaluate candidates throughout the season. Fans also were able to vote.\n___\nMore AP college basketball: https://apnews.com/Collegebasketball and https://twitter.com/AP_Top25", "url": "https://apnews.com/afee7c7306246a63a817821db17e2c2a"}