{"authors": ["Analysis Paul Leblanc"], "date_download": "2020-05-04 16:57:52", "date_modify": "2020-05-04 16:57:52", "date_publish": "2020-04-09 00:47:07", "description": "Things are still getting worse. The US death toll crossed 14,000 on Wednesday, with a record 1,858 deaths reported just on Tuesday. Since the outbreak started, about 425,000 cases have been diagnosed in the US. And researchers say the peak has yet to come.", "filename": "2020_04_08_politics_what-matters-april-8_index_1588611472.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408162250-04-hf-coronavirus-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_what-matters-april-8_index_1588611472.html", "title": "US coronavirus predictions are shifting. Here's why", "title_page": "What Matters: US Coronavirus predictions are changing. Here's why - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here\nBut the main model used by the White House and pretty much everyone else was updated Wednesday to show far fewer projected US deaths from Covid-19 -- down to 60,415 people by August , from the 82,000 the model showed on Tuesday (which was already lower than previous projections).\nWhat is going on?\nNew data on the pandemic's trajectory -- from the United States and around the world -- has been fed into the model almost every day, driving the changes. And the downward adjustment suggests that social distancing may be working better than expected in some places.\nThe pain may last until August -- The updated model assumes social distancing measures, including the closure of schools and businesses, will remain in place until August. But other measures could replace those, Azad reports, including mass screening, contact tracing and selective quarantines.\nWhat it means for the next few months\nCNN posed a few key questions to Dr. Gregory Roth, one of the senior faculty at the University of Washington's Institute for Health Metrics and Evaluation, about the new modeling. The conversation, conducted via Zoom and lightly edited for flow, is below:\nCNN: The IHME model has shifted downward for the second time in two weeks. Why is that happening and what exactly does it mean?\nGR: Our model is designed to be updated frequently to make sure that we're making the best use of all of the available data. This has been a very rapidly evolving pandemic and as data sources change, we want to include them in our forecasts as quickly as possible. The model updates reflect the most recently available data on the number of deaths from the source we're using, which is from Johns Hopkins University, as well as all of the available data on the relationship between deaths and hospitalizations, ICU bed utilization, and the number of ventilators that are being needed.\nCNN: The model assumes social distancing. The fact that the numbers have dropped twice now, does that show that either there's more social distancing happening than expected or is it that social distancing itself is more effective than was expected?\nGR: The model has always assumed that social distancing has an impact on the number of deaths that we expect to occur. It has also always assumed that every state where social distancing policies have not yet been mandated, that they will be mandated within a week of the date that we ran that model. So the model is always forecasting based on the assumption that the states are all going to line up behind a broad, aggressive social distancing policy. However, we certainly account for the fact that some states have implemented that much earlier than others.\nCNN: I think something that might be confusing to a lot of people is that we see this modeling drop -- your model specifically -- but the death toll continues to rise in an alarming way. Can you explain that dynamic and where people should pay attention?\nGR: So the changes in the model are driven by new data and improved methods, particularly around estimating how uncertain the forecasts may be. As we receive more data on Covid-19 deaths, we expect our projections to adjust to follow those new trends. For locations that are still early in the epidemic where there are just a few data points and a low number of deaths due to Covid-19, the forecast will be less certain and the range of deaths in the future will be greater.\nCNN: What exactly could cause the model to shift back upwards? Would it be a relaxing of social distancing measures in certain areas?\nGR: So we haven't seen a relaxing of social distancing in any parts of the United States yet. In the future, if social distancing was relaxed, we would be concerned that there would be a rise again in the number of cases. In fact, one of the most important features of social distancing is that we maintain it long enough to avoid recurrent spikes in the disease. We know that even when cases and deaths are declining in some locations, there is still circulating virus. And given the fact that social distancing appears to be very successful, we are concerned that if it were rolled back too soon, then we would see second or even additional outbreaks after that. Large changes in the model are seen in places where there's a small amount of data. And so we can expect that as more data accumulates in places where currently we don't have many deaths counted, that the quality of those forecasts will improve and may change.\nCNN: Based on your modeling, can you give a sense of a timeline that would make sense for relaxing social distancing measures or is it just too early to be able to talk in terms of a timeline like that?\nGR: I think we don't yet have enough data from this outbreak to necessarily know when it will be safe to roll back social distancing. I think we're all very carefully following the news out of China that there's some locations where they're beginning to roll back some aspects of the social distancing policies that have been implemented. But I think a relatively small minority of the entire population will end up having been exposed and potentially developing immunity, that there's going to be a very large pool of people with no immunity after this first wave. That means that not only does social distancing have an important role, but a lot of the traditional tools in the public health toolkit like surveillance, case identification, contact tracing and all sorts of ways that can be used to try and make sure that we find new cases as soon as they occur are going to be really important parts of making sure that we don't see recurrent outbreaks.\nCNN: How much should people be paying attention to models? Is this something you recommend people follow closely?\nGR: The forecast has a range that's really important to pay attention to. If you are a health care planner, you want to be as aware of the upper range of our forecast as the mean value. And so there's a lot of uncertainty remaining in our forecasts and as a planner you need to be prepared for the possibility that, in fact, the trend may be at the upper end of the range rather than just right through the middle. And so I would first and foremost stress the fact that our forecast is designed for health care decision makers and policy makers and governments so they can try and use all of the available evidence in an up to date way to make good decisions.\nCan the US economy re-open by May?\nDespite the still-rising pandemic, President Donald Trump's aides have begun intensive discussions on a plan to reopen the US economy as soon as May , according to people familiar with the deliberations, setting up what some officials predict could be another showdown between the President's heath and economic advisers.\nTrump has begun aggressively touting a potential turnaround in the outbreak, even as health officials caution it's too early to declare victory in the coronavirus fight. \"FLATTENING OF THE CURVE!\" he wrote on Twitter on Wednesday. Still, the extent to which Trump can declare the country \"reopened\" remains limited.\nNo optimism -- A new CNN poll shows Americans aren't feeling optimistic : 6 in 10 respondents said the economy is in poor shape, up 30 points since last month. That shift is the steepest worsening of public perceptions of the economy in polling dating back to 1997.\nAnother grim sign of the times -- The crowds of Floridians who lined up to The crowds of Floridians who lined up to obtain paper applications for unemployment benefits this week after the state's online and phone systems were overwhelmed by a crush of newly jobless residents. Hundreds of people in South Florida waited for forms on Tuesday, when the Florida Department of Economic Opportunity rolled out the option.\nSome of Trump's advisers believe rural or smaller towns are on track for reopening in a quicker time frame and want to focus on how to best identify those areas. But others on the team, and Trump himself, seem to be eyeing a more widespread announcement.\nThe coronavirus task force has weighed benchmarks that might indicate a state is ready to loosen restrictions on businesses and gatherings, including a sustained 14-day period reduction in the number of confirmed cases, normal operations returned to hospitals and widely available testing.\nA central hurdle for the administration remains the availability of widespread testing, which Trump's health experts acknowledge is still an issue. Many inside the White House fear the ongoing struggle to ramp up testing could impede any reopening efforts.", "url": "https://www.cnn.com/2020/04/08/politics/what-matters-april-8/index.html"}