{"authors": ["Caroline Kelly"], "date_download": "2020-05-04 17:00:12", "date_modify": "2020-05-04 17:00:12", "date_publish": "2020-04-10 01:33:39", "description": "A federal judge has once again cleared the way for some abortions to resume in Texas despite the governor's order restricting them during the coronavirus outbreak.", "filename": "2020_04_09_politics_texas-abortion-order-block-again_index_1588611612.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200305160614-11-week-in-photos-0306-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_texas-abortion-order-block-again_index_1588611612.html", "title": "Federal court again allows some abortions in Texas despite governor's coronavirus restrictions", "title_page": "Federal court again allows some abortions in Texas despite governor's coronavirus restrictions   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A federal judge has once again cleared the way for some abortions to resume in Texas despite the governor's order restricting them during the coronavirus outbreak.\nJudge Lee Yeakel blocked the state from enforcing the order specifically \"as a categorical ban on all abortions provided by Plaintiffs\" and specifically against those providing medication abortions or providing surgical abortions to abortion-seekers who would reach 22 weeks since their last menstrual period -- the cutoff to receive an abortion in Texas -- by the order's expiration on April 21.\nThe ruling would also apply to surgical abortions performed on those who, by April 21, would reach 18 weeks since their last menstrual period, rendering them eligible for abortions only at ambulatory surgery centers, and would be \"likely unable to reach an ambulatory surgical center in Texas or to obtain abortion care,\" Yeakel wrote.\n\"As a minimum, this is an undue burden on a woman's right to a pre-viability abortion,\" he wrote Thursday.\nThe ruling marks another turn in a case that has bounced back and forth between courts that reach opposite conclusions, blurring the lines as to what forms of the procedure have been allowed in Texas and when.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/texas-abortion-order-block-again/index.html"}