{"authors": ["Rebekah Riess"], "date_download": "2020-05-04 16:34:09", "date_modify": "2020-05-04 16:34:09", "date_publish": "2020-04-08 03:11:34", "description": "The Baltimore Police Department has launched an internal investigation into a social media video that appears to show an officer repeatedly coughing near citizens in Southeast Baltimore, according to the department.", "filename": "2020_04_07_us_baltimore-pol_89b94632bf44fa92cf8c1061367ba14a_index_1588610049.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407224216-baltimore-police-officer-cough-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_baltimore-pol_89b94632bf44fa92cf8c1061367ba14a_index_1588610049.html", "title": "Baltimore police launch investigation into video that appears to show an officer repeatedly coughing on residents", "title_page": "Baltimore police launch investigation into video that appears to show an officer repeatedly coughing on residents - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Baltimore Police Department has launched an internal investigation into a social media video that appears to show an officer repeatedly coughing near citizens in Southeast Baltimore, according to the department.\nThe department's Public Integrity Bureau has opened up an internal investigation and reviewed the online video, according to a release from BPD, as well as the unidentified sergeant's body-worn camera footage. The department says a complete investigation will be conducted.\n\"The Department takes Covid-19 very seriously and we do not condone any action by our members which may be perceived as making light of the Covid-19 pandemic,\" police spokeswoman Lindsey Eldridge wrote in the department's statement.\nMore than 398,700 people have tested positive for coronavirus in the US and at least 12,893 have died.\n\"After watching the full video, it [sic] its entirety, it is not only disturbing, but incomprehensible, especially considering the high-level of strong and clear guidance that we have provided from the beginning, regarding Covid-19,\" Baltimore Police Commissioner Michael Harrison said in the statement. \"Members are always expected to be sensitive and professional to the community, but what we saw in the video is alarming because this pandemic is affecting lives not only nationally, worldwide, but right here in our own police department.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/us/baltimore-police-officer-cough-video-investigation/index.html"}