{"authors": ["Clare Duffy", "Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 16:20:58", "date_modify": "2020-05-04 16:20:58", "date_publish": "2020-04-05 17:50:40", "description": "Two workers at a Chicago-area Walmart store have died from the novel coronavirus, the company confirmed Sunday.", "filename": "2020_04_05_business_walmart-workers-coronavirus-deaths_index_1588609258.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405130745-01-walmart-sign-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_business_walmart-workers-coronavirus-deaths_index_1588609258.html", "title": "Two Walmart workers die of coronavirus", "title_page": "Two Walmart workers die of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Two workers at a Chicago-area Walmart store have died from the novel coronavirus, the company confirmed Sunday.\n\"We are heartbroken to learn of the passing of two associates at our Evergreen Park store, and we are mourning along with their families,\" an emailed statement from the company reads.\nWalmart in its statement did not provide the workers' names, ages or how long they had been with the company. It is also unclear exactly when the two workers passed away.\nThe two associates had not been in the Evergreen Park store \"for more than a week,\" according to the company. Experts say people infected with the novel coronavirus typically develop symptoms within about five days after infection, though it can be up to two weeks.\nWalmart WMT said it has implemented various cleaning, sanitizing and health measures in the store, including bringing in an outside company to clean \"high-touch\" areas of the store, such as front entrances, carts, registers, bathrooms and food areas including produce and meat. The company said that within the past week, it passed \"a third-party safety and environmental compliance assessment as well as a health department inspection.\"\nRead More", "url": "https://www.cnn.com/2020/04/05/business/walmart-workers-coronavirus-deaths/index.html"}