{"authors": [], "date_download": "2020-05-04 20:22:49", "date_modify": "2020-05-04 20:22:49", "date_publish": "2020-04-20 18:03:55", "description": "HELENA, Mont. (AP) — For the first time since the Montana state lab started running tests for coronavirus, the health department reported no positive COVID-19 tests among the 153 that were...", "filename": "_6778df09547993fb3155785c03ab56ed_1588623769.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6778df09547993fb3155785c03ab56ed_1588623769.html", "title": "No new COVID cases in Montana, state reaches 12 deaths", "title_page": "No new COVID cases in Montana, state reaches 12 deaths", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HELENA, Mont. (AP) — For the first time since the Montana state lab started running tests for coronavirus, the health department reported no positive COVID-19 tests among the 153 that were performed on Sunday. Toole County reported its fifth COVID-19 death on Monday and Cascade County reported its second, raising the state’s total to 12.\nThe latest Toole County victim was woman in her 80′s who was not identified. The Cascade County victim was a man over the age of 65 who had underlying health conditions.\nAll 29 of the cases in Toole County, which has a population about 4,800 residents, have been because of close contact rather than community transmission, said Blair Tomsheck, director of the county Health Department. Nearly all are tied to an assisted living facility and to the hospital in the city of Shelby, officials have said.\nMontana has reported 433 cases of COVID-19, with just over 11,000 tests performed.\nNineteen people were still hospitalized out of 57 who required hospital treatment. Montana has reported a steady decrease in new cases since March 26, when 35 cases were reported.\nSymptoms of COVID-19 can include fever, cough and trouble breathing. Most develop only mild symptoms. But some people, usually those with other medical complications, develop more severe symptoms, including pneumonia, which can be fatal.\nIn other coronavirus-related developments:\n— Montana received 5,000 nasal swabs from the Federal Emergency Management Agency to be used for testing, Gov. Steve Bullock said Monday. Bullock said the state still needs more supplies to ensure it has adequate testing capacity. Bullock announced last Friday that he plans to start lifting restrictions starting on April 25, although he has not said what restrictions will be lifted.\n— The state health department has expanded some mental health services after an increased number of calls to the Montana Suicide Prevention Lifeline and the Montana Warmline. The latter telephone service offers people the opportunity to talk to people in recovery from mental illness or treatment issues.\n— The health department is spending $25,000 for an online cognitive behavioral therapy program called Thrive. It helps people navigate anxiety and stress. The funding is meant to provide free access for adults. Between April 8 and 13, 200 people enrolled, The Billings Gazette reports.\n— Yellowstone National Park has delayed hiring the vast majority of seasonal employees as the park remains closed, park superintendent Cam Sholly said Monday. Employees who are returning initially won’t be in group housing. He said the park still has things it needs to work through before re-opening.", "url": "https://apnews.com/6778df09547993fb3155785c03ab56ed"}