{"authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "date_download": "2020-05-04 16:15:17", "date_modify": "2020-05-04 16:15:17", "date_publish": "2020-04-03 14:39:05", "description": "President Donald Trump announced Friday that he would name Justin Walker, a favorite of Senate Majority Leader Mitch McConnell, to one of the most powerful appellate courts in the country.", "filename": "2020_04_03_politics_justin-walker-dc-appeals-court_index_1588608917.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403105712-mcconnell-walker-file-2019-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_justin-walker-dc-appeals-court_index_1588608917.html", "title": "Trump picks controversial McConnell ally for powerful appeals court", "title_page": "Trump picks controversial McConnell ally for powerful appeals court - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump announced Friday that he would name Justin Walker, a favorite of Senate Majority Leader Mitch McConnell, to one of the most powerful appellate courts in the country.\nWalker will be one of the youngest nominees ever for a seat on the US District Court of Appeals for the District of Columbia Circuit, and the nomination will draw controversy as just last year Walker was confirmed to a district court in Kentucky, despite having received a \"not qualified\" rating\" from the American Bar Association.\nThe nomination, coming while much of the country is closed down because of the coronavirus pandemic , is the latest move by the President to reshape the appellate courts with a record number of his nominees.\nThe DC appeals court, located blocks from the Supreme Court, has jurisdiction over federal agencies and is acknowledged as a breeding ground for future Supreme Court justices. Chief Justice John Roberts served there, as did Justice Brett Kavanaugh and Merrick Garland, President Barack Obama's final nominee to the bench, which was blocked by McConnell.\nWalker, 37, was confirmed in October by a vote of 50-41 to sit on the US District Court for the Western District of Kentucky.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/justin-walker-dc-appeals-court/index.html"}