{"authors": ["Analysis Brandon Tensley"], "date_download": "2020-05-04 16:20:04", "date_modify": "2020-05-04 16:20:04", "date_publish": "2020-04-05 10:01:22", "description": "One thing people hunger to know in times of crisis: Have we been through a situation like this before?", "filename": "2020_04_05_politics_coronavirus-aids-hiv-sarah-schulman_index_1588609204.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403174829-aids-epidemic-act-up-1994-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_coronavirus-aids-hiv-sarah-schulman_index_1588609204.html", "title": "Lessons the AIDS epidemic has for coronavirus", "title_page": "Lessons the AIDS epidemic has for coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) One thing people hunger to know in times of crisis: Have we been through a situation like this before?\nIndeed, as the novel coronavirus continues its rapid spread, having already claimed tens of thousands of lives across the world , many are turning to the familiarity of history to get a better sense of the problem at hand. They're wondering, for instance, what the loneliness experienced during the 1918 influenza pandemic might teach present-day society about social isolation.\nAnother piece of the past that some are revisiting: the AIDS epidemic.\nOften referred to as \"the plague,\" AIDS stalked and devastated LGBTQ communities in the 1980s and '90s, wiping out a generation of gay men as state inaction and cultural homophobia kept the sick and dying at arm's length: The famous \" Silence = Death \" poster became the primary image of the activist group AIDS Coalition to Unleash Power, or ACT UP.\nStill, it's difficult to overstate the two crises' significant differences, including the ferocious lethality of AIDS at its peak.\nSarah Schulman, an AIDS historian, writer and professor at the College of Staten Island of the City University of New York, co-founded the ACT UP Oral History Project in 2002. The project aims to \"present comprehensive, complex, human, collective and individual pictures of the people who have made up ACT UP/New York.\"\nOur following conversation has been lightly edited for length and clarity.\nDo you see any meaningful parallels between the AIDS epidemic and the coronavirus pandemic?\nThe similarity is that we also have a monstrous federal government today. It's ironic: At the height of the AIDS crisis, HIV communities, which were already marginalized, imagined that if the virus had been affecting mainstream people as well, the government would've reacted -- tried to help -- because, famously, there was Legionnaires' disease, which affected members of the American Legion, and then-President Ronald Reagan acted promptly to address it\nNow, we have a federal government that's so narcissistic that even though the coronavirus affects every single person in the country, it doesn't care.\nAs in the past, the national leadership today is indifferent toward people's suffering -- maybe even more so than the administrations of Reagan and George H.W. Bush. The question is: What are the numbers going to be? The death toll from the coronavirus in New York City is more than 1,000 (as of the time of this conversation). As far as we know, more than 100,000 New Yorkers have died from AIDS-related causes . I don't know where those numbers are going. No one does. But as long as there's no broad coordination, nothing good can happen. That was true during the AIDS crisis, too.\nWhat are the limitations of this comparison?\nAt its height, the AIDS crisis was very different from what we're experiencing now. That's because hatred for people with HIV dominated public policy and social attitudes. The AIDS crisis should've been met with collective energy. There should've been updates every night in the media. There should've been governors speaking out against federal-level indifference. There should've been cooperation to try to limit illness and suffering. But none of that took place. People with HIV/AIDS were scorned and punished and excluded.\nIn addition, no one has ever been made accountable for the 600,000 American deaths during the AIDS crisis. When Reagan and (former North Carolina Sen.) Jesse Helms and Bush died, their obituaries barely mentioned their roles in that mass death experience. And those are very significant differences.\nIt's demoralizing to reflect on how, through the decades, the federal government has been so reliably reluctant to act in the face of a calamity -- depending on whose lives have been at stake.\nOne of the things that happens in America is that, when we have a cataclysm, it reveals fissures in society that have long been here. We already have a health-care system that's inadequate. We already have huge numbers of homeless people who aren't getting enough aid. We already have a public education system that doesn't function -- I teach in the City University of New York system, and we don't have paper to make copies for my students. That's the status quo. And now we're in a situation where we're dependent on people who make $11 an hour to carry the burden of the federal government's inadequate response.\nThe AIDS crisis revealed profound differences in race, gender and class in America in terms of who had access to care and whose lives mattered. We haven't yet seen those rifts reemerge with the coronavirus. But the irony of new medications and treatments in America is that once they finally happen, they're available only to people with adequate health insurance. That's what we've seen with HIV. We now have drugs that people who are newly infected can take and have a normal lifespan and become virally suppressed -- they can't infect anybody else. But in important ways, those drugs are dependent on where you live\nYou lived through the AIDS epidemic and were a member of ACT UP at the peak of the crisis. Are there any lessons to be learned from how LGBTQ people then responded to the catastrophe? I'm thinking specifically in terms of organizing.\nWhen your federal government is indifferent, people have to depend on one another. It's very hard to organize right now because there's so much chaos and fear. But we do have the ability to help one another financially, to help one another buy food, to help one another pay rent. And certainly for queer people, who overwhelmingly face familial homophobia, there's often a separation from the financial and emotional support that could be provided by a family unit.\nThe reason that the AIDS movement was able to force the country to change was because we had a collective identity that was global, and people with AIDS joined together. If everyone is locked into a privatized family unit, it's very hard to have that community sense of accountability.\nSomething I've been thinking about a lot in recent days is the distinct impact that the pandemic has already had on LGBTQ people when it comes to our histories. Within the past couple weeks, we've lost queer pioneers including the former drag queen Mona Foot and the transgender activist Lorena Borjas, whose deaths have been attributed to the coronavirus. Do you have any thoughts on how a vulnerable community might preserve its legacies, especially at a time when we can't physically come together?\nHistory has shown that, for queer people, going against the corporate model has been the thing that's been most successful in terms of preserving community ties and cultural representation. That's because the acceptable representations of our experiences are often to our detriment, and also water down what we've really lived. It's the rebellious, more underground, less rewarded stories that tend to be more truthful and last longer.", "url": "https://www.cnn.com/2020/04/05/politics/coronavirus-aids-hiv-sarah-schulman/index.html"}