{"authors": ["Ryan J. Foley", "David Pitt"], "date_download": "2020-05-04 20:07:48", "date_modify": "2020-05-04 20:07:48", "date_publish": "2020-04-16 13:41:01", "description": "JOHNSTON, Iowa (AP) — Gov. Kim Reynolds ordered residents in northeastern Iowa to practice stricter social distancing Thursday as she confirmed that workers at a second Tyson Foods plant are...", "filename": "_64e06ea0c2a83d2013240587e7d8d06b_1588622868.html", "image_url": "https://storage.googleapis.com/afs-prod/media/48abc84205be4f34ad17c90bf9bafb97/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_64e06ea0c2a83d2013240587e7d8d06b_1588622868.html", "title": "Governor orders stricter social distancing in NE Iowa region", "title_page": "Governor orders stricter social distancing in NE Iowa region", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Iowa Gov. Kim Reynolds updates the state's response to the coronavirus outbreak during a news conference at the State Emergency Operations Center, Thursday, April 16, 2020, in Johnston, Iowa. (AP Photo/Charlie Neibergall, pool)\nIowa Gov. Kim Reynolds updates the state's response to the coronavirus outbreak during a news conference at the State Emergency Operations Center, Thursday, April 16, 2020, in Johnston, Iowa. (AP Photo/Charlie Neibergall, pool)\nJOHNSTON, Iowa (AP) — Gov. Kim Reynolds ordered residents in northeastern Iowa to practice stricter social distancing Thursday as she confirmed that workers at a second Tyson Foods plant are infected with the coronavirus.\nReynolds said she was banning nearly all gatherings in the region that includes Cedar Rapids, Waterloo and Dubuque.\nShe said the state was responding to reports of infections at a Tyson Foods pork processing plant in Waterloo. The state was sending supplies to test hundreds of workers at the facility, which remained open Thursday.\nThe goal is to “understand what the scope of the outbreak may be and to get in front of that,” Reynolds said.\nShe did not directly respond to questions about whether she would order the plant closed, saying she trusted management to do “the right thing.”\nBut Black Hawk County Sheriff Tony Thompson said he witnessed inadequate social distancing and protective equipment for workers when he visited the plant last week.\n“There was clearly more that could and should have been done,” he said. The entire county, he said, was “paying the price for those lapses in protocol.”\nThompson warned that the outbreak creates danger for workers and health care providers, who face a dire shortage of sufficient personal protective equipment.\nThe county’s confirmed count of coronavirus cases has skyrocketed to 150 from 21 last week and most are linked to the plant, he said. The county reported its first death Thursday but officials didn’t identify the deceased.\nFor the second straight day, the governor struggled to explain which if any government agency was inspecting plants to ensure they have implemented worker safety protections. She repeated her inaccurate claim that the U.S. Department of Agriculture, which inspects food safety, was handling those matters.\nTyson said Wednesday that two workers have died following an outbreak at its Columbus Junction plant, where at least 148 have become infected. That plant has been closed since April 6 but the company hopes to reopen it next week.\nHundreds of workers didn’t show up for work at Tyson’s Waterloo plant in recent days because they are sick or are afraid of catching the virus, county officials said.\nMore than a dozen elected officials, including Waterloo’s mayor, signed a letter asking Tyson to suspend production so that cleaning and testing of workers could take place.\nTyson spokeswoman Liz Croston said the company was trying to protect workers “during this ever-changing situation,” while fulfilling its role in the nation’s food supply.\nReynolds has banned gatherings larger than 10 statewide while recommending even stricter voluntary social distancing practices, and order schools and many businesses closed. But she is one of the only governors not to issue a statewide stay-at-home order.\nUnder the new order, residents in the northeastern region can only gather with household members and must do everything possible to stay six feet away from others when in public. Weddings, funerals and other religious gatherings are exceptions and can include up to 10 people.\nThe order doesn’t close any more businesses, but directs employers to evaluate whether more workers can stay home and to take “reasonable precautions” to protect those who go in.\nViolating the order, which takes effect at 11:59 p.m. and lasts through April 30, is a simple misdemeanor.\nReynolds said northeastern Iowa was seeing an “increase of virus activity,” including outbreaks at long-term care facilities, more severe illnesses and higher hospitalization rates. So far, 28 people in the region have died, including at least 17 at a Cedar Rapids nursing home.\nThe statewide death toll from the pandemic increased Thursday to 60 after seven more died. Two more outbreaks at nursing homes were confirmed, bringing the total to nine.\n___\nFoley reported from Iowa City.", "url": "https://apnews.com/64e06ea0c2a83d2013240587e7d8d06b"}