{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:00:11", "date_modify": "2020-05-04 16:00:11", "date_publish": "2020-04-01 07:01:00", "description": "A good portion of the population are cooped up in their homes. And if the cabin fever isn't getting to them, surely the global cloud of human suffering is. That doesn't make for a jocular vibe.", "filename": "2020_04_01_us_april-fools-coronavirus-prank-trnd_index_1588608011.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331165442-april-fools-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_april-fools-coronavirus-prank-trnd_index_1588608011.html", "title": "April Fools' Day pranks are not funny right now. Don't do them.", "title_page": "April Fools' Day pranks are not funny right now. Don't do them. - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "So let's take this opportunity to clarify something: April Fools' Day pranks are not funny right now. Don't do them.\nMany people have been pretty clear that April Fools' Day is all but canceled this year, seeing that pretty much every day for the past few weeks has felt like a terrible prank.\nEven Google, which traditionally shares April Fools' Day pranks and jokes across its platforms, is abstaining from such tomfoolery this year, according to a Business Insider report\nAnd if you still think something like a coronavirus prank may be a big laugh, keep in mind a few things that could happen: You could get arrested. You could endanger other people's lives. And, at the very least, your friends and family will know just how unfunny you really are.\nThinking of pretending you have coronavirus? In the US, a man who allegedly coughed in the direction of a grocery clerk and said he had the virus was charged with making a terrorist threat in the third degree, according to the New Jersey Attorney General's office.\nLooking to cause a scene? A Missouri man who filmed himself licking items on a Walmart shelf while saying \"Who's afraid of the coronavirus\" was charged with making a terrorist threat in the second degree, the St. Louis Post-Dispatch reported.\nAnother woman in Pennsylvania is facing criminal charges after intentionally coughing on grocery store produce, CNN reported last week. The store had to throw out $35,000 worth of food as a caution.\nEven local officials in different countries have asked citizens not to pull any coronavirus pranks this year.\nIn Thailand, the Attorney General's office warned people against spreading fake news, the country's English-language newspaper Nation Thailand reported\nAnd in India, Maharashtra Home Minister Anil Deshmukh announced on Twitter that legal action would be taken against people pulling coronavirus stunts on WhatsApp and other social media platforms.\nYour messy attempt at a prank may not earn you a criminal record, but consider what will actually happen if you hop onto Facebook and say, \"Hey ma, I've got coronavirus!\"\nNot only will your loved ones worry about you, you'll send anyone who's had contact with you in the last two weeks into apoplexy. You may even get health officials poking around asking questions, or end up taxing already-suffocating medical resources with your foolery.\nBe sure to tell the exhausted health care worker who has to deal with you that it was \"just a joke.\" They'll find it hilarious.\nApril Fools' Day pranks have always been a dicey endeavor, but they're going to be even more difficult to pull off if you can't even get close to someone. No, that's not a challenge.\nSocial distancing bubbles are sacred now. We're literally being tasked with keeping each other healthy. Is that enough to sacrifice for whatever scheme you've cooked up in your self-isolated sopor?\nHere's a better April Fools' Day prank this year: Stay very far away from people, wash your hands, and don't pluck at the few fragile little threads holding together our collective sanity.\nIt'll be a hit.", "url": "https://www.cnn.com/2020/04/01/us/april-fools-coronavirus-prank-trnd/index.html"}