{"authors": [], "date_download": "2020-05-04 20:24:47", "date_modify": "2020-05-04 20:24:47", "date_publish": "2020-04-17 07:09:18", "description": "RALEIGH, N.C. (AP) — Sales of chicken products by a North Carolina-based processor directly to the public as a result of the COVID-19 outbreak led to a traffic jam at the State Farmers Market,...", "filename": "_ffb302bf017680b4ff7584af70d4bd81_1588623887.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ffb302bf017680b4ff7584af70d4bd81_1588623887.html", "title": "Sales of chicken by processor causes traffic jam at one site", "title_page": "Sales of chicken by processor causes traffic jam at one site", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Sales of chicken by processor causes traffic jam at one site\nRALEIGH, N.C. (AP) — Sales of chicken products by a North Carolina-based processor directly to the public as a result of the COVID-19 outbreak led to a traffic jam at the State Farmers Market, authorities said.\nBuyers driving up to the House of Raeford sale on Thursday backed up Raleigh’s Centennial Parkway and Lake Wheeler Road, which is the access to the farmers market from Interstate 40, about a mile (1.6 kilometers) away, news sources reported.\nState Department of Transportation personnel closed the Lake Wheeler Road exit off the interstate and detoured traffic around the area.\nHouse of Raeford is selling chicken in North Carolina and three other states. It said in a statement that stay-at-home orders issued as a result of the pandemic have led consumers to stock more meat products than normal. It said demand has led to shortages of chicken in the marketplace.\nSpokesman Dave Witter said sales at a single location began three weeks ago and expanded to six of the company’s seven plants in the Southeast. More sales are scheduled for Friday.\nSales occur from Tuesday through Saturday in North Carolina, South Carolina, Georgia and Louisiana, and Witter said sales will continue as long as the company thinks it benefits the public as well as House of Raeford.", "url": "https://apnews.com/ffb302bf017680b4ff7584af70d4bd81"}