{"authors": ["Jim Acosta"], "date_download": "2020-05-04 16:04:35", "date_modify": "2020-05-04 16:04:35", "date_publish": "2020-04-02 00:07:26", "description": "Despite White House claims that President Donald Trump and the administration did everything right in response to the coronavirus, a source close to the task force said tougher social distancing measures implemented earlier in the pandemic could have blunted the severity of the current crisis.", "filename": "2020_04_01_politics_white-house-measures-make-a-difference_index_1588608275.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331230558-01-trump-coronavirus-briefing-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_white-house-measures-make-a-difference_index_1588608275.html", "title": "Source close to coronavirus task force: Despite what White House is saying, tougher measures implemented earlier 'might have made a difference'", "title_page": "Source close to coronavirus task force: Despite what White House is saying, tougher measures implemented earlier 'might have made a difference' - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Despite White House claims that President Donald Trump and the administration did everything right in response to the coronavirus, a source close to the task force said tougher social distancing measures implemented earlier in the pandemic could have blunted the severity of the current crisis.\nIt all depends, the source said, whether there were coronavirus infections in the US that were going undetected during the initial weeks of the outbreak, when the Trump administration was falling behind on testing for the virus nationwide.\nNumerous public health experts have said those cases were likely going undetected, considering the lack of widespread testing.\n\"If there were no infections out there, then there was nothing to mitigate,\" the source said. \"If there were infections under the radar, it might have made a difference.\"\nA Trump adviser working with White House officials on messaging for the pandemic response said Trump \"took a gamble\" that warmer weather would cause the virus to dissipate, siding with aides who were pushing back on the dire warnings coming from doctors on the coronavirus task force.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/white-house-measures-make-a-difference/index.html"}