{"authors": ["Ryan Browne"], "date_download": "2020-05-04 16:57:45", "date_modify": "2020-05-04 16:57:45", "date_publish": "2020-04-08 22:20:15", "description": "The US military is surging hundreds of doctors and nurses into some of the New York City hospitals that have been hardest hit by the coronavirus as the city's mayor, Bill de Blasio, is calling for even more military help in combating the pandemic.", "filename": "2020_04_08_politics_military-doctor-surge-nyc_index_1588611465.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200328161910-new-york-coronavirus-javits-hospital-room-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_military-doctor-surge-nyc_index_1588611465.html", "title": "Military sending doctors into New York hospitals hard hit by coronavirus as new facilities sit mostly empty", "title_page": "Military sending doctors into New York hospitals hard hit by coronavirus as new facilities sit mostly empty  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The US military is surging hundreds of doctors and nurses into some of the New York City hospitals that have been hardest hit by the coronavirus as the city's mayor, Bill de Blasio, is calling for even more military help in combating the pandemic.\n\"We are flooding the area with medical teams,\" chief Pentagon spokesman Jonathan Hoffman told reporters Tuesday.\nThe deployment of military medical personnel directly to hospitals represents a recent change in tactics for the Defense Department, which had already deployed a US Navy hospital ship and converted the Javits Convention Center into a make-shift field hospital as part of its coronavirus response.\nHowever, both the hospital ship, the USNS Comfort, and the temporary hospital at the Javits Center still remain mostly empty, an issue the Pentagon attributes to communication challenges between local civilian hospitals and the military that have hindered patient transfers, and that the military says it is actively working to fix.\nDeputy Secretary of Defense David Norquist acknowledged the shift in tactics Thursday.\n\"We have evolved our response to the crisis as the situation's evolved,\" Norquist told reporters at the Pentagon, saying \"originally the goal was maximize the number of beds.\"\n\"But what we're seeing is that inside New York City, many of the hospitals are still able to manage the workload, what they're suffering from is doctors getting sick, or nurses, or capacity. And so the request has been, hey, rather than trying to always move the patients to you, when we have gaps can you move the doctors to us,\" he added.\nThe focus on personnel as opposed to new facilities comes as New York Democratic Gov. Andrew Cuomo says the need for the Comfort and Javits Center may be decreasing.\n'We just need more help'\n\"The number of patients hospitalized is down,\" Cuomo said Wednesday, adding that, \"we don't just look at day-to-day data, you look at the three-day trend, but that number is down.\"\n\"If the hospitalization rate keeps decreasing the way it is now, then the system should stabilize over these next couple of weeks, which will minimize the need for overflow on the system that we have built in at Javits and at the USNS Comfort,\" Cuomo added.\nThe Pentagon said Tuesday that 325 military medical personnel have arrived in New York and would start embedding in 11 public hospitals on Wednesday, including New York City Health and Hospitals-Bellevue, Coney Island, Elmhurst, Harlem, Jacobi, Kings County, Lincoln, Metropolitan, North Central Bronx, Queens, and Woodhull.\n\"Each hospital is receiving 20 to 30 medical personnel to augment the hospital's civilian staff. This includes doctors, assistants, nurses, respiratory therapists and other professionals,\" Hoffman said\nDe Blasio acknowledged the surge in personnel Wednesday, saying that nearly 300 military medical personnel have been deployed throughout New York City's public hospitals, but said that additional help is needed \"quickly.\"\n\"We just need more help, particularly when it comes to personnel,\" de Blasio said at a press briefing, reiterating his request of 1,450 medical military personnel from the federal government.\nThe mayor's appeal reflects the ongoing challenges of responding to the pandemic in New York, the country's epicenter of the disease. The state saw 779 coronavirus-related deaths Tuesday, the single highest coronavirus-related death toll to date, Cuomo said Wednesday.\nThe chief of the National Guard Bureau said Wednesday that the death toll in New York City has risen significantly, with National Guard forces helping the city cope with the dramatic increase.\n\"They've been involved and continue to be involved unfortunately in mortuary affairs,\" Gen. Joseph Lengyel told reporters in a conference call Wednesday.\n\"I mean a normal, non-COVID sort of a day, you know maybe 25 people need to be removed from homes that, where they've passed away,\" Lengyel said. \"Those numbers are up significantly, and 150 people a day are needing to be taken via mortuary affairs and we're concerned -- we have some National Guard units that are trained to do this, so that people can be -- human remains treated with dignity and respect,\" he added.\nA Pentagon spokesman said Tuesday that additional military assistance was on the way, saying, \"we also expect an additional 775 medical professionals to travel to New York City in the coming days to further support our efforts. These will be a mix of Army, Navy, and Air Force personnel, including Air Force reservists.\"\nLengyel said Wednesday that he doesn't know why more patients aren't being sent to the Javits military hospital in New York, even as de Blasio called for more help.\nThe Javits Center military hospital in New York is currently treating 134 patients, the Pentagon said Thursday in an update on its coronavirus efforts. It has a current capacity of about 1,000 beds and is expected to be built out to accommodate a total of around 2,500 beds.\nComfort\nThe USNS Comfort hospital ship, which is docked off Manhattan, currently has 62 patients and has treated 79 to date. It has a capacity of 500 after being reconfigured to treat coronavirus patients, a change made in recent days due to the prevalence of coronavirus positive patients.\nThe USNS Comfort is staffed by about 1,000 medical personnel. The Javits Center currently has a medical staff of about 900 drawn mostly from several Army field hospitals, according to Pentagon officials.\n\"The Javits Center is up and running, it's staffed with people and they are prepared to take patients across the spectrum from COVID positive to, you know, the full array of people who need treatment, so as to why there is such a small number of folks in there, I really can't tell you,\" Lengyel told reporters Wednesday. \"I know they have capacity. They are prepared to service people, whoever shows up and needs medical care.\"\nWhile Javits has had few patients to date, military medical personnel assigned there have provided assistance in other ways.\nResponding to a request for immediate assistance, a Javits-based team of 37 soldiers \"facilitated the emergency transfer of 18 patients who are critically ill with\" coronavirus from two hospitals in Queens to three local hospitals and the USNS Comfort Tuesday, US Northern Command said in a statement.\nThe military has worked to streamline the process of admitting patients and a defense official tells CNN that they expect the number of patients on the USNS Comfort to increase in the coming days, now that the ship is accepting coronavirus-positive patients.\nA top general helping to oversee these efforts said that the military has dispatched two-man teams to local hospitals to bolster communication and facilitate the transfer and referral processes.\n\"We put together two personnel in those teams, a doctor and a nurse, to go out to the hospitals and sit down with them and explain what patients we were taking for the Comfort and for the Javits Center, and then help them screen their records, because they're working hard at hospitals and -- and really had a hard time having the time to do that. So those two personnel in those teams going out has made a huge difference,\" Maj. Gen. Bill Hall, the Commander of the Joint Task Force Civil Support, told reporters on a phone call Tuesday.\nNY State Governor Andrew Cuomo is seen during a press conference at the COVID-19 field hospital site at the Javits Center in New York , NY, USA on March 30, 2020.\n\"The level of understanding of what the hospitals need and the level of understanding of what we're able to provide has grown. And so, we're seeing our patient count go up, and we're continuing to work that every day to make sure that we can help them offload the patients that we can accept at the Javits Center,\" he added.\nThe general said another challenge is the patients themselves, some of whom may be reluctant to be transferred to a military hospital.\n\"They have to give their consent to come here,\" Hall said, adding that, \"generally when you go to a hospital you know what to expect.\" But for patients who are told, \"'Hey, we want to move you to the Comfort or we want to move you to the Javits Center,' overcoming that fear of that gap of information, I think is critical to them coming to these locations,\" Hall said.\nThe unused military hospital capacity raises questions about the process being used to set-up medical facilities to cope with the coronavirus.\nWashington state Democratic Gov. Jay Inslee announced Wednesday that the military field hospital currently stationed at the Century Link Field Event Center in Seattle \"will be returned to the Federal Emergency Management Agency so it can be deployed to another state facing a more significant need,\" according to a statement from his office.\nLt. Gen. Todd Semonite, commanding general of the US Army Corps of Engineers, which is building out the Javits Center facility and others, said that in time the military would assess what facilities will be built or kept. For now, he said, \"I get my guidance from the Secretary of Defense to say, you make sure we have the facilities available.\"\nAdding that \"we're moving fast,\" Semonite added, \"my task is when FEMA tells me to build, you know, two thousand in Denver, we're going in to build two thousand.\"\nThe Army Corps efforts to build out the Javits military hospital are part of a three-pronged effort the Pentagon says it is \"aggressively pursuing\" in New York City.\nCNN reported earlier that eight Army Urban Augmentation Task Forces began deploying yesterday, with four of those teams are going to the Javits Center, three to the New Jersey Expedition Center, and one to operations in Stamford, Connecticut. An additional 775 Air Force and Navy medical personnel have \"arrived at Joint Base McGuire-Dix-Lakehurst yesterday and will continue their movement to New York City to support relief operations,\" according to the Pentagon.\nDe Blasio thanked the military for its support Wednesday, saying that 291 highly trained and effective medical personnel, \"many of them with the kind of military experience that makes them very, very ready to handle the toughest situations,\" are now deployed in the city's public hospitals.\nWe are \"very grateful that our Armed Forces have come forward to help our public hospitals, but we will need more help and we need it quickly,\" de Blasio said.\nThis story has been updated with comments from the Pentagon.", "url": "https://www.cnn.com/2020/04/08/politics/military-doctor-surge-nyc/index.html"}