{"authors": ["Tami Luhby"], "date_download": "2020-05-04 16:54:41", "date_modify": "2020-05-04 16:54:41", "date_publish": "2020-04-07 22:23:47", "description": "Crowds of Floridians lined up to obtain paper applications for unemployment benefits this week after the state's online and phone systems were overwhelmed by a crush of newly jobless residents.", "filename": "2020_04_07_politics_florida-unemployment-benefits-covid_index_1588611281.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408131227-unemployment-lines-hialeah-fl-1-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_florida-unemployment-benefits-covid_index_1588611281.html", "title": "Floridians line up to get paper unemployment benefits forms", "title_page": "Unemployment benefits: Floridians line up to get paper forms - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Crowds of Floridians lined up to obtain paper applications for unemployment benefits this week after the state's online and phone systems were overwhelmed by a crush of newly jobless residents.\nAerial footage showed hundreds of people in South Florida waiting for forms on Tuesday, when the Florida Department of Economic Opportunity rolled out the option.\nThe move stems from an executive order issued last week by Republican Gov. Ron DeSantis, which directed the agency to \"take all necessary actions\" to improve access to the unemployment benefits program amid a historic spike in joblessness due to the coronavirus pandemic\nIt also comes a week after DeSantis changed his mind and issued a stay-at-home order , joining dozens of other states trying to stem the spread of the disease.\nMany states are contending with skyrocketing numbers of unemployed residents as businesses lay off or furlough their workers after being forced to shut their doors. State agencies, including Florida's, are upgrading their servers and adding call center staff to bolster capacity\nLike their peers in other states, many Floridians have been left unable to file their initial claims because the agency's online system keeps crashing and the call center is overloaded. DeSantis called the filing problems \"totally unacceptable\" at a news conference on Monday.\nResidents can download the form from the agency's site and mail it in. Or they can go to CareerSource locations, which can provide the applications and assist Floridians with submitting it. FedEx is also offering free printing and mailing of the forms at more than 100 storefronts across the state.\nBut, the department warns, it could potentially take longer to process the paper form than an online application.\nMore than 300,000 Florida residents applied for jobless benefits in the last two weeks of March.\nThis story has been updated with details of people turning out to wait in line.", "url": "https://www.cnn.com/2020/04/07/politics/florida-unemployment-benefits-covid/index.html"}