{"authors": ["Clare Foran", "Haley Byrd", "Manu Raju"], "date_download": "2020-05-04 16:10:20", "date_modify": "2020-05-04 16:10:20", "date_publish": "2020-04-02 15:50:52", "description": "House Speaker Nancy Pelosi on Thursday announced the creation of a new bipartisan House select committee on the coronavirus crisis that will exercise oversight of the federal response to the pandemic and be chaired by Majority Whip Jim Clyburn.", "filename": "2020_04_02_politics_coronavirus-house-committee-pelosi_index_1588608620.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326151023-01-pelosi-elected-speaker-2019-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_coronavirus-house-committee-pelosi_index_1588608620.html", "title": "Pelosi announces House committee on coronavirus crisis to exercise oversight of pandemic response", "title_page": "Pelosi announces House committee on coronavirus crisis to exercise oversight of pandemic response - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) House Speaker Nancy Pelosi on Thursday announced the creation of a new bipartisan House select committee on the coronavirus crisis that will exercise oversight of the federal response to the pandemic and be chaired by Majority Whip Jim Clyburn.\nThe speaker told reporters on a conference call that the committee's immediate focus will be on \"the here and now,\" not the Trump administration's initial response to the pandemic, though she said there will come a time when such a review will be appropriate.\nShe said the committee will \"have an expert staff and the committee will be empowered to examine all aspects of the federal response to coronavirus and to ensure that the taxpayers dollars are being wisely and efficiently spent to save lives, deliver relief, and benefit our economy.\"\nPelosi said the committee will be able to exercise oversight and would have the authority to issue subpoenas.\n\"It's no use having a committee unless you have subpoena power,\" she said.\n\"We would hope there would be cooperation,\" she added. \"We want to make sure there are not exploiters out there.\"\nWhile Pelosi has the power to propose the formation of such a select committee, the House must vote on a resolution to actually create it, according to the House rules. But that's unlikely to happen in the near term given that the House is not expected to have any votes before April 20, and when exactly the House will return is still uncertain.\nPelosi also discussed her view that Congress will need to take further legislative action to deal with the crisis.\n\"Every day we see the need for further action,\" she said, adding, \"House Democrats have continued our work in daily conference calls with our frontline personnel and each other,\" she said.\nHouse GOP Leader Kevin McCarthy reiterated on Thursday that he disagrees with Pelosi's push to craft a fourth coronavirus response bill, saying Congress should instead be focused on making sure the first three bills are implemented well.\nA fourth stimulus bill \"is not appropriate at this time,\" he said during a phone call with reporters.\n\"I'm for infrastructure in the future,\" McCarthy said, but he wants to ensure it is \"targeted, that it works.\" Asked about President Donald Trump's support for a large infrastructure package to boost the economy, McCarthy said Trump would also \"want it to be targeted and timely.\"\nMcCarthy also criticized Pelosi's decision to form a House select committee on the coronavirus crisis, arguing that such a committee would be \"redundant\" because existing House committees are able to exercise oversight, and there are other oversight provisions in the coronavirus legislation that has been passed.\nMcCarthy also said he's concerned that Clyburn will be heading the committee.\n\"Congressman Clyburn is the one who thought that this crisis is an opportune time to restructure government. That's not what we should be doing,\" the California Republican said.\nMcCarthy cautioned that getting the select committee up and running would require a House vote.\n\"I don't know when we'd go back and vote on this. I don't know what the budget would be. I don't know what the responsibility would be. And I'm just wondering, does the speaker not trust the Oversight Committee?\" he said.\nTreasury Secretary Steve Mnuchin said later Thursday that he does not support the creation of a select committee either. Asked during the White House press briefing whether he thought the committee was necessary, Mnuchin said, \"I don't.\"\n\"Both parties wanted us to have oversight, wanted us to have transparency. We have full transparency,\" he said, referring to the oversight panel created as part of the stimulus package. \"And again, that committee will review the money that we're spending,\" Mnuchin added.\nPresident Donald Trump also criticized the formation of such a committee. \"Here we go again,\" Trump griped at Thursday's news conference as he bemoaned \"witch hunt after witch hunt after witch hunt.\"\n\"It's time to get this enemy defeated. Conducting these partisan investigations in a pandemic is a big waste of vital resources, time, attention,\" Trump said.\nWhen asked if she would support a commission to investigate what unfolded in the onset of the crisis, Pelosi said she that is \"a big supporter of after-action review,\" and there is \"absolutely\" a need for one in this case.\nShe said it's \"something that we should discuss\" and it would have to be bipartisan. Anything that affects this many Americans, she added, needs an after-action review — \"not to point fingers, but to ensure that it doesn't happen again in the manner in which it happened.\"\n\"Right now, we just have to work together to get through this. But as we do, we don't want to make more mistakes,\" she said.\nThe creation of the panel comes after Congress passed a massive and far-reaching stimulus package with an estimated price tag of roughly $2 trillion to respond to the economic and public health fallout from the rapid spread of the devastating disease.\nThe legislation stands as the largest emergency aid package in US history and represents a massive financial injection into a struggling economy with provisions aimed at helping American workers, small businesses and industries grappling with the economic disruption.\nPelosi called on all Americans to take care of themselves amidst the ongoing crisis.\n\"Take care, wash your hands, hydrate, and as I always say, you can never dance too much, especially when you're home,\" she said.", "url": "https://www.cnn.com/2020/04/02/politics/coronavirus-house-committee-pelosi/index.html"}