{"authors": ["Sherisse Pham", "Cnn Business"], "date_download": "2020-05-04 15:58:24", "date_modify": "2020-05-04 15:58:24", "date_publish": "2020-03-31 15:39:19", "description": "At Huawei's first ever virtual press conference on Tuesday, CEO Eric Xu waited patiently as dozens of reporters attempted to get the moderator's attention on video conferencing platform Zoom.", "filename": "2020_03_31_tech_huawei-coronavirus-changes_index_1588607904.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331131758-01-huawei-beijing-0308-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_tech_huawei-coronavirus-changes_index_1588607904.html", "title": "Desk dining and mandatory health checks: How Huawei is returning to work", "title_page": "Desk dining and mandatory health checks: How Huawei is returning to work - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) At Huawei's first ever virtual press conference on Tuesday, CEO Eric Xu waited patiently as dozens of reporters attempted to get the moderator's attention on video conferencing platform Zoom .\nThe first question was often: \"Can you hear me?\"\nAs for many companies in China, Huawei is having to find new ways to work under strict conditions aimed at preventing another upsurge in coronavirus cases.\nThe world's largest telecommunications equipment maker and China's leading smartphone brand re-opened its Shenzhen headquarters and another office nearby in early February, after a government-ordered lockdown ended.\nHuawei holds its first ever virtual press conference. My Hong Kong apartment (and many other reporters apartments I might add!) made a guest appearance during the Q&A session #huawei #COVID19 #business #news pic.twitter.com/aYoTm4SFev\nWhile the severe restrictions on travel and work have been lifted, daily office life has changed substantially.\nOver at Huawei headquarters, wining and dining clients is now impossible. The sales and marketing team, for example, can't invite executives from carrier companies to Shenzhen and usher them into a brand new exhibition hall showing off Huawei's 5G network equipment. The team now hosts virtual tours instead.\nHealth app\nEmployees are having to form new habits. They have to complete a \"daily health check-in\" using a mobile app, before they're allowed to enter Huawei offices. CNN Business was sent images of the app by a Huawei spokesperson. Staff must confirm that they don't have a fever or any other coronavirus symptoms and that they are not in quarantine. If they forget to fill in the questionnaire, their employee ID card stops working until a manager gives the all clear.\nThe impact is visible too, the spokesperson said. There are fewer buses shuttling people around Huawei's sprawling campus, and the ones in service have blocked off every other row to ensure people stay a safe distance apart. That means more employees are driving their own cars, and competing for spots in Huawei's staff parking lots.\nAl desko dining\nStaff cafeterias are closed. Lunch boxes are delivered to a central point before being distributed around the building. Everyone has been asked to eat at their desks.\nHuawei's new routine illustrates how even as China is trying to restart its economy as the outbreak there subsides, life is anything but normal.\nIf there's one positive lesson the company has learned from the pandemic so far, it's that \"you don't have to sit face-to-face to have a good meeting, and you don't really have to all sit in one room to have a good press conference,\" Xu said on Tuesday.\nWhile the immediate crisis may have passed, Huawei is now operating in a vastly different business environment.\nThe pandemic has brought about \"new, unexpected challenges, like economic decline, financial turmoil and also shrinking market demand,\" Xu said. Smartphone sales in China collapsed this quarter, as the country practically ground to a halt to contain the outbreak.\nHuawei has been working with clients around the world to ensure the internet can handle the surge in online activities, like virtual meetings and school classes, and streaming TV shows.\nLast year, the company reported annual revenue of 858.8 billion yuan ($121 billion), up 19% compared to a year earlier, with net profit of 62.7 billion yuan ($8.8 billion).\nProfit growth slowed significantly compared to 2018, and Xu blamed the US blacklist barring Huawei from buying key American tech for the slump.\nGoogle's GOOGL Looking ahead, Xu said 2020 will be a \"crucial year\" for Huawei, because it is still on that blacklist, which means the company's latest smartphones remain cut off frommobile services and popular apps like Gmail, YouTube and Google Maps.\nMeanwhile, with the coronavirus pandemic still fast developing \"we don't have the time yet to either forecast or evaluate how our annual numbers will look like,\" Xu said.\n\"For 2020, we'll try everything we can to continue to survive,\" he added.", "url": "https://www.cnn.com/2020/03/31/tech/huawei-coronavirus-changes/index.html"}