{"authors": ["Mark Gillispie"], "date_download": "2020-05-04 20:23:19", "date_modify": "2020-05-04 20:23:19", "date_publish": "2020-04-04 16:07:13", "description": "CLEVELAND (AP) — Ohio Gov. Mike DeWine said Saturday he won't require people to wear cloth masks in public but is strongly encouraging their use. He said he has signed an executive order removing...", "filename": "_8bec06c20b402a8e6455b472b231abd1_1588623799.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8bec06c20b402a8e6455b472b231abd1_1588623799.html", "title": "DeWine won't require wearing of cloth masks in public", "title_page": "DeWine won't require wearing of cloth masks in public", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CLEVELAND (AP) — Ohio Gov. Mike DeWine said Saturday he won’t require people to wear cloth masks in public but is strongly encouraging their use. He said he has signed an executive order removing training requirements for mental health and marriage counselors to make remote “telehealth” visits more accessible. A look at coronavirus-related developments in Ohio on Saturday:\n___\nPERSONAL PROTECTION\nDeWine at his daily briefing in Columbus said he will be wearing cloth masks sewn by his wife, Fran, when he is out in public. President Donald Trump on Friday also encouraged the use of masks, but said he didn’t think he would wear them.\n“They’re not a substitute for social distancing, but it’s something we can do and should be accepted,” DeWine said.\nThe state is working to procure more N95 masks for medical workers and people working on the “front lines,” DeWine said. He noted that the state has heard from doctors and nurses who have been wearing the same mask throughout the day.\nWithout providing details about where it is coming from, DeWine said the a plane is due to arrive Tuesday with the state’s first shipment of personal protection equipment.\n“We want to make sure this personal protection equipment is there for everyone who needs it in the state of Ohio,” DeWine said.\nOhio Health Department Director Dr. Amy Acton said Saturday that homemade masks “won’t make you bulletproof” against the coronavirus, but will help with slowing its spread and “buying us time.”\n___\nCASES\nThe state Health Department said Saturday that 3,739 people have tested positive for the coronavirus and 102 people have died thus far. That’s compared with 3,312 confirmed cases and 91 deaths on Friday. Just over 1,000 people have been hospitalized.\nThere were 3,312 reported cases and 91 deaths on Friday.\nFor most people, COVID-19 displays mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can be more severe, causing pneumonia or death.\n___\nCORRECTIONAL FACILITIES\nThe first Ohio prison inmate has tested positive for COVID-19. The inmate is housed at the Marion Correctional Institution where at least one employee also has tested positive.\nThe Ohio Department of Rehabilitation website shows all of Marion’s 2,535 prisoners have been quarantined along with all 929 prisoners at the Toledo Correctional Institution.\nCounty health officials have told employees at a federal prison in eastern Ohio where two inmates have died from COVID-19 to use self-quarantine protocols when not at work.\nThe president of a union representing most of the 320 at FCI Elkton in Lisbon employees told The (East Liverpool) Review that two inmates are currently hospitalized and tests results for a third inmate who died are pending.\nUnion official Joseph Mayle said 80 of the low-security prison’s 2,457 inmates have been isolated after displaying COVID-19 symptoms and 16 new prisoners have been quarantined for 14 days.\nTwo prison employees have tested positive thus far, Mayle said.\n___\nCHURCH BULLETINS\nA Roman Catholic church in Cincinnati has canceled a Good Friday tradition of “praying the steps” dating back 160 years.\nThe faithful at Holy Cross Immaculata Church each Easter season slowly climb the 96 steps leading to the church in the Mount Adams neighborhood while praying and reflecting on their way up.\nA Cincinnati police officer will be stationed at the bottom of the steps to prevent anyone from climbing.\nThe Catholic Bishops of Ohio earlier this week announced the suspension of all publicly celebrated masses and liturgies through at least May 3.\n___\nCOLLEGE NEWS\nVirtual commencements will be held at Ohio State University and the University of Toledo officials next month, school officials said.\nThe May 3 Ohio State commencement will be live streamed with Apple CEO Tim Cook delivering the commencement address, President Michael Drake said. Diplomas to around 12,000 graduates will be mailed at a later date.\nSpring commencement at the University of Toledo is May 9.\nOhio’s 23 community colleges have donated more than 200,000 medical face masks and pairs of gloves to hospitals and first responders along with 25 much-needed ventilators.", "url": "https://apnews.com/8bec06c20b402a8e6455b472b231abd1"}