{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 21:07:19", "date_modify": "2020-05-04 21:07:19", "date_publish": "2020-04-30 21:04:13", "description": "A crowded funeral that violated social distancing rules is itself a symptom of bigger issues in the community that are getting overlooked.", "filename": "entry_hasidic-jews-coronavirus-guidelines_n_5ea992cec5b6fb98a2b61e96_1588626439.html", "image_url": "https://img.huffingtonpost.com/asset/5eab1914220000690d827f3f.jpeg?cache=8zrljnsmwl&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_hasidic-jews-coronavirus-guidelines_n_5ea992cec5b6fb98a2b61e96_1588626439.html", "title": "Why Singling Out A Hasidic Funeral Won't Make The Community Healthier", "title_page": "Why Singling Out A Hasidic Funeral Won't Make The Community Healthier | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "On Tuesday, throngs of Hasidic Jews (specifically Satmar, which is one of many Hasidic sects) gathered to witness the funeral of a deeply respected rabbi from their community who died from COVID-19. Roughly 2,500 people came to the funeral, standing “shoulder to shoulder,” in violation of the state’s social-distancing guidelines to slow the spread of the coronavirus.\nSadly, this was not an isolated incident. Rather, stories of Hasidic and Haredi (“Ultra-Orthodox”) Jews gathering for everything from funerals to weddings have proliferated in the media.\nBut what happened next on Tuesday only made matters worse. New York City Mayor Bill de Blasio (D) tweeted a bullheaded “message to the Jewish community, and all communities” that “the time for warnings has passed,” and said police would arrest people gathering in large groups.\nThe explosion was immediate (one that I myself took part in) and powerful: Jews have a scary history of being blamed for many societal ills, and one of those happens to be literal ills. When the bubonic plague hit, Jews were blamed for its spread, and the backlash was so severe that, in total, at least 200 Jewish communities were wiped out. In one incident, 2,000 Jews were burned alive.\nAnd there is no doubt that the mayor’s statement was problematic at best: There are over 1 million Jews in New York City, and speaking of them as if they are a monolith is dangerous, especially in a city that has become known for rising violent anti-Semitism. Experts say there’s been a global spike in anti-Semitic sentiment since COVID-19 began to spread. It’s understandable that Jews are touchy about political leaders saying something even verging on anti-Semitism during a plague.\nDe Blasio apologized ― as he should have. But the debate didn’t solve a very real problem as the city ― and the world ― grapples with the coronavirus pandemic. Measures meant to protect people are often up against centuries of cultural norms that may conflict with them. They need to pierce through community distrust of governments, and individuals’ own desire to dictate the terms of their lives.\nThat’s true everywhere ― and it’s true among Hasidic communities of New York. Blaming them for a pandemic’s spread isn’t going to fix the issues that allowed Tuesday’s funeral gathering to happen.\nDemetrius Freeman for HuffPost The Hasidic community in Williamsburg, Brooklyn.\nThe funeral on Tuesday was not a one-off incident. Here in New York, large gatherings of Hasidic Jews, from funerals to religious institutions, have consistently made headlines.\nThese gatherings have led to disaster. Williamsburg, Borough Park and Crown Heights (the three major Hasidic neighborhoods in Brooklyn) have experienced horrific death tolls. Other Hasidic Jews and I have heard of weddings and other mass gatherings followed shortly by a rash of infections and deaths.\nThis is a systemic problem that won’t go away just by pointing out that other areas of New York have had moments of people gathering, or that they are a minority within the community (both of which are true, but have little relevance in a discussion about communal dynamics).\nMany leaders were slow to act, and even when they did, it has been clear that they were unwilling or unable to stand up to the extremists in their communities who refuse to listen.\nOne example is Chabad, the Hasidic community I used to belong to, where the center of religious life is an institution called “770” (due to its address on 770 Eastern Parkway in Crown Heights). The late rebbe (religious leader of Hasidic sects) centered the building, and in many ways sent the message that the building itself had a special level of holiness. This makes the building a vibrant, exciting location: Jews from all over the world congregate there, and on Shabbat it is often packed to the brim despite its size.\nAll of that makes it a horrific place for a virus to spread. And it would seem obvious to anyone that such a building must be shut down during a pandemic. But the bais din, a court of appointed rabbis that oversees issues concerning Jewish law in communities, did not immediately call for its closure when social distancing was implemented, but rather only that those 65 or older should not enter. And in a show of defiance, one of the leaders of 770 insisted that it would remain open until the arrival of the Messiah.\n770 leaders were met with quick backlash from their own community, which led to a closure, and the bais din quickly changed its messaging. But every day the building remained open was another day that risked subjecting visitors to infections and deaths. Worse, there are still groups praying outside of the building itself, in defiance of the bais din’s order. 770 is, painfully, the location with the second most social distancing complaints in the city, after Central Park.\nAnd while the rabbis claim their hands are tied, they’re not coming down hard on those who violate their decrees. Rather, they describe young men gathering outside 770 as “lost puppies.” In other words, if they wanted to create more of an outcry, they could. But they won’t.\nThis dynamic exists in other Hasidic communities in varying ways. In one Satmar community, a rebbe was seen baking matzo among a large group of people, without any social distancing, shortly after being diagnosed with the coronavirus. Some schools have remained open, and when parents have tried to report it to the authorities, they were reportedly directed instead to de Blasio’s Jewish “community liaison.”\nHowever, it would be wrong to imply that “Hasidic communities” have, as a rule, refused to follow social distancing guidelines. De Blasio’s tweet wouldn’t have been fixed by simply saying “Hasidic” rather than “Jewish.”\nDemetrius Freeman for HuffPost A man wears a mask in Williamsburg, Brooklyn, on April 29.\nHasidic communities are not monolithic. Yet it is all too easy to see them this way because Hasidic Jews appear monolithic to the outside world due to their otherness and separateness.\nThis issue can be seen even in the way many rise to their defense. Stories of these same Hasidic Jews volunteering in droves to donate plasma have been used to paint them all as heroic and angelic. But often the language used is the same as with those who blame all Hasidic Jews, implying that these communities are one-dimensional.\nThe reality is that Hasidic communities are like other societies: They have systemic problems, and they have systemic strengths. Whether one outweighs the other is worth discussing, but not in the context of whether they are or aren’t collectively responsible for a pandemic’s spread.\nThis one-dimensional, disconnected and inhuman approach to Hasidic Jews doesn’t just fuel hate and dismissal. It also helps feed the very systemic problems that must be urgently addressed if these gatherings are to finally stop.\nActivists in Brooklyn Hasidic communities have spent years advocating on issues like sexual abuse and divorce.\nMany have suffered greatly for their activism, and some so severely that they’ve either stopped their activism or left their communities entirely.\nMore often than not, the biggest cudgel used to silence these voices is the danger of “airing dirty laundry.” There is a deep fear of outsiders seeing problems within Hasidic communities, which often leads to people becoming more invested in muzzling activists than in stopping actual problems.\nThis happened to me, as an activist in Crown Heights who spoke up about social distancing problems in my community. And I’ve seen it happen to other activists who worked tirelessly to stamp out gatherings that were taking place in their communities. One, a journalist, would walk into synagogues where men were holding prayers and videotape them in an effort to deter them from gathering. Others would quietly pass on images of weddings to other Jews with an audience, like The New York Times’ Bari Weiss, who would then share them with their online followers.\nAll of this was done in the interest of saving lives. But when powerful people like de Blasio call out all Jews publicly, they give credence and power to those who would rather keep issues hidden than face them. The mayor, in essence, handed those anti-activists a gift: He sent the message that airing dirty laundry is, in fact, dangerous, when the actual danger is in choosing to violate social distancing guidelines, and in the ways latent anti-Semitism comes to the fore during disasters.\nThe only solution, then, to the problems these Hasidic communities are facing, and the only way forward if the non-Jewish and non-Hasidic worlds want to actually make any change in these domains, is to finally treat Hasidic Jews as humans. Not just humans, but human societies.\nHumans are complicated, with unique flaws and strengths. So too are human societies. Few are fully angelic or fully evil. None can be defined by one aspect. And all are strengthened when the angels within are elevated and the demons within are exorcised.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/hasidic-jews-coronavirus-guidelines_n_5ea992cec5b6fb98a2b61e96"}