{"authors": ["Rachel La Corte"], "date_download": "2020-05-04 21:09:21", "date_modify": "2020-05-04 21:09:21", "date_publish": "2020-04-13 21:37:10", "description": "OLYMPIA, Wash. (AP) — Pierce County Superior Court Judge G. Helen Whitener was appointed Monday by Gov. Jay Inslee to the Washington Supreme Court. Whitener has served on the superior court...", "filename": "_38b6f46382dfed494caafaa8a39755ed_1588626561.html", "image_url": "https://storage.googleapis.com/afs-prod/media/650ec62730c247eeae702b128bbb9623/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38b6f46382dfed494caafaa8a39755ed_1588626561.html", "title": "Judge G. Helen Whitener appointed to state Supreme Court", "title_page": " Judge G. Helen Whitener appointed to state Supreme Court", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Pierce County Superior Court Judge G. Helen Whitener, left, listens as Washington Gov. Jay Inslee speaks during a news conference, Monday, April 13, 2020, at the Capitol in Olympia, Wash. Whitener was appointed Monday by Inslee to the Washington Supreme Court to replace Justice Charles Wiggins, who retired from the court at the end of March. (AP Photo/Ted S. Warren)\nPierce County Superior Court Judge G. Helen Whitener, left, listens as Washington Gov. Jay Inslee speaks during a news conference, Monday, April 13, 2020, at the Capitol in Olympia, Wash. Whitener was appointed Monday by Inslee to the Washington Supreme Court to replace Justice Charles Wiggins, who retired from the court at the end of March. (AP Photo/Ted S. Warren)\nOLYMPIA, Wash. (AP) — Pierce County Superior Court Judge G. Helen Whitener was appointed Monday by Gov. Jay Inslee to the Washington Supreme Court.\nWhitener has served on the superior court since being appointed by Inslee in 2015, and previously served as a judge on the Board of Industrial Insurance Appeals. Before becoming a judge, she worked as both a prosecutor and defense attorney.\nShe replaces Justice Charles Wiggins, who retired from the court at the end of last month. She will have to run in the November general election to maintain the seat, and then again in 2022, when Wiggins’ term would have ended.\nWhitener, 55, was born in Trinidad and moved to the U.S. to attend college, earning her bachelor’s degree from Baruch College in New York and her law degree from Seattle University School of Law.\n“I think my background is so diverse and so varied that I represent just about every type of individual that could possibly come before the court,” said Whitener. “As far as equity and inclusion, it does not matter where you are, or who you’re dealing with. What we are to be concerned about is the impact our actions have on others and that has always been my focus and I hope I can continue doing that.”\nShe’s the second recent appointment by Inslee. Justice Raquel Montoya-Lewis, who was sworn in Jan. 6, is the first Native American justice to serve on the state’s highest court.\nThe other members of the court are: Chief Justice Debra Stephens, Justices Barbara Madsen, Charles Johnson, Susan Owens, Steven Gonzalez, Sheryl Gordon McCloud, and Mary Yu.\n“Judge Whitener inspires lawyers and non-lawyers alike with her relentless work to raise awareness for matters of race, justice and equity,” Inslee said in a written statement. “She is tireless in her commitment to building a justice system that works for all, and as a Supreme Court justice, she will have an even greater platform to promote justice for everyone in Washington state\nStephens said that while a public swearing-in ceremony will have to be delayed because of the ongoing COVID-19 outbreak, Whitmer will be informally sworn in as soon as possible so that she can begin her work on the court.\n“Judge Whitener’s reputation for excellence precedes her and I know she will serve the people of Washington well in her new role as a justice,” Stephens said in a written statement.\nWhitener, who was awarded the Washington State Bar Association’s C.Z. Smith Excellence in Diversity and Inclusion Award last year, serves as co-chair of the Washington State Minority and Justice Commission and as a member of the Civil Legal Aid Oversight Committee and the International Association of LGBT Judges.\n“While many know her for her work in Pierce County, I can personally attest to her traveling statewide to inspire and mentor youth from underrepresented backgrounds into the legal profession,” Washington State Bar President Rajeev Majumdar said in a written statement. “Now the entire state will benefit from her human-centered and dignified pursuit of justice.”", "url": "https://apnews.com/38b6f46382dfed494caafaa8a39755ed"}