{"authors": ["Joan Biskupic"], "date_download": "2020-05-04 17:02:11", "date_modify": "2020-05-04 17:02:11", "date_publish": "2020-04-10 16:00:52", "description": "Supreme Court Justice Stephen Breyer recently plunked down before his computer camera for a lively Zoom chat with students at the United Nations International School, offering a glimpse of the justices' private negotiations against a canvas of how the law develops in America.", "filename": "2020_04_10_politics_stephen-breyer-zoom-coronavirus_index_1588611731.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181130144240-01-stephen-breyer-file-1130-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_stephen-breyer-zoom-coronavirus_index_1588611731.html", "title": "Justice Stephen Breyer reflects on Supreme Court and life in isolation", "title_page": "Justice Stephen Breyer reflects on Supreme Court and life in isolation - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Supreme Court Justice Stephen Breyer recently plunked down before his computer camera for a lively Zoom chat with students at the United Nations International School, offering a glimpse of the justices' private negotiations against a canvas of how the law develops in America.\nSpeaking from his Cambridge, Massachusetts, home, Breyer's mien alternated between intellectual former law professor dropping French literary allusions and animated 81-year-old grandfather bursting with enthusiasm for the US constitutional structure, both of which he is.\nIn the video posted online , the 1994 appointee of President Bill Clinton recounts his distress during the 2000 Bush v. Gore presidential election controversy. He also spoke of the importance of changing social attitudes in the #MeToo era and brushed off current \"court packing\" proposals that recall the 1930s era.\nAn image of the columned Supreme Court appeared as Breyer's backdrop, and his bespectacled face filled the frame. He was wearing a blue shirt, open collar, no black robe. Breyer said he is \"self-isolating\" with his wife, a daughter, and the daughter's children. He spoke with dismay of the coronavirus pandemic but soberly looked ahead: \"We'll get over it.\"\nHe explained the basics at America's highest court: Of the 8,000 petitions it receives, fewer than 80 are accepted to review. Most of these appeals, from people who have lost cases in lower courts, are rejected out of hand after an initial screening by the justices' law clerks. Breyer noted that justices mainly want to hear disputes that would allow them to resolve disparities in lower court rulings, to bring more uniformity to the law.\nBreyer and his eight judicial colleagues are now finishing opinions in dozens of cases heard before the coronavirus pandemic began, including over LGBTQ worker discrimination, state abortion regulation, New York gun restrictions and the Trump administration's plan for deportation of certain undocumented immigrants who came to the US as children. The justices have suspended their oral argument sessions -- leaving 20 cases in an indeterminate state -- and have added fewer new cases for the months ahead.\nEven though they handle hundreds of petitions for review each week, only about 10 to 15 filings are actually discussed by the justices, Breyer said, as he revealed a few details of their private sessions. (Those meetings in a conference room adjoining Chief Justice John Roberts' chambers are now conducted largely by phone; only Roberts is regularly there in person, according to a court spokeswoman.)\nBreyer said Roberts was \"succinct\" in his usual opening of discussions of cases heard. As is tradition, the associate justices then speak and vote in order of seniority, beginning with Justice Clarence Thomas , then Ruth Bader Ginsburg , then Breyer and the rest.\n\"There's some back and forth discussion\" before a vote is taken, Breyer said, adding that the first vote is sometimes tentatively cast. \"We think we know how we're deciding\" a case, he said, but justices can change their minds in the opinion-drafting process.\nHe recalled some past cases more vividly than others. \"The one that has stuck with me the most, which was really stressful, was Bush v. Gore,\" he said of the 2000 presidential election dispute between Republican Texas Governor George W. Bush and Democratic Vice President Al Gore.\n\"The question was who was supposed to get the electoral votes from Florida and did (the state) have to have a recount,\" Breyer said, referring to the tallies from the November Florida balloting that were practically tied. \"We had to decide that in about a week, and we had different opinions. The majority decided that Florida could not recount the ballots. And some of us thought that they could recount the ballots. But it was stressful, because everybody in the United States was interested.\"\nHe recalled the television cameras that encircled the building and all the news reporters awaiting the justices' ruling, which came at 10 p.m. on December 12, 2000. Breyer was one of the four dissenters to the decision that favored Bush. Breyer remains part of a four-justice liberal minority on the ideologically split bench.\nRegarding current \"court packing\" proposals, raised by liberal advocates who want to add more justices to the bench, Breyer was skeptical but declined to elaborate. \"I do not, in this hour, want to be making news for the newspapers,\" he said.\nIn a recent conversation with The Wall Street Journal for its \"Life in Quarantine\" series, Breyer similarly stayed on message, speaking of his reading list, meditation and jogging routines, and favorite pot roast recipe.\nOn his recent Zoom chat with the United Nations International School students, Breyer was asked about any \"judicial framework\" for addressing sexual abuse in the age of #MeToo. He said legislators are responsible for the laws in this area. \"It's not an easy problem,\" he added. \"A lot of it has to do with ... social attitudes, which are changing, and which probably should change. You can control a certain amount by law, but you can't change everything. Social attitudes matter.\" With some chagrin, he said of his answer, \"That's the best I can do.\"\nHe spoke of the give-and-take during court oral arguments, now on hold because of Covid-19, voicing some pity for lawyers caught in the crossfire of justices' competing questions and views.\nHe invited the students to visit Washington so they could watch. \"You should come down to this building here,\" he said, gesturing to his backdrop. \"You should come. You should hear a case argued. I would love it.\"", "url": "https://www.cnn.com/2020/04/10/politics/stephen-breyer-zoom-coronavirus/index.html"}