{"authors": ["Alicia Wallace", "Cnn Business"], "date_download": "2020-05-04 16:24:10", "date_modify": "2020-05-04 16:24:10", "date_publish": "2020-04-06 21:59:00", "description": "The one-way aisle is the latest traffic-control measure to be implemented by US grocery retailers to encourage physical distancing during the coronavirus pandemic.", "filename": "2020_04_06_business_coronavirus-grocers-one-way-aisles_index_1588609450.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406175335-walmart-shoppers-coronavirus-florida-0405-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_coronavirus-grocers-one-way-aisles_index_1588609450.html", "title": "Kroger and Walmart test one-way aisles as a coronavirus preventative measure", "title_page": "Kroger and Walmart test one-way aisles as a coronavirus preventative measure  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "San Francisco (CNN Business) The one-way aisle is the latest traffic-control measure to be implemented by US grocery retailers to encourage physical distancing during the coronavirus pandemic.\n, the nation's largest supermarket operator, is testing one-way aisles at stores in certain markets to determine their effectiveness in providing appropriate distancing between customers, according to a statement released Monday.\n\"We expect this to help more customers avoid coming into close contact with others as they shop,\" Dacona Smith, Walmart US' executive vice president and chief operating officer, wrote in an April 3 announcement\nThe efforts to direct in-store shopping flow are part of a growing slew of measures put in place by retailers in recent weeks to help protect both employees and shoppers. Essential businesses like grocery stores and pharmacies have installed plexiglass partitions at checkouts, designated shopping hours for older and immune-compromised individuals, installed distancing decals and signage, and started to meter store traffic.\nStarting Tuesday, Kroger will reduce its store capacity by 50% to limit the number of customers who are shopping at the same time.\n\"By leveraging QueVision, our technology system that uses infrared sensors and predictive analytics, we will be able to more efficiently support our new capacity limits, creating a safer environment for our customers and associates,\" Yael Cosset, Kroger's chief technology and digital officer, said in the announcement.\nKroger is encouraging employees to wear protective masks and gloves. The grocer said it has ordered masks for its US workforce and also plans to expand employee temperature checks to stores.\nA Kroger spokesperson could not be immediately reached for comment.", "url": "https://www.cnn.com/2020/04/06/business/coronavirus-grocers-one-way-aisles/index.html"}