{"authors": ["Senior Reporter", "Huffpost Life"], "date_download": "2020-05-04 20:13:00", "date_modify": "2020-05-04 20:13:00", "date_publish": "2020-04-30 17:56:31", "description": "In teletherapy sessions, patients are venting about the stress, anxiety and other mental health concerns they're dealing with at this stage of the...", "filename": "entry_therapy-issues-coronavirus_l_5ea9a8d7c5b6106b8ed0dfd5_1588623180.html", "image_url": "https://img.huffingtonpost.com/asset/5eaaffa2250000b711eb0a5c.jpeg?cache=0IFz4mmyyo&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_therapy-issues-coronavirus_l_5ea9a8d7c5b6106b8ed0dfd5_1588623180.html", "title": "9 Issues People Are Bringing Up Most In Therapy During Coronavirus", "title_page": "9 Issues People Are Bringing Up Most In Therapy During Coronavirus | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The coronavirus pandemic has upended nearly every aspect of life as we know it. These sudden and dramatic shifts have, understandably, taken a toll on people’s mental health.\nMany are turning to teletherapy (online, rather than in-person, sessions to comply with social distancing guidelines) to vent about their fears and frustrations and to find healthy ways to manage increased levels of stress and anxiety.\nWe asked mental health professionals about which concerns their clients are bringing up most at this stage of the pandemic. Here’s what they said.\n1. “I feel burned out.”\nThose on the front lines — health care professionals, delivery drivers, postal workers, garbage collectors, grocery store employees and law enforcement officials, just to name a few — are facing physical, mental and emotional exhaustion.\nBut even those who are able to do their jobs at home, as well as people who are out of work, are experiencing a degree of burnout, said Ryan Howes, a psychologist in Pasadena, California.\n“Their physical output and workload may have declined, but the massive changes that have taken place, the waiting for this to be over, and some new responsibilities like homeschooling or trying to communicate electronically take their toll as well,” he said.\nPlus, many of the activities and interactions that replenish us when we feel depleted are off the table right now.\n“Whatever used to get them excited for the day or the weekend — like social events, travel or trying a new restaurant — all of those assets are on hold,” Howes said. “So every effort feels like they’re giving from a deficit.”\n2. “I’m really worried about my family.”\nStress about relatives’ health and safety is a theme that keeps popping up in sessions, according to Chicago therapist Anna Poss.\n“This includes worry about family members who are in high-risk groups, are essential workers on the front lines or are not taking guidance about social distancing and safety precautions seriously,” she said.\nPoss works with her patients to develop tools to help manage this anxiety, such as journaling, meditation and other relaxation practices.\n3. “I feel guilty about finding pockets of joy in all of this.”\nSome of Howes’ clients are enjoying certain aspects of life in quarantine. Then they beat themselves up for feeling that way, knowing that others are having a much harder time.\n“They enjoy not going to work, or they like spending more time with family, or they like taking a break from social events,” he said. “And when some joy creeps in, they feel like a monster for feeling good when so many are struggling and suffering.”\nHowes’ advice? Rather than criticizing yourself, embrace those sunny spots when they appear. “That might help ourselves and others get through this,” he said.\n4. “I’m grieving the loss of my old life.”\nmixetto via Getty Images Mental health professionals reveal the most common concerns they're hearing from patients at this stage of the COVID-19 pandemic.\nWhen we think of grief, we often think of mourning the loss of a person or perhaps a pet. But you can grieve other types of losses, too.\n“[My clients] have lost their routine, their schedule, their sense of security, their plans for the next few months, and of course many have lost jobs or loved ones,” Howes said. “Once they can identify that feeling as grief, they can give themselves permission to cry, seek comfort, process the loss and eventually move forward.”\n5. “I don’t know what my future looks like anymore and that scares me.”\nHumans crave control over their lives. We look for signs of certainty about what the future holds. Because of the pandemic, we no longer have a sense of what the coming weeks, months, even years might look like.\nZainab Delawalla, a clinical psychologist in Atlanta, said her clients worry about how the pandemic will change the trajectory of their lives. This is particularly unsettling for her patients who were already in the middle of a transition when the pandemic hit, “like graduating seniors, those between jobs or those who recently moved their elderly parents to assisted living facilities.”\n“We can often look back and reflect on a critical event or decision that changed the course of our path,” Delawalla said. “But it is rare to experience in real time that something that’s happening today is potentially changing the future course of our lives.”\n6. “I’m worried about money.”\n“Fears about financial security and losing jobs are not merely the products of over-anxious minds right now,” Poss said.\nHer clients have legitimate concerns about how the pandemic will impact their careers, health insurance and other financial plans.\nFor example, Poss said people are wondering: “Will they be able to retire? Will it be a struggle like the 2008 recession? Will people with chronic disease have insurance to cover treatment?”\n7. “Being home all the time has created friction with my partner.”\nCouples who once spent most of the day apart are now living and working under the same roof. This “forced togetherness,” as Delawalla put it, has brought certain relationship tensions to the surface.\n“Division of household labor, for example, is something that is much easier to estimate now that both partners are home all the time,” she said. “What seemed equitable before the pandemic because of varying work schedules no longer seems that way.”\nTo address this, Delawalla helps her clients learn how to stop taking their partner’s behavior personally.\n“For example, when your partner is doing something annoying, instead of thinking ’he/she is giving me a hard time,’ reframe that into ‘he/she is having a hard time.’”\n8. “I’m questioning my faith.”\nSessions with Delawalla’s clients have taken a more philosophical turn amid the pandemic. Some are losing faith in the religious or spiritual beliefs that once brought them comfort. Others have concerns about the government’s ability to protect them in a crisis of this magnitude.\n“The feeling that you have to rely only on yourself for protection has added to the anxiety for some and, for others, has led to feelings of anger,” she said.\n9. “It feels like the whole world is anxious right now.”\nIt seems like everyone you talk to these days is experiencing some degree of anxiety — and that’s certainly unsettling. But some of Howes’ clients who have dealt with anxiety for a long time say they actually feel prepared in some ways for the present circumstances.\n“They are recognizing that they have been training for this for a good portion of their life, and they feel equipped to battle this anxiety,” he said. “Some of them have already spent months or years battling their anxiety in therapy or through reading books or joining online forums. They’ve acquired a lot of self-knowledge and anxiety-busting tips along the way.”\nThose who lived with anxiety pre-pandemic now feel “seen and heard” by others in a way they didn’t before.\n“Friends and family members are telling them, ‘This is what you’ve felt for so long? Now I understand!’” Howes said. “They’re no longer the outsider with an invisible disease others think they can just ‘snap out’ of. They’re veterans with compassion and tools to share.”", "url": "https://www.huffpost.com/entry/therapy-issues-coronavirus_l_5ea9a8d7c5b6106b8ed0dfd5"}