{"authors": ["Mark Scolforo", "Michael Rubinkam", "Marc Levy"], "date_download": "2020-05-04 20:16:05", "date_modify": "2020-05-04 20:16:05", "date_publish": "2020-04-09 14:00:32", "description": "HARRISBURG, Pa. (AP) — Pennsylvania schools will remain shuttered for the rest of the academic year because of the coronavirus pandemic that has sickened thousands and caused hundreds of deaths...", "filename": "_f80805afc3a63b5ae60b6cfaaf6173e6_1588623365.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d33468f3b84841b0830f8965bf355988/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f80805afc3a63b5ae60b6cfaaf6173e6_1588623365.html", "title": "Schools ordered to remain closed until end of academic year", "title_page": "Schools ordered to remain closed until end of academic year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "School buses are parked at a depot Thursday, April 9, 2020, in Zelienople, Pa. Pennsylvania Gov. Tom Wolf said Thursday that schools will remain shuttered for the rest of the academic year because of the coronavirus pandemic. (AP Photo/Keith Srakocic)\nSchool buses are parked at a depot Thursday, April 9, 2020, in Zelienople, Pa. Pennsylvania Gov. Tom Wolf said Thursday that schools will remain shuttered for the rest of the academic year because of the coronavirus pandemic. (AP Photo/Keith Srakocic)\nHARRISBURG, Pa. (AP) — Pennsylvania schools will remain shuttered for the rest of the academic year because of the coronavirus pandemic that has sickened thousands and caused hundreds of deaths statewide, the governor said Thursday.\nThe extended shutdown order , issued by Gov. Tom Wolf’s education secretary, affects more than 1.7 million students in public and private K-12 schools. It means children will spend the rest of the year learning remotely. It also wipes out school plays and concerts, sporting events, field trips, proms and everything else that typically happens during the spring.\n“While this was a critical step for us to take to protect as many people as possible, it was not an easy decision to make,” Wolf said. “We all know that Pennsylvania’s schools are about more than academics.”\nIn a videotaped statement , Wolf lauded parents and caregivers who have “turned kitchens into classrooms,” schools that have continued providing free meals to needy kids, and teachers who are adjusting on the fly to a virtual classroom environment.\nWolf first closed schools March 13, initially for two weeks, as the virus continued its march across Pennsylvania. He tacked on another week before closing schools indefinitely, part of a series of progressively tougher measures meant to contain the virus outbreak and prevent hospitals from becoming overwhelmed.\nSchools will remain closed through the last day of the current academic year, a date that varies among districts because calendars are set by school boards.\nA state law passed last month mandates that schools provide an education during the pandemic, either by teaching new material or reviewing material that was already taught.\nEducation Secretary Pedro Rivera told The Associated Press that about half of the state’s 500 school districts have informed his department how they are continuing to educate children during the shutdown.\nIndividual school districts, meanwhile, will have to decide how they intend to handle commencement. It will depend on the extent to which social distancing and stay-at-home measures remain in place as graduation season nears, Rivera said.\nSome districts are making plans for virtual commencement exercises, he said.\nWhether school buildings will be able to reopen for summer programming beyond the end of the academic year also remains up in the air.\nWolf, a Democrat, has closed nonessential businesses and ordered all Pennsylvania residents to stay home during the pandemic.\nIn other coronavirus-related developments:\n___\nCASES\nThe Department of Health reported 1,989 new cases Thursday, bringing the statewide total to more than 18,000. There were 29 new deaths, for a statewide toll of 338.\nFor most people, the virus causes mild or moderate symptoms that clear up in a couple of weeks. Older adults and people with existing health problems are at higher risk of more severe illness, including pneumonia, or death.\n___\nOVERWHELMING ALCOHOL DEMAND\nThe Pennsylvania Liquor Control Board said Thursday it might open additional fulfillment centers to handle tremendous demand for its new online sales program.\nThe online system has been getting upwards of 2 million page hits a day since it launched last week, but the vast majority of would-be customers have been unable to place an order because of the program’s lack of fulfillment capacity.\nThe program filled about 1,800 orders per day this week, said board spokeswoman Elizabeth Brassell. Over its first eight days, the online system processed about 9,600 orders for 48,000 bottles worth nearly $900,000.\nPennsylvania’s state-controlled liquor stores and distribution system rang up about $2.7 billion in sales last year.\nThe state’s brick-and-mortar liquor stores have been shut down since March 17.\n___\nSTRAINED HOSPITALS\nThe pandemic is costing Pennsylvania hospitals and health systems up to $2 billion per month, a trade group said Thursday as it warned anew that some of them might not survive the crisis without government assistance.\nHospitals are spending hundreds of millions on supplies, frontline health care workers and expanded bed capacity. At the same time, their revenue is down 40% because all elective procedures have been canceled, said Andy Carter, president and CEO of the Hospital and Healthsystem Association of Pennsylvania.\nThe group has been pressing the Wolf administration and lawmakers for a state fund that would help hospitals build capacity, hire more clinicians and buy more protective gear. Carter said his members also want tax relief, liability protection and other help.\n“The financial strain on these organizations is enormous, and it is complicating the vital efforts underway at these hospitals,” he said.\nWolf’s spokeswoman, Lyndsay Kensinger, said Wolf is “working on a plan to provide immediate financial support for working capital” to hospitals.\n___\nTESTING SITES AND FIELD HOSPITALS\nState officials are making plans to open a mass testing site and a field hospital in northeastern Pennsylvania amid worrisome growth in confirmed cases of coronavirus in that part of the state.\nHealth Secretary Rachel Levine said the field hospital will be located in East Stroudsburg, in Monroe County. Monroe, Lehigh and Luzerne counties have the state’s highest rates of infection.\nA field hospital in Allegheny County is also planned.\nPhiladelphia has been setting up a field hospital at Temple University, while Delaware and Chester counties are setting one up at Glen Mills school in the suburbs.\nMeanwhile, mass testing sites in Montgomery County and Philadelphia are shutting down because the federal government will no longer fund them. The Department of Health said other testing sites continue to operate.\n___\nMARINER EAST PIPELINE\nConstruction on a massive pipeline project in southeastern Pennsylvania is in limbo.\nThe state Department of Community and Economic Development issued a waiver Monday to the owner of the Mariner East system, Texas-based Energy Transfer LP, allowing it to work despite Wolf’s order shutting down all non-life-sustaining business activity.\nBut the agency said it has since rescinded the waiver to give it additional scrutiny. The 350-mile, multibillion-dollar pipeline carries highly volatile natural gas liquids, much of it for export.\nEnergy Transfer said it’s continuing construction activity that is allowed for safety and security at 15 sites associated with the Mariner East project.\nEnergy Transfer has been heavily penalized for environmental violations at Mariner East.\n___\nINMATE VISITS\nThe Department of Corrections said Thursday it is now canceling inmate visits at state prisons indefinitely as a result of COVID-19.\nThe state’s prison visitation program has been shut down since March 13 as corrections officials seek to prevent the spread of the highly contagious coronavirus. The shutdown was originally slated to last 14 days, then was extended until April 10. To date, the prison system has reported seven cases in one prison.\nInmates are allowed video visits and are getting additional free phone calls and emails.", "url": "https://apnews.com/f80805afc3a63b5ae60b6cfaaf6173e6"}