{"authors": [], "date_download": "2020-05-04 20:28:56", "date_modify": "2020-05-04 20:28:56", "date_publish": "2020-04-14 02:56:07", "description": "OKLAHOMA CITY (AP) — A federal appeals court on Monday upheld a lower-court order that overturned the Oklahoma governor’s ban on abortions during the coronavirus outbreak emergency. The...", "filename": "_62eda55344d577f67e9a7b6a9c83dd6e_1588624136.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bc7989bfb15444b1a4a2496b0d7c32c8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_62eda55344d577f67e9a7b6a9c83dd6e_1588624136.html", "title": "Appeals court blocks Oklahoma COVID-19-related abortion ban", "title_page": "Appeals court blocks Oklahoma COVID-19-related abortion ban", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 3, 2020, file photo, Oklahoma Gov. Kevin Stitt delivers his State of the State address in Oklahoma City. A federal appeals court upheld a lower-court order Monday, April 13, that overturned the governor's ban on abortions during the coronavirus outbreak emergency. (AP Photo/Alonzo Adams, File)\nFILE - In this Feb. 3, 2020, file photo, Oklahoma Gov. Kevin Stitt delivers his State of the State address in Oklahoma City. A federal appeals court upheld a lower-court order Monday, April 13, that overturned the governor's ban on abortions during the coronavirus outbreak emergency. (AP Photo/Alonzo Adams, File)\nOKLAHOMA CITY (AP) — A federal appeals court on Monday upheld a lower-court order that overturned the Oklahoma governor’s ban on abortions during the coronavirus outbreak emergency.\nThe unanimous ruling by a three-judge panel of the Denver-based 10th U.S. Circuit Court of Appeals allows abortions to continue in Oklahoma, the ban issued by Gov. Kevin Stitt notwithstanding. In an eight-page opinion, the panel said it was letting stand a temporary restraining order issued April 6 by U.S. District Judge Charles Goodwin in Oklahoma City because it caused the state no irreparable harm, since Goodwin’s order expires April 20.\nThe ban was part of an executive order Stitt issued March 27 that banned all elective surgeries during the coronavirus outbreak. On April 3, Stitt extended the April 7 scheduled expiration of the ban until April 30.\nThere was no immediate comment from Oklahoma Attorney General Mike Hunter’s office.\nGovernors across the country have issued executive orders halting nonessential medical surgeries to free up hospitals, and Republicans have said abortions should be included under those mandates. Those bans, including Oklahoma’s, were challenged in court by Planned Parenthood, the American Civil Liberties Union, the Center for Reproductive Rights and local lawyers in each state.\nThe 6th U.S. Circuit Court of Appeals declined to hear an appeal by Ohio Attorney General Dave Yost seeking to reverse a judge’s temporary restraining order allowing abortion facilities in the state to continue performing surgical abortions.\nA federal judge temporarily blocked a ban in Texas last week but the 5th U.S. Court of Appeals quickly put that ruling on hold, pending a review of the case. U.S. District Judge Lee Yeakel of Austin, Texas, followed up with an order allowing abortions in Texas by medication or in cases where a delay in the procedure would push a pregnancy beyond the state’s 22-week legal cutoff. However, the 5th Circuit Court upheld the ban on abortions by medication.\nIn a statement, Nancy Northup, president and CEO of the Center for Reproductive Rights, said “It’s time for Oklahoma and other states to stop exploiting the pandemic to shutdown clinics. Oklahoma’s true motive has never been more apparent. This has nothing to do with the current pandemic — it’s purely politics.”", "url": "https://apnews.com/62eda55344d577f67e9a7b6a9c83dd6e"}