{"authors": ["Dan Merica"], "date_download": "2020-05-04 16:53:06", "date_modify": "2020-05-04 16:53:06", "date_publish": "2020-04-08 11:12:43", "description": "A top Democratic super PAC will begin running scores of new digital ads on Wednesday aimed at holding President Donald Trump accountable for a host of comments he has made about his administration's response to the coronavirus pandemic.", "filename": "2020_04_08_politics_priorities-usa-coronavirus-ads_index_1588611186.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405190737-02-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_priorities-usa-coronavirus-ads_index_1588611186.html", "title": "Democratic super PAC turns up focus on Trump's coronavirus response", "title_page": "Democratic super PAC turns up focus on Trump's coronavirus response - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A top Democratic super PAC will begin running scores of new digital ads on Wednesday aimed at holding President Donald Trump accountable for a host of comments he has made about his administration's response to the coronavirus pandemic.\nPriorities USA , which is now supporting former Vice President Joe Biden, will release seven digital ads that use the words of nurse and doctors against the President, fault him for a shortage of critical ventilators and turn comments he made doubting that anyone could have seen the crisis coming against him.\nThe ads -- along with efforts from other Democratic groups -- show how nearly all Democratic organizations have shifted their paid media to focus on the Republican response to coronavirus, a reflection of both the belief that the outbreak is a liability for the GOP and the reality that the virus has the full attention of all Americans. The ads will air in the key battleground states of Michigan, Pennsylvania, Wisconsin and Florida.\nThe ads are meant to establish that early in the coronavirus crisis, Trump downplayed the issue. They will run in both English and Spanish and are part of the nearly $8 million television and digital ad buy the group is currently funding.\nOther Priorities ads about the pandemic have already drawn the attention of the Trump campaign. After the organization began running an at titled \"Exponential Threat,\" the Trump campaign sent a cease and desist letter demanding television stations stop airing the ad.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/priorities-usa-coronavirus-ads/index.html"}