{"authors": [], "date_download": "2020-05-04 20:28:20", "date_modify": "2020-05-04 20:28:20", "date_publish": "2020-04-17 21:52:49", "description": "NORTHEAST HARBOR, Maine (AP) — It wasn't the destination wedding in Florida that they'd planned, but a Maine couple found a way to tie the knot in the middle of a pandemic. Bradley Gray and...", "filename": "_6daac3d32960f510c7652710a0eadfc7_1588624100.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6daac3d32960f510c7652710a0eadfc7_1588624100.html", "title": "Love finds a way, even in a pandemic, with some ingenuity", "title_page": "Love finds a way, even in a pandemic, with some ingenuity", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Love finds a way, even in a pandemic, with some ingenuity\nNORTHEAST HARBOR, Maine (AP) — It wasn’t the destination wedding in Florida that they’d planned, but a Maine couple found a way to tie the knot in the middle of a pandemic.\nBradley Gray and Teresa Norwood Gray got hitched Thursday at a drive-through window at a local bank in their hometown.\n“I threw it out there kind of as a joke at first. Then the more we talked about it, we’re like, oh, maybe that’ll work,” Bradley Gray told The Associated Press.\nThe officiant was inside the bank, behind the glass at the teller window. The happy couple stood outside, where they exchanged their vows. Guests in the parking lot practiced social distancing.\nTeresa Norwood Gray’s son walked her down the “aisle.” Local teens provided the music. Passing motorists stopped to watch.\n“Everyone needs a little lifting up right now. So the community really came together,” she said. “It gave them something to smile about.”\nThe novel coronavirus didn’t just ruin their warm-weather wedding. It also ruined their honeymoon. They were supposed to be departing Saturday on a cruise to the Caribbean.\nBut the happy couple is making the best of it. They were heading to the groom’s cabin in Maine. “It’s not quite as warm as the Caribbean but we’ll make it work,” Bradley Gray said.", "url": "https://apnews.com/6daac3d32960f510c7652710a0eadfc7"}