{"authors": [], "date_download": "2020-05-04 21:10:40", "date_modify": "2020-05-04 21:10:40", "date_publish": "2020-04-30 22:56:44", "description": "Fear of getting sick or worries that an employer isn’t providing adequate infection protection are generally not reasons someone can file for benefits.", "filename": "entry_workers-fear-coronavirus-unemployment_n_5eab54e3c5b65156135acb4d_1588626640.html", "image_url": "https://img.huffingtonpost.com/asset/5eab561c24000054028ea0d6.jpeg?cache=27v7y62ecn&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_workers-fear-coronavirus-unemployment_n_5eab54e3c5b65156135acb4d_1588626640.html", "title": "Workers Forced To Choose Between Infection Or Losing Unemployment Checks", "title_page": "Workers Forced To Choose Between Infection Or Losing Unemployment Checks | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "ATLANTA (AP) — Some of the millions of American workers laid off because of the coronavirus are beginning to face a tough choice — return to work and risk infection, or stay home and risk losing unemployment payments.\nThe decision is most pressing in states where governors have started allowing businesses such as restaurants to reopen with social-distancing restrictions.\nTyler Price, 26, was called back to his job at Del Frisco’s Grille in the Nashville suburb of Brentwood. Tennessee allowed restaurants to open dining rooms at 50% capacity, with servers wearing masks and being tested for fever.\nBut Price, who has yet to receive any unemployment benefits, is wrestling with what do. He said he is “highly susceptible” to respiratory illness and was hospitalized with pneumonia as a child.\n“I know what it feels like to be in a hospital, to be drowning in your own lungs,” said Price, who moved in with his mother near St. Louis after getting laid off. “It’s horrifying. It’s terrible. I don’t want to find myself there.”\nHe said waiting tables “is impossible to do under social distancing guidelines,” and he would prefer to draw unemployment payments.\nOn Thursday, the Labor Department reported that the business shutdowns and stay-at-home orders caused by the pandemic have led 30 million Americans to file for unemployment insurance, or roughly 1 of every 6 workers.\nThe design of the unemployment system adds to the pressure. If an employer calls back laid-off workers, they must report to work or are likely to lose their benefits.\nThat’s because unemployment insurance is designed to tide people over until they can get back to a job, said Michele Evermore, a senior policy analyst with the National Employment Law Project in New York.\n“An unemployed worker cannot refuse suitable work and still continue to collect unemployment insurance,” Evermore said. “Presumably, the job you used to have is suitable.”\nFear of getting sick or worries that an employer isn’t providing adequate infection protection are generally not reasons someone can file for benefits. The latter concern is getting more complicated because some businesses are lobbying to keep employees and customers from suing them over coronavirus transmission.\nLacey Ward, a hairstylist in Omaha, Nebraska, filed for unemployment benefits in mid-March and is still waiting for the first payment. She’s been forced to drain her family’s savings and feels increasing pressure to return to work. Still, she is worried that Gov. Pete Ricketts’ decision to let salons reopen Monday could put her, her husband and two young sons at risk.\nWard, 38, said she would prefer to collect unemployment until the risk from the virus subsides and it’s clearer whether she can offer services like shampooing. She co-owns the salon but makes money only off her own clients.\n“I would rather be safe than sorry,” Ward said. “We are not an essential field. I haven’t had my hair done in three or four months at this point. But what does it matter? Who are people seeing?”\nWard said she’s so concerned about spreading the virus that she plans to change clothes and wash her hair before she returns home.\n“We’re playing with fire, physically touching another person,” she said.\nSome workers are ready to go back. Kathryn Marsilli, 33, is a manager and server at The Collins Quarter restaurant in Savannah, Georgia.\nShe knows she may make less at work because of reduced business and would like a way for those with fears of the virus to stay home. But she said she wants to go back out of loyalty to the owner and because she’s not interested in trying to maximize her unemployment benefits.\n“My future where I work is more important to me than trying to get what I can now,” Marsilli said.\nOther workers may be tempted to hold on to unemployment. Especially in some low-wage regions, laid-off workers may receive more money with the state benefit and the additional $600 a week provided by Congress than they were on the job. The federal boost ends July 31.\nGeorgia labor officials are trying to balance the needs of business owners with the genuine concerns of workers. State Labor Commissioner Mark Butler said he’s telling businesses that are easing into reopening and don’t need all their employees to call in those who are willing to work and leave the others to the unemployment system.\nGeorgia also is allowing people to earn up to $300 a week before it begins to eat into their state unemployment benefit, meaning workers could earn more than $1,200 a week in total.\n“It was a way we could get more people back to work at reduced hours,” Butler said. “Otherwise, why would you go back to work at all?”\nJennifer Holliday is a manager at a restaurant in Oklahoma City called Zio’s Italian Kitchen, which plans to reopen its dining room Friday. She said getting furloughed employees to return has been difficult. Many are not returning her phone calls or messages.\n“There are some who want to just ride it out (until July) and take the unemployment,” Holliday said. “They don’t even have to apply” for other jobs.\n___\nSainz reported from Memphis, Tennessee. Associated Press writers Ken Miller and Sean Murphy in Oklahoma City; Grant Schulte in Lincoln, Nebraska; and Jim Vertuno in Austin, Texas, contributed to this report.", "url": "https://www.huffpost.com/entry/workers-fear-coronavirus-unemployment_n_5eab54e3c5b65156135acb4d"}