{"authors": ["Politics Reporter"], "date_download": "2020-05-04 20:26:47", "date_modify": "2020-05-04 20:26:47", "date_publish": "2020-04-28 20:47:53", "description": "Democrats say it will weaken worker protections. The issue is another sticking point in coming talks over the next relief package.", "filename": "entry_coronavirus-mcconnell-business-liability-congress-senate_n_5ea860e2c5b6dff6f3328ddc_1588624007.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8619e2500007210eb07f7.jpeg?cache=unnepxm0ga&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_coronavirus-mcconnell-business-liability-congress-senate_n_5ea860e2c5b6dff6f3328ddc_1588624007.html", "title": "Republicans Want To Shield Companies From Future Coronavirus Lawsuits", "title_page": "Republicans Want To Shield Companies From Future Coronavirus Lawsuits | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The Senate is scheduled to return to Washington next week to tackle an “urgent need,” according to Senate Majority Leader Mitch McConnell: the threat facing businesses from lawsuits related to the coronavirus pandemic.\nIn a statement announcing the chamber’s return, McConnell echoed complaints lodged by top business groups in recent weeks about the legal liability faced by the nation’s employers and health care providers, especially as some states move forward with reopening parts of their economy.\nMcConnell warned that “a massive tangle of federal and state laws could easily mean their heroic efforts are met with years of endless lawsuits.”\n“We cannot let that happen,” McConnell added on Monday. “Our nation is facing the worst pandemic in over a century and potentially the worst economic shock since the Great Depression. Our response must not be slowed, weakened, or exploited to set up the biggest trial lawyer bonanza in history.”\nDemocrats, meanwhile, rejected McConnell’s argument, saying that now is not the time to weaken protections for workers.\nTort reform has long been a goal of congressional Republicans, who argue that frivolous lawsuits help drive businesses into bankruptcy and deny compensation to actual victims.\nThe latest push to reform the nation’s civil justice system, however, appears to be led by groups such as the U.S. Chamber of Commerce and National Association of Manufacturers. They are calling on lawmakers to waive some legal liability in the next coronavirus relief package, according to The New York Times.\nTheir main concern appears to be that employees or customers may take advantage of the legal system and sue businesses they believe ― fairly or not ― are the source of their infection.\nTop labor groups, meanwhile, argue that the changes would encourage businesses not to adequately protect their employees and customers from the coronavirus.\n“It’s absolutely outrageous that employers and corporations are trying to shirk their legal responsibility at the same time they’re refusing to provide protective equipment and paid sick days to their workers,” Service Employees International Union President Mary Kay Henry said in a statement.\nTrump Wants Meat Plants Reopened\nPresident Donald Trump announced Tuesday he plans to order meat processing plants to stay open during the coronavirus pandemic in order to secure the nation’s food supply chain despite outbreaks, lack of protective gear and poor working conditions at several rural meatpacking plant communities, including one in Minnesota and another in Washington state.\nSome meat producers are appealing to their workers’ sense of civic duty and patriotism as a way to get them to return to work.\nNevertheless, McConnell suggested this week that he wants the liability protections to be included in the next coronavirus bill taken up by Congress in exchange for providing critical aid to states and localities whose revenues have dried up because of the ongoing pandemic. Democrats have called for at least $500 billion in additional aid to states and localities.\n“Before we start sending additional money down to states and localities, I want to make sure that we protect the people we’ve already sent assistance to, who are going to be set up for an avalanche of lawsuits if we don’t act,” McConnell said Monday during an interview with Fox News radio host Guy Benson.\nBut top congressional Democrats rejected the notion of waiving liability of businesses at this time, saying that it would further harm protections for workers.\n“Does that mean that if a boss tells a worker, ‘You gotta work next to somebody that has no mask,’ that worker can’t protect him or herself and the boss is immune from liability?” Senate Minority Leader Chuck Schumer asked Tuesday in an interview on MSNBC.\nHouse Speaker Nancy Pelosi, speaking in a press conference call on Tuesday, echoed Schumer’s remarks: “I don’t think at this time of the coronavirus there’s any interest in having any less protections for our workers. In fact, [there’s] even more.”\nAs Republicans push to shield companies from lawsuits, Democrats are demanding hazard pay and new safety protections in the next coronavirus stimulus package to be taken up by Congress.\nFifty-seven members of Congress sent a letter to Democratic and Republican leaders in the House and Senate on Monday night asking them to include premium pay for frontline workers, funding for child care and additional protections for workplace safety whistleblowers, among other asks.\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/coronavirus-mcconnell-business-liability-congress-senate_n_5ea860e2c5b6dff6f3328ddc"}