{"authors": ["Tami Luhby"], "date_download": "2020-05-04 16:18:45", "date_modify": "2020-05-04 16:18:45", "date_publish": "2020-04-04 11:51:14", "description": "Eight hours and 48 minutes.", "filename": "2020_04_04_politics_unemployment-benefits-states-coronavirus_index_1588609125.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403123218-camilla-christiansen-poole-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_unemployment-benefits-states-coronavirus_index_1588609125.html", "title": "Countless Americans cannot complete unemployment applications", "title_page": "Unemployment benefits: Countless Americans cannot complete unemployment applications - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "That's how long Camilla Christiansen Poole waited on hold with the North Carolina Division of Employment Security, trying to find out why she could not file for unemployment online\nThe Asheville, North Carolina, resident had been laid off from her job as a medical courier on March 24 -- one of a record number of people left without work because of the coronavirus crisis. She called the division dozens of times, only to be disconnected. But finally, on Monday, she was placed on hold.\n\"I pretty much was sitting still, besides walking my dogs,\" said Poole, who was prepared to stay on the line through the night. \"I was so scared. I knew it was probably a blessing that I had been looped into being on hold. I was really surprised when someone finally answered.\"\nYet while Poole is among the millions of economic victims of the pandemic, she is not one of the nearly 10 million Americans who filed for first-time unemployment benefits in the last two weeks of March -- because, like countless others, she hasn't been able to complete her application and be approved.\nThe crush of layoffs and furloughs have overwhelmed state unemployment agencies . More than 1,000 readers from coast to coast wrote to CNN in the last two days about the error messages, frozen screens, disconnected calls and busy signals they encountered when trying to file their initial claims.\nCongress is funneling $1 billion in stimulus funds to states to help them handle the unprecedented workload. The money can't come soon enough since most state agencies are dealing with antiquated technology and smaller staffs due to recent low unemployment rates.\nUnable to get through\nCamilla Christiansen Poole spent nearly 9 hours on hold with her state unemployment agency.\nWhen Poole finally got hold of a representative, she was told to upload two forms of identification, which she quickly did. But she has yet to be approved for unemployment benefits. Poole, who is married, has called dozens of times this week but has not been able to get through again.\n\"It's just highlighting how ill-prepared we were,\" said Poole, 43, who is talking to the couple's bank about possibly deferring their mortgage payment next month. \"It's super frustrating.\"\nThe agency said Friday that it is \"moving aggressively\" to better address the unprecedented spike in filings by hiring 50 more staffers, contracting with an additional 200-person call center, adding computer servers and purchasing new equipment.\nAbout 370,000 North Carolinians have filed for benefits since March 16, compared to 3,000 in a typical week before the pandemic hit.\nBusy signals and disconnects\nIn San Antonio, Texas, Liam Apperley put the state Workforce Commission on speed dial after being furloughed from his sales and training job at a corporate development company on March 16.\nApperley had called 5,257 times by midday Thursday -- he checked his cellphone account -- but would either get a busy signal, a message that all circuits were busy or an automated recording to hold the line, only to be disconnected or get a voicemail saying the agency was overwhelmed by calls. On Friday, he tried calling a minute before the office opened at 8 a.m., but got a message that it was closed. After that, all he heard were busy signals.\nMore than half a million Texans have filed for claims in the last 18 days, the commission said Friday. The number will soon outpace the total received in all of 2019. The agency recommended that residents stagger the days they file by the first digit of their area code to ease the crunch.\nLiam Apperley called his state unemployment agency more than 5,250 times to try to file his claim.\nApperley, 48, who is the main breadwinner for his family and has had to start drawing down his savings, would prefer the commission set up a system to take residents' contact information and return their call at a certain time, much like many companies do.\n\"Even if I were to get (a message) from Texas Workforce that said we'll call you back in three or four days, at least I'd know there's some light at the end of the tunnel,\" he said.", "url": "https://www.cnn.com/2020/04/04/politics/unemployment-benefits-states-coronavirus/index.html"}