{"authors": ["Don Babwin"], "date_download": "2020-05-04 20:15:31", "date_modify": "2020-05-04 20:15:31", "date_publish": "2020-04-07 15:34:21", "description": "CHICAGO (AP) — The death of a 59-year-old man who had been detained at the Cook County Jail was likely due to complications of the coronavirus, officials announced Tuesday. An autopsy will...", "filename": "_cd705bcf6baec7a36a8f14318d5c3706_1588623331.html", "image_url": "https://storage.googleapis.com/afs-prod/media/61a8591f49c04d1ab7dfe045c9febd58/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cd705bcf6baec7a36a8f14318d5c3706_1588623331.html", "title": "Chicago jail sees 1st possible coronavirus-related death", "title_page": "Chicago jail sees 1st possible coronavirus-related death", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Amid fears of the coronavirus pandemic, dozens of protesters drive around Cook County Jail and the Leighton Criminal Courthouse, honking their horns and chanting to demand the \"mass release\" of detainees at the jail, Tuesday, April 7, 2020. (Ashlee Rezin Garcia/Chicago Sun-Times via AP)\nAmid fears of the coronavirus pandemic, dozens of protesters drive around Cook County Jail and the Leighton Criminal Courthouse, honking their horns and chanting to demand the \"mass release\" of detainees at the jail, Tuesday, April 7, 2020. (Ashlee Rezin Garcia/Chicago Sun-Times via AP)\nCHICAGO (AP) — The death of a 59-year-old man who had been detained at the Cook County Jail was likely due to complications of the coronavirus, officials announced Tuesday.\nAn autopsy will be conducted to determine cause of death, the sheriff’s department said. It could be the first death related to the virus at the Chicago jail where since March 27 the number of detainees to test positive for COVID-19 has risen from 28 to 230. Additionally, 92 sheriff’s personnel at the jail have tested positive.\nGov. J.B. Pritzker reported 73 deaths from COVID-19 Tuesday, pushing the state’s total to 380, among 13,549 cases, up 1,287 from a day earlier.\nPritzker reported at his daily briefing that not counting temporary field-hospital beds being installed, the state has about 43% of its hospital beds available and better than one-third of its intensive-care beds. More than half of the state’s ventilators are available but thousands more are needed.\nThe county jail detainee, Jeffery Pendleton, was booked in July 2018 on charges of armed violence and being an armed habitual criminal, according to a sheriff’s office news release. After he tested positive for the virus, he was taken to Stroger Hospital on March 30 and died there Sunday.\nHe is the third in Illinois to die of COVID-19 while incarcerated. The Stateville prison in Joliet, where the virus has infected 95 inmates and 24 staff members , has reported two deaths of unnamed inmates, a man in his 50s on March 30 and a man in his 60s on Sunday.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nA judge in late March, in an effort to slow the spread of the virus in the jail, ordered bail reduction hearings to bring down the jail population by releasing detainees who are not considered a threat to public safety. Since the hearings began, the jail population has dropped by almost 900 to 4,567, according to sheriff’s department statistics.\nStatewide, Pritzker has released hundreds of low-level offenders, such as pregnant inmates and new mothers, and Monday signed an executive order allowing furloughs in certain cases of “medically vulnerable” inmates for the duration of the disaster declaration.\nA hearing to determine Pendleton’s $50,000 bond should be reduced was held March 26, but the motion on behalf of Pendletion was denied. His record included 15 convictions and a 1997 conviction of aggravated criminal sexual assault that resulted in a 15-year prison sentence, the sheriff’s department said.\nPendletion was one of 14 detainees being treated for the virus at outside hospitals, the sheriff’s department said.\n___\nAssociated Press writer John O’Connor contributed from Springfield, Illinois.", "url": "https://apnews.com/cd705bcf6baec7a36a8f14318d5c3706"}