{"authors": ["Alisha Ebrahimji"], "date_download": "2020-05-04 16:09:14", "date_modify": "2020-05-04 16:09:14", "date_publish": "2020-04-02 19:25:36", "description": "Two days after Pennsylvania re-opened its state-owned liquor stores online, it's already struggling to keep up with the \"overwhelming demand.\"", "filename": "2020_04_02_us_pa-liquor-online-sales-trnd_index_1588608554.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402113603-fine-wind-and-good-spirit-0318-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_pa-liquor-online-sales-trnd_index_1588608554.html", "title": "In Pennsylvania you can buy liquor and wine again online, but only if you're lucky", "title_page": "In Pennsylvania you can buy liquor and wine again online, but only if you're lucky - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Two days after Pennsylvania re-opened its state-owned liquor stores online, it's already struggling to keep up with the \"overwhelming demand.\"\nAs a result, Fine Wine & Good Spirits -- which sells all of the state's liquor -- is now regulating when people can order their liquor.\n\"Due to overwhelming demand, the online store is not available at this time,\" the Fine Wine & Good Spirits website reads. \"Please try again tomorrow or in the coming days. We apologize for the inconvenience.\"\nThe Pennsylvania Liquor Control Board said in a statement that access to the website will be randomized \"to avoid overwhelming the site with high traffic, prevent order abuse and prolong access throughout the day, so that order availability isn't exhausted in seconds or minutes each day.\"\nAll Pennsylvania state liquor stores and licensee service centers closed on March 17 to help slow the spread of coronavirus. The liquor control board handles all beverage alcohol distribution in Pennsylvania, operating nearly 600 wine and spirits stores statewide.\nRead More", "url": "https://www.cnn.com/2020/04/02/us/pa-liquor-online-sales-trnd/index.html"}