{"authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "date_download": "2020-05-04 15:56:39", "date_modify": "2020-05-04 15:56:39", "date_publish": "2020-04-15 17:45:10", "description": "The Supreme Court announced on Wednesday that it will hear two blockbuster cases concerning President Donald Trump's bid to shield his financial records on May 12.", "filename": "2020_04_15_politics_supreme-court-trump-finances-may_index_1588607799.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190919130022-20190918-trump-tax-forms-generic-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_politics_supreme-court-trump-finances-may_index_1588607799.html", "title": "Supreme Court sets oral arguments in Trump finance documents case for May 12", "title_page": "Supreme Court sets oral arguments in Trump finance documents case for May 12 - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Supreme Court announced on Wednesday that it will hear two blockbuster cases concerning President Donald Trump's bid to shield his financial records on May 12.\nThe cases were originally set to be heard in late March and early April but were postponed due to health concerns related to the coronavirus . Earlier in the week, the justices announced that instead of holding oral arguments for cases in their august courtroom they would participate remotely by phone and allow the public to listen in real time. The justices have never allowed the release of live audio of their proceedings.\nThe court has yet to release any details on how exactly the oral arguments will play out, and whether they will depart from their normal protocols given that they won't actually be able to see the lawyers or even their own colleagues.\nNo justices will be in the courtroom and there will be no on-camera component, court spokeswoman Kathy Arberg said earlier in the week.\nThe 10 cases will be heard May 4-6 and May 11-13. It is also unclear if the court will keep to its usual end of June deadline to release all opinions.\nRead More", "url": "https://www.cnn.com/2020/04/15/politics/supreme-court-trump-finances-may/index.html"}