{"authors": ["Amanda Jackson"], "date_download": "2020-05-04 16:34:31", "date_modify": "2020-05-04 16:34:31", "date_publish": "2020-04-08 08:04:02", "description": "Kristen Bell and Dax Shepard's brand, Hello Bello, is looking to hire camp counselors for their newly launched virtual kids camp.", "filename": "2020_04_08_us_kristen-bell-_ab4b2feac5791501a52b23ae0d9fa133_index_1588610071.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407212115-01-camp-hello-bello-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_kristen-bell-_ab4b2feac5791501a52b23ae0d9fa133_index_1588610071.html", "title": "Kristen Bell and Dax Shepard launched a virtual camp for kids. Now they are hiring camp counselors", "title_page": "Kristen Bell and Dax Shepard launched a virtual camp for kids. Now they are hiring camp counselors - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Kristen Bell and Dax Shepard's brand, Hello Bello, is looking to hire camp counselors for their newly launched virtual kids camp.\nHello Bello is the couple's family brand that sells baby products such as diapers, vitamins and lotions. At the beginning of April, Camp Hello Bello launched on the company's Instagram to help bring activities to kids to keep them busy as families stay home to curb the spread of coronavirus.\nDax Shepard and Kristen Bell.\n\"We know that parenting is hard (and now more than ever) and being home all day is even harder, so we want to do it together (virtually, of course),\" a press release from Hello Bello reads.\nFrom story time to crafting lessons to singalongs, Camp Hello Bello -- which is free -- offers a variety of activities during the week. Each Sunday, the schedule for that week's virtual camp is posted online\nThe company is now accepting applications for more camp counselors to fill up the schedule for the month of April.\nRead More", "url": "https://www.cnn.com/2020/04/08/us/kristen-bell-dax-shepard-hello-bello-camp-counselors-tnd-wellness/index.html"}