{"authors": [], "date_download": "2020-05-04 20:11:44", "date_modify": "2020-05-04 20:11:44", "date_publish": "2020-04-08 16:57:33", "description": "MANTEO, N.C. (AP) — A North Carolina county’s entry restrictions in the wake of the coronavirus pandemic are unconstitutional and beyond its authority, a federal lawsuit contends. The six...", "filename": "_25ad5ab7dd474462a58e2df1fcf8b0b7_1588623104.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_25ad5ab7dd474462a58e2df1fcf8b0b7_1588623104.html", "title": "Six people sue North Carolina county over beach access", "title_page": "Six people sue North Carolina county over beach access", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MANTEO, N.C. (AP) — A North Carolina county’s entry restrictions in the wake of the coronavirus pandemic are unconstitutional and beyond its authority, a federal lawsuit contends.\nThe six non-North Carolina residents said in the lawsuit filed in U.S. District Court for Eastern North Carolina that they should be able to prepare their rental properties for the spring and summer season, The Virginian-Pilot of Norfolk reported on Wednesday. The lawsuit calls for the borders to reopen right away.\nThe plaintiffs come from Virginia, South Carolina and Maryland, according to the lawsuit.\nDare County closed its borders to visitors and non-resident property owners three weeks ago in response to the COVID-19 outbreak as a means of limiting the number of people on a narrow barrier island.\nThe county set up checkpoints at the two bridges where highways enter the Outer Banks. Anyone who is not a resident of Dare, Currituck, Hyde or Tyrrell counties are not allowed in except those who have an emergency or are in extreme hardship.\nWhile people from neighboring counties can enter and leave, the plaintiffs are banned “solely because they are residents of another state,” according to the lawsuit.", "url": "https://apnews.com/25ad5ab7dd474462a58e2df1fcf8b0b7"}