{"authors": ["Casey Tolan"], "date_download": "2020-05-04 16:18:37", "date_modify": "2020-05-04 16:18:37", "date_publish": "2020-04-04 08:19:22", "description": "As more and more Americans are forced to stay home during the escalating coronavirus pandemic, the crisis has created a pressure-cooker situation for domestic violence victims, exacerbating stressors and isolation that can make for a deadly mix.", "filename": "2020_04_04_us_domestic-viol_a4b072eb8b6a75a07e99ae0d57347ca4_index_1588609117.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190121151045-05-domestic-violence-economic-uk-restricted-use-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_domestic-viol_a4b072eb8b6a75a07e99ae0d57347ca4_index_1588609117.html", "title": "Some cities see jumps in domestic violence during the pandemic", "title_page": "Several cities seeing jumps in domestic violence reports amid pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As more and more Americans are forced to stay home during the escalating coronavirus pandemic, the crisis has created a pressure-cooker situation for domestic violence victims, exacerbating stressors and isolation that can make for a deadly mix.\nSeveral cities are already reporting jumps in domestic violence cases or calls to local hotlines. Some shelters around the country say they're full -- some after reducing their capacity to maintain social distancing -- and struggling to help survivors. And with gun sales setting records , advocates worry that the next few weeks could be especially dangerous.\nIn an eastern Pennsylvania town under a local shelter-in-place order, a man who lost his job due to the pandemic shot his girlfriend in the back and then killed himself on Monday. Just before he went into the basement to get his handgun, he became \"extremely upset\" about coronavirus, the victim, who survived, told police.\n\"Domestic violence is rooted in power and control, and all of us are feeling a loss of power and control right now,\" said Katie Ray-Jones, the CEO of the National Domestic Violence Hotline. \"We're really bracing for a spike post-Covid-19 -- that's when law enforcement and advocates and courts are going to hear the really, really scary stuff going on behind closed doors.\"\nWhile police and advocates haven't seen jumps in domestic violence cases across the board, some hot spots are emerging around the country. Of the 20 large metropolitan police departments that provided data to CNN, nine saw double-digit percentage jumps in domestic violence cases or 911 calls in March, either compared to the previous year or to earlier months in 2020.\nNot every department provided standardized numbers -- some counted domestic violence-related 911 calls, while others tallied confirmed cases or arrests.\nPortland, Oregon had a 27% increase in domestic violence arrests between March 12 and 23, 2020, as compared with the same period in 2019, police said. Boston had a 22% jump in domestic assault and battery reports between March 2019 and March 2020, and Seattle had a 21% increase in reports of domestic violence during the same time period.\nBut advocates worry that with victims stuck in close proximity with abusers, there are many others who are unable to safely reach out for help.\n\"I imagine that that is the tip of the iceberg,\" said Anne DePrince, a University of Denver psychology professor who studies domestic violence.\nHow stay-at-home orders impact victims\nWith more than 96% of Americans living under stay-at-home orders, some cities are seeing significant jumps in domestic violence reports.\nPolice in Pittsburgh, Charlotte, Oklahoma City, San Antonio and Omaha experienced double-digit percent increases in domestic violence-related calls, comparing March or part of March to 2019 or earlier months in 2020, according to data provided by the departments to CNN. Kansas City reported a similar jump in domestic violence incident reports.\nOther cities like St. Louis and Denver registered barely any change in domestic violence calls, while San Diego and Las Vegas saw small declines in calls. New York City, the epicenter of the pandemic, saw a 15% drop in domestic violence complaints from March 2019 to 2020, although an aide to New York Gov. Andrew Cuomo said Friday that the state police had received reports about spikes in cases elsewhere in the state.\nChicago's domestic battery 911 calls are up only 3% between March 2019 and 2020, according to data provided by the city -- but calls to the Illinois Domestic Violence Hotline have spiked, with the hotline hitting its highest daily call volume in its 20-year history this week, city officials told CNN.\nExperts say the varying numbers might have to do with the different timing of when shelter-in-place orders went into effect. And in some cities, calling 911 may be domestic violence victims' main resource to get help, while other areas have robust networks of nonprofit agencies and hotlines that survivors turn to first.\nSome organizations are seeing changes in the times their hotlines are busiest. In the last two weeks of March, a Seattle domestic violence hotline, New Beginnings , saw a 34% drop in typical call volume during the daytime on weekdays, but a 13% jump in calls at night. Susan Segall, the organization's executive director, said that was likely because victims who typically find time alone during the day now don't have that opportunity to avoid their abuser, or because they're now busy taking care of kids.\nThe national hotline, which typically gets around 1,800 to 2,000 calls, chats and text messages a day, has stayed at a mostly normal pace, Ray-Jones said. But because of isolation, she predicted that there would be a flood of more reports after social distancing measures ease.\n\"They can't reach out safely, because their perpetrator is sitting right next to them,\" Ray-Jones said.\nThe group has been receiving an increasing number of calls from survivors who say the pandemic is making their situation worse. One woman was audibly hoarse and said her partner had tried to strangle her, but she was too scared of the virus to go to the hospital, Ray-Jones said.\nAnother woman calling in to the hotline said her partner had started slowly loading his gun as she got ready to leave for her job, telling her she couldn't go outside at all. A third said her partner had forced her to keep scrubbing her hands until they were raw.\nRhonda Voss, 63, a domestic violence activist and survivor in North Carolina, said being cooped up at home is a domestic violence victim's nightmare.\n\"I know they would be constantly walking on eggshells just trying their best to stay out of the way, to keep the person appeased,\" she said. Getting out of the house can be \"such a relief\" for victims, she said, \"and that's not available that much now.\"\nShelters are struggling to help\nIn some ways, the coronavirus pandemic seems like the worst possible scenario for domestic violence victims. In addition to being cloistered inside with their abuser, job and financial losses can inflame stress. The economic impact can also make it harder for survivors to plan an escape or hold onto their financial independence.\nResearch suggests an association between natural disasters and increased rates of domestic violence. After Hurricane Harvey flooded Houston in 2017, for example, the city saw an increase in domestic violence reports.\nNow, the pandemic could have a similar effect -- but like a hurricane slamming the entire country at the same time.\nDuring Harvey, \"the stressors of being out of work, being at home, losing everything -- that spiked our violence,\" said Chau Nguyen, the chief public strategies officer for the Houston Area Women's Center . \"You're going to see it more and more.\"\nNow, Nguyen's shelter is full, and they're struggling to help the people calling. One pregnant woman who the shelter is helping is terrified that she's going to have to go home after giving birth because she has no place to go, Nguyen said. Another woman who fled from another state had been reaching out to domestic violence shelters around the region and finding none of them had any space.\nJUST WATCHED Lawmakers get creative with how to tell people to stay home Replay More Videos ... MUST WATCH Lawmakers get creative with how to tell people to stay home 02:02\nNeha Gill, the executive director of Apna Ghar , a Chicago domestic violence shelter that focuses on immigrant and refugee communities, said her shelter is also full. They had to cut the capacity of the shelter by two-thirds -- from about 30 people to about 10 -- in order to maintain safe social distancing policies.\n\"It's been frustrating and painful for those of us whose job is to help,\" she said.\nFor now, the Houston and Chicago shelters are both paying out of pocket for hotel rooms for some survivors who desperately need to leave home. Gill said she hoped the city or state would start a program to fund similar efforts.\nThat has left advocates to get creative. In several cities, courts have started granting temporary restraining orders remotely. Others groups are promoting their texting help line, which might be easier for victims to surreptitiously use even from the same room as their abuser. They're encouraging family members to stay in close contact with victims suffering abuse.\nStaff at DC SAFE , a nonprofit that helps coordinate response to domestic violence cases in Washington, DC, has found that as more of the city has shut down, it's taken twice as long for them to find resources for survivors like mental health services, food or transportation.\n\"All the services that would normally happen are really not happening,\" said Natalia Marlow-Otero, the group's executive director. \"As barriers increase for survivors and services shrink, they are left in situations where there's not a lot of options for them.\"\nReports of deadly domestic violence cases tied to coronavirus\nThere have already been several domestic violence fatalities around the country which police have tied to coronavirus.\nIn Colorado Springs, a woman accused of fatally shooting her husband in their home last month said he had brandished a knife at her, \"blaming the coronavirus and stating he was not going to live through it,\" according to court documents reported by the Colorado Springs Gazette.\nIn Wilson Borough, Pennsylvania, a town about 50 miles north of Philadelphia, 38-year-old Roderick Bliss IV shot his longtime girlfriend in the back on Monday before killing himself , detective Dan Pacchioli said in an interview. Bliss had become increasingly upset about coronavirus after losing his construction job due to the pandemic, the victim told officers.\n\"She was completely shocked that he went off the wall in the way he did that day,\" Pacchioli said.\nBut in the vast majority of domestic violence cases, any connection to the pandemic is less obvious.\nEd Gonzalez, the sheriff of Texas' Harris County, which includes Houston, said his county has had two domestic violence murders in the last two weeks, including one in which a husband allegedly left his three young children at home with the body of his wife and went to the police to turn himself in.\n\"It's not that all of a sudden the virus comes along and people become abusive -- it's already there,\" Gonzalez said in an interview. \"Many people will not be killed by Covid-19, but instead they'll die at the hands of an intimate partner.\"\nSome families are left wondering whether the isolation caused by the pandemic could have played a part in their loved one's death.\nIn Mashpee, a Massachusetts town on Cape Cod, 53-year-old Sandra Corfield was killed last week in a suspected domestic beating that took place two days after the state's shelter-in-place order went into effect. Her boyfriend, Marc Audette, told police that he was \"off my meds\" and that Corfield had kept saying \"I love you\" while he was hitting her in the head, according to a police report reviewed by the Cape Cod Times . Audette has pled not guilty to Corfield's murder.\nCorfield was an art teacher at Boston schools who painted murals and taught modeling. She had been with Audette for about a year and had seemed happy with him, her mother, Eleanor Corfield, said in an interview.\nEleanor said she didn't know whether the pandemic and shelter-in-place order had played any role in her daughter's death. \"It could have tied into it, it could very well have,\" she said. \"They were together all the time.\"\nNow, with a large funeral impossible under the stay-at-home order, Eleanor said she was planning to ask for donations to a domestic violence charity in honor of her daughter.\n\"I would like the word to get out, if it even helps one battered woman,\" she said. \"I would like them to know it's okay to reach out for help.\"\nResources for victims of domestic violence\nNational Domestic Violence Hotline Call 1-800-799-7233 or text LOVEIS to 22522\nAvailable 24/7. Can connect callers with local resources and immediate support. Also available through online chat tool\nNational Sexual Assault Hotline 1-800-656-4673\nProvided by RAINN (Rape, Abuse & Incest National Network). Available 24/7. Also available through online chat tool.\nCrisis Text Line Text HOME to 741741\nAvailable 24/7 for victims of abuse and any other type of crisis.\nChildhelp National Child Abuse Hotline 1-800-422-4453\nAvailable 24/7 in 170 different languages.\nOffice on Women's Health Helpline 1-800-994-9662\nA resource provided by the US Department of Health & Human Services.", "url": "https://www.cnn.com/2020/04/04/us/domestic-violence-coronavirus-calls-cases-increase-invs/index.html"}