{"authors": ["Chris Carlson", "Amy Taxin"], "date_download": "2020-05-04 20:04:47", "date_modify": "2020-05-04 20:04:47", "date_publish": "2020-04-09 05:17:22", "description": "RIVERSIDE, Calif. (AP) — The San Francisco Bay Area nursing home where seven residents with coronavirus died has a history of citations for health and safety issues, including infection control,...", "filename": "_0bcfa5349e378c3ec86a612f58320882_1588622687.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d3a071ccc50546e09c7ed210eb19c074/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0bcfa5349e378c3ec86a612f58320882_1588622687.html", "title": "Nursing home with 7 virus deaths had health citations", "title_page": "Nursing home with 7 virus deaths had health citations", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A patient is evacuated from the Magnolia Rehabilitation and Nursing Center in Riverside, Calif., Wednesday, April 8, 2020. More than 80 patients from a Riverside skilled nursing facility are being evacuated this morning to other healthcare locations throughout Riverside County, Calif. (AP Photo/Chris Carlson)\nA patient is evacuated from the Magnolia Rehabilitation and Nursing Center in Riverside, Calif., Wednesday, April 8, 2020. More than 80 patients from a Riverside skilled nursing facility are being evacuated this morning to other healthcare locations throughout Riverside County, Calif. (AP Photo/Chris Carlson)\nRIVERSIDE, Calif. (AP) — The San Francisco Bay Area nursing home where seven residents with coronavirus died has a history of citations for health and safety issues, including infection control, according to state records.\nSixty-five residents and staff at Gateway Care and Rehabilitation Center in the East Bay city of Hayward were confirmed to have the COVID-19 infection, Alameda County health officials said Thursday.\nNursing homes are one of the highest-risk centers for coronavirus outbreaks because many residents live in close quarters, are elderly and have chronic health problems. Several hundred residents have been infected throughout California.\nLos Angeles will deploy mobile test teams to nursing homes and assisted living facilities that request them to prevent outbreaks among the elderly and vulnerable, Mayor Eric Garcetti announced Thursday.\nOn Wednesday, more than 80 patients at the Magnolia Rehabilitation and Nursing Center in Riverside were moved to other facilities after many employees failed to report for work for a second day. There was only one certified nursing assistant out of 13 scheduled for a shift, health officials said.\n“Our understanding is some of the staff were worried about their health and did not show up,” Riverside County Public Health spokesman Jose Arballo told KTLA-TV.\nHealth officials said 16 staff members at the center had tested positive for the virus along with 34 patients, while a neighboring facility, Extended Care Hospital of Riverside, had 26 staffers and 28 patients with confirmed infections.\nAt the Hayward facility, Ruby Walia, a nurse who answered the phone Thursday, said she is in charge of 18 patients on her wing and none have tested positive. All patients are tested regularly, she said.\nSome patients on another wing have tested positive but Walia didn’t know the exact number.\nWalia said the health workers have sufficient protective gear.\n“The state gave us gowns and we’ve had so much support from the local community donating masks,” Walia said.\nDinesh Kumar said his wife is a nurse at Gateway who tested positive for the virus.\n“After she got diagnosed positive the employer called. A supervisor told my wife, ‘Oh, you can still come to work,’” Kumar told KPIX-TV . “I said, ‘No, we’ve been told you’re supposed to be isolated.’”\nGuadalupe Tafolla said his wife, who also works at Gateway, was told: “You can come back to work. Just have to wear a mask and be careful.”\n“She’s positive!” Tafolla said. “Of course, she’s never going to come back to work.”\nThe owners of the facility, Antony and Prema Thekkek, could not be reached for comment.\nThere have been a number of complaints filed against the facility, according to information from the California Department of Public Health. Six complaints were filed this year, including one alleging improper infection control in March, but all were found to be unsubstantiated, according to the health department’s website.\nFrom 2017 through 2019, more than 70 complaints or reports of incidents filed by the home itself were made to state regulators involving issues including quality of life for patients, accidents and even one death. Most were unsubstantiated or didn’t involve rules violations.\nHowever in January of 2019, the center was fined $1,000 after a resident fell and broke a hand after being left unsupervised in a bathroom.\nProblems also were found during inspections. Among other things, a state safety survey last year concluded that the center failed to develop procedures for providing staffing “to address surge needs during an emergency.” The report said that could result in a “failure to protect” residents during a disaster.\nAntony and Prema Thekkek have owned the facility since 2003. In 2015, they were denied licenses to operate skilled nursing facilities in Millbrae and Bakersfield because of violations at other facilities they owned, the San Francisco Chronicle reported .\nAnother Bay Area nursing home, East Bay Post-Acute Healthcare Center in Castro Valley, had 31 residents and staffers who were positive and no deaths had been reported.\nAnd a third home in San Jose reported Thursday that it had 27 infections, including 10 staffers, while an outbreak at a home in Orinda in Contra Costa County had grown to at least 50 people, with two deaths reported.\nIn the Central Valley, the Redwood Springs Healthcare Center in Visalia reported more than 60 cases and three deaths. The nursing home accounts for about one-third of all the infections in Tulare County.\n___\nTaxin reported from Orange County, California. Chris Weber and John Antczak in Los Angeles contributed to this report.", "url": "https://apnews.com/0bcfa5349e378c3ec86a612f58320882"}