{"authors": [], "date_download": "2020-05-04 20:15:26", "date_modify": "2020-05-04 20:15:26", "date_publish": "2020-04-08 19:46:07", "description": "OKLAHOMA CITY (AP) — The number of coronavirus cases in Oklahoma surpassed 1,500 on Wednesday and the number of COVID-19 deaths now stands at 79, the Oklahoma State Department of Health...", "filename": "_3ea95b29cc0b7e1abeb6ca0e2280b1d9_1588623326.html", "image_url": "https://storage.googleapis.com/afs-prod/media/350b1424bbf0415f9b856414209c8085/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3ea95b29cc0b7e1abeb6ca0e2280b1d9_1588623326.html", "title": "Oklahoma's COVID-19 death toll climbs to 79; cases top 1,500", "title_page": "Oklahoma's COVID-19 death toll climbs to 79; cases top 1,500", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Oklahoma Governor Kevin Stitt answers a questions at a news conference at Oklahoma's Strategic National Stockpile warehouse in Oklahoma City, Tuesday, April 7, 2020, in Oklahoma City. Stitt said he is \"cautiously optimistic\" that the rate of people being hospitalized from COVID-19 symptoms is starting to flatten in Oklahoma. Behind him are supplies, including roughly four million pairs of gloves, 120 thousand gowns, 173 thousand face shields and goggles, 900 thousand surgical and medical masks, 110 thousand respirators and a variety of other personal protections equipment. The actual numbers vary as more supplies arrive and are shipped out daily. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Sue Ogrocki)\nOklahoma Governor Kevin Stitt answers a questions at a news conference at Oklahoma's Strategic National Stockpile warehouse in Oklahoma City, Tuesday, April 7, 2020, in Oklahoma City. Stitt said he is \"cautiously optimistic\" that the rate of people being hospitalized from COVID-19 symptoms is starting to flatten in Oklahoma. Behind him are supplies, including roughly four million pairs of gloves, 120 thousand gowns, 173 thousand face shields and goggles, 900 thousand surgical and medical masks, 110 thousand respirators and a variety of other personal protections equipment. The actual numbers vary as more supplies arrive and are shipped out daily. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death. (AP Photo/Sue Ogrocki)\nOKLAHOMA CITY (AP) — The number of coronavirus cases in Oklahoma surpassed 1,500 on Wednesday and the number of COVID-19 deaths now stands at 79, the Oklahoma State Department of Health reported.\nThere are at least 1,524 cases compared to 1,472 reported Tuesday and the number of deaths rose by 12. Ten of the latest deaths were people 65 years old or older and one was in the 36-49 age group.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nThe spread of the virus is largely blamed for the state’s ecomomic downturn and an estimated $416 million budget hole as non-essential businesses have closed and energy prices have slumped. Stitt said Tuesday an additional $40 million will be needed to shore up a separate fund for public schools.\nThe Legislature on Monday passed three bills to provide about $500 million from the state’s Rainy Day Fund to offset the shortfall, but Gov. Kevin Stitt has yet to sign the legislation.", "url": "https://apnews.com/3ea95b29cc0b7e1abeb6ca0e2280b1d9"}