{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 16:59:18", "date_modify": "2020-05-04 16:59:18", "date_publish": "2020-04-07 13:46:38", "description": "Pink took to Instagram to speak about her experience with coronavirus, saying she's been \"really, really sick\" and reminding people that \"no one is safe from this.\"", "filename": "2020_04_07_entertainment_pink-coronavirus_index_1588611558.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407064311-pink-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_entertainment_pink-coronavirus_index_1588611558.html", "title": "Pink details her scary experience with coronavirus", "title_page": "Pink details her scary experience with coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Pink took to Instagram to speak about her experience with coronavirus, saying she's been \"really, really sick\" and reminding people that \"no one is safe from this.\"\nThe singer filmed a conversation with her friend and author Jen Pastiloff after revealing she and her 3-year-old son, Jameson, had recently tested positive for Covid-19. The talk was part of the \"Chat and Feed\" series to raise money to feed people in need.\nPink said it was the first time in three weeks she dressed up.\n\"I really needed it. Thank you for the opportunity,\" she said, explaining, \"We have been really, really sick. My 3-year-old, Jameson, has had the worst of it. I've had many nights where I've cried and I've never prayed more in my life.\"\n\"At one point I heard myself saying, 'I thought they promised us our kids would be OK.' And it's not guaranteed. There's no one that is safe from this,\" she said. \"Jameson's been really, really sick. I've kept a journal of his symptoms for the past three weeks, and mine as well. He still, three weeks later, has a 100 degree temperature. It's been a roller coaster. It's been a different roller coaster for both of us.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/entertainment/pink-coronavirus/index.html"}