{"authors": ["Betsy Klein"], "date_download": "2020-05-04 16:53:52", "date_modify": "2020-05-04 16:53:52", "date_publish": "2020-04-07 22:04:17", "description": "The White House's communications staff got a shakeup Tuesday with the announcement that Kayleigh McEnany, the Trump 2020 campaign's press secretary and high-profile Republican communicator, is joining the team as the Trump administration's fourth White House press secretary.", "filename": "2020_04_07_politics_kayleig_e14fc7b53eaa5f1707976653e542a5ef_index_1588611232.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407114326-kayleigh-mcenany-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_kayleig_e14fc7b53eaa5f1707976653e542a5ef_index_1588611232.html", "title": "Kayleigh McEnany set to become fourth Trump press secretary", "title_page": "Kayleigh McEnany set to become fourth Trump press secretary - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The White House's communications staff got a shakeup Tuesday with the announcement that Kayleigh McEnany, the Trump 2020 campaign's press secretary and high-profile Republican communicator, is joining the team as the Trump administration's fourth White House press secretary.\nMcEnany comes to the role with a bevy of Republican communications and television experience, beginning with an internship during the 2004 Bush-Cheney campaign, where she worked as an intern at a Tampa field office as a high school student. From there, she held internships at a gubernatorial campaign and with a Florida congressman.\nA 2010 Georgetown University graduate, McEnany earned a law degree from Harvard University, and began a media career in production at Fox News.\nLike others in the administration, including President Donald Trump , she has made past controversial comments, such as stoking the \"birther\" conspiracy theory regarding then-President Barack Obama's citizenship in 2012 with two tweets appearing to make light of the racist attack.\n\"How I Met Your Brother -- Never mind, forgot he's still in that hut in Kenya. #ObamaTVShows,\" she posted\nMcEnany rose to prominence -- and also captured then-candidate Trump's attention -- during the 2016 presidential election, when she was frequently on air as a paid CNN political commentator.\nThe role of a pundit, she said, gave her a voice that she hadn't previously found working in politics.\n\"There's a lot of political calculus that goes into decision making, every campaign and primary is trying to position themselves one place or another ideologically. But I've always been someone who, I just like to speak my mind and I like to say what I believe and media gives you that freedom to -- you don't feel like you have to say what someone wants to hear, you can say what you think and what you believe. And one of the reasons I think Donald Trump was so successful is taking that attribute of what I find in media to politics,\" she told Georgetown University's \"Fly on the Wall\" podcast in 2018.\nAfter the election, McEnany wrote a book about Trump voters and joined the Republican National Committee as a spokeswoman, shifting to the Trump reelection campaign as national press secretary in February 2019. She's been a frequent pro-Trump presence on cable and local news in the role, an unabashed defender of the President and his policies.\n\"I was that heavily outnumbered blonde girl fighting for Donald Trump,\" McEnany said of her time at CNN, saying that she jumped to the RNC position because she \"wanted to be in the fight\" and have a more active role in political strategy and planning, while still getting to debate on television.\nThe new White House position is also a homecoming of sorts. McEnany interned in the Bush administration's press shop as a Georgetown University sophomore, where she was responsible for scouring the news in southeastern US newspapers to help write a daily briefing for the chief of staff, she told the university's podcast.\nMcEnany recalled \"walking into the White House and passing people like Dana Perino, passing these top-level Bush officials, as a young college student.\"\nNow, she'll be the top-level official.\nThose who have worked with her describe her meticulous preparation and attention to detail, a smart yet low-maintenance surrogate who came prepared and never asked aides for talking points.\nEach Trump press secretary -- Stephanie Grisham, Sarah Sanders and Sean Spicer -- has made the role their own in an administration that prides itself on its unorthodox press strategy. It's unclear how McEnany will exercise the position, though she could take a more public-facing role than her predecessor, Grisham, who never held a press briefing during her time as press secretary and made rare appearances on Fox News.\nJUST WATCHED See the question Trump wouldn't let Dr. Fauci answer Replay More Videos ... MUST WATCH See the question Trump wouldn't let Dr. Fauci answer 02:29\nWith Trump and senior administration officials directly briefing the press on coronavirus each day, the question of how and when McEnany restarts briefings is much less urgent in the press shop shake-up.\nMcEnany's credibility as a coronavirus messenger could be tested by comments she made in late February appearing to downplay the severity of the outbreak in the United States.\n\"This President will always put America first, he will always protect American citizens. We will not see diseases like the coronavirus come here,\" she said on a now-canceled Fox Business Network program. \"We will not see terrorism come here. And isn't that refreshing when contrasting it with the awful presidency of President Obama?\"\nMcEnany claimed those comments were taken out of context and said she was \"was asked about travel restrictions & stated the intent of those restrictions\" in her response.\nAt 31, McEnany is one of the youngest press secretaries to hold the role. Dee Dee Myers, who served in the Clinton administration, was also 31 when she stepped into the job, but Ron Ziegler was just 29 when he held the title in the Nixon administration.\n\"Never feel like you're too young to ask for something,\" McEnany told the Georgetown University podcast. \"You might just get an opportunity if you knock on that door hard enough.\"\nMcEnany underwent a preventative double mastectomy in 2018 after learning she carried the BRCA-2 genetic mutation that put her at risk for breast cancer, something she's spoken about publicly since.", "url": "https://www.cnn.com/2020/04/07/politics/kayleigh-mcenany-new-white-house-press-secretary/index.html"}