{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:58:07", "date_modify": "2020-05-04 16:58:07", "date_publish": "2020-04-09 13:36:21", "description": "The Federal Reserve is continuing its extraordinary efforts to prop up the United States economy in the wake of the coronavirus pandemic. The Fed launched a $600 billion program for hard-hit states and local governments.", "filename": "2020_04_09_economy_federal-reserve-stimulus-states-cities_index_1588611487.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409085044-federal-reserve-building-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_economy_federal-reserve-stimulus-states-cities_index_1588611487.html", "title": "Federal Reserve rolls out massive support for states and cities", "title_page": "Federal Reserve rolls out massive support for states and cities  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) The Federal Reserve is continuing its extraordinary efforts to prop up the US economy in the wake of the coronavirus pandemic.\nThe central bank announced a new $2.3 trillion round of loans that include even more support for small businesses and consumers — and, for the first time, for states, cities and municipalities, too.\nThe Fed said Thursday that it is creating a Municipal Liquidity Facility with up to $500 billion in loans and $35 billion in credit protection in order to \"help state and local governments manage cash flow stresses caused by the coronavirus pandemic.\"\nThrough this lending program, the Fed said it will buy short-term debt from states and Washington D.C., counties with at least 2 million people and cities with a population of 1 million and above.\n\"The Fed's role is to provide as much relief and stability as we can during this period of constrained economic activity, and our actions today will help ensure that the eventual recovery is as vigorous as possible,\" said Fed chair Jerome Powell in a statement.\nRead More", "url": "https://www.cnn.com/2020/04/09/economy/federal-reserve-stimulus-states-cities/index.html"}