{"authors": ["Hollie Silverman"], "date_download": "2020-05-04 15:57:24", "date_modify": "2020-05-04 15:57:24", "date_publish": "2020-04-12 07:31:13", "description": "Six people were shot at a California party that was held despite the state's stay-at-home order issued to stop the spread of coronavirus.", "filename": "2020_04_12_us_bakersfield-california-shooting-stay-at-home_index_1588607844.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/160708183143-police-tape-crime-scene-generic-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_us_bakersfield-california-shooting-stay-at-home_index_1588607844.html", "title": "6 people shot at a California party held despite state's stay-at-home order", "title_page": "6 people shot at a California party held despite state's stay-at-home order - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Six people were shot at a California party that was held despite the state's stay-at-home order issued to stop the spread of coronavirus.\nAuthorities responded to a call of multiple shots fired at an apartment in Bakersfield shortly after midnight Saturday morning, the Kern County Sheriff's Office said in a statement\nDeputies found six victims -- including a juvenile -- at the scene and learned that a large party was going on before the shooting.\nAll the victims were taken to a local hospital and treated for injuries that were not life-threatening. The suspects were described as four men driving a white sedan, authorities said. No arrests have been made.\nThe shooting occurred during a statewide stay-at-home order aimed at keeping 40 million California residents in their homes to stop the spread of coronavirus, which has killed more than 20,000 people in the US. Gov. Gavin Newsom issued it in late March and extended it until May 15 on Friday.", "url": "https://www.cnn.com/2020/04/12/us/bakersfield-california-shooting-stay-at-home/index.html"}