{"authors": ["Breaking News Reporter"], "date_download": "2020-05-04 20:21:17", "date_modify": "2020-05-04 20:21:17", "date_publish": "2020-04-29 18:17:38", "description": "The New York City mayor apologized if his language was hurtful but said he has “no regrets about calling out this danger.\"", "filename": "entry_de-blasio-defends-rabbi-funeral-response_n_5ea99e52c5b6fb98a2b64863_1588623677.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9b4912500000511eb0925.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_de-blasio-defends-rabbi-funeral-response_n_5ea99e52c5b6fb98a2b64863_1588623677.html", "title": "De Blasio Defends Public Scolding Over Rabbi's Funeral As 'Tough Love'", "title_page": "De Blasio Defends Public Scolding Over Rabbi's Funeral As 'Tough Love' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "New York City Mayor Bill de Blasio said he has “no regrets” about publicly calling out members of a Jewish community who packed Brooklyn’s streets for a rabbi’s funeral Tuesday night amid the coronavirus outbreak, calling his criticism an act of “tough love” that was not intended to discriminate as some have accused.\n“If in my passion and in my emotion I said something that was in any way hurtful, I’m sorry about that. That was not my intention. But I also want to be clear, I have no regrets about calling out this danger and saying we’re going to be dealing with it very, very aggressively,” he said at a press conference Wednesday.\nTipster says this is the Williamsburg funeral today of Rabbi Chaim Mertz who died from COVID-19 pic.twitter.com/wsTvCrlzpb — Reuven Blau (@ReuvenBlau) April 29, 2020\nThe mayor’s response followed him ﻿reprimanding on Twitter those gathered for the event and warning that he had directed police to issue a summons or make arrests. His tweet ignited fury that he chose to publicly single out this mass gathering as opposed to others.\nEarlier in the day Tuesday, crowds had gathered in the city’s streets to watch a flyover by the Navy’s Blue Angels and the Air Force’s Thunderbirds to honor health care workers. The Orthodox Jewish Public Affairs Council shared a photo of that flyover event on Twitter and asked where the city’s police force was to disperse the crowds.\nThe photos attached to this tweet is of today in NYC. Where was @NYPDnews? Oops. It’s not Hasidim so there is no media and no tweets from you either. BTW there is no distancing at Domino Park in Williamsburg but @NYPD90Pct breaks up even funerals of just 15 Hasidim in Willi. pic.twitter.com/dNptnaYF00 — OJPAC (@OJPAC) April 29, 2020\nJonathan Greenblatt, the head of the Anti-Defamation League, and Councilmember Chaim Deutsch, who represents an area of Brooklyn with a large Orthodox Jewish population, separately condemned the mayor for generalizing the city’s entire Jewish community as having participated in the funeral.\n“The few who don’t social distance should be called out — but generalizing against the whole population is outrageous especially when so many are scapegoating Jews,” Greenblatt tweeted at the mayor.\nWhat???\nThis has to be a joke. Did the Mayor of NYC really just single out one specific ethnic community (a community that has been the target of increasing hate crimes in HIS city) as being noncompliant?? Has he been to a park lately? (What am I saying - of course he has!) https://t.co/LYKnUZm2Mc — Councilman Deutsch (@ChaimDeutsch) April 29, 2020\nDe Blasio denied that he had unfairly targeted one religious population, arguing that he has had “a long-held relationship with the Orthodox Jewish community.” He went on to say that the crowds gathered in Brooklyn were unlike anything he had ever seen.\nIt was “by far the largest gathering in any community of New York City of any kind that I had heard of or seen directly or on video since the beginning of this crisis, and it’s just not allowable,” he said. “No, it’s not like people gathering in the park. It was thousands of people.”\n“I regret if the way I said it in any way gave people a feeling of being treated the wrong way, that was not my intention,” he added. “It was said with love, but it was tough love. It was anger and frustration.”\nPolice Commissioner Dermot Shea, who said 12 summons were issued to people attending the funeral, echoed de Blasio’s concerns.\n“There were thousands of people crammed on one block,” he said. “People have to be accountable for their own actions, regardless of what neighborhood, ethnicity, where they come from. We cannot have what we had last night.”\nAll non-essential gatherings of any size and for any reason have been banned in New York amid the coronavirus outbreak which has sickened more people in the state than any other in the country.", "url": "https://www.huffpost.com/entry/de-blasio-defends-rabbi-funeral-response_n_5ea99e52c5b6fb98a2b64863"}