{"authors": ["Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 16:56:49", "date_modify": "2020-05-04 16:56:49", "date_publish": "2020-04-09 12:20:48", "description": "Seth Meyers has worked in some well-known studios. He got his TV start in Studio 8H, famously the home of \"Saturday Night Live.\" Then he moved down the hall to Studio 8G for his NBC late night show, \"Late Night,\" which has aired from NBC's Rockefeller Center headquarters since 2014.", "filename": "2020_04_09_media_seth-meyers-coronavirus-late-night_index_1588611409.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408093127-seth-meyers-late-night-from-home-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_media_seth-meyers-coronavirus-late-night_index_1588611409.html", "title": "Seth Meyers on what it's like to do 'Late Night' from his attic during a pandemic", "title_page": "Seth Meyers on what it's like to do 'Late Night' from his attic amid the coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Seth Meyers has worked in some well-known studios. He got his TV start in Studio 8H, famously the home of \"Saturday Night Live.\" Then he moved down the hall to Studio 8G for his NBC late night show, \"Late Night,\" which has aired from NBC's Rockefeller Center headquarters since 2014.\nThe coronavirus pandemic has forced late night hosts like Meyers to broadcast from their homes. That has created some memorable moments — Stephen Colbert doing his monologue from his bathtub comes to mind — but it also comes with challenges.\nMeyers spoke with CNN Business about the transition, what challenges have popped up and why he misses his cue card guy, Wally.\nThis interview has been edited and condensed.\nSo, it appears that you're doing your show from a haunted attic.\nYeah, we've settled on a haunted attic because while the attic tries to be haunting and scary, we're living through a haunted time, so I have one up on the attic right now.\nAre there other places in the house you've been scoping out to do the show from or are you going to be stuck in the attic for the foreseeable future?\nI'm pretty psyched about the attic right now. We do have a wasp problem and if that gets worse as the weather warms up at the very least, I think it'll make for entertaining television.\nYou've been doing \"Late Night\" from home for a little over a week now. From a production standpoint, what's the hardest part?\nMostly it's just doing it without your staff right next to you. Most of my bandwidth on a regular workday is just about writing for the first chunk of the day and then the second chunk of the day is performing what was written. I don't have to make any other decisions about anything other than that because you're surrounded by this incredible group of people who are as good if not better at what I'm good at... Even just having to pick a shirt is exhausting when you're not used to it, then all of a sudden you see it on camera and you're like, \"Oh, this isn't a good pattern for TV.\"\nThe coronavirus pandemic has forced late night hosts like Seth Meyers to broadcast from home.\nHow are you even producing the show? What type of technology are you using?\nAfter a week of balancing on books I now have a tripod for my iPad. I get a script, I load it into a Dropbox. I use the teleprompter, I have to download it from there. Then I had to teach myself how to read off the teleprompter... I think of the many people I miss, Wally Feresten, our cue card guy, is probably top of the list just because that's how I've been doing jokes since \"Weekend Update\" [on \"Saturday Night Live\"] and Wally's been the guy who's been with me since then. I feel as though I've always valued how lucky I am to have someone like Wally who knows my rhythms and the pace of my jokes, but now more than ever.\nYou're doing interviews with guests via Zoom?\nYeah. We're using Zoom right now.\nHow weird is it to not be sitting next to the person you're interviewing?\nAgain, you learn exponentially the rhythm of how it's different to interview somebody remotely, which we have never done before in any way, shape, or form on our show. One thing is just trying to figure out when to jump in. Is somebody done or are they just starting a new thought, and will you interrupt them? It is like those old standup comedian bits about bad cell phone connections where you're just cutting people off before they're done.\nHow hard is it to do jokes without any feedback or laughter?\nIt's not great, but then again nothing's great right now. If I'm being totally honest, not having an audience is the least of it for me because just the grind of getting it all ready and then actually having to sit at the desk and record it and then remember to also record my audio on a separate track. The amount of times where the director will have to call me after I upload it and say, \"You forgot...\" and it's like, \"I did. I totally forgot to record sound.\" As far as doing the jokes for no audience, it might sound strange, but I don't feel as alone in those moments because I know that everybody else is going through exactly what I'm going through, so there's some comfort in that.\nAre you alone in your attic or is there someone else up there with you?\nNo, I'm fully alone. [\"Late Night\" producer] Mike Shoemaker stopped by last week a couple of days. We kept our six feet social distancing, but just to have a trusted set of eyes on the setup. Now, it's just me alone, hearing my children run around and hoping they'll be quiet.\nIs there something weird about performing a late-night show and your family is right outside the door? Do you ever get worried that they might just storm in during a monologue?\nThe real surreal thing is saying to your children, \"Daddy's going to go do a TV show,\" and then just carrying a laptop into an attic. I definitely feel like an alcoholic making up a story so I can go finish off a bottle of booze in the corner.", "url": "https://www.cnn.com/2020/04/09/media/seth-meyers-coronavirus-late-night/index.html"}