{"authors": [], "date_download": "2020-05-04 20:17:32", "date_modify": "2020-05-04 20:17:32", "date_publish": "2020-04-28 11:49:29", "description": "At least 15 tribes sued the Treasury Department in an effort to block Alaska Native corporations from getting a share of the $8 billion in funding.", "filename": "entry_tribes-coronavirus-alaska-native-corporations_n_5ea81680c5b6dd3f908ae880_1588623452.html", "image_url": "https://img.huffingtonpost.com/asset/5ea818303000002711155098.jpeg?cache=5deed8dm2g&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_tribes-coronavirus-alaska-native-corporations_n_5ea81680c5b6dd3f908ae880_1588623452.html", "title": "Judge Sides With Native Tribes, Limits Distribution Of Coronavirus Relief", "title_page": "Judge Sides With Native Tribes, Limits Distribution Of Coronavirus Relief | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "FLAGSTAFF, Ariz. (AP) — A judge has ruled in favor of tribal nations in their bid to keep Alaska Native corporations from getting a share of $8 billion in coronavirus relief funding — at least for now.\nIn a decision issued late Monday, U.S. District Judge Amit Mehta in Washington, D.C., said the U.S. Treasury Department could begin disbursing funding to 574 federally recognized tribes to respond to the coronavirus but not to the corporations.\nThe ruling comes in a case brought by at least 15 tribes against the Treasury Department. The tribes allege that Congress intended the funding to go only to tribal governments and that the corporations don’t fit within the definition of “Indian Tribe” in the Coronavirus Aid, Relief and Economic Security Act.\nMehta said the tribes easily showed they would suffer irreparable harm unless he limited the funding temporarily to tribal governments while he awaited more argument on the question of eligibility of Alaska Native corporations.\n“These are monies that Congress appropriated on an emergency basis to assist tribal governments in providing core public services to battle a pandemic that is ravaging the nation, including in Indian Country,” Mehta said.\nThe Treasury Department and the U.S. Justice Department representing the Treasury did not immediately respond to requests for comment Monday.\nJustice Department attorney Jason Lynch had argued that the Treasury Department’s decision to include Alaska Native corporations wasn’t subject to judicial review because the funding is for a public health emergency. Mehta rejected the argument.\nThe Treasury Department has said it could start sending payments to tribes Tuesday — two days past the deadline in the coronavirus relief bill. But it has not said how it would determine who gets what.\nHarry Pickernell, Sr., the chairman of the lead plaintiff tribe, the Confederated Tribes of the Chehalis Reservation in Washington state, said he was pleased with the judge’s decision.\n“This ruling will help tribal governments to lead in the aid and recovery of their people,” he said in a statement.\nAlaska Native corporations are unique to Alaska and own most of the Native land in the state under a 1971 settlement known as the Alaska Native Claims Settlement Act. Mehta said neither the corporations nor the Treasury Department showed the corporations are providing public services comparable to the tribes to combat the coronavirus.\nThe corporations, which are not parties to the lawsuit, have said they support Alaska Natives economically, socially and culturally.\nTwo associations representing some of the corporations — the ANCSA Regional Association and the Alaska Native Village Corporation Association — said they believe the corporations ultimately will be deemed eligible for funding.\n“This will mean a delay in necessary resources and economic assistance for Alaska Native people in our communities and our state,” the groups said. “However, Alaska Native people have a history of resilience and strength. Together we will prevent the spread of COVID-19, care for those who get sick, and repair our economies.”\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness and death. The vast majority of people recover.", "url": "https://www.huffpost.com/entry/tribes-coronavirus-alaska-native-corporations_n_5ea81680c5b6dd3f908ae880"}