{"authors": [], "date_download": "2020-05-04 20:24:52", "date_modify": "2020-05-04 20:24:52", "date_publish": "2020-04-29 20:50:47", "description": "The U.S. government said it is working to make the antiviral medication remdesivir available to patients as quickly as possible.", "filename": "entry_remdesivir-drug-effective-virus_n_5ea9e264c5b633a854449b06_1588623892.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9e857300000a11215525a.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_remdesivir-drug-effective-virus_n_5ea9e264c5b633a854449b06_1588623892.html", "title": "Drug Proves Effective Against Coronavirus As Economic Damage Rises", "title_page": "Drug Proves Effective Against Coronavirus As Economic Damage Rises | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Scientists on Wednesday announced the first effective treatment against the coronavirus — an experimental drug that can speed the recovery of COVID-19 patients — in a major medical advance that came as the economic gloom caused by the scourge deepened in the U.S. and Europe.\nThe U.S. government said it is working to make the antiviral medication remdesivir available to patients as quickly as possible. Stocks surged around the world on the news, with the Dow Jones Industrial average climbing more than 550 points, or over 2%, in the afternoon.\n“What it has proven is that a drug can block this virus,” said Dr. Anthony Fauci, the U.S. government’s top infectious-disease expert. “This will be the standard of care.”\nThe news came as the U.S. government reported that American output is shriveling at an alarming rate in the biggest and fastest collapse since the Depression. The virus has killed over 220,000 people worldwide since December, including about 60,000 confirmed deaths in the U.S., and led to lockdowns and other restrictions that have closed factories and other businesses around the world.\nAmid the shutdowns, the U.S. said its gross domestic product, or output of goods and services, shrank at an annual rate of 4.8% in the January-March period, the sharpest quarterly drop since the global financial meltdown of more than a decade ago.\nAnd the worst is yet to come: The Congressional Budget Office has estimated that the GDP of the world’s biggest economy will plunge at a 40% annual rate during the three-month period that ends in June.\nThe latest figures on people applying for unemployment benefits in the U.S. come out Thursday, with economists estimating perhaps 1 in 6 American workers, or about 30 million people, have lost their jobs over the past six weeks.\nThe U.S. unemployment rate for April will be released at the end of next week, and economists have forecast that it could range as high as 20% — a level not seen since the Depression.\nMario Franco, who worked at a McDonald’s at a rest stop along Interstate 95 in Darien, Connecticut, for 26 years, rising to night manager in charge of the kitchen staff, was laid off in late March. The 50-year-old said he has little savings and now relies on a food bank and union donations.\n“They didn’t give us any notice,” he said through an interpreter. “They didn’t tell us about it. Just suddenly the night shift ended and that was it. There was no more work.”\nConfirmed infections globally reached more than 3.2 million, including 1 million in the U.S., according to a tally by Johns Hopkins University. The true numbers of deaths and infections are believed to be much higher because of limited testing, differences in counting the dead and concealment by some governments.\nBiotech company Gilead Sciences and the U.S. government reported that in a major study, remdesivir shortened the time it takes for COVID-19 patients to recover by four days on average —from 15 days to 11. Also, a trend toward fewer deaths was seen among those on the drug, Fauci said.\nThe study was run by the U.S. National Institutes of Health and involved 1,063 hospitalized coronavirus patients around the world.\nAn effective treatment could have a profound effect on the outbreak, since a vaccine is probably a year or more away.\nEconomic damage, meanwhile, is piling up elsewhere around the world.\nGlobally, the United Nations’ main labor body raised its prediction of full-time-equivalent job losses in the second quarter to an estimated 305 million.\nIt also projected that 1.6 billion workers in the “informal economy,” including those working without proper contracts or oversight by government regulation, “stand in immediate danger of having their livelihoods destroyed.” That is nearly half the global workforce of 3.3 billion people.\nIn Europe, almost every measure of the economy is in free-fall. Figures due to be released Thursday are expected to show a drop of about 4% in the first three months of the year in the eurozone, and an even steeper hit is projected this quarter. Unemployment is expected to rise to about 8% in March.\nThe figure would be worse if not for massive amounts of government aid to keep millions of workers on payrolls. Government debt is exploding to cover the costs of such relief.\n“The lockdowns to contain the COVID-19 pandemic are taking an unprecedented toll on the European economy,” said Florian Hense, an economist at Berenberg Bank.\nIn Paris, aircraft maker Airbus reported a first-quarter loss of 481 million euros ($515 million), laid off t housands of workers and sought billions in loans to pull through the crisis.\nItaly’s credit rating was lowered in the first downgrade of a major economy as a result of the crisis. Its rating stands just one level above junk bond status. Italy expects its economy to shrink 8% this year.\nGermany’s economy minister said the government is projecting a contraction of about 11% in GDP by the end of the quarter. But he also predicted a sharp recovery in 2021.\nMany economists are skeptical the U.S. economy will bounce back quickly later in the year, noting that the virus could flare up again or consumers and employees might be too worried to return to business as usual.\n“The virus has done a lot of damage to the economy, and there is just so much uncertainty now,” said Mark Zandi, chief economist at Moody’s Analytics.\nIn other developments, British raised its death toll to more than 26,000 after adding more than 3,800 nursing home deaths that were previously not included.\nWith the crisis easing in places like Italy, France and Spain, European governments are turning their attention to rethinking public transportation to get their economies running again without setting off a second wave of infections.\nSolutions include putting red stickers on the floor to tell bus passengers in Milan how far apart to stand. The Dutch are putting on longer, roomier trains. Berlin and many other cities are opening up more lanes to bicyclists. And in Britain, bus passengers are using the middle or rear doors to reduce the risk to the driver.\n___\nAssociated Press journalists around the world contributed to this report.\n___\nFollow AP pandemic coverage at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://www.huffpost.com/entry/remdesivir-drug-effective-virus_n_5ea9e264c5b633a854449b06"}