{"authors": ["Tobie Nell Perkins Of Fresh Take Florida News Service"], "date_download": "2020-05-04 20:07:27", "date_modify": "2020-05-04 20:07:27", "date_publish": "2020-04-08 21:11:10", "description": "LONGWOOD, Fla. (AP) — There was supposed to be ceremony. The last of the dogs would trickle out to happily live new lives with adoption agencies and new owners. There was supposed to be tears....", "filename": "_42f80483a3c6be3bec7a77d3c8d827b3_1588622847.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2f49cfc96afa455089282a54065d96bf/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_42f80483a3c6be3bec7a77d3c8d827b3_1588622847.html", "title": "Pandemic shuts the door permanently at Florida dog track", "title_page": "Pandemic shuts the door permanently at Florida dog track", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Nov. 23, 2019 photo, Arthur Marcoux watches the dogs race along with many patrons at the Sanford Orlando Kennel Club in Longwood, Fla. Floridians overwhelmingly voted in 2018 to ban greyhound racing. The closing of the tracks was accelerated by the COVID-19 pandemic that forced the state to prohibit crowds and gatherings of any kind. (Sam Thomas/Fresh Take Florida via AP)\nIn this Nov. 23, 2019 photo, Arthur Marcoux watches the dogs race along with many patrons at the Sanford Orlando Kennel Club in Longwood, Fla. Floridians overwhelmingly voted in 2018 to ban greyhound racing. The closing of the tracks was accelerated by the COVID-19 pandemic that forced the state to prohibit crowds and gatherings of any kind. (Sam Thomas/Fresh Take Florida via AP)\nLONGWOOD, Fla. (AP) — There was supposed to be ceremony. The last of the dogs would trickle out to happily live new lives with adoption agencies and new owners. There was supposed to be tears. Owners would sweep the dust and dirt from empty kennels and turn off the lights. For the very last time.\nThose who worked at Sanford Orlando Kennel Club knew the end was coming. Floridians voted overwhelmingly in 2018 to ban the sport of greyhound racing, and all 11 of the state’s tracks were on a path to closure. For years dog trainers, handlers and owners had battled anti-racing activists. They lost. And they made plans for how they would leave the only life they had ever known.\nBut a new enemy appeared, and it would make that inevitable end come more swiftly. And most of all, without ceremony.\nEven Florida’s most rough-and-tumble, who stood day after day in the beating sun and pounding rain, who lived with dirt under their nails, couldn’t escape the virus.\nThe COVID-19 pandemic forced the state to prohibit crowds and gatherings of any kind. That meant gamblers could no longer congregate at the track’s restaurant for cheeseburgers, fries or cheesesteaks. The word got out in late March. Sanford Orlando Kennel Club had planned to stay open until June, but the track would have to close by March 28.\nWhen that Saturday came, it didn’t seem like the end. The sun was high, and the sky was blue. The conditions were good, a perfect day for a race. The dogs ran like the wind, just like always, sprinting around the track at up to 45 mph, clouds of dust and sand behind them.\nSome of the track’s employees had been there for decades, and they would follow the routines that had become like breathing to them.\nOne of them, Kathi Lacasse, has been raising greyhounds for three decades. In the lobby of the clubhouse, she knelt with a hound’s head against her chest, tears in her eyes. He was the last dog she would ever weigh in.\nThrough bustling chaos of the weigh-in, where some trainers lead herds of five dogs, the murmurs carried. “The last day.” “One last time.”\nThis was the end of an institution in Florida. For years, dog racing had been as much a part of the state’s soul as the sand and surf along its coasts. Dog racing had been good to the state, a lucrative business in its heyday decades ago. But times had changed and so had public attitudes.\nA.J. Grant, a kennel owner at the track, plucked dog tags from the clubhouse as souvenirs. No one would need them anymore.\nThe careers of racing greyhounds end routinely with injury or retirement. But never had the kennel club’s staff seen something like this. Almost every dog on the track was giving it one last shot.\nMaybe there was something wonderful in the fact that the dogs didn’t know. That they pounded that sand with the same ferocity they always had. Greyhounds are known for their hearts, after all.\nAt 5 p.m., track announcer Bob Thacker’s voice crackled over the loud speaker.\n“This is the final race at SOKC. Thank you everyone for being here.”\nThacker wished there could have been more pomp and circumstance.\n“Eighty-five years of racing, and it comes to a close.”\nOn this day, there were no gamblers, distantly hollering for their favorite to win. Just silence.\n_____\nThis story was produced by Fresh Take Florida, a news service of the University of Florida College of Journalism and Communications. The reporter can be reached at tperkins@freshtakeflorida.com\nAdditional reporting for this story was contributed by Sam Thomas of Fresh Take Florida.", "url": "https://apnews.com/42f80483a3c6be3bec7a77d3c8d827b3"}