{"authors": ["Ryan Browne"], "date_download": "2020-05-04 16:26:41", "date_modify": "2020-05-04 16:26:41", "date_publish": "2020-04-07 14:30:21", "description": "Defense Secretary Mark Esper told acting Secretary of the Navy Thomas Modly that he must apologize for his remarks slamming the former commander of the USS Theodore Roosevelt, two US officials tell CNN, prompting Modly's late-night about-face apology which was issued just hours after he defended his comments to the aircraft carrier's crew.", "filename": "2020_04_07_politics_mark-es_52d9afcb0d5dc2f32784a1916e373905_index_1588609601.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327101147-uss-theodore-roosevelt-03182020-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_mark-es_52d9afcb0d5dc2f32784a1916e373905_index_1588609601.html", "title": "Esper's office told acting Navy secretary to apologize for his remarks on ousted aircraft carrier captain", "title_page": "Esper's office told acting Navy secretary to apologize for his remarks on ousted aircraft carrier captain - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Defense Secretary Mark Esper told acting Secretary of the Navy Thomas Modly that he must apologize for his remarks slamming the former commander of the USS Theodore Roosevelt, two US officials tell CNN, prompting Modly's late-night about-face apology which was issued just hours after he defended his comments to the aircraft carrier's crew.\nOne official said Esper's staff communicated to Modly that he needed to apologize.\nModly told the crew Monday that their former commander, Capt. Brett Crozier, was either \"too naive or too stupid\" to be in command or that he intentionally leaked to the media a memo in which he warned about coronavirus spreading aboard the aircraft carrier and urged action to save his sailors, according to remarks obtained by CNN.\nThe acting secretary also accused Crozier of committing a \"betrayal\" and creating a \"big controversy\" in Washington by disseminating the warning so widely among Navy officials.\nModly initially defended his remarks in a statement Monday, issuing a statement that said, \"I stand by every word I said.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/mark-esper-thomas-modly-brett-crozier-coronavirus/index.html"}