{"authors": ["Kevin Mcgill"], "date_download": "2020-05-04 20:24:48", "date_modify": "2020-05-04 20:24:48", "date_publish": "2020-04-17 15:59:48", "description": "NEW ORLEANS (AP) — Louisiana is working to make more clinic and hospital space available again for elective surgeries and other nonemergency medical care before May 1, Gov. John Bel Edwards said...", "filename": "_67d79b194f4db33b7a659a15b9d9aeba_1588623888.html", "image_url": "https://storage.googleapis.com/afs-prod/media/4f614ff9e31b42b086f28b1c9644a404/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_67d79b194f4db33b7a659a15b9d9aeba_1588623888.html", "title": "Hopes in Louisiana for more nonemergency care by May 1", "title_page": "Hopes in Louisiana for more nonemergency care by May 1", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Louisiana Gov. John Bel Edwards wears a face mask as he visits a production site on the LSU campus in Baton Rouge, La., where the school is manufacturing personal protection equipment for hospitals in response to the coronavirus pandemic Friday, April 17, 2020. (AP Photo/Gerald Herbert)\nLouisiana Gov. John Bel Edwards wears a face mask as he visits a production site on the LSU campus in Baton Rouge, La., where the school is manufacturing personal protection equipment for hospitals in response to the coronavirus pandemic Friday, April 17, 2020. (AP Photo/Gerald Herbert)\nNEW ORLEANS (AP) — Louisiana is working to make more clinic and hospital space available again for elective surgeries and other nonemergency medical care before May 1, Gov. John Bel Edwards said Friday.\nElective surgeries and other procedures were largely put on hold as state hospitals converted space and clinic personnel were diverted to other jobs as Louisiana ramped up to deal with the COVID-19 outbreak. The state has the third-highest rate of cases in the country, Edwards said.\nBut the number of those requiring hospitalization and ventilators has declined in recent days, raising hopes that an easing of economically devastating stay-at-home orders and business shutdowns may soon be in sight.\nEdwards said details on the return of more nonemergency services would be released next week.\n“We’re going to open that up sooner rather than later and, in all likelihood, ahead of May 1,” he said during a news conference at LSU’s Pete Maravich Assembly Center. The college basketball arena has been converted into a manufacturing site for protective medical masks and gowns badly needed by hospital and clinic personnel who must come into contact with coronavirus patients. Edwards toured the facility before his news conference.\nLess certain is whether the state will be able to begin a phased in reopening of shuttered businesses by May 1, when the current state emergency order expires. Edwards again said the state doesn’t yet meet thresholds for the first phase of business reopenings under guidelines issued Thursday by the White House.\nHe said the availability of masks, gowns and other personal protective equipment that must be used and discarded by medical personnel is one factor in the state’s readiness to begin opening up.\nEarlier Friday, the governor’s office said officials in Lafayette were in compliance with state orders when they issued guidance allowing furniture and clothing stores and other “durable goods” retailers to reopen under certain conditions.\nLafayette officials on Thursday said their new guidance affects an estimated 60% of previously closed businesses that fall into a “gray area” between those explicitly labeled essential and nonessential under a state emergency order.\nBut a governor’s spokeswoman said there was no gray area and the affected businesses are clearly allowed to open under the emergency order as long as they follow social distancing requirements.\n“There was nothing in his order that was inconsistent with what we have done previously and I appreciate the mayor for doing that,” Edwards said Friday, referring to Mayor-President Josh Guillory of the consolidated Lafayette city and parish government.\nEdwards spokeswoman Christina Stephens said in an email that businesses not specifically listed in the state emergency order can open as long as they “reduce operations to continue with minimum contact with members of the public and essential employees, while requiring proper social distancing, adhering to the 10-person limitation on gathering size.”\nThe state death toll hit, 1,213 Friday, up 57. But statewide hospitalizations were down to 1, 868 as of Friday. There were over 1,900 reported hospitalized a day earlier and the figures were well over 2,000 last week. The total number of known cases in the state surpassed 23,000 as of Friday. The number of people needing ventilators was down to 363 from 396 Thursday, and well below last week’s totals.\nAlso Friday, it was announced that state Senate President Page Cortez and House Speaker Clay Schexnayder are creating a private sector task force to advise the Legislature on what lawmakers can do to help speed economic recovery. The task force will start meeting this month, with recommendations due by July 1.\nChambers of commerce and other business organizations from across Louisiana released a report on factors to be considered in safely reopening a state economy devastated by efforts to stop the spread of the disease. The Baton Rouge Area Chamber released the report on behalf of organizations including the Louisiana Association of Business and Industry.\nFor most people, the coronavirus causes symptoms such as high fever and a dry cough that resolve in several weeks. But some, especially older adults and people with existing health problems, can suffer severe symptoms that can be fatal.\n___\nAssociated Press reporters Melinda Deslatte and Stacey Plaisance contributed to this report from Baton Rouge, Louisiana.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/67d79b194f4db33b7a659a15b9d9aeba"}