{"authors": ["Opinion Lynn Smith"], "date_download": "2020-05-04 16:57:35", "date_modify": "2020-05-04 16:57:35", "date_publish": "2020-04-09 14:43:51", "description": "Many parents are being asked to do the impossible, says Lynn Smith - raising kids in a crisis while continuing to work. There is no end in sight and we are not okay, says Smith, who urges all parents and caregivers to children to give themselves grace.", "filename": "2020_04_09_opinions_parenti_996f425ee6eb161296488bb061c5aa08_index_1588611455.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408221402-parent-burnout-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_parenti_996f425ee6eb161296488bb061c5aa08_index_1588611455.html", "title": "Parents, this burnout is real. Give yourself grace", "title_page": "Parents, this burnout is real. Give yourself grace (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Lynn Smith is the anchor of \"On the Story\" on HLN, which airs Monday through Friday from 10 a.m. to 12 p.m. ET. The opinions expressed in this commentary are solely her own. View more opinion articles on CNN.\n(CNN) Many parents and others taking care of children are being asked to do the impossible right now. We must raise our kids in the most terrifying of times. Homeschool them amid the chaos and in many cases work from home while doing it. There is no end in sight and we are not okay.\nThis is what parent burnout looks like in a pandemic.\nJust weeks ago, we may have been masters at juggling it all, of managing days filled with schedules that were bursting at the seams. Our cars were clocking miles to and from dozens of activities -- virtually all of us unaware it was about to come grinding to a halt.\nNow, here we are, weeks into quarantine, and it's already feeling a bit like the movie \"Groundhog Day.\" Waking up to a new day and a newly minted attempt at routine to keep some semblance of sanity.\nEvery working parent is between some kind of rock and another kind of hard place right now. I know well that I'm one of the very lucky ones to have resources and support.\nMany of us, myself included, have discovered a shift in priorities that would have never happened without this dark and scary time. We are reevaluating things and seeing what happens when you dedicate time to stillness, uncertainty and family togetherness.\nBut none of that quells the parenting burnout. If there's one thing I've learned from the countless remote catchups or cocktail hours I've had on Zoom or FaceTime with girlfriends and what I hear from so many other people on social media and from other parts of life, it's that I am not alone in that. We ask each other how we're holding up or if we completed the daily activities sent by teachers. Others wonder if their children will get a grade or need to repeat next year, some breaking the news to their kids that school is over for the rest of the year. And a sea of stressed parents are doing what we all felt was way outside our job description: acting as schoolteachers.\nJust over one month ago, I was hosting my HLN show \"On the Story.\" On March 16th, in the interest of keeping HLN employees safe, we temporarily went to taped programming beginning at 10 a.m. to ensure the least amount of people were coming into the CNN center in Atlanta. The way my colleagues have rallied under difficult circumstances is remarkable. I was given everything I needed to work remotely and am now ensconced in what I affectionately call my basement bureau.\nNow I appear on air with Robin Meade with my kids screaming upstairs while I am barefoot, wearing yoga pants and a bright top to look like I am put together. Spoiler alert: I'm not. Then I hurry back upstairs to help my son with his Zoom classes to keep his mind enriched and engaged with his schoolwork. Then, I sneak back into my closet office to write my script for the next day or work on interviews I need for my pieces. No small feat and not executed with anything close to perfection.\nJust the other day, I did my first virtual interview. I was planning on recording John DeGarmo , a foster care expert on the how Covid-19 is affecting foster children. Sadly, this crisis will likely drive more children into foster care as parents who get sick from or succumb to the disease will be unable to care for their children\nDeGarmo noted that while virtually everyone is suffering from stress and anxiety caused by this pandemic, it's likely worse for foster children who may already be coping with dislocation and trauma.\nBefore the Covid-19 pandemic, I could have never conceived of running my own interviews on my laptop in my dining room but there I was -- even logging in early to make sure everything was working right before DeGarmo joined me, since it was my first time doing it. My 4-year-old son chose that time to have one of the many meltdowns that have come with this crisis. I've had my fair share too. And from the hall I began screaming for him to stop: \"Mommy has an interview to DOOOOOOO!!!\"\nYes, I know he doesn't know what an interview is, but there I was, screaming. That was when I realized that I wasn't alone on the call -- DeGarmo had joined as well. The man who was there to help me tell viewers what children without parents are facing right now had just heard me yelling at my own. Gulp. \"Please don't take my children away,\" I said, only half-joking. He gave me a reassuring laugh and said, \"That's parenting in a crisis.\" He gave me grace, and I was actually able to accept it.\nIt's guaranteed that if you're parenting right now, you have your own version of this story -- of something that you couldn't do right but had to do anyway. I hope that there is someone there to see your burnout and offer you grace too. If there isn't, I want you to know that I see you. There is no supreme act of juggling that could bring all of this into balance. You are doing your best.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nBottom line, this crisis -- even as it's gutting us -- has the potential to produce (among the people who are lucky enough to be able to rally) a generation of children defined by their resilience. Helicopter and lawnmower parents are powerless right now to do anything about their children's disappointment about canceled graduations, proms, birthday parties and more. That's terrifying and exhausting, but it should also give us perspective. We cannot shield our children from this crisis, but it's quite possible that because we can't, they will grow and stretch in uncomfortable but meaningful ways.\nIn the meantime, give yourself grace. Remember that you're being asked to do the impossible.", "url": "https://www.cnn.com/2020/04/09/opinions/parenting-burnout-and-covid-19-wellness-smith/index.html"}