{"authors": [], "date_download": "2020-05-04 20:26:43", "date_modify": "2020-05-04 20:26:43", "date_publish": "2020-04-20 18:53:47", "description": "BLOOMINGTON, Ind. (AP) — The wife of a southern Indiana mayor has been hospitalized for more than a week with a coronavirus infection and her mother died last week from the...", "filename": "_f82a9b668a5329f6a6910fd898129b6a_1588624003.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f82a9b668a5329f6a6910fd898129b6a_1588624003.html", "title": "Coronavirus sickens Indiana mayor's wife, kills her mother", "title_page": "Coronavirus sickens Indiana mayor's wife, kills her mother", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BLOOMINGTON, Ind. (AP) — The wife of a southern Indiana mayor has been hospitalized for more than a week with a coronavirus infection and her mother died last week from the illness.\nBloomington Mayor John Hamilton’s wife, Indiana University law professor Dawn Johnsen, wrote in a Facebook post Monday that she was in her ninth day at IU Health Bloomington Hospital. Johnsen said her breathing had improved and pneumonia eased in the last couple days, making her hopeful of returning home in the coming days.\nBut Johnsen wrote that her 79-year-old mother, Carolyn R. Johnsen of Bloomington, died Thursday in the Philadelphia area, where she became ill with COVID-19 while visiting another family member.\n“Our family got to say our goodbyes but, in these surreal, terrible times, only by phone, without the tender kisses and embraces we desperately wanted to share,” Johnsen wrote.\nA spokeswoman for the mayor’s office confirmed Dawn Johnsen’s Facebook posts.\nHamilton received test results Monday showing that he didn’t have COVID-19 infection, the mayor’s office announced. Hamilton has been self-quarantined since his wife’s diagnosis on April 9 and was tested Saturday after experiencing flu-like symptoms.", "url": "https://apnews.com/f82a9b668a5329f6a6910fd898129b6a"}