{"authors": ["Martha Bellisle"], "date_download": "2020-05-04 20:23:40", "date_modify": "2020-05-04 20:23:40", "date_publish": "2020-04-14 22:32:40", "description": "SEATTLE (AP) — The number of staff at a Washington state psychiatric hospital who have tested positive for the new coronavirus increased in April, but only two patients have been tested this...", "filename": "_1554280842f5fe381812f998289ebee6_1588623820.html", "image_url": "https://storage.googleapis.com/afs-prod/media/64a572f167d74419be4424890775ca2b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1554280842f5fe381812f998289ebee6_1588623820.html", "title": "More than 30 have COVID-19 at psychiatric hospital", "title_page": "More than 30 have COVID-19 at psychiatric hospital", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Relwende Guiguemde, left, waits to have his temperature taken by Angie Webb, right, a nurse at Western State Hospital, Thursday, March 19, 2020, as he arrives at a visitors' entrance for a job interview in Lakewood, Wash. A patient and a worker at the facility, the state's largest psychiatric hospital, have tested positive for the new coronavirus. (AP Photo/Ted S. Warren)\nRelwende Guiguemde, left, waits to have his temperature taken by Angie Webb, right, a nurse at Western State Hospital, Thursday, March 19, 2020, as he arrives at a visitors' entrance for a job interview in Lakewood, Wash. A patient and a worker at the facility, the state's largest psychiatric hospital, have tested positive for the new coronavirus. (AP Photo/Ted S. Warren)\nSEATTLE (AP) — The number of staff at a Washington state psychiatric hospital who have tested positive for the new coronavirus increased in April, but only two patients have been tested this month, despite recommendations from health officials.\nAt least 27 workers at Western State Hospital have the disease, while six patients have tested positive so far and one died. The facility is home to 735 patients and 17 were recently moved to group or family homes to ease the pressure from the COVID-19 outbreak, officials said.\nWhen the COVID-19 hit the facility toward the end of March, they sought help from the state health department. At that time 17 workers and six patients had the disease. State epidemiologist Dr. Scott Lindquist toured the facility and made a list of recommendations, including testing the staff and patients on certain wards.\nAs of Tuesday, only two patients had been tested this month, according to Kelly Von Holtz, spokesperson for the Department of Social and Health Services. She said the low number was because few had shown any symptoms, but Lindquist said testing should be happening and any new positive patients should be isolated.\n“Due to widespread community transmission of COVID-19 in Washington, it is very likely that some staff were infected in the community, worked while infectious, and were a source of infection to patients and other staff people,” he said in his letter to hospital officials.\nAll staff on a ward that had eight cases should be tested and patients on another ward that had a positive case should also be tested, he said. Holtz said there are 28 patients on ward S-7. A note to staff said the patients had previously been tested and their incubation period was ending on Wednesday.\n“A single new case in a patient on any ward should be considered a new ‘outbreak’ and be attributed to staff transmitting to patients,” he said. “At that time, all patients should on the affected ward be tested and mask all staff. Please be aware that this recommendation may change going forward.”\nWorkers say the testing process for staff has been problematic. Maria Claudio, a psychiatric social worker, said the numbers aren’t adding up. Out of 414 tests, six workers were positive and 39 were rejected and have to be retested, according to a note sent to staff.\n“The validity of the testing is questionable,” she said. “We’re likely getting false negatives.”\nJustin Lee, a spokesman for the union that represents hospital employees, said staff were initially told that they would be tested in a drive-through, but instead they gathered workers in a small room where they were tested simultaneously. One worker said someone sneezed on her during the process.\nThe health department’s recommendations said staff should test themselves using a new protocol for collecting samples.\nInstead reaching far back in the nasal cavity with a long swab, health officials told them to do a “shallow nasal swab,” said Lisa Stromme, a spokesperson for the health department. The process involves swirling the cotton tip inside the nose and then putting the swab into a container, according to the health department’s website.\nThe shallow process saves on PPE and a recent study out of Everett found it to be as accurate as the deep nasal cavity test, Stromme said.\n“Bad idea,” said Paul Vilja, a nursing supervisor. “We need trained personnel with proper PPE to perform the test and package the specimen to prevent further exposure of others.”\nThe health department also said the patients can test themselves if a staff member is present, but staff said that’s unworkable.\n“That’s the stupidest thing I’ve ever heard in my life,” Claudio said.\nMany patients are not able to bathe themselves and in some cases, it would take several staff members to hold a patient down to get a proper sample, she said.\nMost won’t even put a mask on, which was another recommendation.\n“On our ward, not a single patient has a mask on,” she said. “You’re not going to get a good sample if the patient self-administers the test.”\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.", "url": "https://apnews.com/1554280842f5fe381812f998289ebee6"}