{"authors": ["Randall Chase"], "date_download": "2020-05-04 20:12:00", "date_modify": "2020-05-04 20:12:00", "date_publish": "2020-04-07 14:47:47", "description": "DOVER, Del. (AP) — Delaware officials are reporting the first coronavirus infection involving a state prison inmate. The Department of Correction said Tuesday that the inmate at the state’s...", "filename": "_b14ec24f26f8c9584b4cd148c7876363_1588623120.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b14ec24f26f8c9584b4cd148c7876363_1588623120.html", "title": "Delaware reports first virus case involving prison inmate", "title_page": "Delaware reports first virus case involving prison inmate", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "DOVER, Del. (AP) — Delaware officials are reporting the first coronavirus infection involving a state prison inmate.\nThe Department of Correction said Tuesday that the inmate at the state’s maximum-security prison was tested Monday after registering a fever and was moved to the infirmary. Officials said the inmate is over the age of 60 and is being treated in a negative pressure isolation room.\nA second inmate from the same housing unit also registered a fever during temperature checks on Tuesday and was being treated in isolation in the infirmary. His test results were pending.\nAs a precautionary measure, officials were moving inmates from the housing unit to a vacant building across the prison compound that provides greater separation among inmates.\nDOC officials also said two more correctional officers have tested positive for the virus, bringing the total to six, in addition to three contract health providers.\nFor most people, the coronavirus causes mild or moderate symptoms, and the vast majority survive. But for others, especially older adults and people with existing health problems, it can cause pneumonia or death.\nPublic health officials reported another 145 cases of the virus on Tuesday, bringing the total to more than 920 amid the global pandemic.\nSixteen people have died of complications from COVID-19, and 147 were hospitalized as of Tuesday, including 52 in critically ill condition.\nMeanwhile, a Delaware woman is facing felony charges after going into a store and shouting that she had the coronavirus.\nNew Castle County police responded last Friday to a report of disorderly conduct at a shopping center in Newark.\nWitnesses told police that a woman was screaming and using profanity and telling everyone at the Brookside Shopping Center that she had tested positive for COVID-19 and she did not care who she infected. Witnesses said people fled the store, trying to avoid the woman.\nOfficers detained Kelley Hines, 54, and took her to a local hospital for testing. After being medically cleared, Hines was charged with felony terroristic threatening causing a building to be evacuated, two counts of misdemeanor terroristic threatening, and one count of misdemeanor disorderly conduct.\nHines was released after posting $5,200 unsecured bail.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/b14ec24f26f8c9584b4cd148c7876363"}