{"authors": [], "date_download": "2020-05-04 20:19:18", "date_modify": "2020-05-04 20:19:18", "date_publish": "2020-04-14 13:20:04", "description": "ALBUQUERQUE, N.M. (AP) — Some attorneys and prisoner advocates petitioned the New Mexico Supreme Court on Tuesday for the release of more inmates from the state corrections system amid the...", "filename": "_9b85525528c7ddfd27c74ffe015a50b4_1588623558.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6b439e2915484faeb4364f4377936185/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9b85525528c7ddfd27c74ffe015a50b4_1588623558.html", "title": "Petition seeks release of New Mexico prisoners amid outbreak", "title_page": "Petition seeks release of New Mexico prisoners amid outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Flashing highway message boards along Interstate 25 in Albuquerque, New Mexico, urge people in both English and Spanish to stay home amid the coronavirus outbreak on Thursday, April 9, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death.(AP Photo/Susan Montoya Bryan)\nFlashing highway message boards along Interstate 25 in Albuquerque, New Mexico, urge people in both English and Spanish to stay home amid the coronavirus outbreak on Thursday, April 9, 2020. The new coronavirus causes mild or moderate symptoms for most people, but for some, especially older adults and people with existing health problems, it can cause more severe illness or death.(AP Photo/Susan Montoya Bryan)\nALBUQUERQUE, N.M. (AP) — Some attorneys and prisoner advocates petitioned the New Mexico Supreme Court on Tuesday for the release of more inmates from the state corrections system amid the coronavirus outbreak.\nGroups representing defense attorneys and public defenders joined with the American Civil Liberties Union of New Mexico to file the emergency petition. They’re seeking the immediate release of those at risk of serious illness from COVID-19, those with less than a year of their sentences remaining, and those held on infractions such as parole and probation violations.\nThe request goes beyond the releases ordered last week by Gov. Michelle Lujan Grisham.\n“The New Mexico Supreme Court has the power to significantly reduce the number of people in prisons in our state,” ACLU staff attorney Lalita Moskowitz said in a statement. “It should exercise that power immediately to protect the health and wellbeing of hundreds of incarcerated people who can safely be released, as well as medical staff, correctional officers and communities at large.”\nIt’s unclear whether the court will take up the petition.\nImmigrant advocacy groups also sent a letter Tuesday to the governor, pressing her to do what she can to reduce the number of federal immigration detainees being held in county lockups in New Mexico. The groups asked the same of governors in Colorado and New Jersey.\nKim Chavez-Cook with the New Mexico Law Offices of the Public Defender said doing nothing to reduce prison populations guarantees an outbreak that’s certain to spread to neighboring communities.\nNew Mexico has 1,407 coronavirus cases as of Tuesday with 36 known deaths, up by five from Monday. State health officials said the latest reported deaths included four women. The infections include an inmate at the Santa Fe County Detention Center who previously tested negative, and one at the Metropolitan Detention Center in Albuquerque.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can lead to pneumonia or death.\nNew Mexico health officials unveiled an online portal that breaks down the cases by age, gender and ethnicity. It shows Native Americans make up more than 36% of the cases.\nExtensive testing has been done in tribal communities where clusters of illness have been identified. Officials say that partly explains the disproportionate share of the Native American population in the state’s total positive tests.\nIn other developments:\n— Hospitals around New Mexico have announced staff cuts and furloughs. Hundreds of employees from Memorial Medical Center and MountainView Regional Medical Center in Las Cruces to Christus St. Vincent Regional Medical Center in Santa Fe are being placed on temporary leave amid fallout from public health orders and a ban on elective surgeries and non-urgent procedures.\n— A church is suing the state after houses of worship were removed from an exemption of a public health order that limits gatherings to no more than five people. Legacy Church is seeking a temporary restraining order and permanent injunction, saying the order violates the church’s First Amendment rights.", "url": "https://apnews.com/9b85525528c7ddfd27c74ffe015a50b4"}