{"authors": ["Sarah Westwood", "Betsy Klein"], "date_download": "2020-05-04 16:02:05", "date_modify": "2020-05-04 16:02:05", "date_publish": "2020-04-01 17:43:31", "description": "The Trump-aligned America First Action super PAC is spending $10 million targeting Joe Biden in Pennsylvania, Michigan and Wisconsin.", "filename": "2020_04_01_politics_america-first-action-trump-biden-ad-buy_index_1588608125.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191205005729-joe-biden-donald-trump-split-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_america-first-action-trump-biden-ad-buy_index_1588608125.html", "title": "Trump-aligned super PAC spending $10 million against Biden", "title_page": "Trump-aligned super PAC spending $10 million against Biden - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Trump-aligned America First Action super PAC is spending $10 million targeting Joe Biden in Pennsylvania, Michigan and Wisconsin.\nIt will be spent on digital, cable, and mail and is \"the group's first wave of independent expenditure spending in the 2020 election cycle,\" according to a news release.\nThe ad buy represents the super PAC's first foray into the 2020 race and will run through May.\nThe anti-Biden blitz will be the rebuttal many Trump allies think the campaign or pro-Trump outside groups should have launched weeks ago to shield President Donald Trump from the beating he is taking on the airwaves as a result of pro-Biden groups' investment in anti-Trump ads during the coronavirus pandemic\nThe ads come as left-leaning super PAC Priorities USA Action Fund is currently airing an attack ad hitting the President's coronavirus response, repeating Trump's own words as the virus progressed alongside the rising cases.\nThe Trump campaign last week sent a cease-and-desist letter to television stations running the ad in key swing states of Florida, Michigan, Wisconsin and Pennsylvania, because it \"contains the false assertion that President Trump called the coronavirus a 'hoax,' when in fact he was referring to Democrat criticisms and politicization of the federal response to the public health crisis.\"\nIn response, Priorities USA continued to air the ad and expanded it to Arizona. It also launched the ad digitally in Spanish.\nThe pro-Democratic group announced Wednesday it would expand its original pro-Biden ad blitz by $1 million across the same three states, extending its run time by a week, as well as purchase more digital ads in those states and Florida. The group framed it as a direct response to America First Action's move this week.\nThe competing ads include one hammering Trump over his early handling of the coronavirus outbreak, during which the President downplayed the risk to Americans from Covid-19.", "url": "https://www.cnn.com/2020/04/01/politics/america-first-action-trump-biden-ad-buy/index.html"}