{"authors": [], "date_download": "2020-05-04 20:28:15", "date_modify": "2020-05-04 20:28:15", "date_publish": "2020-04-30 10:24:52", "description": "New details have emerged on early efforts to locate Mark R. Frerichs, a contractor from Illinois whose disappearance has been shrouded in mystery.", "filename": "entry_seals-tried-to-locate-us-citizen-taken-by-afghan-militants_n_5eaa9ee9c5b633a85445bb38_1588624095.html", "image_url": "https://img.huffingtonpost.com/asset/5eaaa695240000f3018ea000.jpeg?cache=e2lbldrhyh&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_seals-tried-to-locate-us-citizen-taken-by-afghan-militants_n_5eaa9ee9c5b633a85445bb38_1588624095.html", "title": "SEALs Tried To Locate U.S. Citizen Taken By Afghan Militants", "title_page": "SEALs Tried To Locate U.S. Citizen Taken By Afghan Militants | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — In the days following the capture of an American contractor in Afghanistan earlier this year, Navy commandos raided a village and detained suspected members of the Taliban-linked Haqqani network while the U.S. intelligence community tried to track the cellphones of the man and his captors, The Associated Press has learned.\nWhile the circumstances surrounding the abduction remain unclear, the previously unreported operation described by multiple American officials over the past month shed new light on early efforts to locate Mark R. Frerichs, a contractor from Illinois whose disappearance has been shrouded in mystery and whose case has been the subject of minimal public discussion by the U.S. government.\nThe new details emerge as violence and political infighting in Kabul threaten to scuttle a Taliban peace deal with the U.S. Last month, Secretary of State Mike Pompeo voiced frustrations after a failed attempt to mediate a power struggle between Afghan President Ashraf Ghani and political rival Dr. Abdullah Abdullah. The Trump administration said it would cut $1 billion in aid to Afghanistan.\nWashington has urged Kabul to release Taliban prisoners, which is part of the peace agreement, arguing the detainees were at risk of spreading the coronavirus.\nBut there are no public indications Frerichs, a Navy veteran, has been part of negotiations between the U.S. and Taliban leadership, or that his release is part of any peace deal.\nAP Mark Frerichs, a contractor from Illinois, poses in Iraq in this undated photo obtained from Twitter that he would include with his resume when job hunting.\n“The Taliban kidnapped my brother in January. In February, the U.S. signed a peace deal with the Taliban. My brother wasn’t part of the deal. Now we are arranging for the Taliban and Afghan government to exchange thousands of prisoners,” Charlene Cakora, one of Frerichs’ sisters, said in a statement provided to the AP. “Why can’t we make an American hostage be one of them?”\nFrerichs’ father, Art, said in a statement that though he has faith in President Donald Trump and Pompeo, “I just need them to tell their people negotiating with the Taliban that America won’t lift a finger until my son comes home. He’s a veteran. This is America. We don’t leave people behind.”\nThe Pentagon and U.S. Special Operations Command declined to comment on the SEALs raid. The rescue effort is being coordinated through the FBI-led, multiagency Hostage Recovery Fusion Cell, which said in a statement that it was working with its partners to ensure “that Mark Frerichs and all Americans held hostage abroad are returned home.” It encouraged anyone with information about the case to come forward.\nThe State Department said it was aware of an American who’d been abducted in Afghanistan.\n“The welfare, safety and security of Americans is the Trump Administration’s highest priority,” the department said. “The United States will continue to push for the safe return of this and all other U.S citizens through all relevant channels.”\nA former U.S. national security official who is advising the Frerichs family called on Washington peace envoy Zalmay Khalilzad to resolve the situation and that “he is aware of Mark’s presence, but it does not appear yet that he understands that he needs to get him home.” The former official insisted on anonymity to speak candidly since the official sometimes works with the Trump administration.\nU.S. officials believe Frerichs, 57, of Lombard, Illinois, was held for at least some time in Khost, an eastern province along the border with Pakistan and its so-called tribal regions, a mountainous area that has historically been a haven for Taliban and al-Qaeda militants.\nThe former national security official said that Frerichs has been in Afghanistan for about a decade working on commercial projects and was not a U.S. government contractor.\n“The first 96 hours is crucial,” a senior U.S. government official briefed on the case told the AP on condition of anonymity because the official was not authorized to discuss the matter publicly. “If they’re not recovered in the first few days, it becomes harder every minute after.”\nThough no formal demands are known to have been made, U.S. intelligence officials believe Frerichs was captured by members of the Haqqani network, a militant group aligned with the Taliban in Afghanistan. The Haqqanis have strong links to North Waziristan, a tribal region in Pakistan, south of Afghanistan’s Khost province.\nThe Obama administration designated the Haqqani network as a foreign terrorist organization in 2012 for its ties with the Taliban and the group’s attacks on U.S. military and civilian personnel. Though the Haqqanis are known to carry out assassinations and kidnappings for ransom, Taliban leadership has not acknowledged Frerichs’ capture.\n“I have not received any information about him,” said a Taliban source who asked not to be named. “There has been no clue despite my contacts with every side to get information.”\nIn November, the Afghan government released three prominent members of the Haqqani network in exchange for an American citizen and an Australian professor abducted in 2016. Pompeo characterized the prisoner swap as a “goodwill gesture.”\nRep. Michael Waltz, a Florida Republican and Army veteran who led the teams that searched for Bowe Bergdahl after the Army soldier abandoned his post in 2009 and wound up captured by the Taliban, said the Taliban frequently hides American hostages until they can move them over the border into Pakistan.\n“I have real concerns about suggestions that the Taliban are serious about peace, that the Taliban are upholding their end of the deal when — as we speak today — they are holding a former Navy veteran and American citizen hostage that they took, again, during the peace negotiations,” Waltz said in an interview.\nThe search area for Frerichs began in Khost and extended south to the province of Kandahar, according to the senior U.S. government official and a second official at the Defense Department.\nMembers of the elite Naval Special Warfare Development Group, more familiarly known as SEAL Team Six, who were involved in the Frerichs effort had spent late January working to recover the bodies of two American service members who died when their aircraft crash-landed in Ghazni in central Afghanistan, according to the two U.S. officials.\nThe bitter winter weather that limited overhead surveillance of the airplane wreckage by U.S. military drones also worked against officials during the later SEAL operation on the night of Feb. 3. Periods of poor-to-nonexistent visibility ultimately delayed a planned intelligence-gathering operation on a known Taliban location, said the senior U.S. government official, who has direct knowledge of the raid.\nOnce the weather cleared, the SEALs loaded onto helicopters and flew to the undisclosed location. The senior official declined to disclose the exact location of the province for operational security reasons.\nThe senior U.S. government official and the Defense Department source with knowledge of the raid, who also requested anonymity, said the SEAL platoon was not met with any Taliban resistance and that once at the compound, they detained several alleged Haqqani militants and uncovered a weapons cache. It’s not known if the weapons cache was destroyed at the scene or given to Afghan security forces.\nThe suspected Haqqani members were questioned about Frerichs’ whereabouts and ultimately turned over to the Afghan government, according to the senior U.S. government official.\nOn Feb. 4, American intelligence officials received a report that Frerichs had possibly been moved to Quetta, Pakistan, a historical haven for the Taliban, the two officials said. But the information was deemed not credible enough to warrant a special operations mission, according to the senior U.S. government official.\nThe report also conflicted with signals intelligence U.S. officials had at the time. Signals intelligence is information gathered from the electronic signals that are broadcast from devices like portable radios and cellphones. The information can be used to track the movements of individuals or eavesdrop on conversations, known in the spy business as low-level voice intercepts.\nU.S. intelligence officials continued to receive location pings from the suspected cellphones of Frerichs and his captors, but the trail went cold on Feb. 5, according to the senior U.S. government and Defense Department officials.\nWhile the senior U.S. government official would not say where exactly the last location ping for Frerichs came from, the official said it was near where he was captured. The AP was not able to determine how the U.S. intelligence community knew to target these specific cellphones to monitor.\n“Operationally, the reason why time is critical in a kidnapping is because you can close the distance quicker, ideally immediately or by utilizing sources,” said the senior U.S. government official. “This is not the case right now. He could be two houses down from where he was taken and we would not know.”\n____\nLaPorta reported from Delray Beach, Florida. Associated Press writers Matthew Lee in Washington, Kathy Gannon in Islamabad and Allen G. Breed in Raleigh, North Carolina, contributed to this report.\n___\nContact AP’s global investigative team at Investigative@ap.org.", "url": "https://www.huffpost.com/entry/seals-tried-to-locate-us-citizen-taken-by-afghan-militants_n_5eaa9ee9c5b633a85445bb38"}