{"authors": ["Geneva Sands", "Cristina Alesci"], "date_download": "2020-05-04 16:16:45", "date_modify": "2020-05-04 16:16:45", "date_publish": "2020-04-03 17:43:17", "description": "The US Food and Drug Administration on Friday changed its position on a sought-after type of respirator from China, the KN95, announcing that the agency will authorize the mask for use in healthcare settings if it meets certain criteria.", "filename": "2020_04_03_politics_fda-china-kn95-us-certain-criteria_index_1588609005.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319013301-01-coronavirus-0318-china-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_fda-china-kn95-us-certain-criteria_index_1588609005.html", "title": "FDA changes course and allows China's KN95 mask to be used in US", "title_page": "FDA changes course and allows China's KN95 mask to be used in US - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US Food and Drug Administration on Friday changed its position on a sought-after type of respirator from China, the KN95, announcing that the agency will authorize the mask for use in healthcare settings if it meets certain criteria.\nIn response to continued respirator shortages, the FDA issued new guidance , authorizing KN95 respirators if certain criteria are met, including evidence demonstrating that the respirator is authentic.\nThe move comes after conflicting government guidance that caused confusion over how these masks should be used and whether they could be imported into the US.\nThe FDA did not include these masks on its initial guidance for emergency use issued last month, but the Centers for Disease Control and Prevention said the KN95 masks are \"expected to be suitable alternatives\" to the N95 masks during the coronavirus pandemic when supplies are short.\nThe differing guidance left suppliers hesitant to ship masks and US buyers wary of purchasing them.\nOn March 28, the FDA listed masks from six countries , including Mexico and Brazil, that it found \"appropriate to protect public health or safety,\" but left the Chinese masks off the list.\nAcross the globe, N95 masks -- considered the gold standard of respirator masks -- are in short supply. These masks, which filter out at least 95% of very small particles from the air, are a crucial piece of equipment for doctors and nurses treating the tens of thousands of coronavirus-infected patients in the United States.\nBut questions about the quality and effectiveness of the similarly named KN95 mask arose as production ramped up in China.\nThe masks were not listed in the initial FDA emergency use authorization because of \"challenges in determining the authenticity\" of the imports, said an agency spokesperson, who added that the FDA has already encountered fraudulent products identified as KN95s.\nIn one instance, a business executive who was worried about hospitals refusing to use the KN95 decided against putting KN95 masks on a plane bound for the US because the FDA hadn't issued a blanket \"emergency use authorization\" for hospitals to use Chinese KN95 masks.\n\"(Y)ou have a country (China) that's proven it has masks effective in a hospital setting,\" said the executive. \"Why not let Chinese KN95 masks in?\"\nAt least two Change.org petitions were started asking the FDA to change its protocol and allow the use of KN95 masks.\nHospitals would not accept the Chinese KN95 masks without FDA approval, according to John Wood, a former Microsoft China executive who founded the education nonprofit \"Room to Read.\"\nWood and his wife Amy Powell, who are based in Hong Kong, recently started a private effort accepting financial donations, which are used to source multiple types of masks -- including KN95 -- in China in an effort to deliver them to US health care workers in need.\n\"We have huge demand. And we have donors who are willing to underwrite it and you've got the FDA freezing the market,\" Wood told CNN. They have requests for more than 5 million masks, including from hospitals such as Weill Cornell, Brigham and Women's Hospital and University of Wisconsin Madison.\nKN95s helped China in its fight against the coronavirus, according to Wood, who said the US government has failed to make sure there is an adequate supply of N95 masks. Demand froze, because hospitals were afraid to import them and supply was frozen because producers were afraid of getting them confiscated, he said.\nTheir first shipments arrived in the US on Thursday destined for various places where health care workers or their families had reached out for help, including Seattle, San Francisco, Toronto and Tokyo.\nHowever, there have been issues with these types of masks.\nDr. Steven Corwin, MD, CEO of New York-Presbyterian, one of the nation's largest health care delivery systems in the country, said after testing KN95 respirators, \"they're just not good.\"\n\"Yes, they are too porous. They don't work,\" said Corwin.\nCorwin told CNN that the New York-Presbyterian staff all have to wear the N95 masks when caring for patients.\n\"So what we're going to have to learn as a country. After this, is that if you know the supply chain from China is very fragile, and we have to take that into account the next time, God forbid it happens, assume the next time we go through something like this,\" he said.\nQuality issues were also recently uncovered in a shipment to the Netherlands.\nIn March, the Dutch government recalled a shipment of KN95 masks from a Chinese manufacturer after determining that they did not meet quality standards.\nPart of the shipment had already been sent to health care providers. It was only thereafter, the Dutch Ministry of Health said, that it \"received a signal\" that the \"quality of this shipment did not meet the required standards.\"\nBut quality masks are in demand.\nLeo Friedman -- CEO of iPromo, a Chicago-based promotional products distributor -- began sourcing KN95 masks and other personal protective gear from China into the US when the pandemic hit.\nFriedman said that while he has used his years of experience sourcing from China to import certified masks, dozens of \"fly by night\" factories have opened in China.\n\"People without proper certification, proper proper documentation, proper lab results. They're seeing their masks being stuck in customs,\" said Friedman. \"There's been a ton of counterfeit masks.\"\nNew York and Florida state governments both placed orders with Friedman's company, which included KN95 masks, but he did not know how the masks would be distributed.\n\"Some hospitals have accepted them, some hospitals even turned away donations for them because they're not officially approved,\" said Friedman.\nAccording to Customs and Border Protection guidance, the FDA does not object to importation and use of the KN95 respirators during the emergency. CBP is the enforcement arm for the FDA to stop unregistered, mislabeled or adulterated products coming into the US.\nIn its current guidance, the FDA says that when pre-approved respirators are not available, the agency would \"generally would not object\" to the use of unauthorized masks if they are on the CDC list of alternatives, which includes the KN95.\nEarlier this week, Michael Brugger -- president of Fully Promoted, a franchise uniform and promotional product business -- wrote to the White House, FDA and CDC, asking for clarification on the \"conflicting information\" from the CDC and FDA.\n\"This conflict between two government agencies is causing market confusion and needs to be rectified,\" he wrote. \"We urge you to allow the importation of KN95 masks today so they can get into the hands of people who need them.\"\nThis story has been updated with additional details.", "url": "https://www.cnn.com/2020/04/03/politics/fda-china-kn95-us-certain-criteria/index.html"}