{"authors": ["Nick Perry"], "date_download": "2020-05-04 20:23:37", "date_modify": "2020-05-04 20:23:37", "date_publish": "2020-04-21 01:54:03", "description": "WELLINGTON, New Zealand (AP) — While most countries are working on ways to contain the coronavirus, New Zealand has set itself a much more ambitious goal: eliminating it altogether. And...", "filename": "_2aad9ddddce1492f4e2068c092e65fa7_1588623817.html", "image_url": "https://storage.googleapis.com/afs-prod/media/81d37d17818a49558708daa7167d6c0c/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2aad9ddddce1492f4e2068c092e65fa7_1588623817.html", "title": "New Zealand could pull off bold goal of eliminating virus", "title_page": "New Zealand could pull off bold goal of eliminating virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Friday, April 17, 2020, photo, medical staff test a supermarket employee who volunteered at a pop-up community COVID-19 testing station at a carpark in Christchurch, New Zealand. New Zealand has set itself an ambitious goal of not just containing the coronavirus, but eliminating it altogether. Experts believe the country could pull it off, thanks to its geography and decisive early actions by Prime Minister Jacinda Ardern, who has put the country into a strict lockdown. But whatever happens, the country will continue feeling the effects of the pandemic, which has hobbled its vital tourism industry. (AP Photo/Mark Baker)\nIn this Friday, April 17, 2020, photo, medical staff test a supermarket employee who volunteered at a pop-up community COVID-19 testing station at a carpark in Christchurch, New Zealand. New Zealand has set itself an ambitious goal of not just containing the coronavirus, but eliminating it altogether. Experts believe the country could pull it off, thanks to its geography and decisive early actions by Prime Minister Jacinda Ardern, who has put the country into a strict lockdown. But whatever happens, the country will continue feeling the effects of the pandemic, which has hobbled its vital tourism industry. (AP Photo/Mark Baker)\nWELLINGTON, New Zealand (AP) — While most countries are working on ways to contain the coronavirus, New Zealand has set itself a much more ambitious goal: eliminating it altogether.\nAnd experts believe the country could pull it off.\nThe virus “doesn’t have superpowers,” said Helen Petousis-Harris, a vaccine expert at the University of Auckland. “Once transmission is stopped, it’s gone.”\nGeography has helped. If any place could be described as socially distant it would be New Zealand, surrounded by stormy seas, with Antarctica to the south. With 5 million people spread across an area the size of Britain, even the cities aren’t overly crowded.\nAnd Prime Minister Jacinda Ardern has taken bold steps, putting the country under a strict lockdown in late March, when only about 100 people had tested positive for the new virus. Her motto: “Go hard and go early.”\nNew Zealand has so far avoided a widespread outbreak, and new cases have dwindled from a peak of about 90 per day in early April to just five on Tuesday, leaving the goal tantalizingly close. Only 13 people have died so far, and Ardern has been personally briefed on each death.\n“We have the opportunity to do something no other country has achieved: elimination of the virus,” Ardern told reporters last week. “But it will continue to need a team of 5 million behind it.”\nPetousis-Harris said the country had managed to avoid the confusion and half-measures that have hampered the response in many other places.\n“New Zealand got everything right,” she said. “Decisive action, with strong leadership and very clear communications to everybody.”\nArdern on Monday announced the country would stay in lockdown for another week before slightly easing some work restrictions to help restart the economy. Most of the social restrictions will remain in place.\nShe also tried to temper expectations of her goal, saying elimination didn’t mean that new cases wouldn’t arise in the future but they would be stamped out immediately.\nNew cases are likely when New Zealand eventually reopens its borders, but questions remain about how well prepared the health system is to implement effective contact tracing should a widespread outbreak occur. Petousis-Harris pointed to problems last year when the country failed to contain a measles outbreak.\nEven if New Zealand does purge itself of the virus, the effects will linger. Before the outbreak, tourism was booming. About 4 million people visited each year, drawn by stunning scenery and the lure of adventure sports. The industry employed more than 300,000 people and accounted for about 10% of New Zealand’s entire economy.\n“It’s been devastating. No question at all,” said Stephen England-Hall, the chief executive of Tourism New Zealand, a promotional agency. “No one can really plan to go from 100% to zero in three days.”\nFull Coverage: Virus Outbreak\nA study by the Organisation for Economic Co-operation and Development found that because of its reliance on tourism, New Zealand’s economy could initially be one of the hardest-hit by the coronavirus among developed nations.\nThe government, which came into the crisis with its books in relatively good shape, has been handing out billions of dollars in temporary wage subsidies to try and prevent mass unemployment. More than half the nation’s workforce has suddenly become reliant on government handouts.\nStill, most people appear to support Ardern’s strict lockdown, under which schools are closed and people working nonessential jobs can leave home only for groceries or exercise. Google mobility data indicates there has been high compliance.\nMany have found creative ways to cope, like 28-year-old personal trainer Jessee James. Instead of meeting her clients in gyms or at their homes, she’s been leading virtual sessions over Zoom and FaceTime.\nSome of her clients are using cans of beans instead of dumbbells, or laundry baskets instead of sandbags. Many want to talk more about their feelings, like the business owner who needed to lay off employees or the client with emotional issues who needs encouragement.\n“Normally they would just talk to the people around them,” James said. “It’s been quite different.”\nOne of the most symbolic casualties of the outbreak has been Air New Zealand. The airline had been a source of pride for many as it expanded internationally and won industry awards. In a series of frank updates, Chief Executive Greg Foran described how the carrier had reduced flights by 95% and would need to cut its workforce by at least 3,750.\nOne person who doesn’t yet know if he will retain his job with the airline is 27-year-old pilot Scott Beatson. He and partner Bella Ashworth, who just finished law school, bought a house earlier this year, and they’re both now worried about their futures.\n“It’s quite sad,” Beatson said. “Just before the lockdown, I was talking with a baggage loader and a check-in person, and everyone took such pride in the company.”\nAn eager fisherman and hiker, Beatson has taken to camping in his backyard while stuck at home. Like many around the country, he’s been tuning into some of the daily briefings given by Ardern and Ashley Bloomfield, the director-general of health.\nAn unassuming official who spent a year working at the World Health Organization in Geneva, Bloomfield’s calm and reassuring presence has turned him into an unlikely heartthrob.\nSinger Maxwell Apse wrote a song about Bloomfield that has been viewed more than 75,000 times on YouTube. “If I had one wish, I would make it this: I’d be in your bubble,” go the lyrics.\nWhen New Zealand does come out of its bubble, the path forward remains unclear. It will need to continue relying on its traditional strength in farming to sell things abroad like dairy products, kiwifruit and wine.\nSome have suggested the country could first reopen its borders to Australia, which has also been successful in flattening its virus curve.\nEngland-Hall, the tourism executive, said New Zealand will look to first rebuild the domestic tourism market. He said being virus-free could eventually become a selling point abroad for the country.\nThe conundrum is that to stay virus-free, New Zealand may need to continue its current requirement that new arrivals spend two weeks in quarantine. Given that the average tourist in the past has stayed for about 11 days, it seems an insurmountable obstacle.\nEver the optimist, England-Hall foresees a new type of tourism product in which wealthy people could be pampered during a quarantine period — a kind of isolation spa.\nBut with travel curtailed, some worry that New Zealand could revert to a more insular version of itself, before cheap flights allowed its citizens to roam the world, and foreigners to visit. A place where isolation can be both a blessing and a curse.", "url": "https://apnews.com/2aad9ddddce1492f4e2068c092e65fa7"}