{"authors": ["Jim Salter", "Margaret Stafford"], "date_download": "2020-05-04 20:22:19", "date_modify": "2020-05-04 20:22:19", "date_publish": "2020-04-10 15:28:33", "description": "O'FALLON, Mo. (AP) — Missouri Gov. Mike Parson on Friday signed a supplemental budget bill allocating nearly $6 billion in federal stimulus money to fight the health and economic ramifications of...", "filename": "_2d9ffe01d91978f49ab881c1892807b8_1588623739.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3fe81d7bbe0a4df08bc8413a21640921/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2d9ffe01d91978f49ab881c1892807b8_1588623739.html", "title": "Missouri governor signs spending bill to fight pandemic", "title_page": "Missouri governor signs spending bill to fight pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Blue LED lights light up a Ferris wheel outside Union Station, Thursday, April 9, 2020, in St. Louis. Lights on various buildings, attractions and streetlights have been changed to blue to recognize law enforcement, health care workers and other essential personnel working during the coronavirus outbreak. (AP Photo/Jeff Roberson)\nBlue LED lights light up a Ferris wheel outside Union Station, Thursday, April 9, 2020, in St. Louis. Lights on various buildings, attractions and streetlights have been changed to blue to recognize law enforcement, health care workers and other essential personnel working during the coronavirus outbreak. (AP Photo/Jeff Roberson)\nO’FALLON, Mo. (AP) — Missouri Gov. Mike Parson on Friday signed a supplemental budget bill allocating nearly $6 billion in federal stimulus money to fight the health and economic ramifications of the coronavirus pandemic.\nThe money will be used to purchase additional personal protective equipment for first responders, help develop medical facilities beyond traditional hospitals, and provide aid to hard-hit local governments, Parson said during a news conference. He also announced he was establishing a working group led by state Treasurer Scott Fitzpatrick to help decide how the money will be spent. Both Parson and Fitzpatrick are Republicans.\n“COVID-19 has had an overwhelming impact on our economy and many local governments, health care providers, education institutions, businesses and other groups will rely on this funding,” said Parson, who surrendered part of the news conference to two clergy members who offered prayers in advance of Easter.\nMissouri’s health department on Friday reported 19 new deaths from COVID-19, raising the state’s overall toll to 96. It also reported 260 more confirmed cases of the disease, raising the state’s overall count to 3,799.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nMissouri Secretary of State Jay Ashcroft asked some employees to return to the agency’s office in Jefferson City on Monday to help keep up with an increasing workload. Only people with offices will be asked to come to work, excluding those with preexisting health conditions.\nEmployees will not be ordered to wear masks, but Ashcroft said he intends to wear one to encourage others to do so. He said phones have been “ringing off the hook and we need people to be there to answer those phones.”\nOther state agency heads have said they would continue to have employees work from home for the time being.\n“We are each getting paid by the citizens of Missouri and if we are going to take those dollars, we need to be there to do the work,” Ashcroft said.\nMeanwhile, a blood bank operating in Missouri and three other Midwestern states is seeking plasma donations from people who have recovered from the coronavirus in the hopes of helping those still battling the disease.\nThe Mississippi Valley Regional Blood Center is seeking people who tested positive for COVID-19, the illness caused by the coronavirus, and have not had symptoms for at least 28 days. The blood bank operates in parts of Missouri, Illinois, Iowa and Wisconsin. The first donations are expected within the next few days.\n“We think everything we collect is going to be used somewhere and likely the demand for this treatment will exceed what we can collect,” blood bank spokesman Kirby Winn said Friday.\nDoctors around the world are turning to blood plasma infusions in the hopes of helping patients recover from COVID-19. It’s not certain that it works, but the Food and Drug Administration on April 3 announced that a national study being led by the Mayo Clinic would offer experimental plasma therapy to COVID-19 patients and track how they fared.\nThe idea is that when an infection occurs, the body begins to make proteins called antibodies specially designed to target that pathogen. Those antibodies then remain in a survivor’s blood — specifically, in the plasma — for months or even years.\n___\nStafford reported from Liberty, Missouri.\n___\nCheck out more of the AP’s coronavirus coverage at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/2d9ffe01d91978f49ab881c1892807b8"}