{"authors": [], "date_download": "2020-05-04 16:23:54", "date_modify": "2020-05-04 16:23:54", "date_publish": "2020-04-06 20:17:48", "description": "Here are five bean recipes that will keep you from getting chili fatigue.", "filename": "2020_04_06_cnn-underscored_recipes-with-beans_index_1588609434.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406002852-beans-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_cnn-underscored_recipes-with-beans_index_1588609434.html", "title": "5 easy and creative bean recipies", "title_page": "5 easy and creative bean recipies  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Story highlights Creative recipes for your bean stash from delicious white bean soup to cannellini aglio e olio.\nEssentials you'll need to prep beans like a pro in your kitchen.\nCNN Underscored has interviewed experts to find the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nA lot remains uncertain these days, but we all probably have a ton of beans in our pantries. While there is no reason to hoard food, there is good reason to consider stocking up on beans, which are shelf-stable and nutrient-rich options during this time of social distancing. If you're staring at that full shelf of beans and imagining months of chili, think again. Beans are as versatile as they are long-lasting. Deb Perelman, the culinary mind behind Smitten Kitchen, has known about the wonder of beans for years — her blog is full of easy and delicious recipes chock-full of 'em.\nBefore we dive into five of her best pantry friendly recipes that use legumes, here are a few bits of basic bean wisdom from Perelman.\nFirst: Substitutions\nWhile many grocery store shelves are slowly getting back to normal, food availability (or scarcity) can be regional. Don't let a shelf devoid of black beans change your entire meal plan. She explains that most beans are fairly interchangeable. In fact, just think about size when making a swap. If you can't find black beans, for example, grab small red beans. If you are planning on pureeing the beans into a soup or dip, it's even easier to substitute with whatever beans you have.\nSecond: The canned vs. dried debate\nWhile some people believe strongly that dried beans yield a much tastier dish, Perelman is an unabashed fan of canned beans because they're so easy. She adds that there are times when she would advocate for dried, though.\n\"If you're taking out the Instant Pot or slow cooker, you might as well start with dried beans,\" she says. Pereleman says that since the slow cooker will be cooking for hours anyway, it'll give you plenty of time to simmer the dried beans. Another time she tends to reach for dried is when using a pressure cooker: It doesn't take much extra time to cook them up.\nYou can also substitute dried beans for canned and vice versa, though it's not as simple as substituting one kind of bean for another. Perelman notes that there isn't necessarily a tried-and-true conversion ratio, but there are ways to work around it.\nIf you want to add canned beans to a recipe that calls for dried, just know the liquid can be drastically reduced. On the flip side, if you have dried beans, you can precook them or just plan on increasing cooking time and the amount of liquid. Dried beans require 1 to 2 parts their own volume in liquid to cook properly, whereas canned beans don't need any additional liquid.\nPrecooking dried beans is especially handy with chili, since the acid in the tomatoes can stop cooking, so Pereleman recommends cooking dried beans separately, if possible.\nNow that you've completed the legume crash course, here are five bean recipes that will keep you from getting chili fatigue.\nHummus Heaped with Tomatoes and Cucumbers\nHummus Heaped with Tomatoes and Cucumbers\nPerelman discovered a secret when she tried to make hummus as smooth and delicious as the kind you get in restaurants: You need to remove the skins. It takes about 10 minutes to pop the beans out of their skins, which is a meditative activity for those of us who aren't into puzzles right now. (Perelman also discovered more recently that you can buy split, peeled chickpeas from Indian grocery stores or even online to skip the peeling step.) After your peeling labors are done, let the food processor do the rest of the work. Perelman's hummus is, on its own, a wonderful snack, but she also has a way to turn it into dinner: Top it with cucumbers and tomatoes for a salad. Or, pile on boiled eggs or radishes. It's a delicious experiment, however you do it.\nIngredients:\n4 large pitas, toasted, cut into wedges\n2 cups prepared hummus (from this recipe, your favorite recipe, or your favorite brand)\nOlive oil\n1 1/2 cups (8 ounces or 225 grams) cherry tomatoes, chopped small, plus more to taste\n8 ounces (225 grams) small cucumbers, washed, unpeeled, chopped small\n1/4 medium red onion, chopped small\nJuice of half a lemon\nSalt and freshly ground black pepper\nSumac and/or za'atar (optional)\n1 to 2 tablespoons finely chopped parsley, or a mix of parsley, mint and chives, plus more for garnish\nSee the entire Hummus Heaped with Tomatoes and Cucumbers recipe at SmittenKitchen.com.\nWhite Bean Soup With Crispy Kale\nWhite Bean Soup With Crispy Kale\nWhen Perelman first had the idea for this recipe, she imagined a lighter potato soup where she could \"sort of Italian it up.\" It also happens to be a surprisingly sophisticated meal for using a lot of pantry friendly ingredients like Parmesan, broth, potatoes, and, of course, beans. Another big secret of her soup: Fixings. Here, she cooks pancetta in a heavy pot like a Dutch oven before adding the soup ingredients and crisps some kale while the soup simmers. Blend the soup to a silky smooth consistency and you've got dinner in about 40 minutes.\nIngredients:\n4 ounces diced pancetta (bacon works, too)\nOlive oil\n1 medium onion, chopped\n3 cloves garlic, minced\nKosher salt\nFreshly ground black pepper\n4 cups vegetable or chicken broth\n1 1/2 pounds yukon gold potatoes, diced into 1/2-inch cubes (no need to peel)\n5 ounces curly kale leaves (from a salad-ready container)\n1 15-ounce can of cannellini or a smaller white bean, drained and rinsed\n1/2 cup finely grated Parmesan\nSour cream, to serve\nSee the entire White Bean Soup with Crispy Kale recipe at SmittenKitchen.com.\nCannellini Aglio e Olio\nCannellini Aglio e Olio\nOne of Perelman's many bean tricks is to, as she puts it, treat them like pasta. When you start with canned cannellini beans, they actually cook faster than pasta. In this recipe, beans cook in a generous amount of garlic with chopped artichoke hearts. Perelman recommends serving it two ways: Over toast or straight up on its own. It's also easy to imagine how good the warmed beans would be on a bed of arugula or tossed with other veggies that might be sitting in the fridge waiting to be put to use.\nIngredients:\n3 tablespoons olive oil\n4 garlic cloves, peeled and thinly sliced\nSalt and red pepper flakes\n1 15-ounce cannellini beans, drained and rinsed (about 1 3/4 cups)\nHalf a 14-ounce can artichoke hearts, drained, chopped\n1/4 cup chopped flat leaf parsley\nGrated Parmesan or pecorino Romano\nSee the entire Cannellini Aglio e Olio recipe at SmittenKitchen.com.\nBlack Bean Soup with Toasted Cumin Seed Crema\nBlack Bean Soup with Toasted Cumin Seed Crema\nThis is another favorite soup of Perelman's that's made even better by those famous fixings like avocado, chips and crema. If you start by making the base, you'll have a versatile and delicious soup that you can easily adapt to finish with canned or dried beans, on the stove, in a pressure cooker or with a slow cooker. Once the the soup is made, you can freeze it and pick up the fixings when you're ready to serve it for an easy dinner that feels more fresh and special than your typical thawed freezer meal.\nIngredients:\n1 tablespoon olive oil\n2 medium red onions, chopped\n1 medium red bell pepper, chopped\n1 medium green bell pepper, chopped\n4 garlic cloves, minced\n4 teaspoons ground cumin\n1 16-ounce package dried black beans\n1 tablespoon chopped chipotle chiles from a can\n7 cups water\n2 tablespoons fresh lime juice\n2 teaspoons coarse kosher salt\n1/4 teaspoon ground black pepper\nSee the entire Black Bean Soup with Toasted Cumin Seed Crema recipe at SmittenKitchen.com.\nCrisped Chickpeas with Herbs and Garlic Yogurt\nCrisped Chickpeas with Herbs and Garlic Yogurt\nWhen Perelman first started writing recipes, everyone was all about chickpeas. That was perfectly fine with Perelman, who even has a recipe devoted to making a base of really good chickpeas that can be used any number of ways. If you want guidance, however, consider starting with her crisped chickpeas. Starting with canned beans, you quickly fry them in a pan and serve with zucchini and garlic yogurt. This is another deceptively easy food that you can eat with everything, from toast to fried eggs. Stir the minced garlic into plain yogurt and let it sit. If you want the garlic to be especially smooth, grate it with a microplane.\nIngredients:\n1 15-ounce can chickpeas, drained and rinsed\n1 small garlic clove, minced or microplaned\n1/2 cup plain yogurt\nSalt and red pepper flakes\nHalf a large lemon\n1 small zucchini (about 6 ounces), thinly sliced\nHandful of chopped fresh mint, oregano, basil, parsley or a mix\nSee the entire Crisped Chickpeas with Herbs and Garlic Yogurt recipe at SmittenKitchen.com.\nTools of the trade\nWhether you're just getting to know your way around the kitchen or are ready to expand your skills, these are the tools of the trade that you'll need to whip up amazing bean recipes.\nCuisinart Elemental 8-Cup Food Processor with 3-Cup Bowl in Gunmetal ($99.99, bedbathandbeyond.com)\nCuisinart® Elemental 8-Cup Food Processor with 3-Cup Bowl in Gunmetal\nIf you don't have one, now is a great time to grab a food processor. These workhorses are perfect for pureeing beans and soups, making dough, slicing vegetables and more.\n___________________________________________________________________________________________\n6.5-Quart Tramontina Cast Iron Dutch Oven ($43.99, target.com)\n6.5-Quart Tramontina Cast Iron Dutch Oven\nThis mid-sized Dutch oven goes into the oven and cooks on the stove, meaning it can handle various jobs in your kitchen — from arroz con pollo to soup.\n___________________________________________________________________________________________\nKitchenAid Hand Blender ($34.99, amazon.com)\nKitchenAid Hand Blender\nA nicely pureed soup is usually easiest to accomplish with a hand blender like this. Just stick it in the pot, fully submerged, and go for it.\n___________________________________________________________________________________________\nOXO Good Grips 8-Inch Double Rod Strainer ($15.99, originally $19.99, bedbathandbeyond.com)\nOXO Good Grips 8-Inch Double Rod Strainer\nFor creating a super smooth puree, or for washing canned beans, this fine-mesh strainer is useful in all sorts of ways.\n___________________________________________________________________________________________\nFive Two Bamboo Cutting Board ($59, food52.com)\nFive Two Bamboo Cutting Board\nCooking from scratch means lots of chopping and dicing and slicing. A versatile cutting board is essential for getting the jobs done.\n___________________________________________________________________________________________\nInstant Pot Duo 8-Qt Multi-cooker ($79.99, target.com)\nInstant Pot Duo 8 qt Multi-cooker\nAn Instant Pot is a true blue friend when cooking beans from scratch. You can precook the beans in minutes using the pressure cooking feature. Then, set it and forget it while your soup or stew brews.\n___________________________________________________________________________________________\nCrock-Pot Cook' N Carry 6-Quart Slow Cooker ($34.99, bedbathandbeyond.com)\nCrock-Pot Cook' N Carry 6-Quart Slow Cooker\nIf you don't need the pressure cooking feature of the Instant Pot, or you'd like to slow cook while you're pressure cooking, adding a slow cooker to your collection of kitchen gear is a smart choice.\n___________________________________________________________________________________________\nMicroplane Zester ($14.95, target.com)\nMicroplane Zester\nMicroplanes are the gold standard in zesting, grating and slicing. This zester has more than 7,500 5-star reviews on Amazon.\n___________________________________________________________________________________________\nCuisinart Chef's Classic Nonstick 14-Inch Skillet ($39.95, amazon.com)\nCuisinart Chef's Classic Nonstick 14-Inch Skillet\nA 14-inch skillet gives you extra space for preparing larger dishes for a crowd and if you need to toss around your ingredients. The nonstick surface makes it a breeze to clean.\n___________________________________________________________________________________________\n'Smitten Kitchen Every Day: Triumphant and Unfussy New Favorites: A Cookbook' by Deb Perelman ($22.93, amazon.com)\n\"Smitten Kitchen Every Day: Triumphant and Unfussy New Favorites: A Cookbook\" by Deb Perelman\nDeb Perelman of Smittcen Kitchen has compiled her favorite tips and recipes into this, her second cookbook. Whether you're just learning to cook or are looking to expand your repertoire, she has delicious recipes that aren't too complicated.\nThe prices above reflect the listed retailer's price on the date this article was published.", "url": "https://www.cnn.com/2020/04/06/cnn-underscored/recipes-with-beans/index.html"}