{"authors": [], "date_download": "2020-05-04 16:02:21", "date_modify": "2020-05-04 16:02:21", "date_publish": "2020-03-26 16:08:08", "description": "We may be confined to our homes, but luckily our access to global cultural institutions is nearly unlimited.", "filename": "2020_03_26_cnn-underscored_virtual-museums_index_1588608141.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200325110045-virtual-art-slug-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_26_cnn-underscored_virtual-museums_index_1588608141.html", "title": "50 ways to experience culture from your couch", "title_page": "Virtual Museums: 50 ways to experience culture from your couch - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "With so many of the world's cultural institutions (and even our local libraries) closed for the foreseeable future, it can feel like our only options for feeding our brains are pop culture and whatever books we currently have on the shelf.\nWe may be confined to our homes, but luckily our access to global cultural institutions is nearly unlimited. From virtual tours of the Great Wall to a one-shot tour through the second-largest museum in the world, there's tons of exploring we can do from our couches.\nHere are 50 options to get started — we'll have plenty to keep us feeling cultured. And we've included some mementos from the virtual gift shop to make it feel like you really went there and came home with a souvenir.\nHistory museums and historical sites\nGreat Wall of China in Jinshanling\nNational Museum of American History, Washington\nThe Smithsonian's history museum houses everything from the original star-spangled banner to the first Muppets. Get a glimpse into its vast collection (and learn a thing or two) from the museum's podcast, \"Lost at the Smithsonian,\" hosted by comedian Aasif Mandvi. ______________________________________________________________________________\nNational Archives, Washington\nToday, we keep in touch via texts and FaceTime. The Founding Fathers had letters. Sift through 183,00 pieces of their writings, and even sort correspondence by author and recipient, such as all letters from John Adams to his wife.\n_______________________________________________________________________________\nThe Jewish Museum, New York\nListen to audio tours, hear directly from the artists, and learn more about significant objects as part of The Jewish Museum's online experience. Objects range from a Purim pastry stamp to a painting by Kehinde Wiley.\n_______________________________________________________________________________\nNational Women's History Museum, Online\nMarch is Women's History Month, making it a perfect time to visit the National Women's History Museum, remotely. While the proposed museum doesn't currently have a brick-and-mortar location, its online exhibits range from the women of NASA to women in the Olympics.\n_______________________________________________________________________________\nThe Great Wall of China\nTake virtual tours of some of the most famous spots along the 3,000-mile stretch of the Great Wall. An interactive map lets you explore some of the most visited sections with a click of your mouse.\n_______________________________________________________________________________\nFrederick Douglass House, Washington\nPart of the National Park Service, Frederick Douglass' last home in Washington offers a room-by-room tour. A virtual tour by the Parks Service provides more context, though not as high-tech an experience. For higher-quality photos of each room, use the tour made by Google Arts & Culture.\n_______________________________________________________________________________\nSir John Soane's Museum, London\nArchitect Sir John Soane turned his London home into a floor-to-ceiling display of art and antiquities. You can tour a 3D model of the house (and click on objects to learn more), starting in his famous Sepulchral Chamber, home to a proudly displayed sarcophagus.\n_______________________________________________________________________________\nMuseo Larco, Lima, Peru\nThe Larco Museum, dedicated to pre-Columbian art, is probably best known for its pottery. You can explore the online exhibition and view highlights from its famous gardens and erotic art collection. A 10-minute video, uploaded by the museum onto YouTube, provides a solid background into the history of ancient Peru.\nMementos from the gift shops:\nLego Architecture Great Wall of China Building Kit ($77.98; amazon.com)\nLego Architecture Great Wall of China Building Kit\n_______________________________________________________________________________\nRifle Paper Company Washington Cherry Blossom Print ($39.95; papersource.com)\nRifle Paper Company Washington Cherry Blossom Print\nPerforming arts centers\nNew York's Lincoln Center for the Performing Arts\nThe Metropolitan Opera, New York\nEvery night, the Met makes a different opera available to stream for free. The performances can be viewed on apps for Apple, Amazon, and Roku as well as streamed from the Met's own website. Each opera is available for 20 hours, starting at 7:30 p.m. ET each day.\n_______________________________________________________________________________\nWiener Staatsoper, Vienna, Austria\nThe Vienna state opera, Wiener Staatsoper, is streaming previously recorded ballet and opera performances daily. Each will be available free for 24 hours after the stream, and you can view the current lineup on the website.\n_______________________________________________________________________________\nPhiladelphia Orchestra\nOn March 12, the Philadelphia orchestra played a final concert to an empty hall before suspending performances due to COVID-19. You can view that final performance, which was live-streamed on Youtube, including Beethoven's Fifth and Sixth Symphonies.\n_______________________________________________________________________________\nBerliner Philharmoniker\nThe Berlin Philharmonic is making its archive of hundreds of recorded concerts and performances available free. Go to the website and redeem the voucher code to get access. You can sort performances by genre, composer and more.\n_______________________________________________________________________________\nSeattle Symphony\nThe Seattle Symphony is sharing free broadcasts through YouTube and Facebook. Currently, two performances have been announced, with more to come. Broadcasts have to be viewed live, making this a rare example of appointment viewing in 2020.\n_______________________________________________________________________________\nChamber Music Society of Lincoln Center, New York\nThe Chamber Music Society of Lincoln Center offers over 1,000 archived performances, all free, online. You can also listen to interviews with artists and learn more about the pieces through lectures.\n_______________________________________________________________________________\nBerkeley Rep, Berkeley, CA\nBerkeley Rep is offering a deal it's calling \"Buy one, get 300+ free!\" View a recorded performance of its production of \"School Girls; Or, The African Mean Girls Play\" and get access to over 300 theatrical titles available to stream on BroadwayHD for a week.\n_______________________________________________________________________________\nThe Show Must Go Online\nZoom isn't just for meetings. Actor and Shakespeare aficionado Rob Myles is coordinating readings on Zoom of the Bard's plays, in the order they are thought to have been written, and broadcasting them on YouTube.\n_______________________________________________________________________________\nShakespeare in the Parks, Bozeman, MT\nMontana's Shakespeare in the Parks is also sharing some of its past performances on Facebook, starting with \"The Merry Wives of Windsor.\" Grab a blanket and watch it in your backyard or on your living room floor if you can.\n_______________________________________________________________________________\n24 Hour Plays, Online\n24 Hour Plays, a series of limited-run theatrical productions for charity, took the show online this week, uploading monologues by Rachel Dratch, Patrick Wilson and more. You can view all the performances on its Instagram page.\n_______________________________________________________________________________\nThe Kennedy Center, Washington\nThe Kennedy Center's Digital Stage offers performances from around the country as well on its own stages. Stream performances by the National Symphony Orchestra or American Ballet Theater, or take in a night of comedy with past recordings of the Mark Twain Prize.\nMementos from the gift shop:\n'How to Listen to and Understand Great Music' audiobook (free with Audible subscription; amazon.com)\n\"How to Listen to and Understand Great Music\" audiobook\n_______________________________________________________________________________\n'The Shakespeare Book: Big Ideas Simply Explained' (free with Audible subscription; amazon.com)\n\"The Shakespeare Book: Big Ideas Simply Explained\"\nZoos and the great outdoors (and beyond)\nGreenhouse in Kew botanical gardens in London\nRoyal Botanic Gardens Kew, London\nGo behind the scenes at the Royal Botanic Gardens Kew in London, a UNESCO World Heritage Site. Articles, galleries and videos give you a glimpse into this unique place, which includes everything from giant water lilies to badgers.\n_______________________________________________________________________________\nYellowstone National Park, Wyoming, Montana and Idaho\nThere are webcams across US national parks, many of which are currently closed to the public. You can watch a live stream of a now-deserted Old Faithful, still covered in snow, in Yellowstone.\n_______________________________________________________________________________\nWashington Cherry Blossoms\nYou don't have to miss the beauty of spring just because you're spending most of your time indoors. You can see pictures of Washington's cherry blossoms over the years on the Library of Congress website, just one example of the organization's free-to-use image sets.\n_______________________________________________________________________________\nNASA, Worldwide and Beyond\nIf all these options seem a little close to home, consider a quick trip to the stars via NASA's own smartphone app. You can learn more about NASA's missions, past and present, and view the Earth from the High Definition Earth Viewing experiment on the International Space Station.\n_______________________________________________________________________________\nNational Museum of Natural History, Washington\nThe Smithsonian's 3D digitization project brings thousands of items to life, including lots of bones. Get up close and personal with dinosaurs, a woolly mammoth and more.\n_______________________________________________________________________________\nYosemite National Park, California\nVirtual Yosemite brings you the sights and even sounds of Yosemite National Park. Visit a crowded overlook, or get away from it all in a secluded area with nothing but bird sounds and wind to accompany breathtaking views.\n_______________________________________________________________________________\nSan Diego Zoo\nVisit one of the zoo's nine live cams to see what the animals are up to without any visitors around. Each page features a live stream as well as information and articles about the animals featured.\n_______________________________________________________________________________\nShedd Aquarium, Chicago\nThe Shedd Aquarium has two unexpected stars during its closure: rockhopper penguins exploring the empty exhibits. Their first adventure was so successful that the penguins have more trips planned around the aquarium. Shedd is also sharing video updates on its Facebook page.\n_______________________________________________________________________________\nCincinnati Zoo and Botanical Garden\nWhile the Cincinnati Zoo's home safaris are aimed at kids, learning about animals will delight people of all ages. Currently, the zoo is sharing daily videos from caretakers at 3 p.m. ET through April 11.\n_______________________________________________________________________________\nAmerican Eagle Foundation, Pigeon Forge, TN\nThe American Eagle Foundation, based in Tennessee, maintains live cams of bald eagle nests in the wild of Northeast Florida. Watch the live YouTube stream to see if you can catch the parents bringing home food for the baby eagles.\nMementos from the gift shops:\nNational Parks Scratch-off Map ($31.20, originally $39; etsy.com)\nNational Parks Scratch-off Map\n_______________________________________________________________________________\nMega Fossil Dig Kit ($19.99; amazon.com)\nMega Fossil Dig Kit\nLibraries and literature\nReaders at the British Library in London\nLiterary Locations in Real Life, Worldwide\nGoogle Earth lets you explore locations that inspired some of the world's greatest writers, from a bog that made its way into the writings of J.R.R. Tolkien, to the childhood home of Gabriel García Márquez, and the basis for the fictional village in \"One Hundred Years of Solitude.\"\n_______________________________________________________________________________\nThe British Library, London\nExplore the history of writing in articles and objects from 5,000 B.C. to the present, and view some of the British Library's most important forms of writing, like a 2,000-year-old wax tablet used for teaching in ancient Greece.\n_______________________________________________________________________________\nNew Yorker Fiction, Online/ New York\nCatch up on a decade of The New Yorker's fiction podcasts, including readings of some of its most iconic short stories. Contemporary writers read and discuss some of their favorite pieces from the magazine. Need somewhere to jump in? Try one of the best-known short stories of all time, Shirley Jackson's \"The Lottery.\"\n_______________________________________________________________________________\nThe Morgan Library, New York\nThe Morgan Library packs a lot of books (and some really impressive art) into a relatively small space close to New York's Grand Central Station. Go inside with Google Arts & Culture to view its stately rooms and collections.\n_______________________________________________________________________________\nPoets.org, Online\nSign up to get a poem a day delivered to your inbox from Poets.org. The series features previously unpublished work by contemporary poets. You can also use the site to browse classic works by famous poets throughout history.\n_______________________________________________________________________________\nProject Gutenberg, Online\nAccess over 60,000 documents in the public domain, from the works of Jane Austen to Daniel Defoe's \"A Journal of the Plague Year.\" If you need a place to start, check out the 100 current most popular titles. Documents can be downloaded to e-readers and apps for easier reading.\n_______________________________________________________________________________\n92Y, New York\nManhattan's 92nd Street Y has all its past talks and readings available to stream on YouTube, from classical music performances to a 1955 recording of W.H. Auden. In other words, over half a century of cultural programming, right at your fingertips.\nMementos from the gift shops:\n'642 Things to Write About' (starting at $8.83; abebooks.com)\n\"642 Things to Write About\"\n_______________________________________________________________________________\n'The Library: A World History' ($75; barnesandnoble.com)\n\"The Library: A World History\"\nArt museums\nAmsterdam's Rijksmuseum\nThe Metropolitan Museum of Art, New York\nEasily one of the most famous art museums in the world, New York's Metropolitan Museum has a wealth of online resources for all ages. Not sure where to start? The Heilbrunn Timeline of Art History has a little bit of everything: Scroll through more than 8,000 works of art from 8,000 B.C. to the present, and go deeper with more than 1,000 essays.\n_______________________________________________________________________________\nRijksmuseum, Amsterdam, Netherlands\nOne of the Dutch national museums, the Rijksmuseum is perhaps best known as the home of some of famous works by masters like Rembrandt and Vermeer. Visit museum highlights in the digital Rijks Studio, and even create your own collections around a theme: artist, landscapes, windmills, etc.\n_______________________________________________________________________________\nVan Gogh Museum, Amsterdam, Netherlands\nVan Gogh's vivid, textured paint strokes add another dimension to his paintings that can be lost just looking online. The Van Gogh Museum's Unravel Van Gogh lets you get up close and zoom in on some of his works. The website also uses X-ray images and paint analyses to give you glimpses at aspects of his paintings often hidden from the naked eye.\n_______________________________________________________________________________\nThe Louvre, Paris\nThe world's largest art museum offers a few themed virtual tours and visitor trails. If that overwhelms you, start small: The museum also posts \"Artwork of the Day\" with notes from curators translated into English. You can navigate to the daily selection from the Louvre's homepage.\n_______________________________________________________________________________\nSocial Distance Gallery, Online\nFamous artists aren't the only ones whose works are hidden from the public view right now. Students whose MFA or BFA thesis shows were cut short because of the pandemic can now share their work through the Instagram account Social Distance Gallery.\n_______________________________________________________________________________\nIsabella Stewart Gardner Museum, Boston\nThe Isabella Stewart Gardner Museum, located in Gardner's own home outside of Boston, is worth a visit just to see the building itself. Thankfully, the museum lets you tour both the collection and the stunning courtyard gardens and even stream live musical performances hosted by the museum.\n_______________________________________________________________________________\nHarlem Studio Museum, New York\nOne of the 500 museums available to tour via Google Arts & Culture, the Harlem Studio Museum was already closed to the public for an extensive building project before the COVID-19 outbreak. You can also view plans for its new space, projected to open in the next few years.\n_______________________________________________________________________________\nKyoto Costume Institute, Kyoto, Japan\nIf you're worried a delayed Met Ball means a delayed 2020 costume exhibit, spend some time exploring the Kyoto Costume Institute through Google Arts & Culture. Dedicated to the preservation of Western clothing, it has pieces ranging from 18th-century silk gowns to minidresses of the '60s.\n_______________________________________________________________________________\nWhitney Museum, New York\nAll the Whitney's 25,000 works of art from American artists in the 20th and 21st centuries can be searched and viewed online. You can even click through its audio guides for free. The American Legends tour is a great overview of some of its major works.\n_______________________________________________________________________________\nStreet Art, Worldwide\nYou can experience art and the outdoors from your couch. Google Art Project lets you explore street art and graffiti from every continent: You can even take a virtual walking tour (with commentary) with Street View.\n_______________________________________________________________________________\nThe Vatican\nGet your own 360-degree private tour of the Sistine Chapel, as well as some of the Vatican's other famous rooms and galleries. Zoom out to get the experience of a regular visitor, and zoom in to get an up-close view of some of the most important works of Western art.\n_______________________________________________________________________________\nThe State Hermitage, St. Petersburg, Russia\nThe second-largest museum in the world is the State Hermitage museum in St. Petersburg, Russia. If you really want to get a sense of its scale, you can watch this five-hour, one-shot YouTube video through 45 of its galleries.\n_______________________________________________________________________________\nHirshhorn Museum, Washington\nYayoi Kusama's 2017 Infinity Mirrors exhibit at the Smithsonian's Hirshhorn Museum and Sculpture Garden caused quite a stir — and quite a few Instagram pictures. If you missed the popular exhibit, you can watch NPR's short look inside for a brief moment of calm.\n_______________________________________________________________________________\nPalace of Versailles\nStroll through the former court of Louis XIV and Marie Antoinette from your own couch with Google Arts & Culture, including the iconic Hall of Mirrors and the spectacular gardens. Online exhibits about science at Versailles give a glimpse into a little-known aspect of court life.\n_______________________________________________________________________________\nThe Museum of American Art, New York\nThe first museum dedicated to modern art, MoMA features works from the likes of Van Gogh (\"Starry Night\"!) to contemporary artists like Barbara Kruger. Its collection through Google Arts & Culture is relatively small (129 items), but they give a great overview of how modern art has continued to shift and change in the past 200 years.\nMementos from the gift shops:\n'The Metropolitan Museum of Art: Masterpiece Paintings' ($85; barnesandnoble.com)\n\"The Metropolitan Museum of Art: Masterpiece Paintings\"\n______________________________________________________________________________\n'A Sunday Afternoon' by Georges-Pierre Seurat 1000-Piece Jigsaw Puzzle ($49.99; amazon.com)\n\"A Sunday Afternoon\" by Georges-Pierre Seurat 1000-Piece Jigsaw Puzzle\nNote: The prices above reflect the retailers' listed prices at the time of publication.", "url": "https://www.cnn.com/2020/03/26/cnn-underscored/virtual-museums/index.html"}