{"authors": ["Chris Liakos", "Victoria Cavaliere"], "date_download": "2020-05-04 16:19:18", "date_modify": "2020-05-04 16:19:18", "date_publish": "2020-04-04 20:42:50", "description": "OPEC and Russia have postponed a meeting set for Monday to discuss supply cuts and ending a brutal price war.", "filename": "2020_04_04_intl_business_opec-russia-meeting-delay-oil_index_1588609158.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403102810-russia-oil-tanks-0323-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_intl_business_opec-russia-meeting-delay-oil_index_1588609158.html", "title": "OPEC-Russia meeting delayed until April 9", "title_page": "OPEC-Russia meeting delayed until April 9  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London/New York (CNN Business) OPEC and Russia have postponed a meeting set for Monday to discuss supply cuts and ending a brutal price war .\nThe meeting is now scheduled for April 9, an OPEC source told CNN on Saturday.\nThe meeting, which was called by Saudi Arabia , comes after President Donald Trump suggested that massive production cuts could be on the way and Saudi Arabia called for an \"urgent\" effort to restore \"balance\" to the oil market.\nSaudi Arabia and Russia have been locked in an epic price war since early March when the OPEC+ oil alliance cracked, flooding the oil market with cheap crude just as demand craters because of the coronavirus pandemic . Crude has crashed to 18-year lows, crushing American oil companies and energy stocks.\nThe meeting will be held via video conference and will include oil producers from outside the OPEC+ alliance that includes Russia and a few other countries, two senior sources at the OPEC secretariat told CNN Business. The final list of invitees has not yet been set, they said.\nThe United States, United Kingdom, Canada and Mexico could be invited, according to reports\nTrump, who met on Friday at the White House with US oil executives, said he's optimistic that Saudi Arabia and Russia will reach a deal to end their price war that erupted early last month.\n\"I think President Putin and the crown prince want something to happen badly,\" Trump said, according to a White House readout of the meeting, referring to Saudi Crown Prince Mohammed bin Salman. He added that he's spoken to both the Russian leader and Prince bin Salman.\nBoth Saudi Arabia and Russia would like to get the United States, the world's leading oil producer, to join in emergency cuts aimed at halting the crash in oil prices.\nAmerican Petroleum Institute CEO Mike Sommers, who was in the meeting, told CNN Business that possibility was not discussed.\nThe official Saudi Press Agency on Saturday said Saudi Energy Minister Prince Abdulaziz bin Salman Al Saud \"is still welcoming to anyone who wants to find solutions to the challenges of the oil market.\"\nUS oil prices soared 25% — their biggest one-day gain on record — on Thursday after Trump tweeted that he hopes and expects Saudi Arabia and Russia will slash output by between 10 million and 15 million barrels per day.\nPrices continued to advance Friday, recovering some of the massive plunge seen over the past month.", "url": "https://www.cnn.com/2020/04/04/intl_business/opec-russia-meeting-delay-oil/index.html"}