{"authors": ["Eric Levenson"], "date_download": "2020-05-04 15:57:55", "date_modify": "2020-05-04 15:57:55", "date_publish": "2020-04-07 17:24:34", "description": "Black Americans have more existing medical issues, less access to health care, and are more likely to work in unstable jobs -- all factors that have made the coronavirus pandemic disproportionately hurt blacks more.", "filename": "2020_04_07_us_coronavirus-black-americans-race_index_1588607875.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323182037-us-surgeon-general-jerome-adams-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_coronavirus-black-americans-race_index_1588607875.html", "title": "Why black Americans are at higher risk for coronavirus", "title_page": "Why black Americans are at higher risk for coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Black Americans have more existing medical issues, less access to health care, and are more likely to work in unstable jobs -- all factors that have made the coronavirus pandemic disproportionately hurt blacks more.\nWhile everyone is susceptible to Covid-19, black Americans are at higher risk, Surgeon General Dr. Jerome Adams said during an appearance on CBS This Morning on Tuesday.\nThat racial disparity has been evident in early data on coronavirus deaths in Louisiana, Illinois, Michigan and New Jersey . The federal government has not tracked coronavirus by demographic groups, but Adams and American Medical Association President Dr. Patrice Harris suggested they begin to do so.\n\"We have early evidence that we need to pay particular attention to race and ethnicity,\" Harris said Tuesday.\nLouisiana Gov. John Bel Edwards said Monday that, of the 512 coronavirus deaths so far, more than 70 percent were African American patients, who make up just 32 percent of the state's population.\nChicago, too, has seen similar numbers: Among those for whom race-ethnicity is known, 72% of the city's deaths have been among blacks, who make up just 30% of the city's population.\n\"This new data offers a deeply concerning glimpse into the spread of Covid-19 and is a stark reminder of the deep-seated issues which have long created disparate health impacts in communities across Chicago,\" said Chicago Mayor Lori Lightfoot.\nA combination of structural factors means that black people are getting infected more and dying more of coronavirus, said Dr. Camara Phyllis Jones, a family physician and epidemiologist.\n\"What's happening is black folks are getting infected more because they are exposed more, and once infected they're dying more because they have their bodies -- our bodies -- have born the burden of chronic disinvestment (and) active neglect of the community,\" she said. \"When I look at it is because of structural racism, which puts us in the forward facing jobs so that we are exposed and less valued and don't have the protection that we need.\"\nPresident Donald Trump recognized the issue during the White House's coronavirus news briefing on Tuesday.\n\"We're actively engaging on the problem of increased impacts -- this is a real problem and it's showing up very strongly in our data -- on the African-American community,\" Trump said. \"And we're doing everything in our power to address this challenge. It's a tremendous challenge. It's terrible.\"\nExisting chronic diseases\nPeople with underlying conditions are more affected by Covid-19, and in the United States, black people are more likely to have underlying health issues like diabetes, heart disease and lung disease , Adams said.\n\"I've shared myself personally that I have high blood pressure. That I have heart disease and spent a week in the (intensive care unit) due to a heart condition. That I actually have asthma and I'm pre-diabetic, and so I represent that legacy of growing up poor and black in America,\" Adams said. \"I and many black Americans are at higher risk for Covid. It's why we need everyone to do their part to slow the spread.\"\nAdams added \"it breaks my heart\" to hear about higher Covid-19 death rates among the black community -- and he emphasized that the recommendations to stay at home and follow mitigation measures to slow the spread of the coronavirus are for everyone.\nSome of these health issues are related to the environment, such as the water quality in Flint, Michigan state Rep. Tyrone Carter said.\n\"This pandemic just magnifies what we already knew: Access to health care, environmental issues in certain communities, air quality, water quality. We think about Flint and think about my district who has air issues, asthma,\" he said.\nAccess to health care\nJUST WATCHED Inside the ER: The incredible fight against coronavirus Replay More Videos ... MUST WATCH Inside the ER: The incredible fight against coronavirus 05:30\nCompared to white people, blacks have lower levels of health insurance coverage and are less likely to have insurance coverage through an employer.\n\"The access barriers facing uninsured people mean they are less likely to receive preventive care, are more likely to be hospitalized for conditions that could have been prevented, and are more likely to die in the hospital than those with insurance,\" the report said.\nThat lack of access exacerbates the impact of the outbreak, said Carter, who himself tested positive for coronavirus.\n\"When we talk about health care, it's easy to say that it's accessible, but to people that don't have a job, a service job that has health care, sometimes they use urgent care or the emergency room as their primary care physician,\" he said. \"So what this has done is magnified those issues to show that there is still a huge gap between races when it comes to health care.\"\nLoss of jobs\nWilliam Rodgers, chief economist at the Heldrich Center for Workforce Development at Rutgers University, estimated that the true rate of unemployment is likely 20.7% percent for African Americans rather than the official rate of 4.1%, and 18.7% for Hispanic workers, as opposed to the official rate of 6%.\nHe said that the higher unemployment rates for minorities and young workers is primarily because the sectors in which they typically work will be more affected by current lockdown policies in much of the country.\n\"Those groups' jobs were at greater risk going into this downturn,\" he said.\nBlack and Hispanic workers are also \"much less likely\" to be able to work from home , said Heidi Shierholz, senior economist and director of policy at the Economic Policy Institute in Washington, and fellow economist Elise Gould.\n\"It just comes down to the fact that in the United States there's still a lot of occupational segregation by race and ethnicity,\" said Shierholz, who was the Department of Labor's chief economist from 2014 to 2017.\nFor example, she said, there's a large concentration of Hispanic workers in construction and a large concentration of black workers in service sector jobs. The economists' analysis notes that most low-wage workers can't telework.\nCrowded conditions\nCoronavirus spreads faster in locations with higher density, such as cities. Black Americans are more likely to live in urban counties than suburban or rural ones, according to a Pew analysis. And within those areas, black Americans are more likely to have lower incomes, which may press them into crowded living situations, CNN's Van Jones writes\nData in Chicago , for example, shows that black non-Latino people were more likely to be infected with coronavirus and to die of it. Black non-Latino people made up 52% of all coronavirus cases in the city, and adjusted for population, this group was more than twice as likely to be infected as white non-Latino people.\nAllison Arwady, Commissioner of the Chicago Department of Public Health, said that these racial health disparities were evident in Chicago before the covid-19 outbreak.\n\"As a City, under the Mayor's leadership, we've been facing these huge, historic problems head-on. But our COVID-19 data is a clear reflection of these underlying inequities,\" she said in a statement. \"This is true in Chicago, and true around the U.S.\"", "url": "https://www.cnn.com/2020/04/07/us/coronavirus-black-americans-race/index.html"}