{"authors": ["Hollie Silverman"], "date_download": "2020-05-04 17:00:48", "date_modify": "2020-05-04 17:00:48", "date_publish": "2020-04-09 23:54:10", "description": "New Mexico is using cell phone data from a third party to create social distancing models as a way to gauge whether residents are adhering to social distancing models, Gov. Michelle Lujan Grisham said Thursday.", "filename": "2020_04_09_us_new-mexico-cell-phone-data-track-residents_index_1588611648.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409194649-01-new-mexico-coronavirus-cell-phones-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_new-mexico-cell-phone-data-track-residents_index_1588611648.html", "title": "New Mexico using cell phone data to create social distancing models and considering more restrictive travel measures", "title_page": "New Mexico using cell phone data to create social distancing models and considering more restrictive travel measures - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) New Mexico is using cell phone data from a third party to create social distancing models as a way to gauge whether residents are adhering to social distancing models, Gov. Michelle Lujan Grisham said Thursday.\nThe data is being provided by Descartes Labs in Santa Fe, which has access to the cell phone data, the governor's office said in a statement to CNN.\nThe state also wants to screen truckers who are bringing in supplies and take their temperatures but doesn't have enough temperature readers to do so, Lujan Grisham said.\n\"We're really nervous that this virus will follow travelers into the state,\" she explained.\nThe state is using road signage to let travelers from out of state know that many state parks are closed and small communities should not be visited, Lujan Grisham said.\nRead More", "url": "https://www.cnn.com/2020/04/09/us/new-mexico-cell-phone-data-track-residents/index.html"}