{"authors": ["Opinion Michael Bociurkiw"], "date_download": "2020-05-04 16:13:08", "date_modify": "2020-05-04 16:13:08", "date_publish": "2020-04-03 10:42:18", "description": "Michael Bociurkiw writes that, in the span of just a few days, autocrats around the world -- like Hungary's Viktor Orban -- used the cover of the Covid-19 outbreak to take on extraordinary new powers that undermine modern democracy.", "filename": "2020_04_03_opinions_hungary_a1f940117eb6f1cc7f8ce916d7778075_index_1588608788.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170424084120-viktor-orban-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_hungary_a1f940117eb6f1cc7f8ce916d7778075_index_1588608788.html", "title": "Hungarian leader's outrageous power grab", "title_page": "Hungary leader Viktor Orban's outrageous power grab (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Michael Bociurkiw is a global affairs analyst and a former spokesman for the Organization for Security and Cooperation in Europe. Follow him on Twitter @WorldAffairsPro . The opinions expressed in this commentary are his; view more opinions on CNN.\n(CNN) In the span of just a few days, autocrats around the world, using the cover of the Covid-19 outbreak, have reached for shockingly devious powers to take on extraordinary new powers. We are not talking about logical containment steps, such as the ordering of social distancing, lockdowns or contact tracing.\nAs former Obama White House chief of staff Rahm Emanuel said after the 2008 financial crisis: \"You never want a serious crisis to go to waste. ... It's an opportunity to do things you think you could not do before.\"\nBut there is a big difference between short-term, consensual restrictions of freedom and top-down authoritarian measures that have no expiration date -- let alone a public health justification.\nHungary's strongman gets even stronger\nNowhere is the grab for unchecked power more egregious than in Hungary. Prime Minister Viktor Orban, who once likened immigration to a \"flu epidemic,\" was already on the European Union's troublemaker list after stacking the courts with loyalists and introducing legislation that criminalizes helping undocumented migrants with asylum claims.\nMonday, the situation in Hungary deteriorated further , with loyal parliamentarians mustering a required two-thirds majority to allow Orban to rule by decree indefinitely and without any parliamentary oversight.\nThough Orban has rejected accusations of wrongdoing, calling them \"defamatory,\" it is clear to most that Hungary's gobsmacking measures warrant a strong response. The European Union needs to drop its standard finger-waving for raw pitchfork diplomacy. Its toolbox is not entirely empty: it includes taking action to suspend the country from voting on EU decisions and slapping Orban with weighty sanctions. Former Italian Prime Minister Matteo Renzi, in a tweet , even suggested invoking the nuclear option and expelling Hungary from the EU.\nArmenia, Slovenia, But Hungary is by no means the only country in Europe to be accused of overreach. Hardly a day goes by where the Organization for Security and Cooperation in Europe (OSCE), my former employer, doesn't issue a statement of concern from actions it sees as unacceptable within its 57 member states. In recent days, the Austria-based organization has called out questionable Covid-19-related legislation and punitive actions in Romania Kosovo and Turkey\nMeanwhile in Russia\nOutside the European Union, policies enacted during the Covid-19 outbreak in Russia have caught the OSCE's attention , especially legislation last Tuesday that brings prison sentences of up to five years for spreading false information about the virus. While combating false information is a high priority for governments everywhere, the OSCE and other organizations say it's written without guarantees for the right of the media to report on the pandemic unconstrained and could be used as a tool to suppress free speech.\nSo, it should come as little surprise that the two strongmen borrow from the same playbook, especially when it comes to limiting the work of journalists and non-governmental organizations.\nIn times of crisis, the Kremlin tends to shift into overdrive to sow confusion and create division -- even more so when the major powers are distracted, as they are now. Even after Covid-19 was declared a global public health emergency by the World Health Organization on January 30, a CNN investigation revealed that Russia was still heavily engaged in US election meddling using brilliantly disguised offshore troll farms.\nAnd, in a worrying sign not seen since they landed on the ground in spring 2014, in eastern Ukraine OSCE monitors have been blocked by Russian-backed rebels for several days from crossing the front line on the pretext of Covid-19 \"quarantines.\"\nWithin Russia itself, Putin, amid a rapidly-worsening Covid-19 outbreak, had planned to hold a referendum April 22 to approve revisions to the entire Russian constitution, which among other things guarantees his hold on power until 2036. The exercise has been delayed, but should the pandemic drag on, it would certainly be in the style of the Russian ruler to send his citizens to the polls during a time where low voter turnout is almost guaranteed.\nLockdown protests\nBecause many areas of the world are under lockdown or some sort of movement restriction, organizing physical protests has become nearly impossible. But disgruntled citizens the world over have found creative ways -- other than merely venting their anger on social media -- to register their disgust.\nIn Brazil, for example, people have been pounding kitchenware for the past week in protest of far-right president, Jair Bolsonaro, who faces reelection in 2022. The protests are in response to their leader's casual handling of the crisis -- as well as his general style of governance. As of Thursday, the coronavirus case load in Brazil was over 8,000, according to Johns Hopkins, giving it the third-highest case load in the Americas after the United States and Canada.\nBut people who have had their rights trampled upon should not have to do so in isolation, even with governments and multilateral bodies under pressure to deal with the coronavirus spread and the collateral damage of economic dislocation.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nIf the international community stays silent while people's rights are being eroded, it sends a worrisome signal to strongmen from Brazil to Hungary that major rollbacks of civil liberties are acceptable. Worse, it gives them little motivation to repeal the measures once the public health emergency ends.\nStrongmen may be deaf toward their constituents' pot-banging. But when threats of targeted and well-coordinated economic sanctions, especially aimed at those reliant on devalued petrol dollars and expulsion from coveted clubs, are dangled in front of them, it can help protect the hard-won liberties of citizens whose voices have been temporarily silenced by lockdowns, quarantines, illness and death.\nThe worst collateral damage from the Covid-19 pandemic is that states and leaders emerge from this with the feeling they have unchecked powers for the foreseeable future.", "url": "https://www.cnn.com/2020/04/03/opinions/hungary-autocrat-covid-19-power-grab-bociurkiw/index.html"}