{"authors": ["Brian Witte"], "date_download": "2020-05-04 20:21:45", "date_modify": "2020-05-04 20:21:45", "date_publish": "2020-04-09 16:09:33", "description": "ANNAPOLIS, Md. (AP) — More than 108,000 unemployment filings were made last week in Maryland, the state reported Thursday, as jobless claims continue to rise sharply due to shuttered businesses...", "filename": "_ad5f3adfe989180e6dba216c49fe3191_1588623705.html", "image_url": "https://storage.googleapis.com/afs-prod/media/280bcdde1c8e4454a1cca3ada8bcffa4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ad5f3adfe989180e6dba216c49fe3191_1588623705.html", "title": "Maryland jobless claims more than 108,000 last week", "title_page": "Maryland jobless claims more than 108,000 last week", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "St. Anne's Episcopal Church is seen in the distance from Main Street in Annapolis, Md., Tuesday, March 31, 2020. Maryland Gov. Larry Hogan issued a \"stay-at-home\" directive Monday in response to the coronavirus pandemic. (AP Photo/Susan Walsh)\nSt. Anne's Episcopal Church is seen in the distance from Main Street in Annapolis, Md., Tuesday, March 31, 2020. Maryland Gov. Larry Hogan issued a \"stay-at-home\" directive Monday in response to the coronavirus pandemic. (AP Photo/Susan Walsh)\nANNAPOLIS, Md. (AP) — More than 108,000 unemployment filings were made last week in Maryland, the state reported Thursday, as jobless claims continue to rise sharply due to shuttered businesses because of the coronavirus.\nMaryland also reported available data on cases and deaths by race for the first time. The data shows black residents have had more cases of the virus and deaths in Maryland, even though African-Americans make up only 29% of the population.\nThe state reported 108,508 unemployment insurance claims for the week ending April 4. More than 235,000 people filed for unemployment in a three-week period. The state already has received more jobless claims this year than in all of last year.\nWhile many people have missed the window to file for weekly benefits due to technical difficulties the state has experienced, a spokesman for Gov. Larry Hogan says that will not affect the ultimate payment of the full eligible benefit amount. Michael Ricci says the state has upgraded its systems to enable people to file all weekly claim certifications for weeks missed.\nNationwide, a staggering 16.8 million Americans have been thrown onto the unemployment rolls in just three weeks, as the coronavirus outbreak has brought world economies to a near standstill.\nMeanwhile, Maryland’s health department is reporting the number of confirmed cases of the coronavirus in the state has climbed to at least 6,185, an increase of 656 cases since Wednesday. There have been a total of 138 deaths from the virus reported in Maryland. There have been 35,344 negative tests.\nFor the first time, the state also released available data on cases and deaths by race, showing that black residents have more cases and deaths from the virus. Some 2,064 African Americans have had the disease, compared to 1,540 cases among white residents. There have been 55 deaths among African Americans, compared to 39 deaths among white residents. There have been 122 cases among Asians and six deaths. Data is not available on 1,354 cases involving 21 deaths.\n“Today, we are able to publish 75% of the currently available data, which shows troubling disparities and points to a persistent public health challenge that we must address,” Hogan said on Twitter.\nPrince George’s County, which has a black population of about 63%, has the most cases of the virus in the state with 1,476. Prince George’s also leads the state in deaths from the virus with 35.\nThe Maryland Department of Public Safety and Correctional Services reported Thursday that there has been a total of 57 confirmed cases in its system. That includes 10 inmates, 22 correctional officers, three employees with the Division of Parole and Probation, 19 contractural staff, one clinical health employee and two employees in the Office of the Secretary.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/ad5f3adfe989180e6dba216c49fe3191"}