{"authors": ["Reporter"], "date_download": "2020-05-04 20:14:51", "date_modify": "2020-05-04 20:14:51", "date_publish": "2020-04-29 09:05:33", "description": "The president's \"desperate gamble to save himself by sacrificing others\" is all about the 2020 election, David Frum argued.", "filename": "entry_ex-bush-aide-donald-trump-coronavirus-strategy_n_5ea9393ec5b6123a176494a1_1588623291.html", "image_url": "https://img.huffingtonpost.com/asset/5ea94193220000c80c827d83.jpeg?cache=33pqdujfdk&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_ex-bush-aide-donald-trump-coronavirus-strategy_n_5ea9393ec5b6123a176494a1_1588623291.html", "title": "Ex-Bush Aide Has Chilling Theory About Donald Trump's Coronavirus Strategy", "title_page": "Ex-Bush Aide Has Chilling Theory About Donald Trump's Coronavirus Strategy | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "An ex-speechwriter for former President George W. Bush on Tuesday argued that President Donald Trump is sacrificing the lives of many Americans to the coronavirus crisis in a “desperate” bid to save himself politically.\nIn a thread on Twitter, David Frum said reports that the White House is now pivoting its pandemic messaging to focus on the economy showed Trump is “consciously choosing to risk higher virus casualties” in the second quarter of 2020 “in hope of jolting the economy into revival in Q3 to save his re-election” in November.\n“It’s a desperate gamble to save himself by sacrificing others,” wrote Frum, who is now a senior editor at The Atlantic. “It’s also not very likely to work.”\nBut key point: Trump is consciously choosing to risk higher virus casualties in Q2 in hope of jolting the economy into revival in Q3 to save his re-election in Q4. It's a desperate gamble to save himself by sacrificing others. It's also not very likely to work. 4/x — David Frum (@davidfrum) April 28, 2020\nFrum noted in a later tweet how “many leaders would be daunted by the human costs of Trump’s desperate re-election plan.” But not Trump, he said.\nMany leaders would be daunted by the human costs of Trump's desperate re-election plan. But ... https://t.co/FV8QxXJZA0 — David Frum (@davidfrum) April 28, 2020\nThe U.S. now has more confirmed cases of the coronavirus than any other country in the world, with upward of 1 million people testing positive for COVID-19.\nAs of Wednesday morning, the virus had killed almost 60,000 people nationwide. Globally, it has sickened more than 3 million people — and killed at least 218,000.\nThe Trump administration has faced widespread criticism for the slow and haphazard way in which it has handled the public health crisis. Trump himself downplayed the risk posed by the virus for weeks, in tandem with prime-time personalities on Fox News, and has since taken to using the televised White House coronavirus task force updates to tout unproven cures.\nJust last week, Trump suggested injecting disinfectant as a possible solution and then walked back his comments after sparking anger, claiming he was just being sarcastic.\nFrum suggested on Friday that ﻿Trump will suffer a “historic political defeat” in the 2020 election as a direct consequence of his botched response to the pandemic, and that he will “likely take the Republican Senate down with him.”", "url": "https://www.huffpost.com/entry/ex-bush-aide-donald-trump-coronavirus-strategy_n_5ea9393ec5b6123a176494a1"}