{"authors": [], "date_download": "2020-05-04 20:27:16", "date_modify": "2020-05-04 20:27:16", "date_publish": "2020-04-04 03:01:06", "description": "PORTLAND, Ore. (AP) — The historic Timberline Lodge has slashed hundreds of jobs because of the coronavirus pandemic. Timberline Lodge told the state in a mandatory Worker Adjustment and...", "filename": "_056d1ac6ce4f003ebd6d930896e30853_1588624036.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_056d1ac6ce4f003ebd6d930896e30853_1588624036.html", "title": "Timberline Lodge lays off hundreds amid virus outbreak", "title_page": "Timberline Lodge lays off hundreds amid virus outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — The historic Timberline Lodge has slashed hundreds of jobs because of the coronavirus pandemic.\nTimberline Lodge told the state in a mandatory Worker Adjustment and Retraining Notification that it laid off 471 employees at its lodge and at the adjacent ski area on Mount Hood The Oregonian/OregonLive reported . According to the notice, the layoffs happened over eight days and ended Tuesday. Employees were told the job cuts would be permanent.\nEmployers throughout Oregon have announced mass layoffs amid the coronavirus crisis.\nIn response to the coronavirus pandemic, Oregon Gov. Kate Brown issued an order March 16 barring public gatherings with over 25 people. On March 23, she issued a stay at home order, which forced certain businesses to shutter, including ski resorts. Because of the mandates and the sudden downturn in business, Timberline Lodge officials said they had to make the decision lay off employees at the ski resort and lodge.\nLandmark hotel and brewpub chain McMenamins, which operates 62 hotels, movie theaters, restaurants and bars throughout Oregon and Washington, laid off 3,000 people and closed nearly all its locations in early March. This week, the Nines Hotel, a luxury hotel in downtown Portland, notified the city that it would lay off at least 332 employees and temporarily close.", "url": "https://apnews.com/056d1ac6ce4f003ebd6d930896e30853"}