{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 20:22:40", "date_modify": "2020-05-04 20:22:40", "date_publish": "2020-04-28 19:21:13", "description": "After the too-cute interruption, the four-time Grammy winner shared that his family still has \"good days and bad days.\"", "filename": "entry_michael-buble-instagram-son-noah-cancer_n_5ea83b70c5b6b347a3889237_1588623760.html", "image_url": "https://img.huffingtonpost.com/asset/5ea863313000004a101550f3.png?cache=9fpylgmnci&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_michael-buble-instagram-son-noah-cancer_n_5ea83b70c5b6b347a3889237_1588623760.html", "title": "Michael Bublé's 6-Year-Old Son Joins Parents On Instagram After Battling Cancer", "title_page": "Michael Bublé's 6-Year-Old Son Joins Parents On Instagram After Battling Cancer | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Michael Bublé appeared just as surprised as his fans on Friday after an unexpected — and adorable — guest popped in on his latest Instagram Live.\nThe four-time Grammy winner and his wife, actor Luisana Lopilato, were sharing tips on social distancing during one of their regular Q&A sessions when their 6-year-old son Noah wandered into the frame.\n“You can come and say hi. You’re always welcome, dude,” Bublé said, before the boy climbed up onto Lopilato’s lap and urged his father to play a song on his toy guitar. Dad happily obliged, strumming a few cords of Shawn Mendes and Camila Cabello’s “Señorita.”\nElsewhere during the chat, Bublé ― who also shares son Elias, 4, and daughter Vida, 1, with Lopilato ― called Noah “our superhero.”\n“We have two other superheroes, but this boy ... is a big inspiration for us,” he added.\nThe declaration was most likely a nod to Noah’s 2016 diagnosis with liver cancer, when he was just 3 years old. Though his son is in remission, Bublé has said the experience continues to influence his outlook on music and the way he interacts with fans.\n“When I went through Noah’s cancer from the first moment, there was a snap,” Bublé told Australia’s Herald Sun in 2018. “I remember sitting in the hospital room thinking, ‘I was worried about any of that shit? I was worried about record sales or a meme or what some asshole said about me?’ In a second, it had gotten so clear.”\nThere was no talk of that on Friday, however. Instead, Bublé and Lopilato chatted with Noah about what to watch during their next family movie night (turns out Noah has some strong feelings about “Barbie” and “Jurassic Park”).\nBublé concluded his chat by urging his audience to “stay strong” during the coronavirus pandemic.\n“We have good days and bad days,” he said. “This family has gone through a lot, and we still go through a lot.”\nEarlier this year, Bublé postponed the U.S. leg of his latest tour as concerns over the spread of the coronavirus intensified. Fortunately for fans, he revealed on Instagram Saturday that he’d been spending his time in self-isolation working on a new album.\nWatch Michael Bublé’s full Instagram Live session below:", "url": "https://www.huffpost.com/entry/michael-buble-instagram-son-noah-cancer_n_5ea83b70c5b6b347a3889237"}