{"authors": ["Opinion Joe Torre"], "date_download": "2020-05-04 16:59:32", "date_modify": "2020-05-04 16:59:32", "date_publish": "2020-04-09 19:08:55", "description": "Joe Torre, thinking back to the presence of domestic violence in his home growing up, writes that he often found solace at school or playing outside, but with the Covid-19 pandemic, many students -- including those that his organization, Joe Torre Safe at Home Foundation, serves -- are forced to stay home in violent situations.", "filename": "2020_04_09_opinions_childre_8842911232b4c87da96f8f886304ef21_index_1588611572.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/120417133013-depressed-teens-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_childre_8842911232b4c87da96f8f886304ef21_index_1588611572.html", "title": "Joe Torre: My fear for many children during the Covid-19 pandemic", "title_page": "Joe Torre: My fear for many children during the Covid-19 pandemic (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Joe Torre, former manager of The New York Yankees, is chairman of the Joe Torre Safe at Home Foundation , which provides services to youth who have been traumatized by exposure to violence including domestic violence, child abuse, teen dating abuse, and sexual assault. The opinions expressed in this commentary are those of the author; view more opinion articles on CNN.\n(CNN) When I was a young boy, I witnessed unrelenting verbal abuse and saw the results of the physical harm inflicted on my mother, Margaret. The perpetrator was not some stranger, but my father, a New York City cop. The emotional and physical pain she suffered scarred her life, and mine, too.\nI was fortunate, though, during those dark days.\nThere were times that I would come home from school -- one place I found solace -- and see my dad's car in the driveway and head straight to a neighbor's house instead. Or I was able to escape by getting outside, and playing baseball, a game I loved and fortunately, for me, excelled at, thanks to skills that transported me from the ball fields of Brooklyn to the major leagues.\nWith the Covid-19 virus now consuming our lives and putting so many in harm's way, I think back to my early life, and to the young children like me who witnessed domestic violence in their homes. As more states are taking prudent and necessary measures to keep people inside, \"stay at home\" will not always translate to \"safe at home\" in many households across the country.\nA 2011 US Department of Justice study estimated that 18.8 million children were exposed to domestic violence in their lifetime.\nWith so many young Americans staying in or close to their homes during this crisis, we can expect that many children will witness violence in their homes .\nIn fact, research of past crises indicates that the number of incidents and the intensity of domestic violence and child abuse often increase during the most stressful of times.\nCNN recently reported that in New York City, one domestic violence resource website saw its daily visitors double from March 18 to April 5.\nDuring this unprecedented period of worry and concern, several critical issues come into play:\nSurvivors of domestic violence and child abuse can no longer rely on going to work or school as a reprieve from the dangers they face at home.\nSafety plans that usually work under normal circumstances are now being strained.\nExisting violence and abuse at home are being exacerbated by high levels of stress.\nChildren can't reach for help because they can't talk in front of an abusive parent.\nWithout school, there may not be anyone to \"notice\" signs of abuse and neglect and intervene appropriately.\nAn increase in runaway teenagers, who leave their violent homes, could lead to other dangers, including drug abuse, trafficking and homelessness.\nStudents contemplating suicide may not know where to reach out for help.\nTo make matters worse, the staggering unemployment rate could lead to an exponential growth in domestic violence incidents.\nUnemployment surely will lead to more stress, and the Safe at Home Foundation, which my wife, Ali, and I founded 18 years ago to help young people and their families who have been exposed to domestic violence, has already witnessed a myriad of real world issues adversely affecting families, which might lead family members to engage in abusive or worrisome behaviors.\nIn the past few weeks, many family members who our counselors have built a relationship with have spoken to us about being worried about getting sick or not being able to pay for health care. Others fear they won't have enough food to feed their families.\nJUST WATCHED Rise in French murders points to a domestic violence crisis Replay More Videos ... MUST WATCH Rise in French murders points to a domestic violence crisis 04:17\nWe hear less from the children, however, as outlets at schools and other social service locations are now closed. Schools, especially, are places children can talk to teachers, counselors and others, such as the \"Margaret's Place\" teams that our foundation has placed in schools in New York, Los Angeles, Cincinnati and suburban New Jersey.\nNamed for my mother, \"Margaret's Place\" safe rooms -- part of the Safe at Home foundation and created in partnership with schools -- are in-school locations in these cities, where children affected by domestic violence can go for help and talk to our counselors.\nOne time, out of curiosity, a young man who was thinking about joining a gang stopped by one of our locations. Over time, with help from our foundation, he started thinking about applying to colleges instead.\nWe are certainly not alone in our efforts to help children in abusive homes. There are countless local, state and national organizations committed to ending the cycle of domestic violence and giving children a safe environment at home. Our collective mission, now more challenging than ever before, has become even more essential.\nWith \"Margaret's Place\" and others like it across the country now closed, children have fewer and fewer outlets to seek the kind of help and guidance that helped that young man.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nThankfully, we are able to continue to help families by finding them resources for food and other basic needs. And ahead of the school closures, the students we serve reviewed and revised their safety plans, were reminded of coping skills, and were reminded that the violence they are being exposed to is not their fault and that they are not the only ones going through it.\nWhen the crisis has abated, we anticipate addressing the impact that this collective traumatic experience -- and any previous and ongoing trauma that may have been exacerbated or untreated at this time -- has had on students and their families. Behind the scenes, we are gathering resources on grief and loss and training our staff to respond to these types of issues as they may show up differently now in our school communities.\nOur country is undoubtedly caught up in a crisis with no clear timeline or ending, and I fear that my experiences as a child will be experienced by countless others in the coming days, months and years. I worry not only about the health of my loved ones and friends, but also for the children who may not be safe at home. If you know of a loved one, friend or neighbor who is living in a violent household, please check in -- while following social distancing guidelines -- with them as often as you can.", "url": "https://www.cnn.com/2020/04/09/opinions/children-domestic-violence-coronavirus-torre/index.html"}