{"authors": ["Blake Ellis", "Melanie Hicken", "Ashley Fantz", "Cnn Investigates"], "date_download": "2020-05-04 16:26:26", "date_modify": "2020-05-04 16:26:26", "date_publish": "2020-04-07 02:01:57", "description": "With tests in short supply as coronavirus cases rise and a hodgepodge of state reporting practices, coroners and medical examiners fear many Covid-19 deaths may go uncounted.", "filename": "2020_04_06_health_coronavirus-coroners-uncounted-deaths-invs_index_1588609586.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402161533-01-coronavirus-coroners-barnum-4-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_health_coronavirus-coroners-uncounted-deaths-invs_index_1588609586.html", "title": "Coroners worry Covid-19 test shortages could lead to uncounted deaths", "title_page": "Coroners worry Covid-19 test shortages could lead to uncounted deaths - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Jill Romann, the coroner in Douglas County, Colorado, was so desperate for coronavirus tests that she began calling hospitals in the middle of the night to avoid management, begging whoever was on duty for one or two test kits.\nHer total collection reached about 13 before the hospitals caught on and shut her down.\nShe asked the state health department for help getting the tests needed to determine whether deaths were linked to the virus. But she said the agency told her it was not providing them to coroners because it was prioritizing the tests for the living. She hasn't been able to get the supplies she needs from private labs either.\n\"If you die in my county, I will not know if you died of Covid-19,\" Romann said. \"I will, however, be able to tell if you legally smoked pot.\"\nOther death investigators are equally frustrated and worried about coronavirus deaths being missed. A coroner in Wyoming, the only state that still hasn't reported any deaths due to the virus, said he seriously doubts its official death count, and told CNN he hasn't been able to test a number of suspected cases. And an Ohio coroner said she believes at least four deaths in her county have already been left uncounted.\nInside the Douglas County, Colorado, morgue\nAs the country battles a rapidly growing number of coronavirus infections, 13 coroners and medical examiners in nine states told CNN that they are struggling to acquire the supplies needed to test bodies arriving at their facilities for the disease.\nWith concerns growing about the coronavirus death toll being incomplete because of lack of testing for the living, coroners and medical examiners said being unable to test the dead compounds the issue. They said they are worried that deaths are being significantly undercounted and that as a result, the statistics used by the federal and state governments to chart the virus's spread and severity are far from reliable. Contacts of the deceased may not get the warnings they need to help keep the disease from spreading; families may be left not knowing what killed their loved ones.\nThe CDC's total death count stood at around 9,000 on Monday. When pressed on what deaths it is tracking, the agency told CNN that it is looking at both laboratory-confirmed cases and those without laboratory confirmation. (CNN generally relies on Johns Hopkins University's separate count of coronavirus deaths , which is updated more frequently.)\n\"The simplest answer is that CDC's National Center for Health Statistics reports the deaths that have Covid-19 listed on the death certificate\" as a contributor to death, a CDC spokesperson said. CDC guidance states that testing should be conducted whenever possible, but that when a definite diagnosis can't be made, it is \"acceptable to report Covid-19 on a death certificate as 'probable' or 'presumed'\" if \"the circumstances are compelling within a reasonable degree of certainty.\"\nBut not every state, and not every coroner and medical examiner, is operating under the same policy when it comes to classifying and reporting deaths potentially linked to the disease.\nJill Romann has been scrambling to get Covid-19 test kits, which include tubes used to transport specimens.\nStates vary on how they are currently reporting deaths to the federal government. Some state departments of health told CNN they are reporting only cases confirmed by a positive test, for example, while another said it is also reporting certain unconfirmed cases in which symptoms pointed to coronavirus.\nBut it is ultimately the medical examiners and coroners who decide what ends up on death certificates under their jurisdiction, and some, like Romann, told CNN they don't feel comfortable guessing at the cause of death without a test.\n\"It is very concerning that this data set will not be included in the overall numbers,\" said Romann, who said she will soon run out of testing swabs. \"We want real facts of this disease.\"\n'Your fatality rate is not a true fatality rate'\nDepending on the state, coroners and medical examiners oversee various kinds of deaths where coronavirus is suspected. Some oversee deaths deemed to be unusual or those that have occurred outside of a medical setting -- typically at home. Others said that under current circumstances, they are now certifying all deaths potentially caused by coronavirus, including ones in hospitals. Their official role is to find the cause of death, though their findings can also be important for tracking and heading off the disease.\nBodies can be tested for coronavirus after death. But to do so requires access to the same scarce test supplies that are so desperately needed for people who are alive. The CDC has issued official guidance on the use of testing after death, saying coroners and medical examiners \"should use their judgment to determine if a decedent had signs and symptoms compatible with Covid-19 during life and whether postmortem testing should be pursued.\"\nFor some coroners and medical examiners, getting test kits hasn't been an issue, either because there are sufficient tests in their area or because the disease isn't as prevalent there yet. But others, like Romann, have been turned down when they requested tests from public health departments and have been left scrounging for supplies and processing time at backed-up private labs.\n\"Testing has been so restricted and test kits so unavailable, I do not think we truly know the scope of infection or virus-related deaths here,\" said Dr. Christina VandePol, the coroner in Chester County, Pennsylvania.\nIn several states, including Colorado, Arkansas, and Wyoming, health officials told CNN that coroners who lack tests can use other methods to try to zero in on deaths caused by the virus.\nColorado's Department of Public Health and Environment said that officials certifying deaths do not need test results to attribute Covid-19 as a cause or contributor to death and can list Covid-19 as a suspected cause on death certificates.\n\"Counting a death as Covid-19-related relies on physicians' and coroners' best medical judgment, not necessarily test results, and we believe their medical judgment is pretty sound,\" a vital statistics program manager said in a statement. \"Because we are not relying on test results alone to identify Covid-19 deaths, we do not expect significant undercounting of these deaths.\"\nHowever, a spokesperson told CNN that in addition to confirmed deaths, the agency's current policy is to report to the CDC only untested deaths where the person had symptoms and a known contact with a confirmed case.\nRomann said she disagrees with the approach of assuming that someone has died of Covid-19 without testing.\nJill Romann, the coroner in Douglas County, Colorado.\n\"Accurate data can save lives,\" she said. \"We are better than casual reporters, we are professionals whose charge is to report with purpose.\"\nIn Ohio, meanwhile, Franklin County Coroner Dr. Anahi Ortiz believes her office has already seen at least four coronavirus deaths that were not counted.\nThough she couldn't release personally identifying information, she said two were in their 40s, and two were in their 50s. One woman had been homeless and staying with a friend when she died. Another man had recently traveled to Florida, and his employer called the police when they didn't hear from him. All four had fevers and other common coronavirus symptoms, said Ortiz, and they were all found dead at home.\nWhat should we investigate next? Email Blake Ellis and Melanie Hicken\nBut none of them were tested. With only eight precious tests left, she said, she decided to save them for infant deaths, to test for Covid-19 and other viruses.\nOrtiz said she has struggled to find both supplies and a facility to process the tests, saying that the city and state health departments told her that coroner cases are not being tested because they are not currently a priority. When she was interviewed by a local ABC affiliate last month, there had been one untested death. But now the situation is getting worse, as the number of bodies needing testing increases. The Ohio Department of Health did not respond to a request for comment. Columbus Public Health said testing is limited and that the state prioritizes people who are hospitalized, healthcare workers and first responders, adding that coroners can use private labs instead.\n\"They're not going to be counted,\" said Ortiz, who said her office only reports positive cases to the state. \"Your fatality rate is not a true fatality rate.\"\nWith few tests, states make their own policies\nWyoming, which had no recorded deaths from coronavirus as of Monday, may be seeing a similar undercount, according to Fremont County Coroner Mark Stratmoen.\nStratmoen, president of the Wyoming Coroners Association, said that with doctors struggling to test even living patients in the state, there are minimal testing resources for the deceased. He's having to stick to his typical investigation, he said, based on the scene, medical history, symptoms and other circumstances. As a result, he is having his staff treat all deaths as possible coronavirus patients and use protective gear he said he ordered in February in preparation for the pandemic.\n\"We will ever know the true impact on fatalities from Covid,\" said Mark Stratmoen, the coroner in Fremont County, Wyoming.\nHe described several deaths in his county of around 40,000 people in which the decedents had suffered from pre-existing conditions, and where he suspects that coronavirus may have been -- at the minimum -- the \"tipping point\" in their deaths. But \"without testing,\" he said, \"you have to go with what you know, not what you suspect.\"\nHe told CNN he is worried that compared to other states, Wyoming is just at the start of its curve, and said he doubts \"we will ever know the true impact on fatalities from Covid, both for the living and the dead.\"\nA spokesperson for Wyoming's health department said it encourages postmortem testing, but realizes that the state's lack of testing supplies means that not everyone, both living or dead, will get tested.\nThe spokesperson said it has told coroners to classify both confirmed and potential Covid-19 deaths on death certificates for tracking at the state level, though it is only immediately reporting confirmed Covid-19 deaths to the CDC. He added that death certificate data, including those with suspected Covid-19 deaths, would eventually make it to the CDC \"in the standard manner they receive all death certificate data.\" This suggests that in the case of Wyoming and in any other states following similar procedures, two different death numbers would eventually be reported to the CDC.\nAs of Monday, Wyoming hadn't reported any deaths linked to Covid-19.\nCoroners in Arkansas, which had 16 documented Covid-19 deaths as of Monday, had similar concerns.\n\"We are having a very tough time getting the supplies we need to complete the testing,\" said Benton County, Arkansas Coroner Daniel Oxford.\nOxford said that for two weeks he unsuccessfully wrote and called the state department of health to ask for test kits. After CNN reached out to the state last week, he said on Monday that he had received a few.\nAnother Arkansas coroner, this one in Clark County, expressed his exasperation not to be able to test for the virus. \"Bodies are NOT TESTED for Covid 19!!\" he wrote in an email to CNN. \"Period!\"\nLike Colorado, Arkansas authorities said that coroners have the last say in the cause of death, and that even suspected but untested Covid-19 deaths would be counted by the state as long as the coroner certified the cause of death as Covid-19. The state health department said it is not reporting those suspected but untested deaths to the CDC. It also said that it has not turned down any requests for the processing of tests, but that the actual supplies needed to swab and transport the specimens are limited, creating a difficult situation for coroners.\nSome states, however, are not counting suspected deaths. Missouri, for example, said it is only logging Covid-19 deaths of people who tested positive for the virus. Those who did not receive a test but who may have died from the disease are not being recorded, according to a spokesperson.\nPennsylvania's Department of Health said the state is also only counting deaths in which tests came back positive. It acknowledged that postmortem testing is an area of concern and could be leading to undercounting.\n\"We want them to use their judgement as needed. We are working to get them tests,\" said a Pennsylvania Department of Health spokesperson. \"This is a nationwide issue. We know that the data coming out is only as good as the data coming in...we may not have the most accurate count as to how many deaths there are.\"\nRationing tests as cases rise\nCNN reached out to a sampling of coroners and medical examiners in more than a dozen states. Not all responded, and some of those who did have been able to test the bodies they have received so far, while others hadn't yet had any deaths where testing would be indicated. Many said the concern is what happens as the number of deaths rises.\n\"Orlando hasn't been hit as hard as New York; if that comes down here we will definitely run out of kits, \" said Dr. Joshua Stephany, the Chief Medical Examiner of Orange and Osceola counties in Florida. \"Right now we're okay...but it would only take one or two bad days for that to change.\"\nCurrently, he said, his office reserves tests for people who suffered more serious Covid-19 symptoms, like high fevers, since he believes his role is to focus on cases where it's clearly a possible cause of death. \"It's the difference of someone dying because of it versus someone dying with it,\" he said.\nTest processing is typically conducted by local or state health departments or by labs. But the access to test kits often depends on where coroners and medical examiners are located and the connections they have.\nA CDC spokesperson said that the agency is working with local and state health departments to ensure coroners and medical examiners have access to tests and that the FDA has authorized several commercial labs to conduct testing. \"The situation is constantly evolving, and the availability of testing is a top priority for CDC and our state health department counterparts,\" the spokesperson added.\nCoroners and medical examiners said that getting tests processed by health departments would typically be free. But since that isn't always an option and supplies are so scarce, some have had better luck paying private labs to send them test kits and process tests. Several said they haven't had any luck with the labs either. Some said they've been placed on waiting lists for supplies. Others said their phone calls haven't been returned.\nThat means they have to get creative. In one case, a coroner said he was prepared to use the testing supplies he had secured for his own private practice as a physician. Another said she has changed her testing procedures to conserve swabs -- she is now using fewer swabs per body than the CDC recommends.\nOthers accept that they can't test at all.\nThe stakes of the unknown\nThere are many reasons it's a problem if coroners and medical examiners are unable to test people they believe died of coronavirus, says Gary Watts, the president of the International Association of Coroners and Medical Examiners.\nIt skews the overall tally of coronavirus deaths, which some coroners say is already going to be an undercount because a certain number of deaths are always going to be missed. One medical examiner's office, for example, said it actually had tests available, but some of the bodies of patients who reported symptoms have been so decomposed that a specimen could not be obtained. And as a BuzzFeed investigation revealed, doctors and nurses have also reported some deaths not being counted within hospitals.\nPerhaps more important, Watts and others said, not being able to test the deceased leaves their contacts vulnerable.\n\"Those that die outside of the hospital, if we don't get them tested, not only do we not get the information in terms of correct data, but we're not getting the information that's lifesaving to those who were potentially exposed,\" said Watts, who is also the Richland County, South Carolina, coroner. \"And families always want to know what happened to their loved ones.\"\nCoroners and medical examiners also worry that their employees are at risk. Sally Aiken, the president of the National Association of Medical Examiners, said that the risk of transmission after death is reduced because it can no longer be spread by coughing or breathing, but it is still important for officials to use proper protective equipment.\nThose in the field are facing a shortage of protective supplies like masks and gowns, as is the rest of the health care industry. In some areas, coroners and medical examiners say, they show up to homes without any idea if the person they're examining was suspected to have had coronavirus -- opening up their staff to possible exposure from family members or surfaces in the house.\nChester County's VandePol said that when she asks an investigator to respond to a death, she feels like she is \"sending them off to battle with no weapons.\"\n\"The last responders are a group that no one thinks about,\" said Franklin County's Ortiz. \"But we are essential and we continue working throughout the crisis.\"\nIs there something about Covid-19 you think we should investigate? Email us: watchdog@cnn.com.", "url": "https://www.cnn.com/2020/04/06/health/coronavirus-coroners-uncounted-deaths-invs/index.html"}