{"authors": ["Kimberlee Kruesi"], "date_download": "2020-05-04 20:11:00", "date_modify": "2020-05-04 20:11:00", "date_publish": "2020-04-07 17:56:05", "description": "NASHVILLE, Tenn. (AP) — As Tennessee schools currently remain closed to help curb the spread of the new coronavirus, state officials are accepting applications for a new education voucher program...", "filename": "_83a20d9282039de4b8498b0b1010f7b1_1588623060.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_83a20d9282039de4b8498b0b1010f7b1_1588623060.html", "title": "Groups seek to block Tennessee school voucher implementation", "title_page": "Groups seek to block Tennessee school voucher implementation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NASHVILLE, Tenn. (AP) — As Tennessee schools currently remain closed to help curb the spread of the new coronavirus , state officials are accepting applications for a new education voucher program that would allow eligible families to use public tax dollars on private tuition during the upcoming school year.\nHowever, the American Civil Liberties Union of Tennessee, along with the Southern Poverty Law Center, and the Education Law Center, have filed a motion hoping to temporarily stop the voucher program from being implemented while the legality of the law is debated in court.\nThe same group filed a complaint nearly a month ago alleging that the initiative championed by Gov. Bill Lee is illegal. Additionally, Nashville and Memphis officials have also filed a separate legal challenge also seeking to halt the voucher law.\nOtherwise known as education savings account, families would get up to $7,300 in state education money each year for removing their student from public school and using those tax dollars to help cover the cost of sending the student to a preapproved private school.\nBoth complaints allege that the state’s voucher program is illegal under the Tennessee constitution’s “home rule.” They claim Republican lawmakers did not receive local consent when drawing legislation affecting local communities. Additional concerns have been raised about the law’s possible allowance of discrimination and funding mechanisms.\n“It is critical for the court to grant a temporary injunction until it rules on the merits of the voucher law,” the 47-page document reads. “Maintaining the status quo benefits students eligible for vouchers and those who would remain in the targeted school districts.”\nLee’s office did not immediately return a request for comment.\nThe Republican governor made sure to include funding for the voucher program in his drastically reduced spending plan that he was forced to rewrite due to recession concerns caused by the virus outbreak.\nLawmakers approved the hastily redrawn budget for fiscal year 2020-21 before abruptly recessing last month amid pressure to disperse from the Capitol during the pandemic. While the inclusion of $41 million to fund the voucher program raised eyebrows among some inside the GOP-dominant Statehouse, lawmakers ultimately advanced the spending plan.\nThe $41 million is needed to largely offset the per-pupil funding losses school districts are expected to face when families remove their students from public schools and place them into private ones.\nTennessee’s voucher program is scheduled to go into effect this summer. The Department of Education is accepting voucher applications from interested families until April 29.\nThe voucher program would only apply to Nashville and Memphis, the areas with the lowest performing schools and regions with Democratic political strongholds.\nThe program is set to handle up to 5,000 students during the first year. More than 50 private schools have been approved to participate in the program.\n“Maintaining the status quo during the pendency of the litigation best serves the interests of all parties and the public at large,” court documents state.", "url": "https://apnews.com/83a20d9282039de4b8498b0b1010f7b1"}