{"authors": ["Ellie Kaufman"], "date_download": "2020-05-04 16:20:22", "date_modify": "2020-05-04 16:20:22", "date_publish": "2020-04-04 18:37:05", "description": "As coronavirus patients flood clinics, health care workers are taking steps at the recommendation of federal and state officials to cancel elective procedures, close non-emergency doctors' offices and postpone non-essential appointments.", "filename": "2020_04_04_health_sick-without-covid-wellness_index_1588609222.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403165418-hospital-non-covid-patient-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_health_sick-without-covid-wellness_index_1588609222.html", "title": "As hospitals focus on coronavirus, patients with other illnesses wait in fear", "title_page": "As hospitals focus on coronavirus, patients with other illnesses wait in fear - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) After a diagnosis of breast and thyroid cancer last spring, LaDonna Lokey knew she had a long year of surgery and chemotherapy ahead of her.\nBy the end of January, she had finished chemo and needed one more surgery to remove lymph nodes closing in on her vocal cords. But then the coronavirus pandemic struck, overwhelming her hospital in Wisconsin and others across the US.\nAs coronavirus patients flood clinics and hospitals, health care workers are taking steps at the recommendation of federal and state officials to cancel elective procedures, close non-emergency doctors' offices and postpone nonessential appointments. It's putting people with other health issues -- from cancer to pregnancy -- in a precarious position.\nFor some, services they relied on are no longer available or have been canceled. For others, the services they need are still available, but they're too scared to venture out and risk contracting the virus.\nPutting treatment on hold\nBefore her lymph node surgery, Lokey had to have an ultrasound done at a Green Bay-area hospital. But before she could go, they called to say it would need to be rescheduled to the end of April, at the earliest.\nThey told her the ultrasound would have to wait. \"My sense from all of the health care providers, they just felt like they did not know what was coming,\" she told CNN.\nWithout the ultrasound, Lokey can't have the surgery. But even if she could get the ultrasound, she's worried to have the surgery done during a virus pandemic.\n\"One is would they do it, and two is do I want them to,\" Lokey said. \"Just going there, I'm at risk... even if they said, 'Yeah, I'll go ahead with it,' do I even want to right now? I'm scared either way. I don't know if I would. I might wait.\"\nFor the time being, Lokey can live with the lymph nodes in and around her throat, but it's uncomfortable, she said. The longer they are there, the higher the risk that they'll grow, or the cancer will spread to other parts of her body.\n\"I also want to rip it out of my throat, that's how I feel,\" Lokey said. \"Every day that it's in, it could go further into my lymph nodes.\"\nLike other cancer patients, Lokey's entire treatment plan is on indefinite hold.\nSome patients will die\nAnna Steegmann, a 65-year-old professor in New York City, didn't think a whooshing sound in her ears would lead her to a cancer diagnosis. But after a series of blood tests, four days in the emergency room and a bone marrow biopsy, she was diagnosed with myelodysplastic syndrome, a type of blood cancer.\nSteegmann was diagnosed on March 13, when New York already had more than 400 coronavirus cases . After getting the diagnosis, she reached out to Memorial Sloan Kettering, the top cancer hospital in the region. They said they weren't taking any new patients now.\n\"They said we're in a holding pattern right now. They said they can't take anybody on,\" Steegmann told CNN.\nAfter weeks of calling doctors' offices and coordinating medical records to be sent to those locations, Steegmann was able to get a video-streaming telehealth appointment with a specialist. She said she wants to ask basic questions like how long her prognosis is -- this type of cancer has no cure -- and what treatment options are available to her.\n\"It feels like I'm just waiting, waiting, waiting, condemned to waiting, and I'm wasting time that could be better spent getting treatment,\" Steegmann said. \"Anyone who was recently diagnosed with a serious illness, they are going to have a hard time getting treatment.\"\nDr. Arthur Caplan, a CNN medical analyst and direction of the Division of Medical Ethics at the New York University School of Medicine, said the pandemic will surely hurt patients without the virus.\n\"People are going to be at risk, and some will die, because the normal treatment, particularly early treatment for cancer is not available,\" Caplan told CNN. \"We're talking about hopefully a matter of months, but if this goes on for, say, a year, you're talking about people who are dying not from the virus, but because of the virus.\"\nManaging long-term care\nFor patients managing long-term health issues, the pandemic is upending their routine doctor's visits, lab tests and treatments.\nMolly Schreiber, 40, was diagnosed with Type 1 diabetes when she was a child. Years later, she was diagnosed with rheumatoid arthritis, an auto-immune disorder.\nFor her arthritis, Schreiber gets IV infusions of a drug called Rituxan every four months. These infusions must be done in a hospital. Although her next infusion isn't until the end of May, she's already nervous.\n\"My biggest fear ... just going into the hospital environment,\" Schreiber told CNN. \"My concern is that I would get something much worse in the hospital.\"\nThe drugs Schreiber takes for her arthritis weaken her immune system, which puts her at increased risk for contracting coronavirus.\nBesides the infusions, Schreiber usually gets blood work done every six weeks to check certain markers and make sure her health is stable. She's thinking about postponing those for the time being, she said.\nHer rheumatologist and other doctors who can do telehealth appointments have recommended that she stay inside as much as possible. Her hospital told her if she needs to come in for diabetes-related issues, she should bring her own equipment to check her blood sugar.\n\"They are putting out some guidelines to say just bring your own needles, your own supplies, everything, so that we can check your blood sugar,\" Schreiber said.\nTelehealth helps, but not always\nTelehealth services have increased in the past few weeks as an alternative for people who fear going to a hospital and potentially exposing themselves to coronavirus. Federal agencies have deregulated some of the provisions that prevented insurance companies from covering such services, allowing Medicaid to cover telehealth.\nHeal, a telehealth and home health service, has been in business for more than five years, but founder and chief medical officer Renee Dua said the business has seen a 640 percent increase in patients over the past month. Dua said that telehealth and home health services can provide a safe alternative so that preventive medicine and critical care of auto-immune disorders don't go by the wayside during this time.\n\"The growth has been profound,\" Dua told CNN. \"We call it closing care gaps. We should not avoid preventive screenings and primary care right now.\"\nWhile telehealth services and home visits can supplement some hospital visits, other in-person appointments cannot be replaced.\nFor Rebecca Gray, a 28-year-old mom of two with another baby on the way, ultrasounds are required -- and they can only be done at a hospital.\n\"It's nerve-racking. You fear for the worst. You see they have a little tent set up because the emergency room to the hospital where you are walking are right there in sight of each other,\" Gray told CNN. \"I have to do what's best for my unborn child ... make sure we're on track for that, and also trying to make sure my other two are safe and healthy.\"\nLokey said she wished hospitals would communicate better about which ones do and don't have coronavirus patients, because it would make it easier to know when she's at increased risk.\n\"It's not clear what they are doing. We don't want to go at all,\" Lokey said.\nCaplan agreed the federal government and local emergency management teams could do a better job of telling people which hospitals are safer than others.\n\"I think we should hear more from the White House about this problem,\" Caplan said. \"We should see more from first responders in cities. Here's what the deal is, this is when you should call an ambulance, this is when you should call the fire department. We're not getting enough guidance.\"", "url": "https://www.cnn.com/2020/04/04/health/sick-without-covid-wellness/index.html"}