{"authors": ["Kate Brumback"], "date_download": "2020-05-04 20:13:54", "date_modify": "2020-05-04 20:13:54", "date_publish": "2020-04-16 21:20:10", "description": "ATLANTA (AP) — A former vice president of a medical device packaging company is accused of causing a delay in the delivery to health care providers of personal protective equipment, which is in...", "filename": "_c24c14ee246bdd58d3a72e8ac2832ff1_1588623234.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c24c14ee246bdd58d3a72e8ac2832ff1_1588623234.html", "title": "Man accused of causing delay in delivery of health equipment", "title_page": "Man accused of causing delay in delivery of health equipment", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ATLANTA (AP) — A former vice president of a medical device packaging company is accused of causing a delay in the delivery to health care providers of personal protective equipment, which is in short supply during the coronavirus outbreak.\nChristopher Dobbins, 40, went into his former employer’s package shipping system and deleted shipping information at the company in the Atlanta suburbs, according to court records.\nCourt records show Dobbins was released on bond following a hearing Thursday. He did not immediately respond to a voicemail message seeking comment and online court records did not list an attorney for him.\nDobbins, who lives in the north Atlanta suburb of Duluth, “allegedly disrupted the delivery of personal protective equipment in the middle of a global pandemic,” U.S. Attorney Byung J. “BJay” Pak said in a news release.\nPak added: “The Department of Justice is dedicated to moving quickly on cases like this to bring criminal opportunists to justice and protect the public during these challenging times.”\nSpecial Agent Chris Hacker, who leads the FBI’s Atlanta field office, said in the statement that the medical packaging company, Stradis Healthcare of Peachtree Corners, promptly reported the problem, and agents responded quickly.\nAccording to an FBI agent’s sworn statement filed in court, the company — which packages and distributes protective equipment including masks, gloves and gowns — reported on April 7 that it had experience an “intrusion into its computer network” and that the intruder had “deleted records causing disruption to its operations.”\nThe intrusion was detected March 29 while the company was trying to print shipping labels to send equipment to customers, the FBI agent’s statement says.\nDobbins, who was hired as vice president of finance in August 2016, had been disciplined in August of last year and again in December and was fired on March 2, the agent’s statement says.\nDobbins had administrator access to the computer systems housing the company’s shipping information when he worked there, prosecutors said.\nHe received his last paycheck on March 26 and three days later used a fake user account he had created while working there to access the company’s computer systems, prosecutors said. He then created a second fake user account and used that to edit 115,581 records and delete 2,371 records before deactivating both fake accounts and logging out, prosecutors said.\nThe monetary losses from the computer intrusion are still being determined but exceeded $5,000 in value, the FBI agent’s statement says. That’s based on the cost of responding to the intrusion, restoring data to its prior condition and lost revenue because business was interrupted.\nThe intrusion also caused “a potential modification or impairment of the medical examination, diagnosis, treatment, or care of at least one person” and a “threat to public health and safety by delaying shipments of PPEs,” the agent wrote.\nIt caused delays of 24 to 72 hours in shipments of personal protective equipment that the company would normally be able to deliver on the same day, the agent wrote.\nStradis Healthcare released a statement Thursday that its shipping of key supplies has returned to full strength.\n“Of course we are disappointed about a former employee who caused the company immeasurable internal harm and caused some temporary delays in our shipping system but our focus is completely consumed in working 24/7 to serve the medical community and the public during this critical time,” Stradis CEO and co-founder Jeff Jacobs said in the news release.\nNow that the case is in the hands of the justice system, he said, “this distraction is no longer in the way of our critical day-to-day role in getting vital supplies to our heroes in patient care, and saving lives in the process.”\nStradis specializes in medical device packaging and custom procedure kits and trays, according to the release. The company says it has delivered products to hospitals and medical facilities in the Southeast, as well as in New York City and Washington state.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/c24c14ee246bdd58d3a72e8ac2832ff1"}