{"authors": ["Por Dánica Coto"], "date_download": "2020-05-04 20:19:32", "date_modify": "2020-05-04 20:19:32", "date_publish": "2020-04-15 17:56:29", "description": "SAN JUAN (AP) — Puerto Rico tiene muchos menos casos de COVID-19 que ciertos estados de Estados Unidos, prueba de que las autoridades locales están conteniendo exitosamente la propagación, afirman...", "filename": "_b0959215cfaf48d097e564034607683b_1588623572.html", "image_url": "https://storage.googleapis.com/afs-prod/media/28b8efaa9e09432daa4253cebdd0ddfa/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b0959215cfaf48d097e564034607683b_1588623572.html", "title": "Errores afectan la respuesta de Puerto Rico al coronavirus", "title_page": "Errores afectan la respuesta de Puerto Rico al coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nSAN JUAN (AP) — Puerto Rico tiene muchos menos casos de COVID-19 que ciertos estados de Estados Unidos, prueba de que las autoridades locales están conteniendo exitosamente la propagación, afirman funcionarios de la isla, pero una serie de errores ha incrementado la preocupación de que la epidemia podría ser más extensa de lo que se cree.\nEl territorio se prepara para alcanzar el pico de casos a principios de mayo, mientras las autoridades federales investigan un contrato por 38 millones de dólares para adquirir equipos para pruebas que, según los expertos, se necesitan con urgencia, pero que jamás llegaron. Mientras tanto, los funcionarios locales prefieren las discusiones por televisión a las conferencias de prensa, algo que enfurece a muchos y provoca comparaciones con el mal manejo de la crisis por el huracán María.\n“Básicamente estamos a ciegas”, aseguró Mónica Feliú-Mójer, vocera de CienciaPR, un grupo sin fines de lucro de científicos puertorriqueños que reclaman pruebas masivas de COVID-19 a la población.\nPuerto Rico anunció sus primeros casos de coronavirus a mediados de marzo, uno de los cuales era un turista italiano anciano. Desde entonces se han reportado al menos 51 muertes, más de 970 casos confirmados y 1.400 resultados pendientes. Se han realizado pruebas a unas 9.200 personas en la isla de 3,2 millones de habitantes, lo que significa menos del 1% de la población. Los expertos dicen que la cifra está muy por debajo de la de estados con poblaciones similares que el gobierno local utiliza como comparación para afirmar que el coronavirus está controlado.\nPor ejemplo, Utah, con 3,2 millones de habitantes, ha reportado 18 muertes y más de 2.300 casos confirmados, pero ha realizado pruebas a más de 45.700 personas.\nLa epidemióloga Fabiola Cruz dijo que Puerto Rico ha realizado 2.800 pruebas por cada millón de habitantes. Los Centros para el Control y la Prevención de Enfermedades de Estados Unidos (CDC por sus siglas en inglés) recomiendan 6.000 pruebas por millón de habitantes para realizar proyecciones precisas. El promedio nacional de Estados Unidos es de 596 pruebas por cada 100.000 habitantes, según el Proyecto de Rastreo COVID. En tanto, Puerto Rico reporta 288 pruebas por cada 100.000. personas, la cifra más baja en comparación con cualquier estado de Estados Unidos.\nEl miércoles, decenas de puertorriqueños subieron a sus autos y tocaron sus bocinas como parte de una protesta para denunciar supuestos actos de corrupción y exigir más pruebas en medio de las restricciones de desplazamiento impuestas el 15 de marzo y que han sido extendidas hasta el 3 de mayo.\nLos expertos en salud y los economistas dicen que una de sus mayores preocupaciones es que las autoridades utilizan los escasos datos disponibles para calcular el pico de casos y aplicar una cuarentena de casi dos meses que ha paralizado una economía que ya lleva 13 años en recesión. Mientras tanto, la isla no termina de superar los estragos del huracán María y una serie de terremotos.\nEl economista José Caraballo calcula que la tasa actual de desempleo es de 37% y dijo que se requiere de análisis masivos para frenar la pandemia y reanudar la actividad comercial. El Departamento del Trabajo y Recursos Humanos de la isla dijo que cada día recibe 10.000 solicitudes de subsidios por desempleo.\nA los expertos también les preocupa que el endeble sector salud de la isla no pueda prepararse adecuadamente si las autoridades desconocen el número de casos a los que se enfrentan en realidad.\n“Tenemos una estrategia que no está bien informada”, dijo Feliú-Mójer al resaltar que la gobernadora de la isla señaló recientemente que su gobierno está controlando la curva de contagios. “Realmente Puerto Rico no tiene datos suficientes para aseverar una cosa como esa”.\nSin embargo, los hospitales de Puerto Rico cuentan con más de 800 respiradores y casi la mitad de su total de camas en terapia intensiva están disponibles, y aún no se reporta un incremento notable en el número de pacientes.\nEl lunes, el secretario de Salud Lorenzo González anunció que las autoridades distribuirían 200.000 kits de pruebas rápidas y reconoció que el gobierno necesita al menos 21.000 resultados de análisis para contar con un modelo sólido. La cifra representa más del doble de lo reportado por el gobierno.\n“Estamos peleando por las pruebas”, dijo González, quien asumió el cargo hace dos semanas y resaltó que Puerto Rico está compitiendo con decenas de países en medio de la pandemia.\nEn tanto, el recién designado epidemiólogo gubernamental David Capó dijo que actualmente se reservan las pruebas para aquellas personas que presentan síntomas y las necesitan con mayor urgencia.\nPor su parte, las autoridades locales y federales, y legisladores de Puerto Rico, investigan un contrato gubernamental por 38 millones de dólares para adquirir un millón de pruebas y que fue cancelado recientemente debido a las fuertes críticas.\nEl contrato fue con Apex General Contractors, una pequeña compañía constructora de Puerto Rico que señaló que obtendría las pruebas de Promedical, un fabricante australiano. Promedical emitió un comunicado a The Associated Press en el que indicó que no había negociado ni tenía contrato con Apex, añadiendo que vende pruebas rápidas a distribuidores autorizados por menos de la mitad de la cantidad que señaló Apex.\nA pesar de que el gobierno puertorriqueño recuperó su depósito, los críticos señalan que perdió tiempo fundamental para obtener las pruebas en otra parte.\n“Es algo que tenemos que seguir investigando”, dijo el representante Juan Óscar Morales, miembro del partido de la gobernadora.\nAunque Puerto Rico ha recibido elogios por implementar un confinamiento a mediados de marzo que, de acuerdo con las autoridades, ha ayudado a frenar el número de casos de coronavirus, el gobierno no comenzó a rastrear los contactos sino hasta casi tres semanas después de que se reportó la primera infección, y sigue sin dar a conocer la ubicación de cientos de casos positivos. Una coalición de alcaldes que aguarda dicha información indicó que recurriría a la corte para obtener los datos, aunque González declaró el miércoles que esos detalles se difundirán pronto, una vez que los alcaldes firmen documentos en los que acepten que cierta información debe permanecer privada.\nEl Departamento de Salud también intenta recuperarse después de tener tres titulares distintos en un periodo de dos semanas el mes pasado. El primer secretario renunció después de que la gobernadora criticó la manera en que manejó la crisis de coronavirus.\nTemerosos de que el gobierno de Puerto Rico no esté haciendo lo suficiente, los alcaldes de ciertas localidades han implementado sus propias medidas de protección.\nLuis Javier Hernández, alcalde de Villalba, una localidad montañosa en el centro de la isla, decidió cerrar las fronteras de la ciudad e iniciar su propio rastreo de contactos con la ayuda de Fabiola Cruz, la epidemióloga. Ellos han sido los que han informado al Departamento de Salud sobre los casos, y no al revés. Hernández acusó al gobierno central de dejar que las alcaldías se las arreglen solas y de ocultarles información sobre las estadísticas de COVID-19.\n“Desde el huracán María, aprendimos que no podemos esperar por nadie”, dijo. “Yo pensaba que el gobierno hubiera aprendido de la situación”.", "url": "https://apnews.com/b0959215cfaf48d097e564034607683b"}