{"authors": [], "date_download": "2020-05-04 20:27:09", "date_modify": "2020-05-04 20:27:09", "date_publish": "2020-04-15 14:02:30", "description": "PORTLAND, Maine (AP) — Even though many workplaces are empty in Maine, the state workers' compensation system expects an increase in claims related to the coronavirus. The system already is...", "filename": "_d462038eb93916aab20630abdcfae7a7_1588624029.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d462038eb93916aab20630abdcfae7a7_1588624029.html", "title": "Virus adds to worker comp claims; prosecutor targets gouging", "title_page": "Virus adds to worker comp claims; prosecutor targets gouging", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Maine (AP) — Even though many workplaces are empty in Maine, the state workers’ compensation system expects an increase in claims related to the coronavirus.\nThe system already is receiving claims from dozens of health care workers exposed to the virus at work, and more claims are expected in the coming weeks for injuries suffered at home by Mainers who are working remotely, the Portland Press Herald reported.\n“Spare bedrooms, basements and kitchen counters are newly transformed into eight-hour work spaces that often are not appropriately engineered for comfort or safety,” said Tony Payne, spokesman for MEMIC, the Portland-based workers’ compensation insurer.\nAt least 208 Maine workers had filed notifications by Monday of workplace exposure to coronavirus since mid-February, when the system began coding reports to track COVID-19, said John Rohde, executive director of the Maine Workers’ Compensation Board.\nMainers who contract the virus on the job will be eligible for worker’s compensation benefits, while those who are quarantined and do not test positive will not, officials said.\n___ THE NUMBERS\nThe Maine Center for Disease Control reported four more COVID-19 deaths and said three dozen more people tested positive for the virus.\nThe updated figures bring Maine’s death toll to 24, and the number of positive cases to 770, the Maine CDC said Wednesday.\nAll told, 166 people who’ve tested positive, or 21%, are health care workers, said Dr. Nirav Shah, director of the Maine CDC.\nThe new deaths were a resident of Androscoggin and three in Cumberland County, he said.\nTwo people have died at each of the three long-term care facilities with active outbreaks, The Commons at Tall Pines in Belfast; the Augusta Center for Health and Rehabilitation; and Maine Veterans Homes in Scarborough, Shah said. Five patients and staff also have tested positive at The Cedars retirement community in Portland, he said.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and those with other health problems, it can cause more severe illness, including pneumonia, or death.\n___\nHOARDING AND PRICE GOUGING\nU.S. Attorney Halsey Frank is asking the Maine Medical Association and Maine Hospital Association to provide information to law enforcement about hoarding and price gouging of scarce medical supplies.\nLaw enforcement officials need help from medical professionals in identifying those who may have acquired crucial medical supplies in excess of what they could reasonably use, or for the purpose of charging exorbitant prices, Frank said in a statement.\n“The U.S. attorney’s office is focused on investigating and prosecuting those who are trying to use the current pandemic to take advantage of Mainers,” Frank said.\n___\nHOSPITAL CLINICAL TRIAL\nMaine Medical Center, the state’s largest hospital, has joined a pair of clinical trials designed to examine the usefulness of the drug Remdesivir for treatment of moderate and severe cases of COVID-19.\nThe antiviral drug has not yet been demonstrated to be effective for the treatment of COVID-19. The trials at Maine Med were organized under the Maine Medical Center Research Institute.\n“Unless clinical research is conducted to identify which treatments are effective, doctors, nurses and other front-line caregivers will continue to be limited in how they can care for these patients,” said Dr. David Seder, the trials’ principal investigator.", "url": "https://apnews.com/d462038eb93916aab20630abdcfae7a7"}