{"authors": [], "date_download": "2020-05-04 20:18:50", "date_modify": "2020-05-04 20:18:50", "date_publish": "2020-04-29 13:26:33", "description": "“The historically tragic COVID-19 pandemic necessitates this temporary exception,” the Academy of Motion Picture Arts and Sciences said.", "filename": "entry_oscars-to-admit-streamed-films_n_5ea977afc5b6106b8ed052ce_1588623530.html", "image_url": "https://img.huffingtonpost.com/asset/5ea97cf72500008c10eb08e7.jpeg?cache=p7qce7nabv&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_oscars-to-admit-streamed-films_n_5ea977afc5b6106b8ed052ce_1588623530.html", "title": "Oscars To Admit Streamed Films Next Year As Coronavirus Upends Movie Going", "title_page": "Oscars To Admit Streamed Films Next Year As Coronavirus Upends Movie Going | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "LOS ANGELES - The organizers of the Oscars said on Tuesday that films released only on streaming platforms or video on demand while movie theaters are closed due to the coronavirus pandemic would be eligible for Academy Awards next year.\nThe temporary change, which will apply only for next year’s Oscars and will lapse when movie theaters reopen across the nation, was announced in a statement by the Academy of Motion Picture Arts and Sciences.\nPreviously, a movie had to be screened in a movie theater in Los Angeles for at least seven days in order to be eligible for Oscar consideration.\nMike Blake / Reuters An Oscar statue dries in the sunlight after receiving a fresh coat of gold paint ahead of the 89th Academy Awards in Hollywood, California.\n“The Academy firmly believes there is no greater way to experience the magic of movies than to see them in a theater. Our commitment to that is unchanged and unwavering. Nonetheless, the historically tragic COVID-19 pandemic necessitates this temporary exception to our awards eligibility rules,” President David Rubin and Chief Executive Dawn Hudson said, referring to the disease caused by the virus.\nStreaming platforms like Netflix (NFLX.O) have upended Hollywood, drawing A-list stars such as Robert De Niro and Martin Scorsese and producing award-winning content like 2019 best foreign language winner “Roma” that have rivaled what traditional movie studios can offer.\nEvan Agostini/Invision/AP Renee Zellweger, winner of the award for best performance by an actress in a leading role for \"Judy,\" arrives at the Vanity Fair Oscar Party on Feb. 9, 2020.\nMovie theaters across the United States shut their doors in mid-March, forcing the postponement of major film releases. The three main movie theater chains - AMC, Regal and Cinemark - have said they do not expect to reopen until late June or July.\nSome films, including Universal Pictures CMSCA.O animated “Trolls World Tour,” have been released directly to streaming platforms or video on demand.\nUniversal will do the same with the upcoming Judd Apatow comedy “The King of Staten Island,” while Walt Disney (DIS.N) has announced it will release children’s fantasy film “Artemis Fowl” on its Disney+ streaming platform rather than wait for theaters to reopen. Others are expected to follow.\nThe Oscars, the highest awards in the movie industry, are still scheduled to take place in Hollywood on Feb. 28, 2021.", "url": "https://www.huffpost.com/entry/oscars-to-admit-streamed-films_n_5ea977afc5b6106b8ed052ce"}