{"authors": ["Kate Bennett"], "date_download": "2020-05-04 16:58:59", "date_modify": "2020-05-04 16:58:59", "date_publish": "2020-04-09 18:52:05", "description": "First lady Melania Trump shared a photo of herself wearing a cloth face mask in the wake of the coronavirus pandemic, becoming the first member of the Trump family to publicly don a face covering.", "filename": "2020_04_09_politics_melania-trump-face-mask-coronavirus_index_1588611539.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409130934-melania-mask-card-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_melania-trump-face-mask-coronavirus_index_1588611539.html", "title": "Melania Trump encourages face mask use with photo of herself", "title_page": "Melania Trump encourages face mask use with photo of herself - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) First lady Melania Trump shared a photo of herself wearing a cloth face mask in the wake of the coronavirus pandemic, becoming the first member of the Trump family to publicly don a face covering.\n\"As the CDC studies the spread of #COVID-19, they recommend people wear cloth face coverings in public settings when social distancing can be hard to do,\" the first lady posted on her social media accounts. \"Remember, this does NOT replace the importance of social distancing.\"\nThe tweet with the still photo came shortly after Trump posted a video of herself holding the mask in her hands, stating the US Centers for Disease Control and Prevention guidelines.\nMelania Trump posted this graphic to her twitter on Thursday, April 9.\nThe first lady's visual endorsement of federal guidelines for wearing cloth face coverings comes several days after the CDC updated its guidance for the public. On April 3, the recommendations were adjusted to suggest Americans wear non-medical cloth coverings when in public, in large part to prevent the spread of the virus via those who are asymptomatic carriers.\nTrump taped both Thursday's video message and one posted Wednesday thanking medical personnel and frontline workers earlier this week at the White House, according to a White House official.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/melania-trump-face-mask-coronavirus/index.html"}