{"authors": [], "date_download": "2020-05-04 20:15:51", "date_modify": "2020-05-04 20:15:51", "date_publish": "2020-04-08 12:26:09", "description": "ST. PAUL, Minn. (AP) — The Latest on the coronavirus outbreak in Minnesota (all times local): 2:15 p.m. Gov. Tim Walz said Wednesday he is extending Minnesota’s stay-at-home order...", "filename": "_011cb670c68597b62471271d2e9d17f1_1588623351.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_011cb670c68597b62471271d2e9d17f1_1588623351.html", "title": "The Latest: Walz extends stay-at-home order until May 4", "title_page": "The Latest: Walz extends stay-at-home order until May 4", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ST. PAUL, Minn. (AP) — The Latest on the coronavirus outbreak in Minnesota (all times local):\n2:15 p.m.\nGov. Tim Walz said Wednesday he is extending Minnesota’s stay-at-home order until May 4.\nWalz had imposed the order to slow the spread of the coronavirus. It originally was scheduled to end Friday. But while Walz says Minnesotans have responded well to the order, he notes in his new emergency executive order that confirmed cases of COVID-19 are rapidly increasing in Minnesota, and community spread of the disease also is increasing in the state and nation.\nThe Minnesota Department of Health reported 85 new cases Wednesday, raising the state’s total to 1,154, and it reported five new deaths for a total of 39.\n___\n10:15 a.m.\nMinnesota Attorney General Keith Ellison says a Pine County District Court has issued a temporary restraining order blocking action taken by a landlord against some tenants during the coronavirus pandemic.\nEllison filed a complaint and motion for the temporary restraining order on Friday against Howard Mostad who had disconnected utility services for a Sandstone family who was sheltering in place with a four-year-old child who has an underlying health condition.\n“To protect ourselves and all Minnesotans from this virus, we need everyone to shelter in place and stay home. It’s hard enough to afford your life during the emergency, but to have a landlord try to force out a family illegally doesn’t hurt only them, it hurts every Minnesotan,” Ellison said.\nMostad was ordered this week to restore the family’s utility service and has been barred from taking further actions that interfere with their ability to live at the property. An affidavit said the tenants had no electricity, heat or running water.", "url": "https://apnews.com/011cb670c68597b62471271d2e9d17f1"}