{"authors": ["Danielle Wiener-Bronner", "Cnn Business"], "date_download": "2020-05-04 16:02:38", "date_modify": "2020-05-04 16:02:38", "date_publish": "2020-04-01 19:18:26", "description": "It may not feel like it, but Easter is just around the corner.", "filename": "2020_04_01_business_easter-shopping-coronavirus_index_1588608158.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401135136-peeps-candy-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_easter-shopping-coronavirus_index_1588608158.html", "title": "What the pandemic means for your Easter food shopping", "title_page": "What the pandemic means for your Easter food shopping - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) It may not feel like it, but Easter is just around the corner.\nLast year, about 80% of Americans planned to celebrate the holiday, according to the National Retail Federation . In 2019, most people said they planned to spend the day with family and friends and cook a holiday meal.\nThis year, social distancing practices designed to help stop the spread of the coronavirus pandemic mean large gatherings are off the table for most.\nBut people may still want to cook for themselves or their families.\n\"We are likely to see people still wanting to commemorate Easter in some way,\" said Katherine Cullen, senior director of industry and consumer insights for the National Retail Federation's research team. She noted that the 80% figure has generally held steady \"regardless of where consumer confidence is.\"\nThat's good news for the food companies and retailers that typically get a boost in sales around the holiday. This year, they're trying to make sure that shoppers are able to get traditional Easter foods, despite the tumultuous time. Still, shoppers may have to plan further ahead than usual or spend a little more.\nHere's what to expect if you plan to cook at home this Easter.\nHam\nHam producers want to make sure shoppers can buy what they need for the holiday.\nFor Honey Baked Ham, Easter is an important time.\n\"Easter is one of our highest selling volumes times of the year,\" Jo Ann Herold, the company's chief marketing officer, told CNN Business in an email. She added that \"demand remains positive for our retail products including ham and turkey.\"\nThis year, Honey Baked is offering $10 off to customers who pick up their hams from stores between April 3 and April 8, ahead of the April 12 holiday.\n\"We are extending what is typically a 3-day high-volume period to span over 8 days,\" explained Dan McAleenan, senior vice president of store operations. By spreading the shopping period out, Honey Baked hopes to reduce crowding in stores. It's also offering delivery via Uber Eats, limiting the amount of customers who can enter stores, holding special hours for senior citizens and taking other measures to try to keep customers and employees safe.\nMeat producer Smithfield Foods is also taking steps to ensure that shoppers are able to get ham this Easter.\nThe company has added more than 13 million pounds of bone-in and spiral hams this year to meet customer demand, John Pauley, the company's chief commercial officer of packaged meats, told CNN Business in an email.\nHe added that the company is also shipping out hams earlier than usual to make sure they arrive on time and working with its retail partners to make sure hams are available online and for pickup.\nEggs\nA surge in demand drove up egg prices in March.\nA surge in demand for eggs has sent prices through the roof in recent weeks. To keep up with the shopping frenzy, retailers ordered more eggs than usual, depleting egg producers' Easter supply.\nFarmers can't instruct their hens to lay more eggs to meet a sudden rush on eggs. But that doesn't mean that customers won't be able to find eggs this Easter.\nSome institutional egg buyers, like restaurants or cafeterias, are closed. That means that some of those eggs could be redirected to grocery store shelves.\n\"It does look like the supply side is starting to catch up a little bit,\" said Brian Moscogiuri, director and egg analyst at Urner Barry, a commodity market research firm, adding that \"prices are finally starting to stabilize.\"\nPlus, people who stocked up on eggs a few weeks ago might not come back for more now. \"Consumers have a lot of inventory in their own refrigerators,\" he said. Because of that, producers \"likely won't need that same Easter inventory that they were projecting.\"\nBut, Moscogiuri warned, \"we could still see a run on eggs.\"\nShoppers should still be able to find eggs for Easter, but they might be pricey. And customers might not be able to buy as much as they want. Some retailers have been limiting sales of eggs to prevent more hoarding. Others might raise prices, either because they're paying more for eggs or to try to ration supply, noted Moscogiuri.\nPeeps\nJust Born makes more than two billion Peeps a year.\nEaster is particularly important for niche candy manufacturers, said Neil Saunders, managing director of GlobalData Retail, a research and consulting firm.\nHershey HSY \"It's really important for Peeps,\" he said, because the colorful marshmallow chicks and bunnies are so tightly linked with Easter. Other candy makers, likeor Mars, sell their products throughout the year and on holidays like Halloween and Valentine's Day.\nAlthough people tend to buy perishable food items like ham or eggs just a few days before holidays, they may shop for more shelf-stable goods, like chocolate, ahead of time. And because candy sellers tend to extend their seasons as much as possible, shoppers have been seeing Easter candy on shelves since February.\nUnder these circumstances, that's an advantage — especially for Peeps maker Just Born, which has temporarily closed its production facilities in Pennsylvania.\n\"Thankfully, all of our production was pretty much done, already shipped and on its way to retailers even before the plant closed,\" said Matt Pye, senior vice president of sales and marketing.\nJust Born makes more than two billion Peeps a year, he said, and most of them are for Easter. It also makes Mike And Ike, Hot Tamales and Goldenberg's Peanut Chews. The company expects to make most of its Easter Peeps sales right around now.\n\"The two weeks before any holiday, especially for candy, are the most important,\" Pye said.\nThis year, sales are down up to 12% compared to last year, according to national retailers who sell Peeps, said Pye. That could be because Easter is earlier this year than last, which means there's a shorter shopping period between Valentine's Day — the most recent big candy holiday — and Easter.", "url": "https://www.cnn.com/2020/04/01/business/easter-shopping-coronavirus/index.html"}