{"authors": ["Por Tim Reynolds"], "date_download": "2020-05-04 20:09:38", "date_modify": "2020-05-04 20:09:38", "date_publish": "2020-04-08 20:55:12", "description": "Kevin Garnett encontró siempre que Seattle era una aduana difícil para sus adversarios. Disputó 27 partidos en esa ciudad durante su carrera en la NBA y sólo ganó ocho veces. El pívot...", "filename": "_f349a21afc914eeba6bb4fb67603cf8c_1588622978.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8189136eabf04fb883728fb0306e48f5/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f349a21afc914eeba6bb4fb67603cf8c_1588622978.html", "title": "Entrevista AP: Garnett habla de Kobe, Salón de la Fama", "title_page": "Entrevista AP: Garnett habla de Kobe, Salón de la Fama", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ARCHIVO - En esta foto del 18 de julio del 2012, Kevin Garnett sonríe en una conferencia de prensa de la NBA. El 8 de abril del 2020 habló en entrevista con The Associated Press sobre su ingreso al Salón de la Fama, su rivalidad con Kobe Bryant y su predilección por Seattle. (AP Photo/Mary Altaffer)\nARCHIVO - En esta foto del 18 de julio del 2012, Kevin Garnett sonríe en una conferencia de prensa de la NBA. El 8 de abril del 2020 habló en entrevista con The Associated Press sobre su ingreso al Salón de la Fama, su rivalidad con Kobe Bryant y su predilección por Seattle. (AP Photo/Mary Altaffer)\nKevin Garnett encontró siempre que Seattle era una aduana difícil para sus adversarios. Disputó 27 partidos en esa ciudad durante su carrera en la NBA y sólo ganó ocho veces.\nEl pívot recuerda esos días con respeto.\nEsta semana, en una extensa entrevista con The Associated Press, Garnett habló de varios temas, incluyendo el anuncio surgido el fin de semana, de que oficialmente será integrante del Salón de la Fama como miembro de la generación del 2020. Hizo también referencia a su relación con Kobe Bryant, elegido también como nuevo miembro del recinto, a un par de meses de su deceso.\nY habló además de la pandemia de coronavirus y de sus planes para los próximos cinco a diez años.\nPero también hubo una sorpresa: Garnett reveló una profunda afinidad con Seattle y llegó a decir que le gustaría ver a la NBA de vuelta en esa ciudad _hasta aseguró que llevaría un equipo ahí si pudiera.\n“Si tengo un sueño, diría que quisiera poder comprar a los SuperSonics de Seattle y reactivar la zona noroeste en la costa del Pacífico”, dijo Garnett. “Seattle fue enorme para la liga. Me encantaría hacer eso. Si hubiera algo que pudiera hacer mañana, eso haría”.\nEn estos días es común ver que Garnett piensa en grande.\nLa semana pasada, se enteró de que sería elegido oficialmente al Salón de la Fama como parte de un grupo de nueve personas que incluyen a cuatro exjugadores _a él mismo, Bryant, Tim Duncan y Tamika Catchings.\nReconoció que aún disfruta al recordar sus enfrentamientos con Bryant y Duncan.\n“Me gusta pensar que el acero afila el acero y que los tres nos empujamos mutuamente para ser lo mejor que podíamos”, agregó Garnett. “El entrar con una clase como esta es más que un honor”.\nLa noticia llegó en un momento en el que la pandemia de coronavirus eclipsa todo lo demás. Garnett ha limitado la cantidad de noticias que recibe, asegurando que mucho de lo que observa lo “asusta”.\n“Seré honesto, sólo me estoy alimentando de cosas que me mantienen estimulado y me ejercito mucho”, dijo. “Debería tener la capacidad de correr un maratón cuando esto termine... me he desconectado de toda esta bestia. Me estoy alimentando de libros y documentales”.\nSon distracciones necesarias en un año que ha sido difícil.\n“No lo voy a afrontar, desde que murió Kobe, ha sido como si el año estuviera de cabeza. El 2020 ha sido (terrible)”, dijo Garnett. “Entonces sólo he intentado mantenerme y apreciar algunas de las pequeñas cosas intangibles y realmente disfrutar de la vida un poco e intentar ser productivo”.\nPara Garnett esa pasión se entrelaza con la de Kobe: crear contenido. Bryant estaba conectando con la gente mediante libros para niños, documentales y otros proyectos.\nGarnet ostenta una diversidad similar en sus planes para crear contenido.\nTiene una empresa llamada “Content Cartel” en la que está trabajando para ayudarla a crecer incluso cuando el baloncesto se encuentra en pausa por lo menos durante algunas semanas más.", "url": "https://apnews.com/f349a21afc914eeba6bb4fb67603cf8c"}