{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:05:28", "date_modify": "2020-05-04 20:05:28", "date_publish": "2020-04-07 13:13:33", "description": "With its biggest one-day jump yet, New York City’s death toll from the coronavirus officially eclipsed the number of those killed at the World Trade Center on 9/11. At least 3,202 people...", "filename": "_7b53420f83c8e32fff37065cf35eed29_1588622728.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9d279484a289425595390e4c0c9db44a/1978.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7b53420f83c8e32fff37065cf35eed29_1588622728.html", "title": "What you need to know today about the virus outbreak", "title_page": "What you need to know today about the virus outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "What you need to know today about the virus outbreak\nPresident Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Tuesday, April 7, 2020, in Washington. (AP Photo/Alex Brandon)\nPresident Donald Trump speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Tuesday, April 7, 2020, in Washington. (AP Photo/Alex Brandon)\nWith its biggest one-day jump yet, New York City’s death toll from the coronavirus officially eclipsed the number of those killed at the World Trade Center on 9/11.\nAt least 3,202 people have died in New York City from COVID-19, according to the count released Tuesday by the city . Across the U.S., the death toll reached about 11,000, with around 370,000 confirmed infections.\nIn Britain, Prime Minister Boris Johnson remained in intensive care with the virus, while Japan’s leader declared a monthlong state of emergency for Tokyo and six other regions to keep the virus from ravaging the world’s oldest population.\nHere are some of AP’s top stories Tuesday on the world’s coronavirus pandemic. Follow APNews.com/VirusOutbreak for updates through the day and APNews.com/UnderstandingtheOutbreak for stories explaining some of its complexities.\nWHAT’S HAPPENING TODAY:\n— The latest statistical models show a glimmer of hope, forecasting fewer deaths in the U.S. before August. The only problem with this bit of relatively good news? It’s almost certainly wrong. All models are wrong. Some are just less wrong than others — and those are the ones that public health officials rely on .\n— Defending his administration’s response to the coronavirus, President Donald Trump falsely asserted that travelers at U.S. airports are being routinely tested for COVID-19, made groundless accusations against a watchdog and wrongly claimed the Obama administration did nothing during a flu pandemic.\n— As tens of millions of people turn to video conferencing to stay connected during the coronavirus pandemic , many have reported hackers joining in, making threats, interjecting racist, anti-gay or anti-Semitic messages, or showing pornographic images. The attacks have drawn the attention of the FBI and other law enforcement agencies.\n— President Donald Trump threatened to freeze U.S. funding to the World Health Organization , saying the international group “missed the call” on the coronavirus pandemic.\n— In a housing complex in the Moroccan city of Sale, more than 900 people live in crowded rooms without running water or an income to support them. While the North African country entered total lockdown in mid-March, self-isolation and social distancing are a luxury that families in this complex cannot afford .\n— The measure of a nation — its DNA, or sometimes its political system — becomes more visible when its leader is stricken in office. How to respond, and what to tell — or not tell — the populace? The hospitalization of British Prime Minister Boris Johnson, the first head of government to be stricken by the coronavirus, has pushed this matter to the fore in the United Kingdom .\n___\nWHAT YOU NEED TO KNOW:\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death. The vast majority of people recover.\nHere are the symptoms of the virus compared with the common flu.\nOne of the best ways to prevent spread of the virus is washing your hands with soap and water. The U.S. Centers for Disease Control and Prevention recommends first washing with warm or cold water and then lathering soap for 20 seconds to get it on the backs of hands, between fingers and under fingernails before rinsing off.\nYou should wash your phone, too. Here’s how.\nTRACKING THE VIRUS: Drill down and zoom in at the individual county level , and you can access numbers that will show you the situation where you are, and where loved ones or people you’re worried about live.\n___\nONE NUMBER:\n— 3,039 : That’s the number of new cases in Italy in a 24-hour period. Italy hasn’t seen such a low daily number since the early weeks of the outbreak. In total, Italy has 135,586 confirmed cases and 16,523 deaths from the COVID-19 outbreak.\n___\nIN OTHER NEWS :\n— 90-YEAR-OLD SURVIVOR : Anna Fortunato, a 90-year-old survivor of COVID-19, has a message for the rest of us: Do not be afraid. Do not despair.\n— YOUNG PILOT : A 16-year-old pilot has turned his flying lessons into missions of mercy, bringing desperately needed supplies to rural hospitals in need.\n— CELEBRITIES UNVARNISHED : They may be revealing a new side to their lives during the lockdown, but there also has been backlash to the wealth inequity regular Americans see online.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/7b53420f83c8e32fff37065cf35eed29"}