{"authors": ["Dan Merica"], "date_download": "2020-05-04 16:25:42", "date_modify": "2020-05-04 16:25:42", "date_publish": "2020-04-07 10:09:28", "description": "Steve Benjamin, the Democratic mayor of Columbia, South Carolina, was fed up as he waited for his state's Republican governor to follow in the footsteps of states up and down the East Coast and issue a statewide stay-at-home order.", "filename": "2020_04_07_politics_mayors-response-coronavirus_index_1588609542.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406171512-erin-mendenhall-mayor-salt-lake-city-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_mayors-response-coronavirus_index_1588609542.html", "title": "Mayors take lead in states where governors fight stringent stay-at-home orders", "title_page": "Mayors take lead in states where governors fight stringent stay-at-home orders - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Steve Benjamin, the Democratic mayor of Columbia, South Carolina, was fed up as he waited for his state's Republican governor to follow in the footsteps of states up and down the East Coast and issue a statewide stay-at-home order.\nAfter Gov. Henry McMaster defended his decision to abstain from taking the statewide step, Benjamin -- along with the city's council -- implemented a city-wide stay at home order in late March, telling CNN at the time that while he would \"relish a statewide action by the governor,\" the \"lack aggressive action\" by McMaster made it clear that the city had to \"step up.\"\nThis local drama has played out in other parts of the country in response to the novel coronavirus, with the officials in large metropolitan areas leading the response to the pandemic in states where governors have fought issuing sweeping statewide orders.\nMcMaster, days after defending South Carolina as a \"unique\" place where a stay-at-home order is not needed, ended up issuing a statewide order on Monday that required South Carolinians to stay home unless they are working, visiting family, getting exercise or shopping for needed goods.\n\"This is a stay-at-home order. You call it what you like,\" he said when pressed by a reporter.\nA total of seven states -- all led by Republicans -- have resisted calls to issue strict stay-at-home orders, with most arguing that more rural, sparsely populated states do not need stringent orders comparable to those being implemented in New York and California. Some Republican governors, like those in Texas, Georgia and Florida, fought off persistent calls for days before they issued statewide orders.\nThe dynamics in these states -- with city and county officials from Utah to Mississippi to South Carolina taking more aggressive steps earlier -- has highlighted a gaping divide that splits largely play out along party lines: At the state level, Republicans control the executive office, while metro areas are run by Democrats\nSome mayors, like Benjamin, have been blamed politics for the hesitance, accusing the statewide leaders of not wanting to go beyond their Republican standard bearer, President Donald Trump, who has worried about the impact sweeping orders could have on businesses.\nMcMaster is being \"deferential to the president,\" Benjamin told CNN before the governor issued the order, causing the mayor to be \"at a loss as to why any public official would not do everything in their power to try and save those lives. The governor should be doing more.\"\nBenjamin, after McMaster's order on Monday, said people are \"still unsure as to why it took him so long to act when the data has been crystal clear and dozens of South Carolinians have now been lost.\"\n\"But we welcome the governor to the fight,\" Benjamin said. \"We've been waiting on him.\"\nFrom Utah to Mississippi\nMcMaster is far from alone in resisting calls from local leaders.\nRepublican Utah Gov. Gary Herbert has fought off calls for a statewide order, despite leaders from Salt Lake County, the state's largest, explicitly calling on the governor to make the move.\n\"Every county in the state relies on metropolitan hospitals for critical care needs,\" said Salt Lake City Mayor Erin Mendenhall, a Democrat. \"A statewide order is necessary to slow the spread everywhere, so we don't overwhelm our hospitals.\"\nMendenhall highlighted nationwide concerns that hospitals across the country could be overrun, especially in rural areas where hospital capacity is lower.\nWhile McMaster and Herbert are still holding out on statewide orders, other Republican governors, like Greg Abbott in Texas, Brian Kemp in Georgia and Tate Reeves in Mississippi, spent days fighting off a statewide order before they shifted.\nThe most notable was Florida Gov. Ron DeSantis, who spent weeks fighting off calls for more sweeping action in the face of spring breakers partying on the state's beaches and some of the largest cities in the state pleading for more statewide action. He only decided to move when Trump, whom the governor is close with, struck a more somber tone during a press conference on March 31.\n\"It is a very serious situation,\" DeSantis said of the virus the next day. \"When you see the President up there and his demeanor the last couple of days, that's not necessarily how he always is.\"\nThe conflict has most notably played out in states where the urban-rural divide is starker.\nChokwe Lumumba, the Democratic mayor of Jackson, Mississippi, ordered sweeping closures in his city of 166,000 last week, at the same time that Reeves was actively dismissing calls for a statewide order.\n\"What's best for Oxford and what's best for Tishomingo aren't exactly the same,\" Reeves said in an interview with Mississippi Today in late March, naming a college town of 23,000 and a tiny town of under 400 in Northern Mississippi. He added that he believes some of the pushback against his orders were politically driven even as he allows cities to go beyond his measures.\nBut days after that interview, Reeves shifted his position and issued a statewide order, saying that this \"is a somber time, for our country and our state\" and that his health experts finally advised him it was time for a shelter in place.\n\"They told me we are now at the point in Mississippi's cycle where such drastic restrictions are required,\" he said in a statement.\nLumumba, however, sees politics, lamenting that many Republican \"politicians nationwide have staked their political futures on being in line with\" the President.\n\"We are in a highly politically charged environment and we were prior to the virus spreading as it has globally,\" Lumumba told CNN in an interview. \"And I think that some individuals have found it difficult to break from that partisan rhetoric and really recognize that this virus cares very little for your political ideology.\"\nBut the divides between governor and mayors have gone beyond partisan lines\nIn Oklahoma, for example, the Republican mayor of Oklahoma City, David Holt, issued a citywide stay at home order in mid-March, weeks before the state's Republican governor, Kevin Stitt, issued a statewide order on April 2.\nStitt's order has been confusing, with some reading it as a fully enforced stay at home order and others seeing it as a more lenient measure, in part because the governor has avoided calling it a stay at home order and instead uses the term \"safer at home.\"\nHolt said Stitt \"clearly avoided\" some of the more direct terminology that other states have used to describe their orders, like \"shelter in place,\" which is what the mayor has been calling his own order.\n\"One thing I have learned from this is no one reads the proclamations,\" Holt said in an interview. \"You can labor over the legal language, but what matters more is what you say, the messaging.\"\nHe added: \"We have found in Oklahoma City that the shelter in place language is more powerful and more effective. ... There are 10 people who have read my proclamation and they are me and my staff.\"\n'The cities that have taken the lead here'\nArguably the clearest example of the state vs. local divide is in Texas, where a majority of the state's residents were under stay at home orders from their cities and counties long before Abbott took action.\nAbbott had long taken a more measured approach to fighting the virus and avoided rhetoric like that of Republican Texas Lt. Gov. Dan Patrick, who suggested older Americans would be willing to die of coronavirus as a way to keep the economy moving. But eventually the governor, after dismissing calls for more action, issued a statewide order on March 31.\nEven still, Abbott's slower response -- especially in a state with major metropolitan areas -- led to conflict with some Texas mayors.\n\"The governor took the position that the cities and counties are all different and he didn't want to issue something\" overly broad, Austin Mayor Steve Adler told CNN before Abbott's statewide order. \"It really has been the cities that have taken the lead here.\"\nAdler, along with Travis County Judge Sarah Eckhardt, issued a stay-at-home order on March 24.\nBefore Abbott issued his order, city and county leaders Texas, including in Dallas, Austin, Houston, San Antonio and El Paso, all issued versions of the orders for residents of their areas.\nAdler, like others, blames the political positioning as the reason Republican state leaders have been resistant to issue broad statewide orders.\n\"Too many times we see the President's tenor and own political priorities being reflected in our state leadership and other states,\" Adler concluded. \"The President's politics have a significant impact and influence on what we see happening at state levels.\"", "url": "https://www.cnn.com/2020/04/07/politics/mayors-response-coronavirus/index.html"}