{"authors": ["Michael R. Blood"], "date_download": "2020-05-04 20:22:51", "date_modify": "2020-05-04 20:22:51", "date_publish": "2020-04-20 22:00:09", "description": "LOS ANGELES (AP) — Mayor Eric Garcetti released a pandemic-wounded spending plan Monday for the coming year that he called “a document of our pain” that includes service cuts and furloughs for...", "filename": "_1ee927809987b748f0c9f19dbbc0512c_1588623771.html", "image_url": "https://storage.googleapis.com/afs-prod/media/39b00be8f3424d3bbcde8d95d52352d4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1ee927809987b748f0c9f19dbbc0512c_1588623771.html", "title": "LA mayor calls for cuts, furloughs as virus shakes City Hall", "title_page": "LA mayor calls for cuts, furloughs as virus shakes City Hall", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This photo from streaming video provided by the Office of Mayor Eric Garcetti shows Los Angeles Mayor Eric Garcetti giving his annual State of the City speech in an otherwise empty City Hall council chamber Sunday, April 19, 2020. He said thousands of Los Angeles city workers must take 26 furlough days, the equivalent of a 10 percent pay cut, over the course of the next fiscal year as the nation's second-largest city deals with the economic fallout from the COVID-19 crisis. Garcetti warned of an economic blow far worse than the 2008 recession, when city leaders laid off hundreds of workers and eliminated thousands of jobs. (Office of Mayor Eric Garcetti via AP)\nThis photo from streaming video provided by the Office of Mayor Eric Garcetti shows Los Angeles Mayor Eric Garcetti giving his annual State of the City speech in an otherwise empty City Hall council chamber Sunday, April 19, 2020. He said thousands of Los Angeles city workers must take 26 furlough days, the equivalent of a 10 percent pay cut, over the course of the next fiscal year as the nation's second-largest city deals with the economic fallout from the COVID-19 crisis. Garcetti warned of an economic blow far worse than the 2008 recession, when city leaders laid off hundreds of workers and eliminated thousands of jobs. (Office of Mayor Eric Garcetti via AP)\nLOS ANGELES (AP) — Mayor Eric Garcetti released a pandemic-wounded spending plan Monday for the coming year that he called “a document of our pain” that includes service cuts and furloughs for nearly 16,000 workers to manage economic fallout from the coronavirus crisis.\nIf approved, residents will wait longer to have trees trimmed, graffiti removed and streets and sidewalks fixed. Core services including police, trash pickup and firefighting will be largely safeguarded, but just about anything else is likely to take a hit. Even funds for closing illegal marijuana shops that proliferate in the city would be slashed.\nAnd it could get worse, with much uncertainty about the spread of the virus, the direction of the state and national economy and when government stay-at-home orders will be lifted.\n“Hard times are ahead,” the mayor said during a televised briefing. “There will be cuts.”\nThe spending reductions in Los Angeles are likely to be a sign of what’s to come at city halls across the nation, as jobless lines grow and local treasuries see steep drops in sales, hotel and other taxes they rely on to operate and provide services.\nIn New York, Mayor Bill de Blasio is proposing deep cuts in services over the next year, as the city grapples with the virus and its aftermath. His plans include suspending a summer-job program for young people, delaying expansion of a free prekindergarten program for 3-year-olds and closing city pools this summer.\nA survey conducted by the National League of Cities found nearly universal agreement that cities would be hit by revenue shortfalls this year related to the outbreak, and in many cases furloughs and layoffs would be used to close budget gaps.\nIn Los Angeles, Garcetti warned in a letter accompanying the $10.5 billion proposed budget for the year that begins July 1 that “the road back to where we were will be long and difficult.”\nHe called the city’s financial future “unpredictable.”\nRevenue growth in the coming year is expected to slow to less than 2%, compared to an average growth of 4.5% over the last six years. And since the crisis began, revenue estimates for next year dropped by over $230 million.\nWhile the budget is expected to keep growing in the coming year, the mayor said costs keep going up, including for dealing with the virus outbreak and the cost of living. Firefighters and other city employees are scheduled to receive pay raises.\n“It’s like a household. You can have 2% more come into your household, but that doesn’t mean that it keeps up with your costs,” he said.\nGrowth in the budget is expected to come largely from property taxes, even as sales and hotel taxes are projected to fall.\nLife in the nation’s second most populous city has been largely unrecognizable with most residents staying at home. Notoriously congested freeways have been wide open, with only workers deemed essential still on the job. Even so, there are few places to go, with gyms, bars, beaches and restaurant dining rooms closed to the public.\nA day earlier, the Democratic mayor recalled the 2008 recession and said, “This is bigger and it will hurt more.” In a tourism-reliant economy, he said hotel reservations had collapsed and airport passenger traffic had all but vanished.\n“From a fiscal perspective, this is the worst it’s ever been,” he said.\nThe spread of the potentially lethal virus has reshaped an administration that had been largely focused on an intractable homelessness crisis, and also benefited from years of budget growth from a strong economy.\nAs tax revenues sink, millions have been invested in testing and other costs related to the outbreak: an estimated $60 million by the end of April, though much of that spending could eventually be covered by federal aid.\nThe city had been under a hiring freeze. Under the mayor’s proposal, thousands of civilian city workers would take 26 furlough days, the equivalent of a 10% pay cut, in the coming year.", "url": "https://apnews.com/1ee927809987b748f0c9f19dbbc0512c"}