{"authors": [], "date_download": "2020-05-04 20:31:42", "date_modify": "2020-05-04 20:31:42", "date_publish": "2020-04-30 15:43:31", "description": "The Kentucky Turtle Derby will feature thoroughbreds like Sir-Hides-A-Bunch, American Toruga and Galapa-GO! in the field.", "filename": "entry_kentucky-turtle-derby_n_5eaaeecdc5b63c7a1d4ded97_1588624302.html", "image_url": "https://img.huffingtonpost.com/asset/5eaaf05a220000c20d827f06.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kentucky-turtle-derby_n_5eaaeecdc5b63c7a1d4ded97_1588624302.html", "title": "Kentucky Derby Fans Can Watch Turtles Race Instead Of Horses This Weekend", "title_page": "Kentucky Derby Fans Can Watch Turtles Race Instead Of Horses This Weekend | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Losing the Kentucky Derby has left race fans shell-shocked.\nThe first Saturday in May has yielded to the legs of a bunch of slowpokes: Seattle Slow headlines a field of turtles — yes, turtles — that will race in the Kentucky Turtle Derby.\nCall it, the slowest eight minutes in sports.\nThe race is more methodical marathon that mad dash to the finish — though the victor can win at the line by a turtleneck rather than a nose — and is just one more offbeat sport that has had a moment during the coronvirus pandemic.\nThe Derby, America’s longest continuously held sports event, had been scheduled for May 2. It will now be run Sept. 5, kicking off Labor Day weekend. It’s the first time the Derby won’t be held on its traditional first Saturday in May since 1945, when it was run June 9. The federal government suspended horse racing nationwide for most of the first half of the year before World War II ended in early May, but not in time to hold the first leg of the Triple Crown that month.\nLooking for a slower substitute, the first Kentucky Turtle Derby was hatched.\nThe Courier-Journal headline from 1945 read: “167 Turtles Arrive for Races Saturday” and about 6,500 fans filled the Jefferson County Armory for the 8 p.m. post time. The event went down like this: 20 turtles were herded into seven qualifying races and the winners went on to compete in a 20-foot finale.\nThe Kentucky Derby Museum reported that Broken Spring paid $2.50 on his win and $8,000 was raised to support a local children’s health charity.\nWith Old Forester signed on as a sponsor, Saturday’s race will run at 7 p.m. on YouTube.com/OldForester.\nThe sounds may be familiar for Derby fans: Triple Crown announcer Larry Collmus is calling the race and bugler Steve Buttleman will serenade viewers prior to the turtles taking off.\n“I don’t think I’ve called a race that’s eight minutes long,” Collmus said. “I’m going to have to drink plenty of water to prepare for that one. With the Kentucky Derby, there’s months of preparation getting to know all the horses, getting the names in your head. These turtles, they’re going to be a little bit new to me.”\nThe Derby was first run in 1875 and has gone uninterrupted, even through the Great Depression and World Wars I and II. In 1943, there were travel restrictions imposed by World War II and no out-of-town tickets were sold. Still, the Derby went on, with Count Fleet winning in front of 65,000. The colt won the Triple Crown that year.\nYes, in the slow-and-steady-wins-the-race tradition of turtles, the event is finally back.\nThe turtle race will actually be pre-taped in Chicago with the likes of Sir-Hides-A-Bunch, American Toruga and Galapa-GO! in the field. There was no immediate word if Leonardo, Michelangelo, Donatello or Raphael would be eligible to compete.\n“It is weird, but there’s been a lot of weird going on the last couple of months in this country,” Collmus said. “It will be like the Derby broadcast. Just turtles instead.”\nAnd one big shell-abration at the end.\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\nDominic Udell/Brown-Forman via AP The Kentucky Derby has been postponed so sports fans in the state will be betting on turtle races this weekend.", "url": "https://www.huffpost.com/entry/kentucky-turtle-derby_n_5eaaeecdc5b63c7a1d4ded97"}