{"authors": ["Maria Santana", "Cnn En Español Correspondent Anchor"], "date_download": "2020-05-04 16:55:53", "date_modify": "2020-05-04 16:55:53", "date_publish": "2020-04-09 03:09:14", "description": "Milly Quezada, also known as the \"Queen of Merengue,\" is making an emotional plea to her millions of fans as she reveals she is reeling from the sudden loss of a close family member and former bandmate to the coronavirus pandemic.", "filename": "2020_04_08_us_milly-quezada-brother-in-law-dies-coronavirus_index_1588611353.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408205046-02-fausto-arias-death-milly-quezada-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_milly-quezada-brother-in-law-dies-coronavirus_index_1588611353.html", "title": "Milly Quezada:Queen of Merengue's brother-in-law died from coronavirus", "title_page": "Milly Quezada:Queen of Merengue's brother-in-law died from coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Milly Quezada, also known as the \"Queen of Merengue,\" is making an emotional plea to her millions of fans as she reveals she is reeling from the sudden loss of a close family member and former bandmate to the coronavirus pandemic.\n\"Stay home! I plead, I ask you. Stay home against all your wishes to go out there,\" the multi Latin Grammy-winning artist told CNN Espanol. \"Covid-19 is killing people.\"\nOne of those people is her brother-in-law, Pastor Fausto Arias, who passed away in a New Jersey hospital last Sunday after testing positive for the virus. Arias is married to Quezada's sister, Jocelyn Arias.\nThe couple, the heartbroken singer says, met and fell in love in the late 1970s when together they were all part of what would become the history-making group, \"Milly, Jocelyn y Los Vecinos.\"\nAt the time, merengue, a lively and rhythmic type of music born in the Dominican Republic, was a male-dominated genre. This was the first such band fronted by women to gain critical acclaim, even becoming the first Latin musical act to play at a US presidential inauguration, George H.W. Bush's in 1990. While the sisters sang, Arias played the trombone.\nRead More", "url": "https://www.cnn.com/2020/04/08/us/milly-quezada-brother-in-law-dies-coronavirus/index.html"}