{"authors": ["Jeffrey Collins"], "date_download": "2020-05-04 20:13:26", "date_modify": "2020-05-04 20:13:26", "date_publish": "2020-04-09 14:47:56", "description": "COLUMBIA, S.C. (AP) — For the third week in a row, the number of people who live or work in South Carolina saying they lost their jobs because of the coronavirus outbreak increased. More...", "filename": "_fc3428f78a79de7135c294caa98dc04b_1588623206.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6ebe21a04ef64ffdae42816dfe310e44/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fc3428f78a79de7135c294caa98dc04b_1588623206.html", "title": "COVID-19 job losses top 181,000 in South Carolina", "title_page": "COVID-19 job losses top 181,000 in South Carolina", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A volunteer loads groceries at a drive-thru and pick up location at Harvest Hope Food Bank Wednesday, March 18, 2020, in Greenville, S.C. Harvest Hope helps low income families and senior citizens. (AP Photo/Richard Shiro)\nA volunteer loads groceries at a drive-thru and pick up location at Harvest Hope Food Bank Wednesday, March 18, 2020, in Greenville, S.C. Harvest Hope helps low income families and senior citizens. (AP Photo/Richard Shiro)\nCOLUMBIA, S.C. (AP) — For the third week in a row, the number of people who live or work in South Carolina saying they lost their jobs because of the coronavirus outbreak increased.\nMore than 85,000 people in the state filed for unemployment for the one week ending April 4, a 31% increase from the week before, the South Carolina Department of Employment and Workforce said in a statement Thursday.\nThis past week saw more job losses along the Interstate 85 manufacturing corridor. Earlier weeks saw more job losses along the coast where restaurants and bars help drive tourism.\nNearly 181,000 jobs have been lost in South Carolina over the past three weeks from restaurants, bars, manufacturers, dentist offices and a number of other businesses that have closed.\nIn January, South Carolina’s unemployment rate was 2.4% with 56,500 people looking for a job.\nThe unemployment agency said it has had to quadruple the number of call center workers needed to process claims and paid almost $18.5 million since March 15.\nWorkers who are furloughed but still get some kind of payment or benefit from their employer will be eligible for unemployment benefits, according to an executive order signed Wednesday by South Carolina Gov. Henry McMaster.\nThe coronavirus continues to spread in South Carolina. The state reported nearly 2,800 cases and 67 deaths as of Thursday afternoon, according to the state Department of Health and Environmental Control.\nDHEC said 46% of the COVID-19 deaths have been in African Americans, while in 13% of the deaths, the race is unknown. About 38% of coronavirus cases involve blacks, who make up about 27% of South Carolina’s population.\nThe state health agency said it is studying why the virus has infected and killed more African Americans , but like national researchers, they have not come up with an answer. DHEC is planning to distribute information about fighting the virus to more pastors and churches.\nFor most people, the new coronavirus causes mild or moderate symptoms. For some, especially older adults and people with existing health problems, it can cause severe illness such as pneumonia, or even death.\nSouth Carolina budget officials reported Thursday one effect from the virus has been lighter traffic.\nThe South Carolina Department of Transportation has asked for help to estimate how much it will lose in gas tax revenue and might have to cut back on road projects because recent traffic counts show 50% less traffic than normal on the state’s highways, said state Revenue and Fiscal Affairs Office Executive Director Frank Rainwater.\n___\nFollow Jeffrey Collins on Twitter at https://twitter.com/JSCollinsAP .\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/fc3428f78a79de7135c294caa98dc04b"}