{"authors": ["Travis Loller"], "date_download": "2020-05-04 20:13:54", "date_modify": "2020-05-04 20:13:54", "date_publish": "2020-04-16 15:45:21", "description": "NASHVILLE, Tenn. (AP) — The Tennessee Attorney General's Office on Wednesday defended an order that restricts abortions to prevent the spread of COVID-19. Gov. Bill Lee issued an executive...", "filename": "_cdec9f7dfcacfaa862a959fa6299dead_1588623234.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f8f482c0458d422581ce2043082c4d2f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cdec9f7dfcacfaa862a959fa6299dead_1588623234.html", "title": "Tennessee: Allowing abortions would undermine virus efforts", "title_page": "Tennessee: Allowing abortions would undermine virus efforts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 16, 2020, file photo, Tennessee Gov. Bill Lee answers questions concerning the state's response to the coronavirus during a news conference in Nashville, Tenn. Tennessee abortion providers are asking a federal judge to order that abortions can go forward despite an executive order from Gov. Lee aimed at reducing the spread of the coronavirus. Their lawyers argue in a motion filed on Monday, April 13, 2020, that Lee's order blocking “nonemergency healthcare procedures” should not apply to abortions. (AP Photo/Mark Humphrey, File)\nFILE - In this March 16, 2020, file photo, Tennessee Gov. Bill Lee answers questions concerning the state's response to the coronavirus during a news conference in Nashville, Tenn. Tennessee abortion providers are asking a federal judge to order that abortions can go forward despite an executive order from Gov. Lee aimed at reducing the spread of the coronavirus. Their lawyers argue in a motion filed on Monday, April 13, 2020, that Lee's order blocking “nonemergency healthcare procedures” should not apply to abortions. (AP Photo/Mark Humphrey, File)\nNASHVILLE, Tenn. (AP) — The Tennessee Attorney General’s Office on Wednesday defended an order that restricts abortions to prevent the spread of COVID-19 .\nGov. Bill Lee issued an executive order April 8 that placed a three-week ban on any medical procedures not necessary “to provide life-sustaining treatment, to prevent death or risk of substantial impairment of a major bodily function, or to prevent rapid deterioration or serious adverse consequences to a patient’s physical condition.”\nOn Monday, a group of Tennessee abortion providers filed an emergency motion in federal court seeking to continue providing surgical abortions. They argue that delaying abortions will “impose extreme burdens” on women by forcing them to travel long distances out of state during the pandemic or wait weeks for an abortion, exposing them to increased medical risks. In some cases, the delay could prevent a woman from having an abortion altogether by pushing them past 20 weeks gestation, after which abortions generally are not available in Tennessee.\nIn a response filed late on Wednesday, attorneys for the state argue that Lee’s order preserves personal protective equipment for emergency needs and prevents the community spread of COVID-19. The order is within the governor’s authority to protect the health and welfare of citizens, the filing states.\nExcluding abortions from the ban on nonemergency medical procedures would harm the public, government attorneys argue, “by hindering the State’s otherwise comprehensive efforts to respond to the COVID-19 pandemic.”\nAny harm to women seeking abortions is speculative, the state argues, because the abortion providers have not identified specific women who would be harmed by the delay. The state also challenges whether the abortion providers are allowed to sue on behalf of women seeking abortions.\nAttorneys for the abortion providers argue that restricting abortions actually goes against the stated purpose of Lee’s ban because carrying a pregnancy to term requires more patient-provider interactions and uses more personal protective equipment than an abortion. And if a woman travels out of state to get an abortion, that could increase the risk of spreading the virus.\nSeveral other states are grappling with similar issues.\nA federal judge on Tuesday blocked Arkansas’ order that was preventing the state’s only surgical abortion clinic from performing the procedure during the pandemic. On Monday, a 10th U.S. Circuit Court of Appeals panel ruled against an Oklahoma ban. And the 6th U.S. Circuit Court of Appeals declined to hear an appeal out of Ohio, a move that allows providers there to continue performing surgical abortions. Also Monday, a panel of the 5th U.S. Circuit Court of Appeals ruled that medication abortions —which involve taking one pill at a clinic, then taking a second pill 24 to 48 hours later, typically at home — can go forward in Texas. In Louisiana, an abortion provider on Monday filed a federal lawsuit challenging any state attempts to ban abortions during the pandemic.\nA telephonic hearing on the new motion in the Tennessee case is scheduled for Friday. The motion was filed as part of an ongoing lawsuit by abortion providers challenging a state law that requires women to attend an in-person counselling session at least 48 hours before an abortion. Both sides are awaiting a ruling in the lawsuit. The providers’ lawyers, as part of their emergency motion, also want the judge to issue a preliminary injunction preventing the state from enforcing the in-person counselling requirement.\nMedication abortions are not affected by Tennessee’s ban, according to the Center for Reproductive Rights, one of the groups filing the lawsuit. In Tennessee, medication abortions are available to women who are less than 11 weeks pregnant.\nTennessee had virus-linked 141 deaths as of Thursday, and 6,262 Tennesseans had tested positive.\nIn Shelby County, which includes Memphis, seven senior care facilities have seen outbreaks of multiple coronavirus cases, health officials said. Three residents of Carriage Court of Memphis have died, officials said.\nMayor Lee Harris said Thursday that the Shelby County Commission has approved $2.5 million in coronavirus relief funding for masks, protective suits, expanded testing and other items.\nMeanwhile, Gov. Lee announced the formation of a financial accountability group to oversee the state’s portion of the federal $2.2 trillion package to help businesses, workers and a health care system staggered by the virus. Tennessee expects to see about $2.3 billion from the fund, according to a news release from the governor’s office.\nIn other developments, Vanderbilt University announced Thursday that it will use $2.8 million it is receiving in federal coronavirus relief to directly support needy students. Eligible students will receive $1,100, and the school estimates the grants will go to about 20% of its students.\nFor most people, the coronavirus causes mild or moderate symptoms that clear up within weeks. For some, it can cause more severe illness, including life-threatening pneumonia.\n___\nFollow AP coverage of the pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/cdec9f7dfcacfaa862a959fa6299dead"}