{"authors": ["David Eggert"], "date_download": "2020-05-04 21:09:15", "date_modify": "2020-05-04 21:09:15", "date_publish": "2020-04-13 16:33:41", "description": "LANSING, Mich. (AP) — The growth in coronavirus infections in Michigan is starting to flatten due to the extraordinary restrictions on people’s movements, Gov. Gretchen Whitmer said...", "filename": "_8f4053ebd5c140b357b7a6fb525f0bba_1588626555.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ccac4c0790534782871e0f932738faac/1728.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8f4053ebd5c140b357b7a6fb525f0bba_1588626555.html", "title": "Michigan governor: Virus infection curve starting to flatten", "title_page": "Michigan governor: Virus infection curve starting to flatten", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich., Monday, April 13, 2020. The governor said the state has tough days ahead in its fight against the coronavirus pandemic, but a return to normalcy is \"on the horizon.\" (Michigan Office of the Governor via AP, Pool)\nThis provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich., Monday, April 13, 2020. The governor said the state has tough days ahead in its fight against the coronavirus pandemic, but a return to normalcy is \"on the horizon.\" (Michigan Office of the Governor via AP, Pool)\nLANSING, Mich. (AP) — The growth in coronavirus infections in Michigan is starting to flatten due to the extraordinary restrictions on people’s movements, Gov. Gretchen Whitmer said Monday.\nBut she warned that this doesn’t mean business as usual will resume quickly or soon.\n“We’ve got to make sure that we avoid a second wave at all costs. That would be devastating for our economy,” Whitmer said. “So we’re going to make decisions based on science and having a real strategic phase-in of our economy when it’s appropriate and safe to do.”\nWhitmer’s stay-at-home order is in effect through April 30 and has come under more criticism in the Republican-led Legislature. Her comments came as the state reported nearly 1,000 new COVID-19 cases and 115 additional deaths, bringing total cases to more than 25,600. Michigan’s 1,600-plus deaths are third-most in the U.S.\nTHE LATEST\nDr. Joneigh Khaldun, the state’s chief medical executive, said there are “early signs” of a plateau in the growth rate of cases, particularly in hard-hit metro Detroit. Mayor Mike Duggan said Detroit’s daily death count dropped from a high of 54 to about 22 a day over the three-day Easter weekend.\n“We’ve lost another 67 of our neighbors,” he said. “That’s a painful thing for this community. But when you look at the trend lines, we are making enormous progress.”\nHenry Ford Health System, which has hospitals mainly in southeastern Michigan, reported a five-day period in which admissions were relatively flat despite an uptick Sunday. Chief operating officer Bob Riney cautioned it doesn’t mean “we’ve hit or started a decline.”\nHealth care industry officials fear people will use the data to ease social distancing or to convince themselves “of a different narrative,” he said.\n“It’s really important that we stay very focused on the power of social distancing so that we can move from a flattening of the curve to an actual decline and coming down the other side,” Riney said.\nWhitmer said to begin opening up the economy, she must be assured that the rate of new infections is declining on a sustained basis, that hospitals are no longer at or over capacity and can handle another surge, that there is enhanced testing and contact tracing, and that workplaces have developed best practices to curb the spread of the virus.\nUNEMPLOYMENT SITE DOWN\nMichigan’s unemployment website and other online services crashed for hours due to unprecedented demand on the first day that self-employed workers and independent contractors started making claims for benefits under a federal aid package.\nJeff Donofrio, director of the state Department of Labor and Economic Opportunity, said more than 1 million people filed initial claims in a month — over a quarter of the workforce and third-most in the nation. He said claims will be backdated to reflect when workers were laid off, so they don’t lose benefits.\nTESTING FOR ANTIBODIES\nBeaumont Health, the state’s largest hospital system, launched what it called the country’s largest serological testing study for COVID-19 antibodies. It will largely involve voluntary participation by 38,000 employees, 5,000 independent physicians and their staff.\nResearchers want to know if antibodies protect against infection, how long they last, how susceptible health care workers are, and the relationship between antibody levels and the disease’s severity.\nNURSING HOMES:\nOf Detroit’s deaths over the past three days, eight were patients in nursing homes. The city will test 240 nursing home residents and staff every day over the next 10 days, he said.\nHealth officials discovered over the weekend that 30% of the residents in one nursing home and 50% in another tested positive.\n“Of the patients who weren’t showing any symptoms, nearly 50% of those tested positive,” Duggan said. “You have people who are positive before they’re showing symptoms. ... So, we are going back ... with each individual nursing home to make sure that those who are positive are appropriately isolated.”\n___\nAssociated Press writer Corey Williams in West Bloomfield, Michigan, contributed to this report.", "url": "https://apnews.com/8f4053ebd5c140b357b7a6fb525f0bba"}