{"authors": ["John Hanna", "Heather Hollingsworth"], "date_download": "2020-05-04 20:17:56", "date_modify": "2020-05-04 20:17:56", "date_publish": "2020-04-15 17:50:46", "description": "TOPEKA, Kan. (AP) — Democratic Gov. Laura Kelly faced increased pressure Wednesday from the Republican-controlled Legislature to outline plans for reopening the state's economy even as she...", "filename": "_dbec40f995b83b9a88cfe56cd1149708_1588623476.html", "image_url": "https://storage.googleapis.com/afs-prod/media/14ee778664004441a41f5236041d4f30/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_dbec40f995b83b9a88cfe56cd1149708_1588623476.html", "title": "Kansas governor squeezed on economy but extends restrictions", "title_page": "Kansas governor squeezed on economy but extends restrictions", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kansas Gov. Laura Kelly answers questions about the state's response to the coronavirus pandemic during a news conference, Wednesday, April 15, 2020, at the Statehouse in Topeka, Kan. Kelly has extended a statewide stay-at-home order through May 3, 2020. (AP Photo/John Hanna)\nKansas Gov. Laura Kelly answers questions about the state's response to the coronavirus pandemic during a news conference, Wednesday, April 15, 2020, at the Statehouse in Topeka, Kan. Kelly has extended a statewide stay-at-home order through May 3, 2020. (AP Photo/John Hanna)\nTOPEKA, Kan. (AP) — Democratic Gov. Laura Kelly faced increased pressure Wednesday from the Republican-controlled Legislature to outline plans for reopening the state’s economy even as she extended a statewide stay-at-home order and prepared to send money to hospitals struggling in the coronavirus pandemic.\nKelly is keeping her shelter-in-place directive active for all 2.9 million Kansas residents until May 3, an additional two weeks. It initially took effect March 30 and was to stay in place until Sunday, but Kelly said the coronavirus outbreak might not peak until April 29. The state saw a 4.8% increase Wednesday in confirmed coronavirus cases, to 1,494, and the number of reported COVID-19 related deaths jumped to 76, up seven from the day before.\nThe Democratic governor called a teleconference meeting with top legislative leaders to get their permission to purchase another $10 million in personal protective equipment. She also informed lawmakers of plans to provide $17 million in state funds to hospitals to offset losses until aid promised by the U.S. government starts flowing.\nBut more than 40 Republican legislators demanded in a letter that she provide a detailed plan for allowing businesses to reopen, saying “there is no excuse for us not to be prepared to rebuild.” And House Majority Leader Dan Hawkins, a Wichita Republican, admonished Kelly that the aid to hospitals helps only one segment of the economy.\n“We can’t help out the whole economy — I’m not saying we can — but the one thing we can do is to get people back to work, get people back to making money, being able to pay their bills,” Hawkins said.\nKelly already faces strong criticism from Republicans for limiting in-person worship services and religious gatherings to 10 or fewer people, which GOP leaders see as restricting religious freedom.\nShe’s also under fire from Republicans because a surge in unemployment claims from jobless workers has overwhelmed the state Department of Labor’s phone lines and website. Kelly said Wednesday that 150 workers are handling calls, up from 21 when the coronavirus outbreak began in Kansas in early March, and a team of 30 people is working around-the-clock on the processing system.\nKelly said she’s working on a plan to loosen restrictions, which could be done regionally or industry-by-industry. But she said schools won’t reopen until at least August, large gatherings may be banned for some time and the state won’t “throw the doors wide open.”\n“Life as we’ve known it won’t be the same for quite a while,” Kelly told legislative leaders. “Until we have a vaccine that works, we’re going to probably have to be dealing with some mitigation effort.”\nFor most people, the coronavirus causes mild or moderate symptoms that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness and death.\nBlack Kansans have been disproportionately affected. They’ve had 114 cases per 100,000 residents, compared to 33 cases per 100,000 for white residents as of Wednesday. Even more startling is the difference in death rates: 11.5 per 100,000 for black residents, compared to just 1.4 for white residents. However, the information is incomplete, with missing racial data for 23% of cases and 12% of deaths.\nKelly described the trend as “alarming” in a written statement and said it “points to, among other things, inequalities in healthcare.”\n____\nHollingsworth reported from Mission, Kansas.\n___\nFollow John Hanna on Twitter: https://twitter.com/apjdhanna", "url": "https://apnews.com/dbec40f995b83b9a88cfe56cd1149708"}