{"authors": ["Reporter"], "date_download": "2020-05-04 20:17:46", "date_modify": "2020-05-04 20:17:46", "date_publish": "2020-04-29 09:45:19", "description": "A group in Kansas City is bringing business to halal restaurants and food to essential workers throughout the month of Ramadan.", "filename": "entry_kansas-city-group-delivers-meals-for-fasting-muslim-medical-workers_n_5ea88850c5b6e50adaf4c2a6_1588623466.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a7042500004c10eb0847.jpeg?cache=rqk73lgyos&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kansas-city-group-delivers-meals-for-fasting-muslim-medical-workers_n_5ea88850c5b6e50adaf4c2a6_1588623466.html", "title": "The Volunteers Helping Muslim Medical Workers Break Fast During Ramadan", "title_page": "The Volunteers Helping Muslim Medical Workers Break Fast During Ramadan | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Dr. Karishma Rao was 12 hours into a 24-hour shift at a neonatal intensive care unit on Sunday when the sun set and she could break her fasting day, traditional for Muslims during the holy month of Ramadan. It’s a stressful time at Children’s Mercy hospital, with the coronavirus outbreak spreading, and the 32-year-old had no time to step out to get a bite to break her fast or to celebrate with family and friends.\nSo it was a relief when volunteers came by to drop off a free halal meal Rao could eat with fellow Muslim staffers at the hospital ― a brief moment of relief during a crisis.\n“It was a stress that was taken off for me because I already knew that there’s food there. I didn’t have to plan for it or work for it,” Rao said. “Especially knowing that you have, like, a really long shift ahead of you still, even after iftar, I think that makes a really big difference.”\nDuring the month of Ramadan, which began last Friday, Muslims embark on a daily fast from sunrise to sunset. While the majority of the Muslims are forced to celebrate at home with the closures of mosques and large gatherings banned, essential workers like medical professionals are fasting all while providing critical care for patients.\nJill Toyoshiba for HuffPost Kaitlin Abdelrahman with On Call Halal organizes and delivers halal meals to Muslim medical professionals at Kansas City-area hospitals during the month of Ramadan. Because of social distancing during the coronavirus pandemic, the meals are loaded and unloaded from the trunk of her car. On the first night, Abdelrahman delivered meals to Children's Mercy hospital, Friday, Apr. 24, 2020.\nA volunteer group called On Call Halal, launched last month by 31-year-old entrepreneur Kaitlin Abdelrahman, is aiming to provide dozens of Muslim health workers in the area with free meals to begin and break their fasts during Ramadan. The meals come from Muslim-owned restaurants that serve halal food, which is prepared through the requirements of the Islamic faith.\nThe idea occurred to Abdelrahman after several of her friends who were medical workers mentioned that their already long working hours nearly doubled after the coronavirus outbreak. Many of those health care providers did not have time to find a meal to break their fasts during their hectic shifts. Some workers did not have a proper meal until hours after the sun went down.\n“It was just crazy, what they’re going through,” Abdelrahman said. A self-described problem-solver, she immediately began calling hospitals and surveyed the approximate number of Muslim workers. After securing their approvals, she called up several Muslim-owned businesses.\n“It’s a twofold win because we can help support their morale and we can also support the halal restaurants,” Abdelrahman said.\nHer group already committed to delivering 3,300 meals for Muslim staffers across three major hospitals: The University of Kansas Health System, Children’s Mercy hospital and Hospital Corporation of America’s Midwest Research Medical Center.\n“Our health system’s response to the COVID-19 pandemic has not allowed the flexibility many of our employees and medical staff members normally have in their lives,” said Jeff Novorr, the vice president of support services at The University of Kansas Health System.\nJill Toyoshiba for HuffPost Sohaila Humayon of Sohaila's Kitchen in the Lenexa Public Market fills containers with rice for meals she is preparing for pickup Friday, Apr. 24, 2020.\n“Given the importance of the timing of these meals, this partnering with On Call Halal provided The University of Kansas Health System a unique opportunity to support our Muslim employees and medical staff members by having meals available on our campus and at the right time of the day and night,” he added.\nAbdelrahman and volunteers from On Call Halal pick up meals from local businesses that cater halal food for health care workers twice a day –– for their end-of-day break-fast meal and the predawn meal –– and plan to continue to do so through Ramadan. Normally, health care workers would eat these meals with one another, provided their schedules accommodated, or would go home to eat with family and friends. But with doctors and nurses working longer hours to deal with the pandemic, many barely have time to prepare food for themselves.\nThe meals are paid for through sponsors and local donations collected on its website. As of Monday, On Call Halal has raised enough money to pay for 1,400 out of those 3,300 meals.\nHospital workers at Children’s Mercy in Kansas City broke their fast last Friday, the first full fasting day of Ramadan, with chicken biryani ― a hearty Pakistani dish made with rice, chicken and potatoes ― prepared by Sohaila’s Kitchen.\nAmna Humayon, the 29-year-old founder of the restaurant, said it was deeply personal to her as a family-owned business and as part of a Muslim family to give back to her community. She named the restaurant for her mother, whom she said “has always looked for ways to help out the community.”\n“During Ramadan, there are so many spiritual aspects of fasting,” Humayon said. “But you look forward to breaking your fast at the end of the day and having a really delicious meal.”\nJill Toyoshiba for HuffPost/Dr. Karishma Rao Top left: Kaitlin Abdelrahman, left, and Sohaila Humayon of Sohaila's Kitchen discuss logistics. Top right: A sign hanging up at at Children's Mercy hospital, which partnered with On Call Halal to provide meals to its fasting medical workers. Bottom left: Kaitlin Abdelrahman talks with Ammad Humayon. Bottom right: Some of the food delivered by On Call Halal to Kansas City-area hospitals.\nThe restaurant was forced to shut its doors in early March after a statewide stay-at-home order to slow the spread of the outbreak. Humayon was also concerned her mother would contract the virus. She plans to open for takeout-only service this week in hopes of keeping the business afloat.\nThe opportunity to provide meals for health care workers is “a godsend,” Humayon said. “Everyone keeps saying they’ve been hit really hard, but you don’t really realize it until you’re one of them,” she said. “So we’re trying to find ways to still stay connected.”\nKashif Tufail, the owner of Chai Shai, another participating restaurant with On Call Halal, said it was important to provide a sense of comfort and normalcy to medical workers who may not have the time to run out and get food during their hectic work schedules.\n“Someone who’s working at a hospital and who’s been fasting all day gets a meal that they know is from someone who is also Muslim and understands their faith and has also been fasting all day, and that person is taking care of them a little bit by providing a meal. I think that’s a nice feeling,” said Tufail.\n“It’s not about what you feed people, but how you make them feel,” he added.\nAbdelrahman hopes to secure more funding for On Call Halal over the coming days. If the group exceeds the goal of enough funds to pay for 3,300 meals, it plans to expand and provide meals for more Muslim staffers at more hospitals and wants to see similar programs happen in other cities.\nAbdelrahman said the entire project has been a collaborative way to show health care workers gratitude through the spirit of Ramadan and the community. All health care workers are amazing, she said.\n“But especially those people that are doing it all while fasting,” she added.", "url": "https://www.huffpost.com/entry/kansas-city-group-delivers-meals-for-fasting-muslim-medical-workers_n_5ea88850c5b6e50adaf4c2a6"}