{"authors": ["Christina A. Cassidy", "Nicholas Riccardi"], "date_download": "2020-05-04 20:29:03", "date_modify": "2020-05-04 20:29:03", "date_publish": "2020-04-20 04:01:14", "description": "ATLANTA (AP) — Scrambling to address voting concerns during a pandemic, election officials across the country are eliminating polling places or scaling back opportunities for people to cast...", "filename": "_c9fde1ff959705bc2a6d6643ed2289ba_1588624143.html", "image_url": "https://storage.googleapis.com/afs-prod/media/04aacd835ff1479f976892c0a40e950b/2895.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c9fde1ff959705bc2a6d6643ed2289ba_1588624143.html", "title": "As mail voting pushed, some fear loss of in-person option", "title_page": "As mail voting pushed, some fear loss of in-person option", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 17, 2020, file photo voters walk into a polling station for the Florida presidential primary in Bonita Springs, Fla. Scrambling to address voting concerns amid a pandemic, election officials from Nevada to Florida are scaling back or eliminating opportunities for people to cast ballots in person. (AP Photo/Elise Amendola, File)\nFILE - In this March 17, 2020, file photo voters walk into a polling station for the Florida presidential primary in Bonita Springs, Fla. Scrambling to address voting concerns amid a pandemic, election officials from Nevada to Florida are scaling back or eliminating opportunities for people to cast ballots in person. (AP Photo/Elise Amendola, File)\nATLANTA (AP) — Scrambling to address voting concerns during a pandemic, election officials across the country are eliminating polling places or scaling back opportunities for people to cast ballots in person — a move raising concerns among voting rights groups and some Democrats who say some voters could be disenfranchised.\nIn Nevada, election officials will open only one polling place per county for its June primary. In Florida, county officials warn they may have to consolidate polling places across the state. In Ohio’s primary next week, only the disabled and the homeless will be allowed to vote in person.\nThe closures come as many state officials are encouraging voters to vote by mail — and expanding opportunities to do so. Many election officials and health experts see mail-in and absentee voting as the best way to keep voters from spreading the coronavirus and to address a shortage of poll workers who are able to work without risking their health.\nBut advocates say some states are moving so quickly to embrace the shift to mail that they are not doing enough to accommodate certain voters, including the disabled, people who lack regular mail service, groups with little history of absentee voting or those who are simply unable to keep up with last-minute election changes and mail-in deadlines.\n“Not everyone can or should vote by mail,” said Stacey Abrams, a former Democratic candidate for Georgia governor who now runs Fair Fight Action, a voting rights group.\nThe concerns over polling places largely have been overlooked in the fight over voting rights, which has so far centered on partisan disputes over mail-in and absentee voting.\nDemocrats and voting rights groups have filed lawsuits seeking to expand mail and absentee voting options and pushed for an extra $2 billion to help states adjust their election systems. National Republicans are fighting those efforts, while President Donald Trump claims without evidence that mail-in voting is vulnerable to fraud.\nBut the challenge of securing in-person voting may prove just as contentious and just as likely to curb voter participation in the upcoming primaries, which are largely viewed as a dry run for November. In the chaotic recent Wisconsin election, where voters waited for hours to cast ballots, one expert estimated that the closure of polling sites in Milwaukee and other cities may have kept as many as 100,000 people from casting ballots.\nLast week, Democrats sued Nevada’s top election official, a Republican, for limiting each county to a single polling location during the state’s June 9 primary, alleging that will channel 87% of the state’s voters into only two locations. Democrats, who count on big turnout at the polls in the populous county that contains Las Vegas, sought changes to make mail voting simpler in a state where the overwhelming majority normally vote in person.\nA conflict is also brewing in swing state Florida, where the nonpartisan county election coordinators have asked Republican Gov. Ron DeSantis to loosen rules on early voting and allow consolidation of precinct polling stations for elections in August and November.\nDemocrats fear polling places may close in Palm Beach and Broward counties, two dense areas that are their bases.\nBut the rush to eliminate in-person voting can be bipartisan. Democrats’ party-run primary in Wyoming was conducted exclusively by mail, as was its one in Alaska. Party officials said they took steps like allowing same-day registration that help compensate for lack of in-person options. Kansas Democrats agreed to eliminate polling places for their May primary. Party chairwoman Vicki Hiatt said in-person voting sites were “going to be too risky.”\nOhio, Hawaii, Idaho and New Jersey are also sharply limiting or abolishing in-person voting .\nAdvocates acknowledge election officials are in a difficult position and support an increase in vote by mail for those who want it. But in-person voting, they say, provides an important “fail-safe” in the event of errors or mail delivery issues.\nAccording to a report from the liberal Center for American Progress and the NAACP, African-Americans are particularly reliant on in-person voting. In 2018, only 11% cast a ballot by mail — less than half the rate of whites and Latinos.\n“There are going to be people who are going to be disenfranchised by moving entirely to a vote-by-mail system,” warned Center for American Progress’ Danielle Root.\nOhio’s April 28 primary eliminates in-person voting for all but those with disabilities or those without a home address. Anyone who fails to request an absentee ballot before the deadline or whose absentee ballot doesn’t arrive in time would not be able to vote in person.\nThat may include Katie Brickner, 39, who lives in a Cleveland suburb. Her absentee ballot application was returned to her last week as undeliverable after water somehow damaged the front of the envelope after she dropped it off with the post office. She immediately mailed another but is worried after hearing reports that it’s taking a few weeks for applications to be processed.\n“I will have no voice in the election and it’s really important to me this year,” she said.\nIn Maryland, state election officials were poised to cancel in-person voting but decided to keep at least one polling place open in each of the state’s 24 counties after voting rights groups raised concerns.\nIn Idaho, state election officials said it “simply was not safe for voters, election workers or the larger community” to hold in-person voting for the May 19 primary. The state is mailing absentee ballot applications to voters who haven’t requested one and has partnered with local grocery stores who will be providing stamps for those who need them.\nStill, the decision to eliminate in-person voting could pose a barrier for some tribal members. One county reported the number of absentee ballot requests coming from the Shoshone-Bannock Tribes in southeastern Idaho as “critically low,” said to Randy’L Teton, tribal spokeswoman.\nTeton worries that requesting an absentee ballot may pose a challenge for those used to voting in person.\n“We’re going to need to explain this or delegate a family member that can help their grandma or grandpa on how to get through this,” Teton said.\n___\nAssociated Press writer Bobby Caina Calvan in Tallahassee, Florida, contributed to this report.\n___\nFollow Christina Almeida Cassidy on Twitter at https://twitter.com/AP_Christina", "url": "https://apnews.com/c9fde1ff959705bc2a6d6643ed2289ba"}