{"authors": ["Dave Collins", "Susan Haigh"], "date_download": "2020-05-04 20:05:06", "date_modify": "2020-05-04 20:05:06", "date_publish": "2020-04-07 14:59:48", "description": "HARTFORD, Conn. (AP) — Gov. Ned Lamont said Tuesday there are indications the surge of COVID-19 cases in Connecticut is “flattening out,” but implored residents to remain vigilant and continue to...", "filename": "_1b4a68f67bc11288100d887fa70e69eb_1588622706.html", "image_url": "https://storage.googleapis.com/afs-prod/media/eab36e08355642c2b26a77758b9cd041/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1b4a68f67bc11288100d887fa70e69eb_1588622706.html", "title": "Lamont says cases 'flattening,' warns against complacency", "title_page": "Lamont says cases 'flattening,' warns against complacency", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Head Veterinary Technician Nikki Westman, brings beagle Coco, 10, to owners Dan and Pam Flagg, of Wallingford, after a treatment at Meriden Animal Hospital, Monday, April 6, 2020. The hospital is not allowing visitors due to the COVID-19 pandemic. (Dave Zajac/Record-Journal via AP)\nHead Veterinary Technician Nikki Westman, brings beagle Coco, 10, to owners Dan and Pam Flagg, of Wallingford, after a treatment at Meriden Animal Hospital, Monday, April 6, 2020. The hospital is not allowing visitors due to the COVID-19 pandemic. (Dave Zajac/Record-Journal via AP)\nHARTFORD, Conn. (AP) — Gov. Ned Lamont said Tuesday there are indications the surge of COVID-19 cases in Connecticut is “flattening out,” but implored residents to remain vigilant and continue to adhere to the state’s strict social distancing measures.\nThe Democrat warned “this is no time for ‘Happy Days Are Here Again,’” referring to the upbeat song used by President Franklin Delano Roosevelt’s campaign even though people were still suffering the effects of the Great Depression. Lamont said his administration is working with New York and Pennsylvania officials on a thoughtful and safe way the region can eventually emerge from the coronavirus crisis.\n“And that means starting with social distancing,” he said. “‘Hey dude - keep your distance.’ I want to hear that wherever I go.”\nAs of Tuesday, 1,308 people were hospitalized in Connecticut with COVID-19, an increase of 87 from Monday. Lamont noted how the state has averaged 80-to-90 additional hospitalizations each day for the past five days. While Lamont admitted “five days does not make a trend,” he said “at least we can say we are flattening out.”\nThere have been 277 virus-related deaths in the state.\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness or death.\nIn other developments around Connecticut:\n___\nWORKPLACE RULES\nLamont has signed his 23rd executive order which details protections that should be in place for essential workers, many of which are already being followed by employers. The list of workplace rules includes things like having employees work from home when possible; controlling access to external visitors and customers; using hand sanitizer at point of entry; developing and maintaining social distancing practices; providing masks when close personal contact is unavoidable; moving from one or two shifts to three shifts; and frequently cleaning of all touch points.\n___\nHELP FOR STAMFORD HOSPITAL\nApproximately 85 soldiers from the U.S. Army Reserve’s Urban Augmentation Medical Task Force on Tuesday began arriving to provide additional medical staff to Stamford Hospital, including clinical and administrative workers and experts in operational medicine, infectious disease, preventive medicine, nursing, respiratory therapy, clinical psychology, occupational therapy, dietetics, pharmacy, and other areas.\n___\nDOMESTIC VIOLENCE CALLS\nA special police unit in Hartford will handle a surge in domestic violence calls believed to be linked to social isolation measures imposed to fight the coronavirus pandemic, officials said.\nTwo officers during the day and two at night will respond only to domestic violence calls and will give victims information on services including safe houses and counseling, Mayor Luke Bronin said. The city is working with Interval House, a nonprofit group.\nBronin said there was a 20% increase in domestic violence calls to police over the past week, but officials worry many cases are not being reported.\n“We’ve asked everybody to stay home,” Bronin said Monday. “But the tragic reality is that as we take those measures to keep our community safe, it also means that there are those in our community, in our neighborhood and loved ones who may be at greater risk and who suffer in this time of isolation.”\n___\nNURSING HOME CASES\nCOVID-19 cases in nursing homes around the state have more than doubled since Friday.\nThe state is reporting that 477 nursing home residents have tested positive for the virus as of Monday, including 142 who were hospitalized and 65 who have died. More than 70 of the 215 nursing homes in the state have had at lease one confirmed case of COVID-19.\nOn Friday, officials said 221 residents had tested positive, including 80 who were hospitalized and 23 who had died. There were 48 nursing homes reporting at least one case of COVID-19. The administration plans to offer financial incentives for nursing homes that agree to house only COVID-19 positive residents.\nAt one facility in Milford, nearly half the residents have tested positive for the disease. As of Friday, Golden Hill Rehab Pavilion had 44 positive cases. At least one family said it learned a relative contracted the disease only after he died, Hearst Connecticut Media reported.\nLamont’s COO Josh Geballe said the administration is looking into the situation while the center’s executive director, Andrew Wildman, said in a statement to News12 Connecticut that Golden Hill is notifying families “timely and as appropriate.”\n___\nMEDICAL SUPPLIES LACKING\nHealth care workers of all types in Connecticut are continuing to complain they don’t have the supplies they need to protect themselves from COVID-19, including highly sought-after N95 face masks. Visiting nurses, medical staff at psychiatric facilities, nursing home employees and others voiced their concerns Tuesday to Democratic U.S. Sen. Richard Blumenthal on a conference call, urging him to help Connecticut secure more personal protective equipment.\nJoel Reeves, a mental health worker at Natchaug Hospital, a psychiatric drug and alcohol facility in Mansfield, said employees have received one regular ear-loop mask. He said workers must wear it “for at least a week unless it’s visibly soiled” and then place it in a paper bag at the end of their shift.\n“It’s not good. You’re supposed to change those every two to three hours on a normal day,” he said.\nLamont said he’s aware of the shortages and has been talking with senior-level executives at various manufacturers, trying to secure more equipment.\n“I know how serious this is. I know the risk people are taking,” he said. “And we’re doing everything we can to keep you safe.”", "url": "https://apnews.com/1b4a68f67bc11288100d887fa70e69eb"}