{"authors": ["David Eggert"], "date_download": "2020-05-04 20:18:38", "date_modify": "2020-05-04 20:18:38", "date_publish": "2020-04-09 13:19:44", "description": "LANSING, Mich. (AP) — Nearly 385,000 people filed initial claims for unemployment in Michigan last week amid the economic fallout from the coronavirus pandemic, marking a third straight week of...", "filename": "_48541c3378ba2de7757c78c89f7717d0_1588623518.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7bb914f21fe54d02a04e2e6cbf242198/1800.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_48541c3378ba2de7757c78c89f7717d0_1588623518.html", "title": "Nearly 385,000 more file unemployment claims in Michigan", "title_page": "Nearly 385,000 more file unemployment claims in Michigan", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In a pool photo provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich., Thursday, April 9, 2020. The governor signed an executive order extending her prior \"Stay Home, Stay Safe\" order through the end of April. The order limits gatherings and travel and requires all workers who are not necessary to sustain or protect life to stay home. The order also imposes more stringent limitations on stores to reduce foot traffic to slow the spread of the coronavirus. (Michigan Office of the Governor via AP, Pool)\nIn a pool photo provided by the Michigan Office of the Governor, Michigan Gov. Gretchen Whitmer addresses the state during a speech in Lansing, Mich., Thursday, April 9, 2020. The governor signed an executive order extending her prior \"Stay Home, Stay Safe\" order through the end of April. The order limits gatherings and travel and requires all workers who are not necessary to sustain or protect life to stay home. The order also imposes more stringent limitations on stores to reduce foot traffic to slow the spread of the coronavirus. (Michigan Office of the Governor via AP, Pool)\nLANSING, Mich. (AP) — Nearly 385,000 people filed initial claims for unemployment in Michigan last week amid the economic fallout from the coronavirus pandemic, marking a third straight week of historically high claims.\nMore than 817,000 sought jobless benefits over the past three weeks, which was more than any state except California, which has about four times the population.\nMichigan’s 3.6% unemployment rate is expected to skyrocket to 24% this quarter, according to University of Michigan economists. That would be higher than the 14.4% mark set during the Great Recession that lasted from 2007 to 2009 and the state’s previous peak of 16.4% in 1982.\nThe researchers forecast that Michigan’s payroll job count will fall by nearly 1.2 million this quarter, with nearly three-quarters of workers coming back to the job in the third quarter.\nThe state has been overwhelmed by a flood of unemployment applications, and some of those out of work have had trouble applying online or by phone.\nThe Unemployment Insurance Agency is adding staff — nearly quadrupling the call center workforce to 500 total by the end of the week — and expanding call center hours.\n“I’m committed to make sure that every eligible Michiganders receives their unemployment benefits,” said Gov. Gretchen Whitmer. “I appreciate your patience.”\nThe Democratic governor on Thursday lengthened a stay-at-home order through April. It initially took effect on March 24.\n“This is an unprecedented number of people that are looking for help,” she said, urging people to apply online. “We’re rebuilding the system. I think that we’ve gotten it in a pretty good place from what I understand.”\n___\nFollow Eggert on Twitter: https://twitter.com/DavidEggert00", "url": "https://apnews.com/48541c3378ba2de7757c78c89f7717d0"}