{"authors": ["Phil Mattingly"], "date_download": "2020-05-04 16:23:55", "date_modify": "2020-05-04 16:23:55", "date_publish": "2020-04-06 20:31:21", "description": "Rep. Tom Suozzi, a New York Democrat, has railed about the negative effect a 2017 cap on the state and local tax deduction has had on his Long Island district for years.", "filename": "2020_04_06_politics_state-budgets-salt-2017-tax-law_index_1588609435.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406155446-rep-tom-suozzi-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_state-budgets-salt-2017-tax-law_index_1588609435.html", "title": "Lawmakers push change to 2017 tax law as pandemic hits their states' budgets", "title_page": "Lawmakers push change to 2017 tax law as pandemic hits their states' budgets  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Rep. Tom Suozzi, a New York Democrat, has railed about the negative effect a 2017 cap on the state and local tax deduction has had on his Long Island district for years.\nLack of fairness to those in high-tax states was his central counterargument to the cap put in place by the Republican tax law , listing off anecdote after anecdote of constituents who make six-figure salaries but face living expenses unlike most anywhere else in the country.\nThat is still very much Suozzi's view -- he listed off several of those anecdotes in a phone interview with CNN on Monday -- but a different argument has sharpened his push for a full repeal of the cap as the coronavirus pandemic rips through his home state: the hardest hit states simply can't afford the loss in tax revenue the cap has created in certain states.\n\"What happens is people leave the state, and when they leave the state, they take their tax revenues,\" Suozzi said of the effect of the cap. \"Without those tax revenues, we have a hole in the bucket.\"\nSuozzi and a bipartisan group of House members are pressing leaders to include a change to the cap on the state and local tax deduction as part of the next phase of economic relief efforts to address the cascading effects of the coronavirus pandemic.\nThe group of 12 lawmakers, led by Suozzi, all represent districts in high-tax states that have been hit by the cap on the state and local tax (SALT) deduction implemented in the 2017 tax law.\n\"We need to provide assistance to those bearing the brunt of this crisis: working families and the state and local governments on the frontlines,\" the lawmakers wrote to Speaker Nancy Pelosi and Republican Leader Kevin McCarthy in a letter obtained by CNN. \"Relief from the SALT cap will provide more Americans with economic security and instill confidence in our state and local governments that they will have the resources required to respond to the crisis.\"\nA straight repeal or easing of the cap has long been a complex political equation for those pushing the effort. The beneficiaries of the deduction skew heavily toward higher earners, and many Republicans have pilloried House Democratic legislative efforts to change the 2017 tax law as an effort designed solely to aid the wealthy.\nBut it also underscores both the economic and political realities faced by lawmakers in states like New York, New Jersey, Illinois, Pennsylvania and California, many of whom campaigned on changing the cap in the 2018 midterm elections.\nFor Democrats, those candidates used the cap as a potent political weapon to help unseat Republican incumbents in suburban areas throughout the country. Five of the six Democrats who signed onto the letter are among the freshmen in that group.\nUnder current law, households can't deduct more than $10,000 in state and local taxes from their federal taxes.\nFor states facing decreased tax revenue, the solution often presented by supporters of the cap is to restrain spending and cut social services, Suozzi said, neither of which is remotely plausible at a moment when states are facing significant budget hits as they scramble to triage the outbreak.\n\"Now is a time when state and local governments are facing serious funding issues and relief from the cap would help not only individuals, but the state and local governments addressing the crisis we all face,\" the lawmakers wrote.\nRevising the cap in future economic emergency legislation is an idea that was floated by Pelosi last week, but it received immediate pushback from economists from both ends of the political spectrum who argue the change would do little to stimulate the economy or address the catastrophic economic effects on the lower end of the wage scale.\n, raised the possibility of retroactively undoing the cap, which would allow people to have more disposable income. Ostensibly it could work in tandem with the direct payments, of up to $1,200 for individuals and $2,400 for families, that were included in Pelosi, in an interview with the New York Times , raised the possibility of retroactively undoing the cap, which would allow people to have more disposable income. Ostensibly it could work in tandem with the direct payments, of up to $1,200 for individuals and $2,400 for families, that were included in the $2 trillion economic relief package signed into law last month.\nBut it's unlikely many of those who would receive the direct payments would also benefit from a change in the SALT cap. It's estimated that more than half of the proceeds from a full repeal of the cap would go to the top 1% of households.\nA Pelosi spokesman, Henry Connelly, said any SALT proposal \"would be tailored to focus the benefits on middle class earners and include limitations on the higher end.\"\nAs lawmakers increasingly acknowledge another rescue package will be necessary in the weeks ahead, it's unclear what, if any, prospects a proposal changing the SALT cap would have in negotiations that would require sign off from Democrats and Republicans in both chambers, as well as the White House.\nThe Democratic-led House passed a bill in December to restore the deduction for two years, but Senate Republicans have lambasted the idea. A Senate Republican aide was blunt when asked about whether changes to the SALT cap would be considered in future economic relief legislation. \"Nope,\" the aide told CNN.\nStill, Suozzi plans to push ahead with an argument that is different from the one he readily deployed during the House consideration of the bill to change the cap last year.\n\"The argument I made the most commonly during the December debate is the unfairness of it all,\" Suozzi said. Now, it's that during a critical time, states at the center of the crisis can't be undercut. And there's no doubt which state currently sits at that center.\n\"New York is the epicenter, there's no debate about that,\" Suozzi said, noting that New Jersey, Illinois and California are all close behind.\nThe lawmakers who signed the letter along with Suozzi are Democratic Reps. Mikie Sherrill and Tom Malinowski of New Jersey, Katie Porter and Harley Rouda of California and Lauren Underwood of Illinois. Republican Reps. Peter King, Lee Zeldin, John Katko and Elise Stefanik of New York, as well as Brian Fitzpatrick of Pennsylvania and Chris Smith of New Jersey, also signed on.", "url": "https://www.cnn.com/2020/04/06/politics/state-budgets-salt-2017-tax-law/index.html"}