{"authors": ["Julia Horowitz", "Cnn Business"], "date_download": "2020-05-04 15:59:35", "date_modify": "2020-05-04 15:59:35", "date_publish": "2020-04-01 11:34:54", "description": "The first quarter of 2020 was the worst three months for stocks since the global financial crisis. And it's hard to say whether April through June will be any better.", "filename": "2020_04_01_investing_premarket-stocks-trading_index_1588607975.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401102427-nyse-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_investing_premarket-stocks-trading_index_1588607975.html", "title": "Last quarter was brutal for stocks. This one is a wild card", "title_page": "Premarket stocks: Last quarter was brutal. This one is a wild card - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nLondon (CNN Business) The first quarter of 2020 was the worst three months for stocks since the global financial crisis. And it's hard to say whether April through June will be any better.\nThe details: Thefell 20% between January and March. It was the worst quarter for the index since the end of 2008, when the S&P 500 fell 22.6%. Since World War II, the index has dropped 20% or more in a quarter just five times, according to Bespoke Investment Group.\nSo, safe to say it was a brutal start to the year. But looking forward, what can investors expect?\nHistory suggests a rebound. Bespoke's team points out that seven out of the eight times the S&P 500 has dropped at least 15% in a quarter since World War II, the index rose the following quarter, with an average gain of 5%.\nReturning to previous levels takes time, Morgan Stanley strategists told clients on Wednesday. The investment bank noted that global stocks typically take 15 months to recover to prior peaks after hitting bear market lows, while the S&P 500 generally takes 20 months.\nBut because the coronavirus, and efforts to contain it, are totally without modern precedent, these examples only get us so far.\nSee here: President Donald Trump cautioned on Tuesday that between 100,000 and 240,000 Americans could die in the coming weeks. That warning has sent stocks lower on Wednesday.\nMarkets are reacting to \"a likely increase in the duration and breadth of coronavirus lockdowns in the US and elsewhere, which is pointing to a potentially deeper and longer-term hit to economic activity than was anticipated even a week ago,\" Stephen Innes, a strategist at AxiCorp, said in a note to clients.\nCompanies around the world are halting shareholder payouts\nCompanies typically resist slashing payouts to shareholders at all costs. But the depth of the shock from the novel coronavirus, which has triggered a deep recession and imperiled millions of jobs, has left many firms with no choice.\nGoldman Sachs estimates that S&P 500 dividends will decline by 25% this year. Citigroup, meanwhile, thinks dividends in Europe — which are typically more generous than in the United States — could be sliced in half.\nWhy it matters: The cuts are a sign of just how big a hit the coronavirus has been for global businesses that delivered a record $1.4 trillion in dividends last year. And it could cause further pain for asset managers such as pension funds, which rely on income from dividend stocks to fund payouts to retirees.\nPressure to slice dividends is coming from many sources: In the United States, companies that accept federal bailouts or loans to survive the coronavirus crisis are barred from paying dividends to investors in the near term, while regulators around the world are calling on banks to preserve capital so they can keep lending to businesses.\nHSBC HBCYF Standard Chartered SCBFF Lloyds LLDTF The latest: UK banks includingandhave halted dividend payments following a request from the country's financial services regulator. The FTSE 100 is off 3.7% on Wednesday as a result.\nFor distressed firms in the retail, hospitality and energy sectors — which have seen revenue dry up — it's about holding onto enough cash to tide them over until restrictions lift and the economy can start to recover.\n\"It's all about the balance sheet right now,\" Peter Boockvar, chief investment officer at Bleakley Advisory Group, told me.\nAmerica's food supply is at risk\nFarmers have very little flexibility. They're on a strict planting and harvesting schedule and cannot ramp up or decrease production at will.\nThat puts America's food supply at risk as the coronavirus crisis deepens, my CNN Business colleague Danielle Wiener-Bronner reports.\nApril and May are critical planting and harvesting times for many US farmers. They need skilled laborers to work their fields, and a reliable supply chain to deliver their goods. And they don't have any time to waste.\nIf farmers can't find enough workers or if their farming practices are disrupted because of the pandemic, Americans could have less or pricier food this summer. And because farmers around the world face similar problems, the United States could receive fewer food imports, potentially limiting supply and driving up prices. Prices of some items are already higher due to stockpiling.\nKnow this stat: The price of futures contracts of frozen orange juice concentrate trading on the Intercontinental Exchange has jumped by more than 23% so far this year.\nUp next\nIHS Markit releases its surveys of manufacturing purchasing managers, which face close scrutiny from investors and economists.\nAlso today:\nADP's private employment report for March hits at 8:15 a.m. ET.\nThe ISM Manufacturing Index for March, a crucial gauge of US manufacturing, arrives at 10 a.m. ET.", "url": "https://www.cnn.com/2020/04/01/investing/premarket-stocks-trading/index.html"}