{"authors": [], "date_download": "2020-05-04 20:15:52", "date_modify": "2020-05-04 20:15:52", "date_publish": "2020-04-08 11:30:36", "description": "MADISON, Wis. (AP) — The Latest on the coronavirus outbreak in Wisconsin. (all times local): 3:30 p.m. The head of elections in Milwaukee is seeking a U.S. Postal Service Investigation...", "filename": "_bd4f4a345597a4aaba3781185d365207_1588623352.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bd4f4a345597a4aaba3781185d365207_1588623352.html", "title": "The Latest: Milwaukee election head wants probe into ballots", "title_page": "The Latest: Milwaukee election head wants probe into ballots", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON, Wis. (AP) — The Latest on the coronavirus outbreak in Wisconsin. (all times local):\n3:30 p.m.\nThe head of elections in Milwaukee is seeking a U.S. Postal Service Investigation into what happened to missing absentee ballots that did not make it to voters before Tuesday’s election.\nMilwaukee Election Commission Executive Director Neil Albrecht said Wednesday that he wants the investigation to focus on ballots that were issued and mailed around March 22 and March 23.\nMany voters who showed up at one of the city’s five polling places Tuesday said they were forced to come out after absentee ballots they requested never arrived. The state Elections Commission was also working with the Postal Service on reports of undelivered ballots in Oshkosh and Appleton and elsewhere.\nThe U.S. Postal Service didn’t immediately respond to a call Wednesday seeking comment.\n___\n3 p.m.\nThe number of coronavirus deaths in Wisconsin is near 100, as public health experts worry about a spike in cases due to the state holding its election on Tuesday.\nThe state Department of Health Services reported Wednesday that there had been 99 deaths from COVID-19 to date with nearly 2,800 confirmed cases. The number of confirmed cases increased by about 7% from Tuesday.\nWisconsin’s forging ahead with an election in the middle of a pandemic has public health officials, and those who showed up at the polls, worried.\n“From a public health perspective, this was counter to all good scientific evidence and advice right now for how to continue to curb the pandemic from having serious impacts in the state,” said Kristen Malecki, an epidemiologist at the University of Wisconsin School of Medicine and Public Health.\nCaleb Andersen, 40, said he was concerned that holding the election would wipe out any progress Wisconsin had made in slowing the spread of the virus. Andersen worked at one of Milwaukee’s five polling places where he said 3,800 people voted, and feels certain he was exposed despite all efforts at safety.\n___\n2:40 p.m.\nWisconsin’s top elections official Meagan Wolfe Wednesday that the elections commission was working with the U.S. Postal Service to locate absentee ballots that never made it to voters in time for Tuesday’s deadline, including three bins in the Oshkosh and Appleton area.\nWolfe said because absentee ballots had to be postmarked by Tuesday, those voters who didn’t vote in person but not have any recourse.\nMany people who showed up Tuesday to vote in person said they did so only because they had requested but not received an absentee ballot.\nIt wasn’t clear how many people fell into that category, but election officials were overmatched by a record-high 1.3 million requests for such ballots in the lead-up to the election.\nThe U.S. Postal Service didn’t immediately respond to a call Wednesday seeking comment.\nOne of those who didn’t get their ballot and chose not to vote was Gordon Hintz, the Democratic minority leader in the Wisconsin Assembly, who lives in Oshkosh.\n“I complied with the public health order, as did many of my constituents,” Hintz said in a text. “You either have a once in a hundred year pandemic or you don’t.”\n___\n6:30 a.m.\nUniversity Hospital in Madison will join a national effort to transfuse antibodies from the plasma of people who recovered from the coronavirus to treat patient still struggling with it.\nThe technique is a century-old treatment used to fight off flu and measles outbreaks in the days before vaccines, and tried more recently against SARS and Ebola.\nWith no approved treatment for COVID-19 and more than 11,000 deaths in the U.S., the unproven approach offers some hope against COVID-19.\nAs of Tuesday night, Wisconsin reported more than 2,500 coronavirus infections and 92 related deaths — 49 of them in Milwaukee County.\n“We know that antibody has neutralized the virus in one person,” said Dr. William Hartman, a UW Health anesthesiologist heading up the effort at UW Hospital, which is part of a national study. “We assume that the antibody will neutralize the virus in another person. It’s an extra boost to help fight off the infection.”\nUW Hospital has joined the National COVID-19 Convalescent Plasma Project, started about a month ago by Johns Hopkins University, Mayo Clinic and other institutions.\nThe Food and Drug Administration recently approved a clinical trial at Johns Hopkins, through which UW Hospital’s treatment program will operate, Hartman tells the State Journal.", "url": "https://apnews.com/bd4f4a345597a4aaba3781185d365207"}