{"authors": ["Jeanne Sahadi", "Cnn Business", "Sara Sutton", "Ceo", "Tom Miller"], "date_download": "2020-05-04 17:01:43", "date_modify": "2020-05-04 17:01:43", "date_publish": "2020-04-10 14:14:50", "description": "If you're a manager who was thrown -- overnight -- into a situation where you and your team now work from home thanks to the coronavirus, your job just got a little harder... and a little weirder.", "filename": "2020_04_10_success_managing-a-team-remotely-in-a-crisis_index_1588611703.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410020138-20200407-managing-remote-team-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_success_managing-a-team-remotely-in-a-crisis_index_1588611703.html", "title": "How to manage a team remotely during this crisis", "title_page": "How to manage a team remotely during this crisis - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If you're a manager who was thrown -- overnight -- into a situation where you and your team now work from home thanks to the coronavirus, your job just got a little harder... and a little weirder.\nA deadly pandemic, an economic implosion and a new way of working has created a lot of distracted, anxious employees who now legitimately worry about job security.\nYet you still have to deliver on projects, train and coach, settle disputes and engage the team.\n\"We are integrating remote work in an emergency situation and that has emotional duress tied to it,\" said Sara Sutton, CEO and founder of the career site FlexJobs.\nHere are five ways to successfully manage the situation and your team:\n1. Reassess priorities and offer clear direction\nNothing is business as usual anymore. \"Ask your higher-ups what the top priorities are now,\" Sutton said.\nThat way you can help your team figure out where they should direct their energies. The last thing they need is to be working in isolation and wondering, \"Is this what they want?\"\nOffering your team clarity of purpose also helps with productivity and profits.\nAsk your higher-ups what the top priorities are now.\" Sara Sutton, CEO, FlexJobs\n\"Especially in recessionary times, employees do best when leaders set clear expectations. Give them the resources they need to get the job done. And help them see how their work fits in with the bigger purpose of the organization,\" said Jim Harter, Gallup's chief scientist in workplace management and well-being.\n2. Be flexible\nThe magnitude of what is happening hits everyone at different times. Even normal errands can take up more mental space than imagined, like strategizing the best time to get groceries safely and quickly.\nare actively overseeing their children's remote learning while working. For employees with young kids, life has become a 24/7 stress test and many may need to adjust their work hours to accommodate family crunch times . They have no child care andare actively overseeing their children's remote learning while working.\n\"You have to respect each person's family situation and adjust timelines to that. People are working different hours now. You have to be a bit more adaptable to that than in the past,\" Harter said.\n3. Set a positive tone\nand more to come, remind yourself and your team that whatever frustrations people have with remote working, you're really fortunate to be able to do it and get paid. With millions of people suddenly out of work and more to come, remind yourself and your team that whatever frustrations people have with remote working, you're really fortunate to be able to do it and get paid.\nIt's also helpful to start meetings with some friendly banter and ask everyone how they are doing, Sutton said.\nRecognize individuals for work well done and continue to help them think about their career development, Harter suggested. Since you may feel inaccessible to others because you're not in the same place, you might purposefully set up a regular time to connect individually with each team member.\n4. Look for signs of distress\nThis crisis affects everyone. Retirement and college savings have been hit. Spouses are losing jobs. No one is seeing family. And increasingly, people know someone who has died from Covid-19.\nYou take for granted the ability to check in on someone's wellbeing when you see them every day.\" Tom Miller, CEO, ClearForce\nBut some employees may have a harder time handling it all. Signs of extreme duress include drinking too much, abusing drugs, disengaging or being much more negative and combative than usual.\n\"Managers have to engage in a more conscious way than they did before. You take for granted the ability to check in on someone's well-being when you see them every day,\" said Tom Miller, CEO of employee risk management firm ClearForce.\nPeriodically remind your whole team how to access your company's employee assistance programs -- which can include mental health , addiction and grief counseling, financial coaching and other wellness resources.\nAnd if you sense someone is struggling, be especially attentive. Doing so lets them know you care about their well-being, which is critical now. But you may also prevent problems for your company later, since employees under duress are more likely to make costly mistakes, flout rules and regulations, and become vulnerable to manipulation from foreign governments, hackers and other outside actors wanting access to company systems, Miller said.\n5. Take care of yourself, too\nManagers should regularly encourage team members to take care of themselves in the midst of this crisis. And you should take your own advice.\n\"Model what you're advising your team to do,\" Sutton said. \"Exercise, keep to a work schedule, take breaks. Breathe. It's okay to tell your team this is hard for you, too.\"\nIn fact, showing that vulnerability can help develop openness and trust with your team, which will pay dividends for years to come.", "url": "https://www.cnn.com/2020/04/10/success/managing-a-team-remotely-in-a-crisis/index.html"}