{"authors": ["Madeline Holcombe"], "date_download": "2020-05-04 16:56:36", "date_modify": "2020-05-04 16:56:36", "date_publish": "2020-04-09 11:07:52", "description": "Children are among those fighting coronavirus and those feeling the pain it causes, and a story book wants to help them navigate both.", "filename": "2020_04_09_us_childrens-book-coronavirus-trnd_index_1588611396.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409101834-02-coronavirus-story-book-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_childrens-book-coronavirus-trnd_index_1588611396.html", "title": "Story book aims to help children cope with coronavirus", "title_page": "Story book aims to help children cope with coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Children are among those fighting coronavirus and those feeling the pain it causes, and a story book wants to help them navigate both.\nThe story -- \"My Hero is You, How Kids can fight Covid-19!\" -- features a creature named Ario, who helps explain how children can protect against the virus and cope with the complicated emotions around the world dealing with a pandemic, according to a release from the Inter-Agency Standing Committee (IASC) , which is part of the United Nations Office for the Coordination of Humanitarian Affairs.\nThe new book is a collaboration of more than 50 humanitarian organizations.\n\"All over the world, children's lives have been completely upended -- the majority of them living in countries with some form of restricted movement or lockdown,\" said Henrietta Fore, executive director of UNICEF.\n\"This wonderful book helps children understand and navigate this new landscape and learn how they can take small actions to become the heroes in their own stories.\"\nThe book is aimed at children ages 6 to 11 years old and has already been translated to six languages to reach as many children as possible. Thirty more languages are in the pipeline, the release said.\nRead More", "url": "https://www.cnn.com/2020/04/09/us/childrens-book-coronavirus-trnd/index.html"}