{"authors": [], "date_download": "2020-05-04 20:21:58", "date_modify": "2020-05-04 20:21:58", "date_publish": "2020-04-04 20:14:53", "description": "WAUSAU, Wis. (AP) — WSAW A Wisconsin creamery cooperative is offering dairy farmers an incentive to quit an industry stung first by years of low milk prices and then by the...", "filename": "_c84d48c9974af3858c87c986eae335ba_1588623718.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c84d48c9974af3858c87c986eae335ba_1588623718.html", "title": "Cooperative offers stressed dairy farmers incentive to quit", "title_page": "Cooperative offers stressed dairy farmers incentive to quit", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WAUSAU, Wis. (AP) —\nWSAW\nA Wisconsin creamery cooperative is offering dairy farmers an incentive to quit an industry stung first by years of low milk prices and then by the coronavirus.\nA letter from the Ellsworth Cooperative Creamery board of directors to members offers to pay their equity in the cooperative from 2010 to 2019 if the farmers meet certain criteria, WSAW-TV reported.\n“We know we have farmers that are not sure whether they are going to exit farming this year or next year,” cooperative spokesman Paul Bauer said. “We felt that this was a way to incent our farmers to exit the business, perhaps a little earlier than what they expected, for the betterment of the entire patron base.”\nPaul LIppert, who runs a Wood County dairy farm with his father and brother, said the cooperative is trying to help its farmers. He said there’s “a glut of milk” and it doesn’t look like ” things are going to get better very quickly.”\nThe COVID-19 pandemic has added to the industry’s troubles. Several farms throughout Wisconsin have been asked to dispose of their milk while production plants struggle to keep up with the milk that is being produced.", "url": "https://apnews.com/c84d48c9974af3858c87c986eae335ba"}