{"authors": [], "date_download": "2020-05-04 20:28:24", "date_modify": "2020-05-04 20:28:24", "date_publish": "2020-04-17 14:20:03", "description": "O'FALLON, Mo. (AP) — The number of new confirmed coronavirus cases in Missouri had its biggest one-day increase, jumping by more than 400 Friday and claiming 16 more lives. Data from Johns...", "filename": "_ca0e22d01b2849360fd7e9778325fb15_1588624104.html", "image_url": "https://storage.googleapis.com/afs-prod/media/468494d1d8af4f14b952674738a90b9a/2797.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ca0e22d01b2849360fd7e9778325fb15_1588624104.html", "title": "More than 400 new coronavirus cases reported in Missouri", "title_page": "More than 400 new coronavirus cases reported in Missouri", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "More than 400 new coronavirus cases reported in Missouri\nIn this photo made with a zoom lens, an optimistic sign is seen in the window of a closed small business Thursday, April 16, 2020 in Kansas City, Mo. Many nonessential businesses are hard hit as they remain closed due to stay-at-home orders put in place in an effort to curb the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nIn this photo made with a zoom lens, an optimistic sign is seen in the window of a closed small business Thursday, April 16, 2020 in Kansas City, Mo. Many nonessential businesses are hard hit as they remain closed due to stay-at-home orders put in place in an effort to curb the spread of the new coronavirus. (AP Photo/Charlie Riedel)\nO’FALLON, Mo. (AP) — The number of new confirmed coronavirus cases in Missouri had its biggest one-day increase, jumping by more than 400 Friday and claiming 16 more lives.\nData from Johns Hopkins University’s Center for Systems Science and Engineering, which has been tracking cases worldwide, showed 418 newly-confirmed cases, bringing the total to 5,560. The number of deaths rose to 170, up from 154 on Thursday.\nIn just the past week, the number of deaths in Missouri has increased by 78, and 1,936 new cases have been confirmed.\nThe latest figures come a day after Republican Gov. Mike Parson extended his statewide stay-at-home order through May 3.\nParson on Friday said plans to restart the economy beginning May 4 rest on expanding testing, growing the state’s reserve of protective gear, tracking hospital capacity and predicting potential outbreaks. He said the state will broaden who is eligible to get tested next week.\n“We are seeing improvements across the state,” Parson said. “If good social distancing continues, we will reopen the economy and get Missouri back to work.”\nMeanwhile, Democratic leaders in St. Louis, St. Louis County, Kansas City and Jackson County all extended their stay-at-home orders through at least mid-May.\nRACIAL INEQUITIES\nThe high percentage of black residents who have been sickened and died from the coronavirus “shines a spotlight” on racial inequities in the St. Louis region and elsewhere, Democratic St. Louis County Executive Sam Page said.\nData from the Missouri Department of Health and Senior Services shows that 34% of deaths from COVID-19, the illness caused by the coronavirus, have involved black people, 40% white people and the race was unknown for 23% of victims. Blacks make up about 11.5% of the Missouri population.\nIn St. Louis County, 54% of those who have died were black. About 24% of county residents are black.\n“We need to stop the inequities in the provision of health care in our underserved communities,” Page said during a news conference Friday. “This COVID-19 virus shines a spotlight on those inequities.”\nTEMPORARY MORGUE\nSt. Louis County is nearing completion of a temporary morgue, in case the coronavirus causes more deaths than the existing morgue can handle.\nThe permanent morgue has a capacity of 20 bodies. County spokesman Benjamin Granda said the new “Dignified Transfer Center” could hold up to 1,300 bodies, though no projections show the county reaching anywhere near that number.\nSixty-six people in St. Louis County have died from the coronavirus, according to the Johns Hopkins University website.\nFAULTY MASKS\nPublic Safety Director Sandy Karsten said a vendor that provided the state with about 101,000 faulty KN95 protective masks has refused to give a refund. Karsten said the state will “do everything in our power” to recoup the roughly $8.3 million it paid.\nMissouri health department Director Randall Williams added that the 48,000 KN95 protective masks recalled from police and fire departments this week were deemed faulty because they didn’t keep out COVID-19.\nBROADBAND FOR RURAL AREAS\nParson announced about $3 million in grants will go toward bringing broadband to 4,400 homes, businesses and farms without high-speed internet, which he called “essential infrastructure in the modern economy, especially during these challenging times.”\nCOURT SUSPENSION EXTENDED\nThe Missouri Supreme Court extended through May 15 its statewide suspension of most in-person court proceedings.", "url": "https://apnews.com/ca0e22d01b2849360fd7e9778325fb15"}