{"authors": ["Julia Horowitz", "Cnn Business"], "date_download": "2020-05-04 16:06:55", "date_modify": "2020-05-04 16:06:55", "date_publish": "2020-04-02 11:41:28", "description": "Mass layoffs tied to the coronavirus pandemic sparked a surge in the number of Americans who filed for their first week of unemployment benefits — the latest sign that the US economy is in for a deep recession as shutdowns aimed at containing the virus continue.", "filename": "2020_04_02_investing_premarket-stocks-trading_index_1588608415.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114218-01-us-employment-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_investing_premarket-stocks-trading_index_1588608415.html", "title": "US unemployment report is much worse than economists predicted", "title_page": "Premarket stocks: US unemployment report is much worse than economists predicted - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nLondon (CNN Business) Mass layoffs tied to the coronavirus pandemic sparked a surge in the number of Americans who filed for their first week of unemployment benefits — the latest sign that the US economy is in for a deep recession as shutdowns aimed at containing the virus continue.\nThe data:Over 6.6 million people filed claims for unemployment benefits in the week ending March 28, according to the US government. That is farmore than economists expected and is double the all-time high set the previous week, when 3.3 million Americans filed initial claims.\nThe pre-coronavirus record was 695,000 claims in October 1982. Last week's claims were nearly 10 times that level.\nInvestors will get another indication of the damage done to the US labor market on Friday, when the government publishes its jobs report for March. But Bank of America economist Joseph Song said the real trauma will be revealed later. He expects the jobs report for April to show \"unprecedented\" losses and an unemployment rate in the double digits.\nThe spike in initial claims last week can be attributed to a few factors. Big companies have reported layoffs or indefinite furloughs since the last report, Song observed. And the $2 trillion US relief package passed late last week made unemployment benefits more generous, while extending benefits to self-employed and gig economy workers who weren't covered before.\nOn the radar: The previous week's figure was also revised slightly higher, from 3.28 million to 3.31 million.\nLiz Ann Sonders, chief investment strategist at Charles Schwab, warned that the previous report may have been artificially low due to a backlog of benefit applications. There's anecdotal evidence that \"a lot of people who tried to file [claims] weren't able to, because phone lines were overloaded,\" she recently told me.\nUS stock futures shed some gains after the report posted. Dow futures are up 115 points, or 0.6%. S&P 500 futures are 0.5% higher, while Nasdaq futures have climbed 0.4%.\nOil jumps on hopes of a Saudi-Russia truce\nOptimism that Saudi Arabia and Russia will call off their price war has sent crude prices higher — though it's not clear that two of the world's top oil producers are actually weighing a truce.\nThe latest: President Donald Trump said during a press conference on Wednesday that he'd spoken with the leaders of Russia and Saudi Arabia and thinks \"that they will work it out over the next few days.\"\n\"It's just too simple not to be able to,\" he said.\nBrent crude futures, the global benchmark, have shot up 10.4% to more than $27 per barrel as a result. US oil has rallied 10% to $22.35 per barrel.\nA deal would bring welcome relief to the battered oil market. Prices collapsed after a pact between Saudi Arabia and Russia to limit production broke down, exacerbating a supply glut as thirst for oil dries up.\nThe situation is so dire that the world could soon run out of room to store all the unneeded barrels of oil, my CNN Business colleague Matt Egan reports.\nWhether Saudi Arabia and Russia can come to terms remains to be seen. Russian Energy Minister Alexander Novak told Reuters Thursday that the country has not discussed the oil market situation with Saudi Arabia but does not rule this out.\nWeWork founder misses out on $1 billion\nSoftBank is walking away from a sizable chunk of its WeWork rescue package, which included a nearly $1 billion windfall for ousted founder Adam Neumann, my CNN Business colleague Sherisse Pham reports.\nDetails: The Japanese tech company has backed out of a plan to buy $3 billion worth of shares in the coworking startup from existing shareholders and investors, according to statements from SoftBank and a special committee of WeWork's board. Shares in SoftBank closed up 2.5% in Tokyo following the announcement.\nThe about face cuts deep for Neumann — the October agreement had included an offer to buy up to $975 million worth of the WeWork founder's shares — and is further evidence that SoftBank CEO Masayoshi Son is stepping back from his trademark high-risk investment strategy after the company's shares cratered earlier this year.\nAnd it's a major blow to WeWork, which has been hit hard by the coronavirus pandemic after its botched IPO left it on the brink of insolvency. Many cities where it operates have shut down for weeks on end. It still has to pay long-term leases, even if businesses squeezed by the outbreak cancel contracts.\nUp next\nWalgreens Boots Alliance WBA Chewy CHWY reports earnings before US markets open.follows after the close.\nComing tomorrow: How much did the US unemployment rate tick up in March? Economists surveyed by Reuters think it rose to 3.8% from a record low of 3.5%.", "url": "https://www.cnn.com/2020/04/02/investing/premarket-stocks-trading/index.html"}