{"authors": ["Kevin Liptak"], "date_download": "2020-05-04 16:03:19", "date_modify": "2020-05-04 16:03:19", "date_publish": "2020-04-01 13:48:04", "description": "Most members of President Donald Trump's coronavirus task force have come to agree that Americans should begin wearing face coverings in public and could issue formal guidance on the matter soon, people familiar with the matter said.", "filename": "2020_04_01_politics_trump-coronavirus-masks_index_1588608199.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331180942-04-coronavirus-presser-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_trump-coronavirus-masks_index_1588608199.html", "title": "White House task force could soon recommend Americans wear masks", "title_page": "White House task force could soon recommend Americans wear masks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Most members of President Donald Trump's coronavirus task force have come to agree that Americans should begin wearing face coverings in public and could issue formal guidance on the matter soon, people familiar with the matter said.\nTrump signaled he was open to the idea during Tuesday's White House briefing and members of the task force are working to draft recommendations on how to fashion the coverings to prevent spread of the virus.\n\"My feeling is, if people want to do it, there's certainly no harm to it. I would say do it,\" Trump said Tuesday. \"But use a scarf if you want, you know? Rather than going out and getting a mask or whatever.\"\nHis comments reflect a growing belief by administration officials that more needs to be done to prevent the spread of the virus by infected people who aren't displaying symptoms. A fabric covering of the nose and mouth could prevent the virus from reaching other people, health experts believe.\nPreviously, some members of the task force -- including Dr. Deborah Birx -- cautioned in meetings against recommending Americans wear masks because of a fear it could lull them into a false sense of protection and prevent them from socially distancing.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/trump-coronavirus-masks/index.html"}