{"authors": ["Rachel La Corte"], "date_download": "2020-05-04 20:22:56", "date_modify": "2020-05-04 20:22:56", "date_publish": "2020-04-14 23:23:45", "description": "OLYMPIA, Wash. (AP) — Even once the broad restrictions currently in place in Washington state in response to the coronavirus are lifted, health officials said Tuesday that for months to come the...", "filename": "_942ecf576d8d2358651d4cbd68457bcc_1588623776.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e2dac09a0b9f4c23b477bb62b4fbb991/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_942ecf576d8d2358651d4cbd68457bcc_1588623776.html", "title": "distancing, masks likely needed for months", "title_page": "'New normal': distancing, masks likely needed for months", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A pedestrian wearing a mask walks past paintings featuring lungs and a tree by Burgandy Viscosi on the boarded-up Re-Bar nightclub and theatre, Tuesday, April 14, 2020, in downtown Seattle. Streets and sidewalks in the area were quiet Tuesday as most people in the city are staying and working at home due to the outbreak of the coronavirus. (AP Photo/Ted S. Warren)\nA pedestrian wearing a mask walks past paintings featuring lungs and a tree by Burgandy Viscosi on the boarded-up Re-Bar nightclub and theatre, Tuesday, April 14, 2020, in downtown Seattle. Streets and sidewalks in the area were quiet Tuesday as most people in the city are staying and working at home due to the outbreak of the coronavirus. (AP Photo/Ted S. Warren)\nOLYMPIA, Wash. (AP) — Even once the broad restrictions currently in place in Washington state in response to the coronavirus are lifted, health officials said Tuesday that for months to come the “new normal” will continue to look a lot like daily life does now: teleworking, physical distancing and use of masks in public.\nHealth Secretary John Wiesman said because the virus won’t be able to be stopped or contained until there are treatments and a vaccine, the goal is to make sure that once the state starts to see a decline of cases, “that we do our best not to spring back.”\n“How we go about our daily lives, we’re not going to return to what we knew before COVID-19 for many, many months,” he said. “It’s going to be a new normal, one that is much more aware of safety and biosecurity.”\nMore than 10,500 people in Washington state have tested positive for the virus and at least 516 have died. The virus causes mild to moderate symptoms in most patients, and the vast majority recover. But it is highly contagious and can be spread by those who appear healthy and can cause severe illness and death in some patients, particularly the elderly and those with underlying health conditions.\nDr. Kathy Lofy, state health officer, said that statewide, things have plateaued over the past few weeks, and a she cited a new study by the Institute for Disease Modeling that showed that in three counties — Pierce, King and Snohomish — the rate of transmission was significantly reduced following the implementation of social distancing practices.\n“While we are seeing some good signs, unfortunately we are not yet seeing a clear decline in COVID-19 activity throughout the entire state,” she said.\nWashington state’s stay-at-home order, which has already been extended once, is currently in place through May 4, though Gov. Jay Inslee has warned that it is possible the order may have to be extended once again.\nWiesman said that while details on how the order will be lifted are still being worked out, there will probably be partial easing of some of the restrictions, including possibly businesses opening with reduced occupancy so that social distancing can be maintained.\n“I would imagine that we would modify some of these, hold for a period of time and watch the data to see if the data are saying that we’re still stabilizing or if we’re seeing any hot spots anywhere,” he said. “It will be, in my mind, probably a series of sequential kind of modifications.”\nOn Tuesday evening, Inslee announced new emergency orders related to the virus pandemic to relax deadlines in the criminal justice system, help commercial truck drivers remain on the road, and protect consumers.\nOne proclamation aims to help consumers protect their assets, including federal government stimulus checks, from debt collectors. It suspends statutes that allow the collection of consumer debt judgments, including bank account and wage garnishments and waives accrual of post-judgment interest on consumer debt judgments.\nAnother eases some requirements related to commercial driver’s licenses and learner’s permits so drivers hauling goods can stay on the road.\nA third proclamation suspends statutes of limitations for all crimes and waives the one-year limitation on raising post-conviction challenges in criminal convictions. The order is designed to allow more time for prosecutors to file criminal charges and more time for those convicted of crimes to files challenges to those convictions in court.\nThe proclamations are effective now through May 14.", "url": "https://apnews.com/942ecf576d8d2358651d4cbd68457bcc"}