{"authors": ["Barbara Starr", "Ryan Browne"], "date_download": "2020-05-04 17:01:57", "date_modify": "2020-05-04 17:01:57", "date_publish": "2020-04-09 13:16:52", "description": "A sailor from the USS Theodore Roosevelt who had tested positive for coronavirus was admitted to an intensive care unit in Guam Thursday after being found unresponsive, according to a Navy official.", "filename": "2020_04_09_politics_sailor-_461f55b2a13b76c23f952ca0f625b6d2_index_1588611717.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327101147-uss-theodore-roosevelt-03182020-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_sailor-_461f55b2a13b76c23f952ca0f625b6d2_index_1588611717.html", "title": "Sailor from USS Teddy Roosevelt found unconscious, transferred to intensive care", "title_page": "Sailor from USS Teddy Roosevelt found unconscious, transferred to intensive care   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A sailor from the USS Theodore Roosevelt who had tested positive for coronavirus was admitted to an intensive care unit in Guam Thursday after being found unresponsive, according to a Navy official.\nThe impact of the coronavirus pandemic on Teddy Roosevelt sailors was at the center of a controversy that led to the Tuesday resignation of Acting Navy Secretary Thomas Modly.\nModly dismissed the aircraft carrier's captain Brett Crozier, after the leak of a memo in which he implored Navy officials to urgently evacuate the ship to protect the health of its sailors.\nModly then flew to Guam and delivered remarks to the sailors slamming Crozier as \"stupid\" for not understanding the memo would leak to the media and suggesting the captain had done the leaking himself. Modly's trip to Guam cost the Defense Department an estimated $243,000, according to a Navy official.\nThe sailor tested positive for coronavirus on March 30 and was found unconscious Thursday, he has been admitted to the intensive care unit of the US Navy Hospital on Guam, the Navy said in a statement Thursday.\nAs of Wednesday, 97% of the Theodore Roosevelt's crew have been tested for the virus and 416 sailors have tested positive, according to the Navy, representing more than 20% of all coronavirus cases within the entire US military.\n\"We've tested almost the whole crew now. We still have about 1,000 tests to report out. But 3,170 tested negative, 416 tested positive, 187 of those were symptomatic, 229 were asymptomatic. We still have 1,164 pending results,\" the Vice Chairman of the Joint Chiefs of Staff Gen. John Hyten told reporters at the Pentagon on Thursday.\n\"Sadly this morning we had our first hospitalization of the one sailor,\" Hyten added, saying that crew members who had been moved ashore and placed in isolation were checked on by military medical personnel twice a day.\n\"We're hoping that that sailor recovers, we are praying for him and his family and his shipmates,\" he said.\nHyten said the US military needed to plan for these types of outbreaks in the future as the Defense Department works to cope with the pandemic's impacts.\n\"I think it's not a good idea to think the Teddy Roosevelt is a one-of-a-kind issue. We have too many ships at sea, we have too many deployed capabilities. There's 5,000 sailors on a nuclear-powered aircraft carrier. To think it will never happen again is not a good way to plan. What we have to do is figure out how to plan in these kind of Covid environments,\" Hyten said.\nNearly a week after Modly fired Crozier, the Navy had only evacuated 2,329 of the aircraft carrier's nearly 4,800 sailors.\nThe Navy initially said that it had intended to move 2,700 sailors ashore by April 3. Officials say the process has been slowed due to testing as the government of Guam is requiring that sailors test negative before they can be moved into hotels on the island.\nHyten said that the 2,700 target had been reached Thursday, nearly a week behind schedule.", "url": "https://www.cnn.com/2020/04/09/politics/sailor-teddy-roosevelt-unconcious-covid-modly/index.html"}