{"authors": ["Andrew Demillo"], "date_download": "2020-05-04 20:07:40", "date_modify": "2020-05-04 20:07:40", "date_publish": "2020-04-08 15:10:35", "description": "LITTLE ROCK, Ark. (AP) — A pharmaceutical company has given Arkansas 100,000 tablets of an anti-malarial drug that President Donald Trump is heavily pitching as a treatment for the...", "filename": "_fba75f45f92dfa129c5b9688a6012d62_1588622860.html", "image_url": "https://storage.googleapis.com/afs-prod/media/51c2f346ffa54feb83eed234e3403002/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fba75f45f92dfa129c5b9688a6012d62_1588622860.html", "title": "Arkansas gets donation of Trump-promoted anti-malarial drug", "title_page": "Arkansas gets donation of Trump-promoted anti-malarial drug", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Wednesday, April 1, 2020 photo, nurse Mandy Stuckey reaches into a patient's vehicle window to do a COVID-19 test as fellow nurse Tonya Green, right, looks on at the drive-thru COVID-19 testing site at New Life Church in North Little Rock. The site, a partnership between Sniffle Health and Natural State Laboratories will be open daily from 10 a.m.- 4p.m. through April 11. (Thomas Metthe/The Arkansas Democrat-Gazette via AP)\nIn this Wednesday, April 1, 2020 photo, nurse Mandy Stuckey reaches into a patient's vehicle window to do a COVID-19 test as fellow nurse Tonya Green, right, looks on at the drive-thru COVID-19 testing site at New Life Church in North Little Rock. The site, a partnership between Sniffle Health and Natural State Laboratories will be open daily from 10 a.m.- 4p.m. through April 11. (Thomas Metthe/The Arkansas Democrat-Gazette via AP)\nLITTLE ROCK, Ark. (AP) — A pharmaceutical company has given Arkansas 100,000 tablets of an anti-malarial drug that President Donald Trump is heavily pitching as a treatment for the coronavirus.\nLt. Gov. Tim Griffin and the University of Arkansas for Medical Sciences on Wednesday announced the donation of hydroxychloroquine from Amneal. The pharmaceutical company has announced similar donations to other states, including Texas.\nHydroxychloroquine has long been used to treat malaria, rheumatoid arthritis and lupus. Very small preliminary studies have suggested it might help coronavirus patients, and doctors can prescribe it off-label for COVID-19, the disease caused by the virus. But health experts have said more studies are needed to determine whether it’s safe and effective to use.\nCOVID-19 IN ARKANSAS\nArkansas health officials on Wednesday said the number of coronavirus cases in the state has reached at least 1,071.\nThe Health Department reported the increase in cases, up from at least 997 on Tuesday night. Arkansas has had 18 deaths.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and a cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\nUNEMPLOYMENT CLAIMS RISING\nArkansas officials expect the number of Arkansans filing unemployment claims during the outbreak to hit 150,000 by the end of the week.\nCommerce Secretary Mike Preston said more than 110,000 people have filed for unemployment and his department has been reassigning staffers to handle a flood of calls. The state has waived the requirement to file for unemployment in person.\nThe state will have to build a new system to process claims by independent contractors, freelancers and self-employed workers newly eligible for unemployment benefits under the federal coronavirus aid. Preston said building that system will take three weeks, but that back pay of benefits will be available once the system is set up.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/fba75f45f92dfa129c5b9688a6012d62"}