{"authors": ["Andrew Selsky"], "date_download": "2020-05-04 20:22:57", "date_modify": "2020-05-04 20:22:57", "date_publish": "2020-04-14 21:53:32", "description": "SALEM, Ore. (AP) — A flattening of the number of coronavirus cases in Oregon should persist until at least mid-May, but modeling that shows what to expect beyond then is uncertain and it's too...", "filename": "_a6e72205c0c9eef579086b69b7bc28ec_1588623777.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a6e72205c0c9eef579086b69b7bc28ec_1588623777.html", "title": "Virus: No date to lift restrictions, OR faces budget woes", "title_page": "Virus: No date to lift restrictions, OR faces budget woes", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SALEM, Ore. (AP) — A flattening of the number of coronavirus cases in Oregon should persist until at least mid-May, but modeling that shows what to expect beyond then is uncertain and it’s too soon to tell when the stay-home restrictions can be relaxed, top officials said Tuesday.\n“If we’re doing what we’re doing now through the middle part of May, we’re going to continue to look good, continue to have a kind of flattening of cases if not a slight decrease in cases,” state health office Dean Sidelinger said. “That doesn’t mean that magically in the middle of May we can stop doing what we’re doing.”\nGov. Kate Brown gave no timeline for lifting restrictions, but said said she wants to see things like a declining growth rate of active cases, to make sure healthcare workers have adequate equipment and increased testing capacity.\nBrown, appearing at a news conference alongside Sidelinger — while maintaining social distancing — said the state will be strapped for money because of the massive numbers of layoffs and furloughs the stay-home order has caused.\n“This is going to be a very challenging financial time for the state of Oregon. We are being impacted by a loss of revenue because there are very few folks working,” the Democratic governor said.\nShe said she is focused on keeping people in their homes, ensuring that people get adequate food and have access to health care.\nShe said she will continue to work closely with the leaders of the Legislature, where Democrats hold a supermajority, “to address the fiscal realities.”\nA Republican leader sniped at an announcement Monday by her and the governors of California and Washington state that they would work on a shared approach to re-opening economies while continuing to control the spread of the virus.\n“We cannot give authority to other states, what works in Los Angeles will not work in Enterprise,” said House Republican leader Christine Drazan in a statement. “As we see predictions of the worst recession since the Great Depression, it is essential that we prioritize the unique aspects of this state and our communities.”\nHow an agreement, similar to ones worked out by governors of adjoining states in some other parts of the country, would result in concrete action remains to be seen, but Washington Gov. Jay Inslee indicated it would be limited in scope.\n“It’s more of the issue of how are we going to have consistent-as-we-can testing and contact tracing initiatives. In order for any of these three states to be successful we simply have to have increased products available with which to do this testing,” Inslee said Monday.\nAsked what she thought of President Donald Trump’s insistence that he has “total authority” to order states to open their economies, Brown said it has been the states at the front lines of combating the COVID-19 pandemic: addressing the needs around personal protective equipment, testing capacity and hospital bed capacity.\n“Governors were also the folks that had to make the very tough and hard decisions to shutter parts of our economy,” Brown said. “And I think it’s really important that those of us who are co-located regionally, that we work together, that we align our efforts as we work to make this hard task of reopening our economy.”\nThe Oregon Health Authority has reported two new coronavirus deaths, bringing the total number of people who have died from the disease to 55. The authority also reported 50 new cases of COVID-19, bringing the state total to more than 1,633. A total of 30,730 have tested negative.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\n___\nAndrew Selsky is on Twitter at https://twitter.com/andrewselsky", "url": "https://apnews.com/a6e72205c0c9eef579086b69b7bc28ec"}