{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:25:03", "date_modify": "2020-05-04 20:25:03", "date_publish": "2020-04-29 21:10:33", "description": "\"I just wanted to be able to call in and wish you the best of luck,\" The Duchess of Sussex told her before an interview.", "filename": "entry_meghan-markle-smart-works-call-smile_n_5ea9cd0ac5b63115cec2c8ca_1588623903.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9e61f250000fb10eb0957.png?cache=ja2kgqb2oz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_meghan-markle-smart-works-call-smile_n_5ea9cd0ac5b63115cec2c8ca_1588623903.html", "title": "Meghan Markle's Video Chat Puts A Massive Smile On Woman's Face", "title_page": "Meghan Markle's Video Chat Puts A Massive Smile On Woman's Face | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Meghan Markle managed to put a massive smile on the face of a Smart Works client last month when she joined in on a virtual mentoring session.\nThe Duchess of Sussex became patron of Smart Works last year. The charity offers mentoring, coaching and styling sessions for women who are seeking employment.\nThe duchess spoke with a client before the woman’s job interview and wished her lots of luck.\n“You seem incredibly confident and prepared. And I know everyone here is so excited,” the duchess said during the video chat, which took place on March 27. “When I was reading about what your interests are and especially you have a big focus on mental health as well, right? Psychology? I think that’s excellent.”\nAfter the client explained the potential her internship offered, Meghan said that she thought the woman was “going to be fantastic.”\n“Thank you so much, that means so much to me,” the client said, with a massive smile on her face, later clasping her hands on her heart.\n“Of course! I just wanted to be able to call in and wish you the best of luck and my fingers are crossed for you,” the duchess said.\nMeghan also developed a five-piece capsule clothing collection for Smart Works in partnership with her friend, designer Misha Nonoo, as well as Marks & Spencer, John Lewis and Jigsaw. For every item sold, one was donated to the organization.\nHenry Nicholls / Reuters Meghan, Duchess of Sussex, attends the launch of the Smart Works capsule collection in London on Sept. 12, 2019.\nIn a statement on Smart Works’ website released on Wednesday, Meghan said she is “really proud” to support her patronage, which has continued to provide over 200 hours of virtual service to its clients during the coronavirus pandemic.\n“It’s been such an honour to meet and learn from so many talented women in the Smart Works network over the years, and recently to see the amazing work they’re doing to adapt their programs to the reality of this pandemic,” she said in a message to the charity.\nSince Meghan and Prince Harry stepped back as working members of the royal family on March 31, both have hosted video chats with their U.K. patronages.\nSubscribe to HuffPost’s Watching the Royals newsletter for all things Windsor (and beyond).", "url": "https://www.huffpost.com/entry/meghan-markle-smart-works-call-smile_n_5ea9cd0ac5b63115cec2c8ca"}