{"authors": ["Clare Duffy", "Cnn Business"], "date_download": "2020-05-04 16:28:43", "date_modify": "2020-05-04 16:28:43", "date_publish": "2020-04-07 19:58:37", "description": "Verizon is cutting back on in-home technician visits for internet service installations and repairs to slow the spread of coronavirus.", "filename": "2020_04_07_tech_verizon-internet-installs-coronavirus_index_1588609723.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407152657-verizon-box-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_tech_verizon-internet-installs-coronavirus_index_1588609723.html", "title": "Verizon stops in-home internet repairs and installations except for emergencies", "title_page": "Verizon stops in-home internet repairs and installations except for emergencies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Verizon is cutting back on in-home technician visits for internet service installations and repairs to slow the spread of coronavirus.\n\"To reduce the spread of Covid-19 and keep our employees and customers safe, we are making every attempt to perform work without going into homes or small businesses,\" Howie Waterman, Verizon director of corporate communications in technology and innovation, told CNN Business in an email.\nVerizon VZ As coronavirus spreads across the United States — there are now more than 383,000 reported cases in the country — many health and government officials have urged people to stay home and \"non-essential\" businesses to close.serves 6.2 million internet customers, according to its website , many of whom find themselves working or attending school from home.\nThe company is limiting installations to \"medical emergencies and critical installations,\" Waterman said. Verizon did not immediately respond to a question about what qualifies as a critical installation.\nOn the Verizon website , where customers sign up for new internet service, there is a notice informing customers that \"at this time, our technicians will not be able to enter your home or business to install new services.\" The notice says customers can still place orders, which \"will be held for future installation on a priority basis.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/tech/verizon-internet-installs-coronavirus/index.html"}