{"authors": [], "date_download": "2020-05-04 20:26:56", "date_modify": "2020-05-04 20:26:56", "date_publish": "2020-04-10 11:59:47", "description": "LANSING, Kan. (AP) — Inmates at a Kansas prison where at least 28 people have been sickened by the coronavirus rampaged through offices, breaking windows and setting small fires for several hours...", "filename": "_00c1b9d21e19f2575724329bf67bab7b_1588624016.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b61fa144d3c84d379e210fc566affc80/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00c1b9d21e19f2575724329bf67bab7b_1588624016.html", "title": "Inmates rampage through offices, set fires at Kansas prison", "title_page": "Inmates rampage through offices, set fires at Kansas prison", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - This Feb. 2, 2017 file photo, shows the exterior of the Lansing Correctional Center in Lansing, Kan. State prison officials say inmates in one cell house at the Lansing Correctional Facility are out of their cells and destroying property. Prison spokesman Randy Bowman says the riot started Thursday, April 9, 2020, when several inmates refused to return to their cells. (Mark Rountree/The Leavenworth Times via AP, File)\nFILE - This Feb. 2, 2017 file photo, shows the exterior of the Lansing Correctional Center in Lansing, Kan. State prison officials say inmates in one cell house at the Lansing Correctional Facility are out of their cells and destroying property. Prison spokesman Randy Bowman says the riot started Thursday, April 9, 2020, when several inmates refused to return to their cells. (Mark Rountree/The Leavenworth Times via AP, File)\nLANSING, Kan. (AP) — Inmates at a Kansas prison where at least 28 people have been sickened by the coronavirus rampaged through offices, breaking windows and setting small fires for several hours before the facility was secured, prison officials said Friday.\nThe disturbance involving about 20 men began about 3 p.m. Thursday in medium-security cell house C of the Lansing Correctional Facility, said Rebecca Witte, spokeswoman for the Kansas Department of Corrections. The fires were set in a different living unit at the prison and did not involve the same inmates as the larger disturbance in cell house C, she said.\nThe situation lasted until around 11 p.m., when staff using tear gas were able to re-enter the cell house C and began taking inmates from their cells to another building on the grounds. Everyone was secured by 2 a.m. Friday, she said.\n“We’ve launched an investigation into what took place and what can be done moving forward to ensure that this doesn’t happen again,” Gov. Laura Kelly told reporters Friday. “But rest assured my administration will complete that work, hold those responsible for the outbreak to account and put in place any additional steps that are necessary to ensure that safety and order is maintained. We will learn from this.”\nTwo inmates sustained minor injuries, including one who received stitches for a cut and another who was treated after inhaling tear gas, Kelly said. Both were treated onsite. Staff members were able to get out of the building when the disturbance began and no staff was injured.\nThe governor said that while a review of the disturbance is underway, it appears that officers followed department protocols and that ultimately ensured that injuries were minor and that there was no loss of life.\nCorrections secretary Jeff Zmuda said they do not know yet what triggered the disturbance, which was not in the building where the quarantined inmates are being held.\nNationwide, officials have been wrestling with how to contain the coronavirus within prisons and jails where inmates often live and gather in compact and crowded areas that make social distancing difficult for prisoners and staff alike. To slow the spread of the virus, some states have attempted to reduce jail and prison populations by ordering bail reduction hearings and releasing detainees who are not considered a threat.\nThe Lansing prison has drawn attention recently amid the coronavirus crisis, with the corrections department on Friday reporting 16 staff and 12 inmates with confirmed cases of COVID-19 at the facility. Seven additional inmates are in quarantine for observation.\nEvery staff member and inmate at the Lansing prison received three cloth masks on Thursday. The prison had instituted a plan for reduced movement last Saturday that kept different units in the facility from intermingling.\nOn Thursday, the American Civil Liberties Union of Kansas asked the Kansas Supreme Court to immediately release prisoners who have preexisting medical conditions that make them vulnerable to the coronavirus. That class action petition is on behalf of seven inmates at prisons, including the Lansing facility.\nThe Kansas Supreme Court on Friday granted the ACLU’s request to expedite the matter and set oral argument for Wednesday.\nThe department said Thursday that state officials recognize that inmates and prison staff are especially at risk of infection and have taken steps to reduce the impact of COVID-19 in corrections facilities.\nThe cell house, which housed 169 people on Thursday, sustained “quite a bit of damage” during the disturbance, Witte said. In addition to the broken windows, prisoners damaged computers, furniture, security cameras and lights.", "url": "https://apnews.com/00c1b9d21e19f2575724329bf67bab7b"}