{"authors": ["Opinion Joshua Spivak"], "date_download": "2020-05-04 16:54:42", "date_modify": "2020-05-04 16:54:42", "date_publish": "2020-04-08 16:44:14", "description": "Joshua Spivak writes while once providing the most exciting moments in politics, conventions have become a widely ignored event. And if Democrats are strategic about it, canceling their convention after Sanders has dropped out could prove to be a smart electoral move.", "filename": "2020_04_08_opinions_sanders_0a251e53fab7e0b66ba4e0413c25ea14_index_1588611282.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402130748-02-dnc-2016-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_sanders_0a251e53fab7e0b66ba4e0413c25ea14_index_1588611282.html", "title": "Now that Sanders is out, Dems should cancel convention", "title_page": "2020 election: Now that Sanders is out, Dems should cancel convention (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Joshua Spivak is a senior fellow at the Hugh L. Carey Institute for Government Reform at Wagner College. He blogs at recallelections.blogspot.com . The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) With the coronavirus still wreaking havoc across the country, the Democrats have made the difficult decision to delay the party convention until August. But with Bernie Sanders' decision to suspend his campaign on Wednesday and presumptive Democratic nominee former Vice President Joe Biden noting that a virtual convention may be required, a live, in-person convention is no longer necessary.\nSome party leaders have suggested this is a potential major missed opportunity, but their argument may be flawed. While once providing the most exciting moments in politics, conventions have become a boring, widely ignored event. And if Democrats are strategic about it, canceling a convention could prove to be a strong talking point for the party.\nConventions used to be where journalist H. L. Mencken said \"one lives a gorgeous year in an hour,\" as a presidential contender's hopes could rise out of seemingly nowhere, like Ohio Gov. Warren Harding at the Republican convention in 1920, who was in 6th place after the first ballot, but thanks to several smoke-filled room negotiations, won on the 10th ballot\nOr conventions could mark the end of a candidate's presidential dreams, like Ohio Sen. Robert Taft in 1940, who was in second place after the first ballot at the GOP convention, but could not consolidate support and lost to Wendell Willkie after six ballots.\nBut no convention has made it past a first ballot since 1952, meaning that the horse trading for the nomination that marked past conventions has stopped. And the last time a convention's delegates made a significant choice on their own was in 1956, when Adlai Stevenson added excitement to the Democratic convention by leaving it to the delegates to choose his vice president, who turned out to be Estes Kefauver.\nIn the years since, though, primaries and caucuses have become the standard method of selecting nominees. By the time party leaders arrive at the convention, the nominees are determined.\nNow, there are two practical reasons to have a convention -- beyond trying to give a boost to the candidate before the election. First, if no candidate gains a majority during the primary season, the convention delegates would be called on to select the nominee. And while this could happen again, it will likely not happen 2020, since Biden is now the presumed nominee.\nThe second reason is if the presumptive nominee must be replaced due to death, disability or scandal. But this could be handled in other ways, since a candidate could just as well need to be replaced after the convention. This has happened before -- and that example could serve as a model for the Democrats today, should it happen again.\nIn 1972, Missouri Sen. Thomas Eagleton, slated to be George McGovern's running mate, bowed out after the July convention due to revelations that he had undergone electroshock therapy. In that case, the convention was not reconstituted. Instead, the Democratic National Committee held an emergency meeting in August and ratified the new running mate, Sargent Shriver. An official convention meeting wasn't needed to make that change.\nConventions today amount to several days of political theater -- and not particularly exciting ones at that. While the candidates may want the convention bounce, polls indicate that the bounce is often a momentary uptick that usually dissipates within days. The value of the convention as a campaign rallying point is, at the very least, overstated.\nThe broadcast networks used to devote four days' worth of \"gavel to gavel\" coverage (all-day coverage) to the convention. But that has been cut back, since viewers are just not interested in watching the spectacle, outside of the presidential nominees' speeches. And the ratings of the conventions have wavered over the years. According to Nielsen ratings, Donald Trump's speech in 2016 received an estimated 6 million fewer viewers than John McCain's in 2008.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nDespite the decreased importance of the conventions, President Donald Trump has insisted the Republican National Convention will take place in Charlotte at the end of August, saying there is \"no contingency plan.\"\nThis gives Democrats a unique opportunity to provide a marked contrast. By skipping a convention and instead holding a smaller event with social distancing procedures in place or even an entirely virtual event, Democrats can show that Biden is willing to listen to scientific authority when American lives are at risk. In short, they may be able to gain some needed popular support by taking people's health more seriously than their Republican counterparts.", "url": "https://www.cnn.com/2020/04/08/opinions/sanders-suspends-campaign-cancel-2020-convention-spivak/index.html"}