{"authors": ["Jake Tapper", "Anchor", "Chief Washington Correspondent"], "date_download": "2020-05-04 16:16:51", "date_modify": "2020-05-04 16:16:51", "date_publish": "2020-04-03 20:42:05", "description": "Joe Biden's campaign said Friday the former vice president supports President Donald Trump's January 31 decision to ban foreign nationals who had been in China within the previous 14 days from entering the United States.", "filename": "2020_04_03_politics_joe-biden-trump-china-coronavirus_index_1588609011.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191205005729-joe-biden-donald-trump-split-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_joe-biden-trump-china-coronavirus_index_1588609011.html", "title": "Biden campaign says he backs Trump's China travel ban", "title_page": "Biden campaign says he backs Trump's China travel ban - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Joe Biden's campaign said Friday the former vice president supports President Donald Trump's January 31 decision to ban foreign nationals who had been in China within the previous 14 days from entering the United States.\n\"Joe Biden supports travel bans that are guided by medical experts, advocated by public health officials, and backed by a full strategy,\" Kate Bedingfeld, Biden's deputy campaign manager, told CNN. \"Science supported this ban, therefore he did too.\"\nThe comment comes after weeks of Trump's reelection campaign accused Biden of calling Trump's travel ban xenophobic -- though the former vice president never explicitly said as much. Biden's campaign has said he was not referring to Trump's travel ban, but had not clarified his position on the ban.\nBiden first accused Trump of xenophobia in dealing with the coronavirus pandemic on January 31, at a campaign rally in Fort Madison, Iowa -- in comments that came shortly after Health and Human Services Secretary Alex Azar announced the travel ban.\n\"You know we have right now a crisis with the coronavirus, emanating from China,\" Biden said then. \"The national emergency and worldwide alerts. The American people need to have a president who they can trust what he says about it. That he is going to act rationally about it. In moments like this, this is where the credibility of a president is most needed, as he explains what we should and should not do. This is no time for Donald Trump's record of hysterical xenophobia and fear mongering to lead the way instead of science.\"\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/joe-biden-trump-china-coronavirus/index.html"}