{"authors": ["Opinion Peter Bergen"], "date_download": "2020-05-04 16:24:45", "date_modify": "2020-05-04 16:24:45", "date_publish": "2020-04-07 00:47:12", "description": "Peter Bergen writes that around the world, some religious gatherings continue to take place despite widespread knowledge that large groups of people facilitate in spreading the coronavirus -- and in defiance of government restrictions on such gatherings.", "filename": "2020_04_06_opinions_religious-gatherings-coronavirus-bergen_index_1588609485.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402092025-01-us-coronavirus-religious-gatherings-0315-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_religious-gatherings-coronavirus-bergen_index_1588609485.html", "title": "Religious gatherings around the globe inflame the virus", "title_page": "Religious gatherings around the globe inflame the virus  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. He is the editor of the Coronavirus Daily Brief and author of the new book \"Trump and His Generals: The Cost of Chaos.\" The opinions expressed in this commentary are his own. View more opinion articles at CNN.\n(CNN) Around the world, some religious gatherings continue to take place , despite widespread knowledge that large groups of people facilitate in spreading the coronavirus -- and in defiance of government restrictions on such gatherings.\nExamples of this inexplicably irresponsible behavior can be found in Iraq, Israel, Pakistan and the United States.\nIn Israel, ultra-Orthodox Jews continue to hold crowded religious gatherings despite the government banning such meetings, according to the New York Times. Predictably, Covid-19 may be spreading up to eight times faster among Israel's ultra-Orthodox Jews than it has among the general population.\nThe problem has become so severe that the Israeli government has locked down an ultra-Orthodox city, Bnei Brak, and roadblocks prevent residents from leaving it.\nIn the Pakistani financial capital of Karachi, which has a population of around 15 million, the provincial government ordered a lockdown during Friday prayers when the faithful typically gather in mosques. On Friday enraged worshippers clashed with police as they tried to enforce the lockdown.\nIn Iraq, in late March abaya-clad women crowded the shrine of Imam Musa al-Kadhim in Baghdad while implying their faith kept them safe from the coronavirus.\nOn Sunday, Pastor Tony Spell of the Life Tabernacle Church near Baton Rouge, Louisiana held services despite stay at home orders from Louisiana's governor because of the pandemic. Channeling his inner Franklin D. Roosevelt (FDR), Spell told hundreds of his parishioners, many of whom had arrived on more than two dozen buses, that they had \"nothing to fear but fear itself.\"\nThe danger of such religious gatherings is underlined by anecdotes of how the coronavirus may have spread in countries such as France and India. A prayer meeting at a church in Mulhouse, France in late February unwittingly kicked off \"what soon became one of Europe's largest regional clusters of infections, which then quickly spread across the country and eventually overseas,\" according to the Washington Post. In another case reported by the Washington Post, last month in India thousands of members of a Muslim missionary group had a gathering in New Delhi, which subsequently became a \"super-spreader\" event as attendees went on to spread the virus around the country when they dispersed.\nThe US should look to these cases as examples of what not to do. While many want to continue worshiping in this time of crisis, the risks of gathering to hold in-person services are too great.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nThe Lord does indeed work in mysterious ways and even President Donald Trump is getting in on the act, saying at a press conference at the White House on Saturday that he is considering letting \"special\" churches hold services outside \"with great separation\" for Easter this coming Sunday . This came during the same press conference where he warned that Americans should expect \"a lot of death\" in coming weeks.", "url": "https://www.cnn.com/2020/04/06/opinions/religious-gatherings-coronavirus-bergen/index.html"}