{"authors": ["Laura Smith-Spark", "Valentina Di Donato", "Stephanie Halasz"], "date_download": "2020-05-04 16:56:09", "date_modify": "2020-05-04 16:56:09", "date_publish": "2020-03-27 10:04:04", "description": "As the coronavirus pandemic sweeps the globe, women's access to abortion has become one of many healthcare provisions thrown into jeopardy. One abortion provider operating in 37 countries has warned of far-reaching impacts worldwide.", "filename": "2020_03_27_health_coronavirus-abortion-access-intl_index_1588611369.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327065636-01-abortion-clinic-ms-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_27_health_coronavirus-abortion-access-intl_index_1588611369.html", "title": "Abortion access thrown into jeopardy by coronavirus pandemic", "title_page": "Abortion access thrown into jeopardy by coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN) As the coronavirus pandemic sweeps the globe, women's access to abortion has become one of many healthcare provisions thrown into jeopardy.\nAbortion provider Marie Stopes International, which operates across 37 countries, has warned of far-reaching impacts worldwide if women's reproductive rights are not protected as governments limit citizens' activities.\n\"Our initial projections warn that unless governments act now, up to 9.5 million vulnerable women and girls risk losing access to our contraception and safe abortion services in 2020 due to the Covid-19 pandemic. The consequences would be devastating,\" it said in an online statement Friday.\nThe organization estimates that disruption to its services due to the coronavirus could lead to an additional 3 million unintended pregnancies, 2.7 million unsafe abortions and 11,000 pregnancy-related deaths.\nIn the US, several states' officials opted to include elective abortions in the medical procedures limited during the coronavirus outbreak.\nState officials say the steps are necessary to preserve protective supplies that are becoming increasingly precious as the pandemic worsens. But abortion-rights groups have decried the actions, saying officials are exploiting a public health crisis to advance a political agenda, and court battles continue.\nFederal judges in Texas, Ohio and Alabama moved last week to block those states' orders limiting elective abortions. While an appeals court then reversed course and temporarily allowed the Texas order to go into effect , another appeals court on Monday affirmed the lower court's ruling blocking Ohio's order.\nA federal judge also blocked a state executive order in Oklahoma on Monday limiting abortion access. The state said it would appeal.\nThousands of miles away, in Italy's worst-affected region, Lombardy, some struggling hospitals have closed their abortion services and are sending women to other hospitals for care, the head of a gynecologists' association that supports abortion rights told CNN late last month.\nJUST WATCHED Italy's coronavirus patients are dying alone Replay More Videos ... MUST WATCH Italy's coronavirus patients are dying alone 02:01\nThe move has greatly complicated abortion access for women in those areas, said Dr. Silvana Agatone, president of LAIGA.\nAlthough abortions are considered urgent medical interventions, under Italian law each region is allowed to handle the provision as it sees fit, Agatone said. Her group had not yet been able to speak with the health minister about a national response, she added.\nThe Italian health ministry did not respond to CNN's request for comment.\nMeanwhile, two abortion rights advocate groups in Germany warned that women's health and lives were being put at risk as restrictions on movement and counseling center closures limit their access to abortion services.\nThe UK government caused confusion last month when it first announced that women in England would temporarily be allowed to access early medical abortion at home, rather than attending a clinic -- and then, hours later, reversed its decision.\nA week later, the government guidance allowing women temporarily to access early medical abortion without traveling to a clinic was reinstated\nUK changes\nAbortion providers welcomed the UK government's confirmation on March 30 that women in England seeking an abortion in the first 10 weeks of pregnancy could take both the pills needed for a termination at home rather than having to go to a clinic to take the first one.\nWales and Scotland have also changed their policies to allow early medical abortion at home in the first trimester of pregnancy, up to 10 weeks and 12 weeks respectively.\nJUST WATCHED His mom was a domestic violence victim. Why Covid-19 is worrisome Replay More Videos ... MUST WATCH His mom was a domestic violence victim. Why Covid-19 is worrisome 02:59\nThe British Pregnancy Advisory Service (BPAS), a charity which helps nearly 100,000 women a year with pregnancy counseling and abortion care, said it would keep people safer at a time when UK citizens are largely barred from leaving their homes.\n\"This will prevent tens of thousands of women from having to travel needlessly to clinics and will also enable many of our healthcare professionals to provide teleconsultations and prescriptions from the safety of their own homes,\" said BPAS Chief Executive Ann Furedi.\nBPAS confirmed on Twitter that it was launching its \"pills by post service\" on Wednesday, allowing women to access early abortion care at home. \"Telemedicine is a safe, effective method of delivering early abortion care and will prevent thousands of unnecessary journeys,\" it said.\nMarie Stopes International also welcomed the UK government's move and said its branch there would provide remote services in Britain from April 6.\nNew laws regarding abortion came into force in Northern Ireland on March 31 but do not include provision for allowing early medical abortion wholly at home.\nBPAS and Marie Stopes International called for policy makers urgently to review the situation.\n\"In Northern Ireland, abortion care is now lawful, but services have not yet been established and telemedical abortion care is not permitted under the regulations produced by the government last week,\" said Furedi, of BPAS.\n\"As a result, women are being forced to travel hundreds of miles via ferry and public transport to clinics in England at a time when they are also being told to stay at home to save lives.\"\n'Acute risk'\nMeanwhile, abortions are still happening in Germany, according to CNN's German affiliate RTL, but women face delays in accessing counseling centers -- a requirement there before terminating a pregnancy.\nGroups including abortion rights advocate organizations Pro Familia and Doctors for Choice wrote an open letter last month to doctors performing abortions in which they warned that \"access to abortions is now at acute risk\" because of the restrictions imposed to help contain the pandemic.\nClosures or reduced opening hours for counseling centers have led to serious delays for women seeking the required in-person counseling appointment before any abortion takes place, the letter warns. They may also struggle to get to clinics providing abortions because of travel restrictions.\nThese issues mean that women may no longer meet the legal deadline by which a legal termination is permitted, the letter states, and increases the risk that women will resort to \"unsafe abortion methods.\"\nThe abortion rights advocate organizations urge federal and state governments and health insurers to make it possible for all women to seek advice by video call or telephone, rather than having to attend counseling appointments in person.\nCNN reached out to the German government for comment.\nFrance commits to access\nOfficials in France and Spain have sought to reassure women that their reproductive healthcare rights will be protected.\nThe head of France's national health agency, Jérôme Salomon, insisted last month that the country's abortion centers would remain open during the crisis despite tight restrictions on people's movements.\nJUST WATCHED Drive-through funerals held in Spain's coronavirus epicenter Replay More Videos ... MUST WATCH Drive-through funerals held in Spain's coronavirus epicenter 01:53\nSalomon also stressed France's commitment to ensuring women retain access to vital services during the country's lockdown.\n\"We want to uphold women's sexual and reproductive rights. Access to the contraceptive pill will be maintained. Medical monitoring for pregnancies must continue to be ensured, including the three necessary ultrasound scans. We are exploring the possibilities of doing this through video calls,\" he said.\nMore than 100 health professionals involved in abortion provision put their names to a piece in French national newspaper Le Monde on March 31 calling for emergency measures regarding abortion.\nTheir proposals included providing access to medical abortion at home until seven weeks of pregnancy, giving minors access to abortion straight after their first medical consultation, rather than after 48 hours, and allowing abortion up to 14 weeks of pregnancy, rather than 12.\nIn Spain, the Association of Clinics Accredited for the Voluntary Interruption of Pregnancy tweeted that its clinics remained open because abortion is part of the country's national health provision. \"It's an urgent resource which cannot be postponed and should be attended to promptly,\" the association said.\nOther abortion clinics in Spain also tweeted that they were continuing their work.", "url": "https://www.cnn.com/2020/03/27/health/coronavirus-abortion-access-intl/index.html"}