{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:28:09", "date_modify": "2020-05-04 20:28:09", "date_publish": "2020-04-30 09:45:03", "description": "Big city districts have warned that they may have to cut as many as 275,000 staff members combined as tax revenue plummets due to economic shutdowns.", "filename": "entry_district-layoffs_n_5ea9d25fc5b6ad0a43178b88_1588624089.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9d2f5250000fb10eb0936.jpeg?cache=iek2shmh9o&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_district-layoffs_n_5ea9d25fc5b6ad0a43178b88_1588624089.html", "title": "School Districts Are Preparing To Lay Off Thousands Amid Coronavirus-Related Budget Shortfalls", "title_page": "School Districts Are Preparing To Lay Off Thousands Amid Coronavirus-Related Budget Shortfalls | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Robert Runcie, superintendent of Broward County Public Schools in Florida, is currently preparing for a disaster.\nIt’s not related to the multitude of logistics required in transitioning hundreds of thousands of students to distance learning after the coronavirus pandemic closed all of the district’s hundreds of schools. It’s the school budget cuts that could come next, a result of sharp state and local revenue shortfalls after the crisis stopped the American economy in its tracks.\n“It’s going to be really dramatic,” Runcie, whose district is the sixth largest in the country and serves more than 260,000 students, said of the potential cuts.\nOn Tuesday, Runcie was one of more than 60 superintendents to sign a letter to congressional leaders warning that big urban school districts could be forced to lay off as many as 275,000 teachers unless the federal government intervenes. The schools are in desperate need of funds because they’re facing an estimated 20% loss in local and state revenues, according to the letter, sent under the banner of the Council of the Great City Schools.\nSchool districts were already anticipating a difficult year. Their students have endured months of academic interruption, potentially losing months of learning. Schools are scrambling to find ways to pay for unexpected coronavirus-related expenditures as their buildings have turned into community feeding hubs around the country. Millions of parents have lost their jobs, leading to home-life upheaval for kids. The sudden loss of staff could turn a bad situation into a disaster.\n“The ramifications are not only profound for the students involved, but for the nation,” says the letter, which includes the signatures of the superintendents of New York City’s and Los Angeles’ schools. “This educational catastrophe could weaken the country’s economic foundation for years.”\nIndividual school districts are primarily funded through a combination of state and local revenue, with a small portion of funding from the federal government. At the local level, school districts are often reliant on dollars generated through property taxes, which can be a disadvantage for poorer areas, inextricably tying districts’ fate to that of their communities’ success. At the state level, education represents one of the biggest items on a budget, often funded through a combination of income taxes and sales taxes.\nAs states work to revise their budgets amid unanticipated deep revenue losses, school districts have been told to prepare for draconian cuts.\nIn Florida, Runcie has told his community to brace for cuts of up to 25% in state funding for public schools, even though Florida already has one of the lowest levels of per-pupil spending in the country. He can quickly tick off the reasons for the new deficits.\n“Disney shut down ― Disney accounts for about 50 million visitors to Florida,” he noted. “The cruise industry is shuttered. So are restaurants. Last I heard, hotel occupancies were down in the single digits.”\n“We know it’s coming, and unless there’s a federal infusion to help support that and offset what we see coming, it’s going to be really dramatic,” Runcie added.\nIf the district doesn’t get help, its leaders will start by looking to see where it could make cuts for “everything that is outside of the classroom.” But eventually it could affect class size, transportation services and, in the worst-case scenario, staffing, Runcie said.\nOutside of Spokane, Washington, Freeman School District Superintendent Randy Russell said he’s preparing three budgets for next year: a normal one, one including a 5% cut and a doomsday scenario for a 10% cut.\n“You’re talking about cutting right into the bone if you have to cut 5 to 10%,” said Russell, who leads a small district of about 900 students in kindergarten through 12th grade.\nHe estimates that 82% of his district’s budget goes to basic education services and programs, such as career and technical education, and salaries and benefits for staff. Any cut means a cut for “people and programs.” It could mean a new fee for extracurricular activities. It certainly means less wraparound and academic support for kids. “Everything would be on the table,” he said.\n“As soon as you start bumping up class sizes or reducing personnel, then you’re taking away support systems for kids, and nobody wins in that scenario,” Russell said.\nBut so far, Marguerite Roza, director of the Edunomics Lab at Georgetown University and an expert in school finance, worries that the severity of the budget shortfalls aren’t being properly communicated to school leaders. That means that they, in turn, have been keeping communities and teachers in the dark. Staff and communities need time to prepare and process what’s to come, she said.\nDistricts could start making cuts now to avoid further pain in the fall, Roza said, such as halting pay to substitute teachers while schools are closed (she says she’s heard of some continuing to pay them even amid school closures). Indeed, throughout the country, districts are the biggest employer in many communities.\n“The teacher shortage is now gone,” said Roza, noting that districts may be loath to hire in the fall. “What are people going to do about all these raises they promised?”\nIn New York, where the governor has warned that state support for schools could fall as much as 20%, teachers and advocates have already started fighting back against cuts. Earlier this month, New York City Mayor Bill de Blasio unveiled a budget plan that also included significant cuts to education services, including a hiring freeze and cutbacks in counseling.\nNew York City Council members, community members and teachers said at a virtual press conference Monday that the city and state should reduce contracts for costly consultants and institute higher taxes on the states’ billionaires to offset revenue losses. One of the more controversial suggestions included a hiring freeze for the New York Police Department.\nElementary school teacher Liat Olenick told the story of a 7-year-old student who was struggling academically already before this crisis, who has a family in transitional housing, and who has been sick, even spending some time in the hospital.\n“What happens to this 7-year-old when schools reopen and her class is even bigger than it was before and our already part-time school counselor is even more part-time?” asked Olenick.\nThe Council of the Great City Schools letter asks congressional leaders for a significant infusion of cash to help stave off some of these cuts. The March coronavirus relief package provided schools with about $13.5 billion in relief, but school leaders say this only scratches the surface of the problem and are asking for $200 billion more dollars, including for special education services and Title I, the program that helps fund districts that serve primarily low-income students.\nIndeed, the group points to an injection of funds Congress provided during the 2008-2009 Great Recession. These funds offered a lifeline to schools, says the letter, though some states still aren’t up to their pre-recession spending levels.\n“The situation now, however, is far more severe and promises to cause much more substantial damage,” says the letter.\n“Vast numbers of students will be entering the next school year substantially behind academically — at exactly the time when budget cuts due to local and state revenue shortfalls will be occurring.”", "url": "https://www.huffpost.com/entry/district-layoffs_n_5ea9d25fc5b6ad0a43178b88"}