{"authors": ["Arman Azad"], "date_download": "2020-05-04 16:07:38", "date_modify": "2020-05-04 16:07:38", "date_publish": "2020-04-02 04:04:41", "description": "The company claimed it would distribute the first coronavirus antibody test authorized by the US Food and Drug Administration. It promised to detect current and past infections in as little as two minutes -- with just a tiny amount of blood.", "filename": "2020_04_02_health_coronavirus-test-false-fda-authorization_index_1588608458.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401203232-bodysphere-coronavirus-test-copy-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_coronavirus-test-false-fda-authorization_index_1588608458.html", "title": "The 'game changer' that wasn't: Company falsely claimed FDA authorization for coronavirus blood test", "title_page": "The 'game changer' that wasn't: Company falsely claimed FDA authorization for coronavirus blood test - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The company claimed it would distribute the first coronavirus antibody test authorized by the US Food and Drug Administration. It promised to detect current and past infections in as little as two minutes -- with just a tiny amount of blood.\n\"This is a game changer,\" said the company, Bodysphere, in a statement on Tuesday. It promised to deliver millions of test kits within weeks.\nMultiple news outlets reported the announcement. The company's website, with the words \"MADE IN USA\" beneath a slick logo, showcased photos of the test, including the FDA logo plastered on its box.\nAnd in a tweet on Monday, Bodysphere said: \"It is not the first time we will play a major role in changing the world.\"\nBut the company's claims of an FDA-authorized coronavirus antibody test have been explicitly refuted by the FDA.\nBodysphere said Tuesday that the serology test had received what is known as an Emergency Use Authorization from the FDA. Serology is another word for the study of blood, and the company claimed the test could detect antibodies with a process as simple as a glucose test.\nBut Michael Felberbaum, an FDA spokesperson, told CNN later that day: \"No serology tests have received an authorization to test for coronavirus.\"\nD'Anne Mica, a Bodysphere spokesperson, maintained to CNN throughout the day on Tuesday that the company had received authorization for the test, despite the FDA's statement.\nBut on Wednesday, Mica said \"there was a misunderstanding\" and acknowledged that the FDA never issued the emergency authorization.\nIn a statement that night, the company's CEO, Charlton Lui, said his company \"mistakenly believed\" it had received the authorization \"in the rush\" to deliver tests, blaming a misunderstanding of paperwork.\nAlso on Wednesday, two of the news organizations that reported on Bodysphere -- Reuters and Axios -- retracted their articles.\nThe damage, it seems, had already been done: Following the company's false claims, people scrambled to access the tests. \"It crashed the phone line,\" said Mica when asked how many orders the company had received.\nMica said that \"people desperate to get their hands on these test kits\" had been calling her, even though she is a media representative. \"It's just been blowing my mind.\"\nShe said she had received messages from people clamoring for tests: \"Mothers from North Carolina just wanting to get their kids tested because they've had all of the symptoms. Somebody called me from Tampa.\"\nA foreign embassy had even called four times, she said.\nA different antibody test has now been authorized\n\"HUMANITY GOES HIGH-TECH,\" Bodysphere says on its website, which also lists N95 masks, sanitizing gel and hospital beds.\nThe site, which features photos of lions and an astronaut, says that Bodysphere has \"Alchemy Laboratories\" and is involved in the creation of \"Hemp Bio Plastics.\"\nThe company's most prominent product, though, is its rapid serology test.\nSuch tests are able to look for antibodies against the coronavirus -- a sign of recent or past infection even if somebody never showed severe symptoms.\nThe FDA has cautioned that serology tests \"should not be used as the sole basis to diagnose or exclude [coronavirus] infection or to inform infection status.\"\nBut in an Emergency Use Authorization dated Wednesday , the FDA green-lit an antibody test from a different manufacturer, Cellex Inc.\nThe FDA told the company \"it is reasonable to believe that your product may be effective in diagnosing COVID-19,\" adding that the test's benefits outweighed its risks. The Cellex test, then, became the first antibody test authorized by the FDA.\nBeyond diagnosing the virus, serology tests may be useful for research, such as determining what percentage of the population has ever been infected, according to the US Centers for Disease Control and Prevention.\nThat would allow researchers to understand how widespread coronavirus infections truly are, including asymptomatic or mild cases. But only the one antibody test, from Cellex, has been explicitly authorized by the FDA as of Thursday.\nOn Wednesday, the FDA logo had disappeared from photos of the test on Bodysphere's website. A downloadable catalog from the company, however, still showed the FDA logo above the test.\nA variety of other products in the catalog, including hospital beds and face shields, featured the FDA logo as well.\n\"The FDA logo is for the official use of the U.S. Food and Drug Administration (FDA) and not for use on private sector materials,\" the FDA says on its website.\n\"To the public, such use would send a message that FDA favors or endorses a private sector organization or the organization's activities, products, services, and/or personnel (either overtly or tacitly), which FDA does not and cannot do.\"\nFDA authorization would have signaled confidence in the test\nThe FDA, under rules issued last month, allows companies to make and distribute serology tests that haven't received authorization.\nBut according to Felberbaum, the FDA spokesperson, those companies are required to include something along the lines of: \"This test has not been reviewed by the FDA.\"\nThat's important, because antibodies -- which serology tests look for -- are our body's response to an infection and can take time to develop. That means these blood tests may not be able to identify recent infections.\nMost coronavirus tests, in contrast, generally require a patient to be swabbed. The test then looks for the virus's genetic information, and should be able to detect whenever somebody is shedding the virus.\nBodysphere said in its press release that the blood test \"has not been FDA cleared or approved,\" but the company falsely claimed the test had \"been authorized by the FDA under an Emergency Use Authorization for use by authorized laboratories and patient care settings.\"\nFull FDA approval is an extensive process that no coronavirus test has yet achieved. But an Emergency Use Authorization from the agency would have been a sign that regulators believed the benefits of using a quickly designed blood test outweighed the risks, such as the possibility of false positives or negatives.\nIn its press release, Bodysphere said the two-minute serological coronavirus test had 91% specificity, meaning that 9% of people could falsely test positive for the virus without being infected.\nNot made in the USA, despite the company's claims\nMica, the Bodysphere spokesperson, told CNN on Tuesday that it would take time to send documentation for the test because the company making the tests was based in China. \"[Bodysphere] is the authorized distributor, the US distributor,\" Mica said.\n\"The kits are coming from China, so, they're not coming from China, but the company is, everything, you know, is manufactured in China right now,\" she said.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nIn a call Wednesday, after acknowledging that the FDA had not issued an emergency authorization for Bodysphere's test, Mica confirmed that the test is not in any way designed or manufactured in the United States.\nThe company's website still suggests that its products are US-made, however. Beneath the company's logo, for example, are the words \"MADE IN USA.\" And a page on the company's catalog blares \"Proudly American\" in cursive.\nWhile Mica said Bodysphere had already received numerous requests for its test, the company admitted publicly on Wednesday that it had not received the authorization it had originally claimed.\nIn a Twitter reply to a skeptical observer, the company said, \"you seem to be in a combat to prove that our company is not trustable.\n\"We applied for FDA as well,\" the company added, but \"the process takes time. And the virus does not wait.\"", "url": "https://www.cnn.com/2020/04/02/health/coronavirus-test-false-fda-authorization/index.html"}