{"authors": ["Adam Shanks"], "date_download": "2020-05-04 20:03:45", "date_modify": "2020-05-04 20:03:45", "date_publish": "2020-04-07 00:00:00", "description": "Amid a surge of new demand in a shuttered economy, Gov. Jay Inslee announced a new statewide relief fund on Tuesday to support the state’s food banks and suppliers, including Second Harvest in...", "filename": "_26588615127045a98fb3d4c7c9f2c6d0_1588622625.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_26588615127045a98fb3d4c7c9f2c6d0_1588622625.html", "title": "‘Demand is way beyond the supply’ at Second Harvest, but new fund aims to aid food banks", "title_page": "‘Demand is way beyond the supply’ at Second Harvest, but new fund aims to aid food banks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "‘Demand is way beyond the supply’ at Second Harvest, but new fund aims to aid food banks\nAmid a surge of new demand in a shuttered economy, Gov. Jay Inslee announced a new statewide relief fund on Tuesday to support the state’s food banks and suppliers, including Second Harvest in Spokane.\nThe effort, dubbed the WA Food Fund and managed by Seattle-based philanthropic organization Philanthropy Northwest, aims to buttress the resources and funding for food banks in Washington struggling to meet a surge in demand, as social distancing measures implemented to stem the spread of coronavirus take a harsh toll on the economy and put thousands out of work.\nSecond Harvest, Food Lifeline and Northwest Harvest will receive direct support through the WA Food Fund, a statewide effort that will seek support from businesses, organizations and individuals.\n“All the indicators tell me this is going to be serious, significant and prolonged, and we’ve got to have as much support as we can to feed folks,” said Jason Clark, president and CEO of Second Harvest, a nonprofit that distributes food to more than 200 neighborhood food pantries and meal centers in Eastern Washington. The organization also serves North Idaho.\nThe job losses caused by the coronavirus have been staggering, locally and nationally, and exceeded the worst weeks of the Great Recession more than a decade ago. Nearly 182,000 people filed new claims for unemployment benefits in Washington last week, more than five times the amount of the worst week in 2008.\nFor organizations like Second Harvest, that leads to greater demand. The state estimates that 1.6 million people across Washington will require food assistance during the economic tumult caused by the coronavirus, more than double the typical number.\n“By combining forces, we can draw attention to the need and reach everybody that we possibly can,” Washington first lady Trudi Inslee told The Spokesman-Review on Tuesday.\nMany people are wondering how to help, and the WA Food Fund offers Washington residents an opportunity to aid the coronavirus response. The fund is an efficient, low-overhead way to offer direct support, according to Inslee.\n“This is something that people can do from their home. They can send a few dollars in,” Trudi Inslee said, adding it’s “a long-term campaign” positioned to respond to the enduring economic consequences of the virus.\nWorking with state officials, Philanthropy Northwest scrambled to piece together a fund in the span of about a week.\n“It’s a completely new way of business, which is of course required in this case,” Philanthropy Northwest CEO Kiran Ahuja said.\nSecond Harvest\nBefore the pandemic, about 90% of Second Harvest’s resources came from private donations, farmers, wholesalers and grocery stores. The remaining 10% was directly government funded.\nIn the face of the economic devastation caused by the coronavirus, that equation has to flip rapidly, Clark said.\n“There’s going to be such a tremendous surge in demand that there’s no way the charitable hunger relief system is going to be able to step up,” Clark said.\nBut it will take time, possibly many weeks, for government intervention. In the meantime, food distribution centers like Second Harvest will lean on funds raised through efforts like the WA Food Fund to enable it to aggressively pursue the shortened food supply, despite increased costs.\n“This is happening everywhere all at once,” Clark said. “It’s not like anyone’s being negligent, it’s just everything is being overwhelmed.”\nAs demand across the food industry skyrocketed, Second Harvest watched its ability to restock supplies wane, particularly with high-demand nonperishables like pasta and beans. It’s difficult to pin down what the demand for food will be in a coronavirus economy, but Second Harvest already has seen glaring indicators of what the future may bring.\nOn March 24, Second Harvest threw together 250 emergency boxes of food and posted on social media that it would distribute from its Pasco facility. About 600 cars showed up. The Pasco Police Department had to be called in to direct traffic and the boxes were gone in roughly 40 minutes.\n“We shut down the Port of Pasco with traffic,” Clark said. “The need is going to surge.”\nBut an empty pasta shelf at the local grocery store is an empty shelf at Second Harvest.\nAbout half of the 16 million pounds of food Second Harvest distributes every year is “grocery rescue,” unsold food donated by grocery stores. But amid the increased demand by panicked shoppers, “that has been wiped out,” Clark said.\n“The consumer demand has surged so much that they basically don’t have as much waste anymore,” Clark said.\nWith half of its food stream significantly disrupted, Second Harvest is scrambling to find alternatives – like spending thousands of dollars on a truckload of garbanzo beans that needs to be repacked.\nEven with a quick burst in support through the WA Food Fund, Second Harvest expects it could have to wait weeks to have orders fulfilled by suppliers.\n“The sooner we start, the sooner we may have a solution,” Clark said. “The demand is way beyond the supply right now, and we are just not able to make all the logistics work smoothly enough.”\nMany neighborhood food pantries have reduced their hours and altered their services. Some previously offered a walk-through, grocery-store experience but have resorted to curbside pickup to limit one-on-one interaction.\n“It’s really, really challenging to solve. It’s like everything in our business has been completely disrupted,” Clark said.\nHow to help\nPhilanthropy Northwest and its partners are committed to reassessing the food banks’ need for support, knowing that it remains unclear when federal and state support might lessen their burden. In the meantime, Philanthropy Northwest will work to keep the campaign “front and center,” Ahuja said.\nIn addition to managing the fund and promoting it publicly, Philanthropy Northwest is working behind the scenes to solicit support from its members, which include foundations across the region.\n“We’re already starting to get a really good response,” Ahuja said.\nDonations can be made at philanthropynw.org/wa-food-fund.\nDonating online is easy, Inslee said. She and her husband, the governor, contributed Monday.\n“It’s needed statewide,” she said. “Hunger doesn’t know any geographic boundaries.”", "url": "https://apnews.com/26588615127045a98fb3d4c7c9f2c6d0"}