{"authors": ["Andrew Welsh-Huggins"], "date_download": "2020-05-04 20:19:28", "date_modify": "2020-05-04 20:19:28", "date_publish": "2020-04-09 14:20:22", "description": "COLUMBUS, Ohio (AP) — Nearly 700,000 people in Ohio filed for unemployment in the last three weeks as the coronavirus pandemic continues to shake the economy, almost double the claims filed last...", "filename": "_37c180457f7b30c7a5469d2faa455532_1588623568.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3bfa45b62b6b4ebe95750bfc20d31072/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_37c180457f7b30c7a5469d2faa455532_1588623568.html", "title": "Nearly 700,000 in Ohio file for unemployment in just 3 weeks", "title_page": "Nearly 700,000 in Ohio file for unemployment in just 3 weeks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Nearly 700,000 in Ohio file for unemployment in just 3 weeks\nWearing a homemade mask, Kathy Verhoff of Kalida, Ohio donates blood as phlebotomist Jacqueline Line looks on at the American Red Cross, Tuesday, April 7, 2020 in Lima, Ohio. Approximately 36,000 units of red blood cells are needed every day in the U.S. (Craig J. Orosz/The Lima News via AP)\nWearing a homemade mask, Kathy Verhoff of Kalida, Ohio donates blood as phlebotomist Jacqueline Line looks on at the American Red Cross, Tuesday, April 7, 2020 in Lima, Ohio. Approximately 36,000 units of red blood cells are needed every day in the U.S. (Craig J. Orosz/The Lima News via AP)\nCOLUMBUS, Ohio (AP) — Nearly 700,000 people in Ohio filed for unemployment in the last three weeks as the coronavirus pandemic continues to shake the economy, almost double the claims filed last year, according to the state.\nA look at coronavirus-related developments on Thursday:\n___\nECONOMY\nNearly 700,000 people filed for unemployment in the last three weeks, the state Department of Job and Family Services said, almost double the 364,603 claims filed in all of 2019. The 226,007 claims filed for the week ending April marked the second consecutive week that claims topped 200,000.\nOhio has paid more than $124 million so far to more than 195,000 people who have filed unemployment claims, Job and Family Services Director Kimberly Hall said on Wednesday.\nNationally, 1 in 10 members of the U.S. labor force are now out of work as 6.6 million file for jobless aid across the country.\nIn Ohio, the staggering claims data comes even as many employers are looking for workers. Nearly 500 employers have posted more than 33,000 jobs including health care, protective equipment manufacturing, and food distribution positions, Lt. Gov. Jon Husted said.\nAbout 75 people wearing masks and carrying signs protested outside the Ohio Statehouse, calling on Republican Gov. Mike DeWine to reopen businesses and questioning the models used by Health Director Dr. Amy Acton to continue her shelter-at-home order.\nDeWine, who noted during his daily briefing that he could hear the protesters, said he understood their frustration and supported their right to protest. He said Ohio must continue its measures, but promised the shut-down would not last “one day longer than we have to.”\n___\nCORRECTIONAL FACILITIES\nSeven Ohio prisons are under full quarantines, with 19 inmates and 53 employees having tested positive. One prison guard died. Marion Correctional Institution, where guard John Dawson worked, also has the most staff infections at 34.\nThe governor has proposed the release of about 200 inmates to make room for more social distancing. No violent or sex offenders would be released, nor would inmates with poor prison records or domestic violence convictions, or those who were previously imprisoned. Ohio houses about 49,000 inmates.\n___\nCASES\nMore than 5,500 people in Ohio have tested positive for the virus and 213 have died, with more than 1,700 hospitalizations as of Thursday, according to the state health department. Men make up 65% of the deaths, and 35% are women. About 55,000 people have been tested.\nFor most people, COVID-19 displays mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can be more severe, causing pneumonia or death.\n___\nCARE\nDeWine announced that 19 manufacturers are partnering with three hospital groups to create as many as 1 million face shields over the next few weeks.\nThe Coalition on Homelessness and Housing in Ohio sent nearly $500,000 in grants to local homeless shelters to help limit the spread of COVID-19 among residents, staff, and the community.\nDeWine, who has directed state agencies to find 20% cuts to deal with plummeting revenue, clarified that any aspect of state government focused on battling the virus was likely safe. “Those are going to take priority, because we are in a crisis,” DeWine said. His remarks followed a comment by Acton Tuesday that her budget was “being cut drastically to get through this period.”\n___\nTHE NEW NORMAL\nIn northeastern Ohio, Trumbull County health inspectors filed a violation notice against a group that gathered for a reception after an Amish wedding in Mesopotamia, WKBN-TV reported. Weddings are exempt from the state’s state-at-home order, but wedding receptions are not and are limited to 10 people.\nA black-tie art museum fundraiser that dates to 1957 has postponed its June 13 event. The Dayton Art Institute said Thursday it hopes to hold its Art Ball gala this fall, but no date was set immediately.\n___\nAssociated Press writer Dan Sewell in Cincinnati contributed to this report.", "url": "https://apnews.com/37c180457f7b30c7a5469d2faa455532"}