{"authors": ["Guillermo Garat"], "date_download": "2020-05-04 20:14:26", "date_modify": "2020-05-04 20:14:26", "date_publish": "2020-04-07 16:05:53", "description": "MONTEVIDEO, Uruguay (AP) — Nearly 60 percent of 217 people — many from Australia, Europe and the United States — on board a cruise ship off the coast of Uruguay have tested positive for the new...", "filename": "_0a7c4b83525597890ecf8403b6ef64a5_1588623266.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0fa41e33da4646009edee466a3140ea2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0a7c4b83525597890ecf8403b6ef64a5_1588623266.html", "title": "Most people on Antarctica cruise ship have the coronavirus", "title_page": "Most people on Antarctica cruise ship have the coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Doctor Sebastian Yancev, who participated in the operation to diagnose and treat passengers on the Australian Greg Mortimer cruise ship for the new coronavirus, poses for a photo in front of the ambulance that was used to move the patients to local hospitals in Montevideo, Uruguay, Tuesday, April 7, 2020. (AP Photo/Matilde Campodonico)\nDoctor Sebastian Yancev, who participated in the operation to diagnose and treat passengers on the Australian Greg Mortimer cruise ship for the new coronavirus, poses for a photo in front of the ambulance that was used to move the patients to local hospitals in Montevideo, Uruguay, Tuesday, April 7, 2020. (AP Photo/Matilde Campodonico)\nMONTEVIDEO, Uruguay (AP) — Nearly 60 percent of 217 people — many from Australia, Europe and the United States — on board a cruise ship off the coast of Uruguay have tested positive for the new coronavirus, the ship’s operator said Tuesday.\n“There are currently no fevers on board and all are asymptomatic,” said Aurora Expeditions, the Australian operator of the Greg Mortimer ship that is working to disembark the crew and passengers and arrange flights to their home countries.\nThe Greg Mortimer departed March 15 on a voyage to Antarctica and South Georgia that was titled “In Shackleton’s Footsteps,” a reference to the polar explorer who led British expeditions to the region and died there in 1922.\nOf 217 people tested on the vessel, 128 were positive for the virus that causes the COVID-2019 disease and 89 tested negative, Aurora Expeditions said.\nAnother six people who were evacuated from the ship are in stable condition and being treated in Montevideo.\nThe people on the ship are calm but they are eager to go home, said Marcelo Girard, a doctor at a Uruguayan medical facility where two people from the Greg Mortimer are being treated.\nAustralian passengers, and possibly those from New Zealand, are likely to fly home on Thursday or Friday on an Airbus 340 that has been refitted, with people who have the virus and those who do not traveling in separate cabin areas, according to Aurora Expeditions. The cost per passenger is about $9,300 and the cruise ship operator has asked the Australian government for help with expenses.\nThe plan would require the passengers to undergo a 14-day quarantine on arrival at a facility in Melbourne, the company said.\nU.S. and European passengers who tested negative will hopefully be able to depart later in the week, following a second test and permission from the Uruguayan government, Aurora Expeditions said. Those who tested positive must wait until they test negative before flying home.\nIn a separate case, a cruise ship anchored in Santos, on the coast of Brazil’s Sao Paulo state, had its quarantine extended until at least April 19 after doctors found new suspected cases of the coronavirus, according to Brazilian officials. There are now 40 suspected cases aboard the Costa Fascinosa vessel, which is owned by Costa Cruises. Hundreds of people are on the ship.", "url": "https://apnews.com/0a7c4b83525597890ecf8403b6ef64a5"}