{"authors": ["Por Carlos Rodríguez"], "date_download": "2020-05-04 20:21:30", "date_modify": "2020-05-04 20:21:30", "date_publish": "2020-04-07 18:13:17", "description": "CIUDAD DE MÉXICO (AP) — Son la primera línea de defensa contra la pandemia de COVID-19. Pero en México, a diferencia de lo que ocurre en otros países, médicos y enfermeros han sido víctimas de...", "filename": "_3e1a8a0d74d34766bf2148950991ce30_1588623690.html", "image_url": "https://storage.googleapis.com/afs-prod/media/84f69ba73432487dac979e91b4bf5d42/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e1a8a0d74d34766bf2148950991ce30_1588623690.html", "title": "Escalan las agresiones contra el personal de salud en México", "title_page": "Escalan las agresiones contra el personal de salud en México", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CIUDAD DE MÉXICO (AP) — Son la primera línea de defensa contra la pandemia de COVID-19. Pero en México, a diferencia de lo que ocurre en otros países, médicos y enfermeros han sido víctimas de hostigamiento y agresiones que se han vuelto tan comunes que las autoridades federales le han pedido a la población que muestre solidaridad y ponga fin a las amenazas al personal de la salud.\nEn las últimas semanas el hospital civil de Guadalajara, en el occidente mexicano, pidió a sus enfermeras que no usaran uniforme porque algunas unidades de transporte público se negaban a llevarlas, mientras otros servidores de la salud han reportado agresiones físicas en el sur de México y en el norte del país desconocidos lanzaron material inflamable en la puerta de un nuevo hospital.\n“Habían sido casos, se podría decir aislados, pero todos ellos son indignantes, son lamentables. Y lo que muestran es un fenómeno que es natural pero de ninguna manera justificable, que consiste en que el miedo produce reacciones irracionales, produce reacciones que no tienen ningún sentido, ningún fundamento”, dijo Hugo López Gatell, subsecretario de Prevención y Promoción de la Salud de México.\nAgregó que es aún más indignante cuando se trata de los profesionales “de quienes dependemos todas y todos en este momento”.\nEn Guadalajara, la segunda ciudad más poblada del país luego de la Ciudad de México, los casos de agresiones o actos de discriminación por usar uniforme médico han sido cotidianos en las últimas semanas.\nEdith Mujica Chávez, presidenta de la Comisión Interinstitucional de Enfermeras del Estado de Jalisco, denunció agresiones físicas y verbales a las trabajadoras que inclusive han sido rociadas con agua con cloro por temor al contagio.\nLa Comisión envió una carta al gobernador del estado de Jalisco, Enrique Alfaro, en la que le pidió ayuda y que condene las agresiones.\n“Sabemos que todos estamos en posibilidad de riesgo en material de salud pública, pero nunca se debe de tolerar la violencia, aunque estemos asustados por el contagio del coronavirus”, indicó la Comisión en el escrito. “Debemos mantener la salud mental y compartir información para que sepan que en enfermería no somos enemigos de la sociedad”.\nUna agrupación de taxistas ofreció darles transporte gratis o cobrar tarifas más bajas al personal de salud de Guadalajara mientras las autoridades toman alguna medida institucional.\nPero ese no es el único lugar en México donde se han registrado agresiones.\n“Mientras esperaba mi transporte, dos sujetos en moto me tiraron un huevo en el uniforme. Pensé que esta clase de cosas no pasaban en nuestra ciudad, me sentí impotente al no poder hacer nada mientras ellos se retiraban a carcajadas”, escribió el enfermero Rafael Ramírez en su cuenta de Facebook. “Somos nosotros los que en estos momentos estamos haciéndole frente a esta contingencia y me pregunto si es ésta la forma en la que nos alientan para seguir trabajando”.\nRamírez trabaja en una clínica del Instituto Mexicano del Seguro Social en Mérida, Yucatán, en el sur del país.\nA fines del mes pasado un grupo de pobladores de Axochiapan, en el estado de Morelos, al sur de la capital, amenazaron con quemar el hospital Ángel Ventura Neri si recibía a pacientes con coronavirus.\nEn Sabinas Hidalgo, un municipio del estado de Nuevo León, en el norte, personas no identificadas incendiaron parte de un hospital en construcción que había sido cedido a la Secretaría de la Defensa para recibir pacientes con COVID-19.\n“Amenazar la integridad física del personal médico o afectar el funcionamiento y operación de la infraestructura hospitalaria destinada en este momento a atender la emergencia sanitaria vulnera la capacidad de respuesta que la población requiere”, dijo Víctor Hugo Borja, director de Prestaciones Médicas del Instituto Mexicano del Seguro Social. “Para nosotros, la integridad física de nuestros cuadros médicos es fundamental para garantizar la atención de todos los mexicanos. Les pedimos cesar las agresiones contra el personal de salud”.\nPero México no es el único lugar donde se han registrado agresiones. En Argentina, aunque cada noche la gente sale a sus balcones y ventanas a aplaudir a quienes trabajan en el sistema de salud, también se han viralizado varios casos de discriminación.\nUno de los más difundidos fue el de un edificio de apartamentos de Buenos Aires que intimó a una médica que alquila en el inmueble a que no circule ni permanezca en espacios comunes bajo la amenaza de perseguirla penalmente. A la médica se le requirió, entre otras cosas, “no tocar elementos tales como picaportes, barandas de escalera y acceder a la terraza”.\nOtro caso difundido en las redes sociales fue el de un farmacéutico de la capital argentina que encontró un cartel amenazador en el ascensor en el que lo intimaban a abandonar el edificio en el que vive para no contagiar a los vecinos. El hombre denunció la situación ante la Fiscalía.\nLa titular del Instituto Nacional contra la Discriminación de Argentina, Victoria Donda, reconoció que están apareciendo una “enorme cantidad de casos de discriminación hacia personas que están contagiadas de coronavirus e incluso al personal médico y de enfermería”.\nAgregó que “no podemos aplaudir a las 9 de la noche y discriminar a las 9 de la mañana. Tenemos que informarnos bien para que las emociones que afloren no sean irracionales ante esta emergencia y no dejarnos llevar por el miedo”.\nEn Latinoamérica y el Caribe hay más de 33.000 contagiados y han muerto más de 1.200 personas por el coronavirus.\nLa pandemia ha infectado a más de 1,38 millón de personas y causado la muerte a más de 76.500 en todo el mundo, según el Centro de Ciencias e Ingeniería de Sistemas de la Universidad Johns Hopkins, que basa sus datos en los informes de los gobiernos de cada país.\nEn la mayoría de la gente el nuevo coronavirus provoca síntomas leves o moderados que desaparecen en dos a tres semanas. Pero en algunas personas, sobre todo los adultos mayores y quienes padecen trastornos de salud subyacentes, puede causar enfermedades más graves e incluso la muerte.", "url": "https://apnews.com/3e1a8a0d74d34766bf2148950991ce30"}