{"authors": [], "date_download": "2020-05-04 20:19:57", "date_modify": "2020-05-04 20:19:57", "date_publish": "2020-04-09 16:25:53", "description": "SPRINGFIELD, Ill. (AP) — Unemployment claims in Illinois jumped nearly 13% last week, with 201,041 new claims largely attributable to the spread of the coronavirus. The jump in Illinois,...", "filename": "_fc5ff1747cc28c578bde8b5715b26bc2_1588623597.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_fc5ff1747cc28c578bde8b5715b26bc2_1588623597.html", "title": "Jobless claims up again in Illinois, 200K another new record", "title_page": "Jobless claims up again in Illinois, 200K another new record", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Jobless claims up again in Illinois, 200K another new record\nSPRINGFIELD, Ill. (AP) — Unemployment claims in Illinois jumped nearly 13% last week, with 201,041 new claims largely attributable to the spread of the coronavirus.\nThe jump in Illinois, breaking a record set just a week earlier at 178,421, comes as new claims nationally dipped slightly, according to the Labor Department. The final number from the Illinois Department of Employment Security adjusted the state total upward by 101 from an earlier federal estimate.\nNew U.S. claims totaled 6.6 million, which ultimately was a dip of 3.8% from the previous week, the Labor Department said. Officials adjusted the previous week’s total up 219,000, to 6.87 million, in what had been a hot economy just a month ago.\nThe spread of coronavirus is the main culprit. In Illinois, Gov. J.B. Pritzker shut down “non-essential” businesses, starting with bars and restaurants, on March 21, putting tens of thousands of people out of work.\nIn Illinois, new-claims totals the last two weeks smashed the previous record of 25,800 on Jan. 9, 1982.\nThe Labor Department said that 7.46 million people were receiving unemployment benefits during the week ending March 28, up 161% from the previous week, a new record. The previous high was 6.64 million in May 2009 during the Great Recession.", "url": "https://apnews.com/fc5ff1747cc28c578bde8b5715b26bc2"}