{"authors": [], "date_download": "2020-05-04 20:28:21", "date_modify": "2020-05-04 20:28:21", "date_publish": "2020-04-17 11:10:53", "description": "MADISON, Wis. (AP) — The Latest on the coronavirus outbreak in Wisconsin (all times local): 1:10 p.m. University of Wisconsin System President Ray Cross is ordering everyone that works...", "filename": "_05399062f16f07b6a08f80556ff7d8c9_1588624101.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_05399062f16f07b6a08f80556ff7d8c9_1588624101.html", "title": "The Latest: UW workers to take 1 day off per month for year", "title_page": "The Latest: UW workers to take 1 day off per month for year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Latest: UW workers to take 1 day off per month for year\nMADISON, Wis. (AP) — The Latest on the coronavirus outbreak in Wisconsin (all times local):\n1:10 p.m.\nUniversity of Wisconsin System President Ray Cross is ordering everyone that works in system administration to take one furlough day per month for the next year.\nCross sent an email to nearly 600 system administration employees Friday announcing that starting in May they all must take one furlough day per month until June 2021.\nSystem spokesman Mark Pitsch says the more will result in $3 million in savings as the system grapples with coronavirus pandemic’s economic fallout.\nThe system shut down in-person classes in March. told students to move back home and canceled all spring sports. The moves are expected to cost the system nearly $170 million in the spring semester alone. The losses include refunds for on-campus parking, dining and housing, technology purchases to move classes online, payments to student workers who lost their jobs and nonexistent athletic ticket sales.\nSystem regents on Thursday authorized Cross to implement furloughs among administration workers and chancellors to order campus-based furloughs.\n___\n9:25 a.m.\nInterest in a rally at the Wisconsin state Capitol calling for a reopening of the state has exploded after Gov. Tony Evers extended a stay-at-home order until May 26.\nThe rally scheduled for April 24 had about 700 people who said on Facebook they planned to attend just before Evers announced the order extension on Thursday. As of Friday morning, more than 2,400 said they were attending.\nOne of the organizers of the rally, Madison Elmer, said Friday that a group of people got together to put it on out of frustration over how Evers has handled reaction to the pandemic. She said they have been approached by special interest groups that want to get involved, but they’ve declined their involvement.\n“We didn’t want them hijacking it or turning it into something political to fit their agenda,” said Elmer, 33, who said she lives in southeast Wisconsin but declined to say where. She said organizers have been deluged with threats and “people saying they hope we die, people calling us murderers.”\n“My personal goal of the rally is to start bringing people together that have common goals in mind, which is to get rid of the stay at home order,” Elmer said. “Lots of us want us to demand Gov. Evers and (the Department of Health Services) come up with a plan for ending this. There is no plan in place. He’s not reassuring us this is going to end.”\nEvers and state health officials have said their actions have been guided by the science and what steps are most appropriate to save lives. As of Thursday there were 197 COVID-19 deaths in Wisconsin and nearly 3,900 confirmed cases.\n___\n6:05 a.m.\nOrganizers of the American Family Insurance Championship in Madison couldn’t find a suitable date for rescheduling the event and have now canceled it altogether because of the coronavirus pandemic.\nThe PGA Tour provided alternate summer dates for the June 5-7 championship, but an agreement on a time that was suitable for all parties could not be reached.\n“It was not an easy decision by any means,” Madison resident and tournament host Steve Stricker said in a video message. “We know how much this event means to the community, the fans, the volunteers and the sponsors. We all look forward to it, even the golfers, we look forward to it. But given the mandates ... we just felt like it was in the best interest of everybody and the safety of everybody to cancel this year’s event.”\nAll events associated with the championship were also canceled, including UW Carbone’s Race for Research and concerts featuring Little Big Town and the BoDeans.\nThe tournament will go on next year, slated for June 11-13.", "url": "https://apnews.com/05399062f16f07b6a08f80556ff7d8c9"}