{"authors": ["Barry Wilner"], "date_download": "2020-05-04 20:22:12", "date_modify": "2020-05-04 20:22:12", "date_publish": "2020-04-20 22:35:56", "description": "The NFL's practice draft Monday to test technology and communications for the real thing beginning Thursday night had no major hangups. There were some technical glitches at the outset, when...", "filename": "_5d64f466445d132bab26335480110082_1588623732.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2db08f768f7f460ebdf5e17eee9cbc53/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5d64f466445d132bab26335480110082_1588623732.html", "title": "No major hangups in NFL's mock draft heading to real thing", "title_page": "No major hangups in NFL's mock draft heading to real thing", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Nov. 9, 2019, file photo, Alabama quarterback Tua Tagovailoa plays in an NCAA football game in Tuscaloosa, Ala. Tagovailoa is a likely first round pick in the NFL Draft Thursday, April 23, 2020. (AP Photo/Vasha Hunt, File)\nFILE - In this Nov. 9, 2019, file photo, Alabama quarterback Tua Tagovailoa plays in an NCAA football game in Tuscaloosa, Ala. Tagovailoa is a likely first round pick in the NFL Draft Thursday, April 23, 2020. (AP Photo/Vasha Hunt, File)\nThe NFL’s practice draft Monday to test technology and communications for the real thing beginning Thursday night had no major hangups.\nThere were some technical glitches at the outset, when the Cincinnati Bengals were making the first selection, and at various spots, several people involved in the virtual test told The Associated Press. A few of them spoke anonymously because they were not authorized to comment publicly.\nIndeed, Commissioner Roger Goodell earlier this month warned team executives not to be critical of the process, nor of the league’s decision to go ahead with the draft as scheduled April 23-25.\nBut general managers John Lynch of the NFC champion San Francisco 49ers and John Elway of the Denver Broncos were satisfied with the proceedings.\n“I think we used it as another opportunity to focus on internally,” Lynch said. “I think the chatter out and about that I understand is going on, that it really wasn’t in a good situation, I didn’t really see that. I think early there were a couple of hitches. That’s why we do practice trial runs.”\nAdded Elway: “The draft went smooth. It got off to a little bit of a hiccup when we first started, but other than that I thought it went really smooth. There were no problems with it, so we got more comfortable with it. So, it should be fine and go on without a glitch -- I’m sure there will be a couple of glitches here and there -- but actually for the first time I thought it went pretty well.”\nThe challenges, as noted by several people involved, included too much background noise; team personnel talking over others; and timing issues.\n“It had its glitches, but to call it messy would be inaccurate,” one of the people said. “There were some sound issues and technical stuff that seemed to get solved to the satisfaction of the teams.”\nElway knows who the key members of each club will be Thursday and Friday nights and Saturday afternoon.\n“The heroes in all this are the IT guys,” he said.\nGoodell ordered all team facilities closed in March, and later required club personnel to conduct the draft from their homes. Because of the reliance on free-flowing communication, the league decided to stage the practice draft to ensure all goes smoothly later this week.\nThe draft originally was scheduled for Las Vegas, but the NFL canceled all public events last month as a safeguard against the coronavirus. On April 6, Goodell instructed teams on how they should plan to make selections.\n“After consulting with medical advisers, we cannot identify an alternative that is preferable from a medical or public health perspective, given the varying needs of clubs, the need properly to screen participants, and the unique risk factors that individual club employees may face,” he wrote.\nAmong the technologies needed for the actual draft are team web meetings and a web hookup with the league itself. There also will be phone lines for communicating with other teams for trades, which must be approved by the NFL central office.\n___\nAP Pro Football Writers Josh Dubow and Arnie Stapleton contributed.\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/5d64f466445d132bab26335480110082"}