{"authors": ["Ronald Blum"], "date_download": "2020-05-04 20:22:11", "date_modify": "2020-05-04 20:22:11", "date_publish": "2020-04-20 21:27:08", "description": "NEW YORK (AP) — Major League Baseball players are upset over the prospect teams may seek additional pay cuts if games are played in empty ballparks due to the coronavirus outbreak. Their...", "filename": "_c11a2c671c69868fb11acc2b57b0fb70_1588623731.html", "image_url": "https://storage.googleapis.com/afs-prod/media/212f3c0f00144c0db439c002c18de426/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c11a2c671c69868fb11acc2b57b0fb70_1588623731.html", "title": "MLB players say pay shouldn't be cut if empty ballparks", "title_page": "MLB players say pay shouldn't be cut if empty ballparks", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this March 17, 2015, file photo, Major League Baseball Players Association executive director Tony Clark talks to the media before a spring training exhibition baseball game in Lakeland, Fla. Major League Baseball players are upset over the prospect teams may seek additional pay cuts if games are played in empty ballparks due to the coronavirus outbreak. “Players recently reached an agreement with Major League Baseball that outlines economic terms for resumption of play, which included significant salary adjustments and a number of other compromises. That negotiation is over,” union head Tony Clark said in a statement Monday, April 20, 2020. (AP Photo/Carlos Osorio, File)\nFILE - In this March 17, 2015, file photo, Major League Baseball Players Association executive director Tony Clark talks to the media before a spring training exhibition baseball game in Lakeland, Fla. Major League Baseball players are upset over the prospect teams may seek additional pay cuts if games are played in empty ballparks due to the coronavirus outbreak. “Players recently reached an agreement with Major League Baseball that outlines economic terms for resumption of play, which included significant salary adjustments and a number of other compromises. That negotiation is over,” union head Tony Clark said in a statement Monday, April 20, 2020. (AP Photo/Carlos Osorio, File)\nNEW YORK (AP) — Major League Baseball players are upset over the prospect teams may seek additional pay cuts if games are played in empty ballparks due to the coronavirus outbreak.\nTheir anger was stoked last week when New York Gov. Andrew Cuomo said he was told by Mets chief operating officer Jeff Wilpon that the union would have to agree to lower salaries if games are played without fans.\nA March 26 deal between the sides stated “the Office of the Commissioner and Players Association will discuss in good faith the economic feasibility of playing games in the absence of spectators or at appropriate substitute neutral sites.” The union points to another passage covering salaries in which players agree to give up 1/162nd of base pay for each regular season game lost.\n“Players recently reached an agreement with Major League Baseball that outlines economic terms for resumption of play, which included significant salary adjustments and a number of other compromises. That negotiation is over,” union head Tony Clark said in a statement Monday.\n“We’re now focused on discussing ways to get back on the field under conditions that prioritize the health and well-being of players and their families, coaches, umpires, team staff and fans,” he said.\nThe agreement says that without consent by the commissioner’s office, the season won’t start until there are no official restrictions that would limit teams from playing in front of fans in the 30 clubs’ home ballparks. It also states “the commissioner will consider the use of appropriate substitute neutral sites where economically feasible.”\n“In the agreement reached earlier this spring, the commissioner’s office and the MLBPA agreed that the season would not commence until normal operations -- including fans in our home stadiums -- were possible,” deputy commissioner Dan Halem said in a statement, going on to cite the provision for future talks. “If circumstances require, we will, consistent with our agreement with the union, negotiate in good faith over a framework to resume play without fans that is economically feasible for the sport.”\nThere is little chance for a full 162-game schedule, and players stand to forfeit from $222,222 for each game missed (Mike Trout and Gerrit Cole) to $3,478 for those at the $563,500 minimum. St. Louis reliever Andrew Miller, a member of the union’s eight-man executive committee, would lose $70,988 per game of his $11.5 million salary.\n“My understanding is that we already have an agreement in place regarding salary for the 2020 season when it resumes,” Miller wrote in an email to The Associated Press.\n“Additionally, while ideas regarding games without fans or in neutral sites have been floated, nothing is even close to being put in place. It makes little sense to even attempt to negotiate around such hypotheticals at this point. If at some point there is any negotiation to be had, our leadership from the association will be ready to handle it,” he wrote.\nAmong the plans baseball is considering is the Arizona option , in which all 30 teams would be based in the Phoenix area and use 10 spring training ballparks, the Diamondbacks’ Chase Field and perhaps college venues. The plan has been discussed only generally, and MLB has said no proposal can move forward unless there is a go-ahead from government and medical officials.\nIn order for the season to start, MLB would need for about 3,000 people to be tested on a regular basis: players, staff and broadcast crews.\nBaseball Commissioner Rob Manfred says about 40% of operating revenue derives from gate and gate-related areas, such as luxury suite rentals, concessions, parking, signage, and program sales and advertising. Players counter there would also be fewer expenses.\n“Another version of that is to limit the amount of people in a stadium and make sure you seat them in a way where they are really quite separated and maybe even wearing the facial covers,” Dr. Anthony Fauci , director of the National Institute of Allergy and Infectious Diseases, told the YES Network on Monday. “I know people look at that and they say, what are you crazy? But to me, it’s better than no baseball at all.”\nStill, he added: “It’s more likely that you’re going to have more of a television baseball than a spectator baseball.”\nManfred made a move Monday that allows teams to lay off or cut the pay of major and minor league managers, coaches, trainers and full-time scouts starting May 1. He suspended uniform employee contacts that cover about 9,000 people, including general managers on some teams.\nSeveral teams have said they will pay their employees or baseball operations staff through May.\n___\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports", "url": "https://apnews.com/c11a2c671c69868fb11acc2b57b0fb70"}