{"authors": [], "date_download": "2020-05-04 20:23:18", "date_modify": "2020-05-04 20:23:18", "date_publish": "2020-04-04 13:04:43", "description": "CHICAGO (AP) — Workers on American and foreign freighters are following new protocols and precautionary measures in the Great Lakes region to prevent the spread of the coronavirus. The...", "filename": "_71463553724f3fc5bb22ee83766c5268_1588623798.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_71463553724f3fc5bb22ee83766c5268_1588623798.html", "title": "Freighters in Great Lakes take precautions against virus", "title_page": "Freighters in Great Lakes take precautions against virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "CHICAGO (AP) — Workers on American and foreign freighters are following new protocols and precautionary measures in the Great Lakes region to prevent the spread of the coronavirus.\nThe Coast Guard will monitor American and foreign cargo vessels that have recently traveled to an area affected by the new virus outbreak within the last 14 days.\nShips will be granted entry into the U.S. only if they don’t carry sick crew members, according to Petty Officer Brian McCrum, spokesman for the Coast Guard’s 9th District, which oversees the Great Lakes region.\nCrew members will be required to stay aboard vessels upon arrival, except for necessary activities such as loading or unloading cargo and gathering provisions, the Chicago Tribune reported.\nFreighters are expected to move through more than 100 ports in the Great Lakes region, according to U.S. Customs and Border Protection and industry leaders.\nThe shipping industry is also following suit with its own safeguards.\nJames Weakley, president of the Lake Carriers Association, said crews on ships are required to follow hygiene and social distancing guidelines set by health experts.\n“Not only are there formal ramifications, but there is a very informal peer pressure among our sailors that will keep people from doing anything that is unsafe and potentially cause spread,” Weakley said.\nWeakley’s organization represents 46 American vessels that move 90 million tons of cargo annually across the Great Lakes.\nChicago is the heart of national and international freight in the region. More cargo moves through the Illinois International Port District than any other port in the Great Lakes.\nInternational fleets are also implementing new protocols in response to the outbreak, said Stuart Theis, executive director of the United States Great Lakes Shipping Association, which represents foreign vessels.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.", "url": "https://apnews.com/71463553724f3fc5bb22ee83766c5268"}