{"authors": [], "date_download": "2020-05-04 16:54:53", "date_modify": "2020-05-04 16:54:53", "date_publish": "2020-04-08 21:24:25", "description": null, "filename": "2020_04_08_cnn-underscored_phonesoap-review-outbrain_index_1588611293.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190226103743-phonesoap-01-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_cnn-underscored_phonesoap-review-outbrain_index_1588611293.html", "title": "Meet the PhoneSoap, the phone sanitizer you didn't know you needed", "title_page": "Meet the PhoneSoap, the phone sanitizer you didn't know you needed - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We've interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here, and let us know your thoughts here.\nEditors Note: The full PhoneSoap line is currently sold out, but you can lock in an order for a delivery as early as mid-April.\nAre you on your phone right now? If not, you probably have it just within arm's reach. Here's a not-so-fun fact about your phone: It's dirty — as in, it's thought to be 18 times dirtier than a public restroom.\nHow do our phones get so dirty? Well, whatever ickiness is on anything that we touch -- from subway poles to grocery carts and doorknobs to toilet handles -- soon gets transferred to our phones. Our phone is practically like our third hand that we never wash.\nSo now that we're aware of this dirty truth, how do we clean up the mess?\nMeet the PhoneSoap, a first-of-its-kind phone sanitizer invented by cousin duo Wes LaPorte and Dan Barnes, who pitched PhoneSoap on \"Shark Tank.\" How does it work? You put your phone inside what looks like a miniature tanning bed. Then, it gets blasted with UV-C light, which kills up to 99.99% of the bacteria living on your phone, according to the company, which says the device was laboratory tested against common household germs. After 10 minutes, voila, your phone comes out as clean as new. The company says UV light is harmless to your phone, and encourages you to leave the case on when you sanitize, since that's full of germs too.\nKeep in mind though, PhoneSoap hasn't been tested on the corona virus (COVID-19). Mia Lieberman, a clinical veterinarian at Harvard Medical School, found the PhoneSoap to be effective against bacteria, she noted that eliminating COVID-19 would likely require a much larger UV-C dose, based on the data scientists have on other coronaviruses such as SARS.\nAs tested on the Discovery Channel, the PhoneSoap does seem to live up to its promise of getting to every nook and cranny of your phone, which can't be reached even by alcohol wipes (which, by the way, aren't an ideal phone cleaning method anyway, because chemicals can damage your screen).\nHow to pick your perfect PhoneSoap\nWe recently tested five versions of the PhoneSoap from the current product line, and here are our thoughts that might help you decide if you should get one yourself, and if so, which PhoneSoap is best for you.\nThe Classic: PhoneSoap 3 ($79.95; phonesoap.com or uncommongoods.com)\nPhoneSoap 3\nThe PhoneSoap 3 is PhoneSoap's basic smartphone UV sanitizer that fits all phone models and sizes. It also doubles as a charging hub with two ports (USB & USB-C) that lets you charge your phone while it's getting cleaned.\nThis PhoneSoap is a bit on the bulky side, so it would be best for leaving on your desk or nightstand as a permanent cleaning and charging station. If you're concerned about your PhoneSoap matching your style and décor, fret not, because the PhoneSoap 3 comes in multiple colors, from basics like black to fun colors like gold and aqua.\nIf you're looking to simply try out the PhoneSoap, then we would definitely suggest getting the classic PhoneSoap 3, as it is the most affordable, no-frills PhoneSoap that gets the job done.\nThe Portable: PhoneSoap Go ($99.95; phonesoap.com)\nPhoneSoap Go\nAlways on the go or traveling? If you want to clean and charge your phone wherever and whenever, then the PhoneSoap Go is the one for you. For an extra 20 bucks, you get an upgraded PhoneSoap that's lighter and more portable, rechargeable, doubles as a power bank, and comes in a nice protective carrying case. A fully charged PhoneSoap Go can get you four full phone charges or 45 sanitizing cycles. As for color options, the PhoneSoap Go is currently only available in indigo.\nThe Investment: PhoneSoap Wireless ($99.95; phonesoap.com)\nPhoneSoap Wireless\nIf you don't want to bother with charging cables, then you might want to check out the PhoneSoap Wireless, which comes with a built-in Qi-standard wireless charger. Simply place your device in the PhoneSoap and charge and sanitize your phone sans charging cable. You will, however, still need to plug the PhoneSoap device to an electrical outlet.\nSince the PhoneSoap Wireless is on the pricier end, it may not be for everyone. But it might also be a good investment: If wireless charging is the future of charging, your next phone might not have a charging port.\nThe PhoneSoap Wireless comes in gunmetal gray or white.\nThe Splurge: PhoneSoap Pro ($119.95; phonesoap.com)\nThe PhoneSoap Pro has twice as many bulbs as the classic PhoneSoap, which means it can zap bacteria twice as fast. In just five minutes, the PhoneSoap Pro can clean even large phones with UV-C light. We enjoyed the PhoneSoap Pro when we tried it out, and you can read our full review here.\nPhoneSoap Pro also has Acoustic Passthrough, a technology that lets you hear your phone notifications even while it's getting blasted by sanitizing light. This is great for people who want to stay in touch with what's going on. The big phone cleaner also has nano suction feet on the bottom, so no matter where you put it, the PhoneSoap Pro won't budge.\nA $40 upgrade from the PhoneSoap 3, the PhoneSoap Pro is for people who want a bigger, faster sanitizer and for people who want to be able to hear their phone even when it's locked in the cleaner.\nThe Big One: HomeSoap ($199.95; phonesoap.com)\nAnd if you want to disinfect larger gadgets and even other common household items, the HomeSoap might be your best bet. You can slide a Nintendo Switch, toys, game controllers, tablets, remote controls, and, of course, smartphones into this reflective bay. It also packs in two large UV-C lights inside which hit the items directly or reflect off the walls of the bay. This way it can ensure a cleaning all around the items inside. Yes, it's more expensive at $199.95, but offers more use-cases.\nAn easy-to-use, efficient phone sanitizer that gives you peace of mind\nPhoneSoap with MetroCard, keys and AirPods\nOverall, we think the PhoneSoap is definitely a great gadget worth giving a try. It will give you peace of mind (especially if you're germophobic), knowing that you're getting rid of the bacteria and viruses on your phone. The PhoneSoap can also clean more than just your phone: It can clean other gadgets like your smart watch, or anything else you can fit inside, from your keys and earphones to credit cards.\nWith a variety of models, you can choose the PhoneSoap that works best for you. And along with cleaning your phone, it can even help you reduce daily screen time — because while your phone is being cleaned, you won't be able to reach it.\nEven so, the PhoneSoap family has some room for improvement. First off, the device doesn't get rid of fingerprints and smudges, so you'll still have to use a microfiber cloth to clean your screen. And there is no accurate, technical way for consumers to personally check and know if the germs on their phones have indeed been killed, so you'll have to rely on the tests and research that back PhoneSoap.\nNote: The prices above reflect the retailer's listed price at the time of publication.\nJacob Krol contributed to this reporting.", "url": "https://www.cnn.com/2020/04/08/cnn-underscored/phonesoap-review-outbrain/index.html"}