{"authors": [], "date_download": "2020-05-04 20:13:10", "date_modify": "2020-05-04 20:13:10", "date_publish": "2020-04-16 04:06:17", "description": "BANGKOK (AP) — Prime Minister Shinzo Abe has expanded a state of emergency to all of Japan from just Tokyo and other urban areas as the virus continues to spread. Abe also announced cash...", "filename": "_7c1def79acc61fa244fe3200fbffa827_1588623190.html", "image_url": "https://storage.googleapis.com/afs-prod/media/cc2d59ced1e54236a231069a9dc9b412/2936.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7c1def79acc61fa244fe3200fbffa827_1588623190.html", "title": "Asia Today: Japan expands emergency; China denies allegation", "title_page": "Asia Today: Japan expands emergency; China denies allegation", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Japanese Prime Minister Shinzo Abe, center, wearing a face mask, speaks during the country's coronavirus task force meeting at his official residence in Tokyo Thursday, April 16, 2020. Prime Minister Abe has expanded an ongoing state of emergency to all of Japan from just Tokyo and other urban areas as the virus continued to spread. (Kyodo News via AP)\nJapanese Prime Minister Shinzo Abe, center, wearing a face mask, speaks during the country's coronavirus task force meeting at his official residence in Tokyo Thursday, April 16, 2020. Prime Minister Abe has expanded an ongoing state of emergency to all of Japan from just Tokyo and other urban areas as the virus continued to spread. (Kyodo News via AP)\nBANGKOK (AP) — Prime Minister Shinzo Abe has expanded a state of emergency to all of Japan from just Tokyo and other urban areas as the virus continues to spread.\nAbe also announced cash handouts of 100,000 yen ($930) for each of Japan’s 120 million citizens.\nHe said the expanded state of emergency is aimed at reducing the movement of people and achieving as much as 80% social distancing.\nAbe declared a limited state of emergency on April 7 that covered only Tokyo and six other prefectures deemed at highest risk. He issued a stay-at-home request to people in those areas, but later expanded it to the rest of the country.\nAbe’s coronavirus response has been criticized for being too slow and too lax. Several local leaders had asked him to include their prefectures in the emergency, while others declared their own states of emergency, in rare moves underscoring their frustration with Abe.\nAbe has been seen as reluctant to take tougher measures because of their economic impact.\nJapan, which has one of the world’s oldest populations, has more than 9,000 confirmed coronavirus cases, including about 700 from a cruise ship that was quarantined near Tokyo, with about 150 deaths.\nIn other news around the Asia-Pacific region:\n— CHINA DENIES VIRUS CAME FROM LAB: China is denying allegations that the coronavirus pandemic may have originated in a laboratory near the city of Wuhan where contagious samples were being stored. Foreign ministry spokesman Zhao Lijian cited the head of the World Health Organization and other unidentified medical experts as saying there is no evidence that transmission began from the lab. “We always believe that this is a scientific issue and requires the professional assessment of scientists and medical experts,” Zhao said at a daily briefing Thursday. China also has strongly denied that it delayed announcing the virus outbreak in Wuhan and under-reported case numbers, worsening the impact on the U.S. and other countries. The virus is widely believed to have originated with bats and to have passed via another species to humans at a wildlife and seafood market in Wuhan, although a firm determination has yet to be made. Allegations of a leak of the virus from the lab have been made in U.S. media without direct evidence and President Donald Trump has vowed to suspend funding for the WHO, partly because of what he says is its pro-China bias.\n— SOUTH KOREA ELECTION TURNOUT: South Korea’s ruling liberals scored a strong victory in parliamentary elections with the highest turnout in nearly three decades. Social distancing and other measures were in place at polling booths during Wednesday’s vote. Polls beforehand had indicated public approval for the government’s handling of the virus outbreak, which including aggressive testing to identify and isolate those infected. South Korea confirmed 22 new cases, raising the country’s tally to 10,613 with 229 deaths.\n— INFECTIONS SPIKE IN SINGAPORE: Foreign workers in Singapore who live in crowded dormitories now account for half of the city-state’s virus cases after new infections spiked for a third day. The number of infections has jumped by 1,167 since Monday. While successfully managing its first wave of infections, Singapore overlooked its vast population of foreign workers who live in dormitories that typically house up to 20 men sharing kitchens, toilets and other facilities. The 447 new coronavirus cases on Thursday raised Singapore’s total to 3,699, with 10 deaths. The country has imposed a partial lockdown until May 4 and made it mandatory for people to wear masks outside their homes. Officials say some citizens have resisted, including a man who slapped an enforcement officer and another who punched a volunteer after being told to wear a mask. Authorities have set up a mobile app for the public to report such incidents.\n— AUSTRALIA SUPPORTS WHO REVIEW: The Australian foreign minister says she agrees with the U.S. that the World Health Organization needs to be reviewed, but Australia continues to support the agency’s valuable work in the Pacific. President Donald Trump has directed his administration to freeze WHO funding, claiming it didn’t deliver adequate early reports on the coronavirus. Foreign Minister Marise Payne told Seven Network television: “We share some of the concerns of the United States and I do think there are areas of the operation of WHO that absolutely require review.”\n— PARLIAMENT COULD RETURN TO NORMAL: Australia is planning a business-as-usual week of Parliament in May in an indication that the country is weathering the pandemic better than the government had feared. Parliament’s schedule was scrapped in March and a scaled-down assembly has met only two days since to pass billions of dollars in emergency economic measures. Prime Minister Scott Morrison said he will discuss arrangements for lawmakers to return for a “trial week” in May. Obstacles include a shortage of domestic flights and most states demanding interstate travelers quarantine in hotels for two weeks.\n— PHILIPPINE HEALTH CHIEF IN TROUBLE: A majority of Philippine senators demanded the resignation of Health Secretary Francisco Duque III for what they say is his leadership failure that led to a mishandling of the pandemic. They say it endangers the lives of health workers and the Filipino people. President Rodrigo Duterte rejected the senators’ call but said he wants Duque to work harder. Duque said he’ll press on with the fight against the virus. The Philippines has the most infections in Southeast Asia with 5,660 cases, including 362 deaths.\n— EASED RESTRICTIONS, MAYBE: Prime Minister Jacinda Ardern began outlining how New Zealand’s lockdown might be eased starting next Wednesday. Primary schools would reopen, but attendance would be voluntary. Some businesses could reopen, including drive-through and delivery restaurants. Retail stores would remain closed and large gatherings would still be banned. Lawmakers will decide Monday whether to proceed with the easing. New Zealand reported 15 new cases, a number that has dropped significantly.\n— HONG KONG REPORTS JUST 1 CASE: Hong Kong reported just one more infected person on Thursday, the fifth consecutive day with a single-digit increase. Its tally stands at 1,017 with four deaths. The city has implemented strict social distancing measures.", "url": "https://apnews.com/7c1def79acc61fa244fe3200fbffa827"}