{"authors": ["Ariane De Vogue", "Cnn Supreme Court Reporter"], "date_download": "2020-05-04 16:16:55", "date_modify": "2020-05-04 16:16:55", "date_publish": "2020-04-03 19:17:45", "description": "The Supreme Court said on Friday that it will postpone the remaining two weeks of oral arguments that were set to begin on April 20 and it is considering rescheduling some of the 20 or so cases that it has had to put off so far in response to the coronavirus pandemic.", "filename": "2020_04_03_politics_supreme-court-delay_index_1588609015.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200102152155-02-supreme-court-building-2019-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_supreme-court-delay_index_1588609015.html", "title": "Supreme Court delays oral arguments scheduled for April", "title_page": "Supreme Court delays oral arguments scheduled for April - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) The Supreme Court said on Friday that it will postpone the remaining two weeks of oral arguments that were set to begin on April 20 and it is considering rescheduling some of the 20 or so cases that it has had to put off so far in response to the coronavirus pandemic.\nThe delayed cases include arguments scheduled for this week on attempts by Democrats to obtain President Donald Trump's financial records\n\"The Court will consider rescheduling some cases from the March and April sessions before the end of the Term, if circumstances permit in light of public health and safety guidance at that time,\" Kathy Arberg, a court spokeswoman, said in a statement. \"The Court will consider a range of scheduling options and other alternatives if arguments cannot be held in the Courtroom before the end of the Term.\"\nRegarding oral arguments, Arberg did not specify which of the postponed cases might still be argued this term. Some of the cases are more time sensitive than others, including two concerning Trump's bid to shield his financial documents from release. Another case that might be under consideration concerns so called faithless electors -- something the justices may wish to decide before the next election.\nThe court was also set to hear a copyright dispute between Google and Oracle and a religious liberty case brought by the Little Sisters of the Poor.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/supreme-court-delay/index.html"}