{"authors": [], "date_download": "2020-05-04 20:28:52", "date_modify": "2020-05-04 20:28:52", "date_publish": "2020-04-30 12:33:26", "description": "The government estimated that the economy shrank at a 4.8% annual rate in the first three months of this year, the sharpest quarterly drop since the 2008...", "filename": "entry_us-unemployment-numbers-coronavirus_n_5eaac281c5b633a85446123c_1588624132.html", "image_url": "https://img.huffingtonpost.com/asset/5eaac326240000c6018ea017.jpeg?cache=q2dkqslrs8&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_us-unemployment-numbers-coronavirus_n_5eaac281c5b633a85446123c_1588624132.html", "title": "30 Million Americans Have Sought Unemployment Benefits Since Coronavirus Hit", "title_page": "30 Million Americans Have Sought Unemployment Benefits Since Coronavirus Hit | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — More than 3.8 million laid-off workers applied for unemployment benefits last week as the U.S. economy slid further into a crisis that is becoming the most devastating since the 1930s.\nRoughly 30.3 million people have now filed for jobless aid in the six weeks since the coronavirus outbreak began forcing millions of employers to close their doors and slash their workforces. That is more people than live in the New York and Chicago metropolitan areas combined, and it’s by far the worst string of layoffs on record. It adds up to more than one in six American workers.\nWith more employers cutting payrolls to save money, economists have forecast that the unemployment rate for April could go as high as 20%. That would be the highest rate since it reached 25% during the Great Depression.\nThis week, the government estimated that the economy shrank at a 4.8% annual rate in the first three months of this year, the sharpest quarterly drop since the 2008 financial crisis. Yet the picture is likely to grow far worse: The economy is expected to contract in the April-June quarter by as much as 40% at an annual rate. No previous quarter has been anywhere near as weak since the government began keeping such records after World War II.\nAs businesses across the country have shut down and laid off tens of millions of workers, the economy has sunk into a near-paralysis in just a few weeks. Factories, hotels, restaurants, department stores, movie theaters and many small businesses are shuttered. Home sales are falling. Households are slashing spending. Consumer confidence is sinking.\nWith some signs that the viral outbreak may have plateaued at least in certain areas of the country, a few governors have taken tentative steps to begin reopening their economies. But surveys show that a large majority of Americans remain wary of returning to shopping, traveling and other normal economic activity. That suggests that many industries will struggle with diminished revenue for weeks or months to come and might be unable to rehire laid-off workers.", "url": "https://www.huffpost.com/entry/us-unemployment-numbers-coronavirus_n_5eaac281c5b633a85446123c"}