{"authors": ["Betsy Klein"], "date_download": "2020-05-04 16:52:51", "date_modify": "2020-05-04 16:52:51", "date_publish": "2020-04-08 15:34:13", "description": "Like many at the White House, Ivanka Trump has shifted her focus to the coronavirus response prioritizing its small business efforts.", "filename": "2020_04_08_politics_ivanka-trump-small-business_index_1588611171.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407162557-02-trump-small-business-relief-0407-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_ivanka-trump-small-business_index_1588611171.html", "title": "Ivanka Trump seeks to headline administration's small business recovery effort", "title_page": "Ivanka Trump seeks to headline administration's small business recovery effort - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Like many at the White House, Ivanka Trump has shifted her focus to the coronavirus response prioritizing its small business efforts.\nTrump has long included small business and entrepreneurship as part of her West Wing portfolio , along with workforce development and women's economic empowerment, but this renewed effort comes at a time when millions of Americans who own and work at small businesses are facing dire financial situations due to a near-shutdown of the economy.\nThe Trump administration began its rollout last week of a massive $349 billion loan program , the Paycheck Protection Program, through the Small Business Administration. Despite a rocky rollout , the White House this week requested an extensive $251 billion in additional funds it is working quickly with Congress to pass by the end of the week.\n\"During recent weeks, Ivanka has been meeting on the phone with members of Congress and CEOs of the country's major financial institutions in the run up to and the launch of the PPP. Her calls to financial institutions were to encourage them to step up and support small businesses,\" a White House official said.\nTrump touted $1.5 billion in private sector investments from Goldman Sachs, Bank of America, JP Morgan Chase, Wells Fargo, Citibank, Visa, Mastercard, Grand Rapids State Bank and Community Spirit Bank.\n\"When we began making phone calls to each of you -- some of the largest lenders in the country, bankers, credit card companies, we asked you to provide additional relief, private sector-driven relief to our incredible small businesses. And you've answered that call,\" she said during the teleconference call, citing debt relief, payment deferrals, loan modifications, and other relief measures.\nShe thanked the financial executives for \"doing your part.\"\nTrump has been splitting her time between her Washington home, where she and Kushner have three small children home from school, and the White House. She's been spotted on walks around her neighborhood and has posted a few selfie videos from her home, sometimes dressed in loungewear, wearing minimal makeup, and speaking softly, encouraging Americans to \"be kind to one another\" and \"stay as positive as you possibly can.\"\nOn Tuesday, she posted a more produced Instagram video from the White House colonnade, touting the private sector investments.\n\"We'll keep fighting for you, we're gonna get through this. It's going to be brighter on the other side. And until then, we've got your back.\"\nLater that day, she posted a selfie thanking Surgeon General Jerome Adams for an explainer video on creating your own masks with what appeared to be her own handmade creation and a sewing kit in the shot.", "url": "https://www.cnn.com/2020/04/08/politics/ivanka-trump-small-business/index.html"}