{"authors": ["Fred Goodall"], "date_download": "2020-05-04 20:17:01", "date_modify": "2020-05-04 20:17:01", "date_publish": "2020-04-16 22:43:32", "description": "TAMPA, Fla. (AP) — Chris Godwin isn’t making any bold predictions about what’s on the horizon for the Tampa Bay Buccaneers. The Pro Bowl receiver is excited about the signing of Tom Brady...", "filename": "_94bb1605b8ea9a966c33eeda18e2c9ee_1588623421.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7062f119d61f4b51934f277d4d4ecbca/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_94bb1605b8ea9a966c33eeda18e2c9ee_1588623421.html", "title": "Buccaneers WR Godwin eager to get up to speed with Brady", "title_page": "Buccaneers WR Godwin eager to get up to speed with Brady", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1 of 2 In this handout released by the Tampa Bay Buccaneers Tuesday, April 7, 2020, wide receiver Chris Godwin wears the team's new uniforms that they will debut during the 2020 NFL football season. (Tampa Bay Buccaneers via AP)\n1 of 2 In this handout released by the Tampa Bay Buccaneers Tuesday, April 7, 2020, wide receiver Chris Godwin wears the team's new uniforms that they will debut during the 2020 NFL football season. (Tampa Bay Buccaneers via AP)\nTAMPA, Fla. (AP) — Chris Godwin isn’t making any bold predictions about what’s on the horizon for the Tampa Bay Buccaneers.\nThe Pro Bowl receiver is excited about the signing of Tom Brady and eager to begin working with the six-time Super Bowl champion quarterback. He’s also not in a hurry to speculate on how good the Bucs can be.\n“Preseason expectations are cool to talk about, but at the end of the day we still have to put in a lot of work to get to where we want to be,” Godwin said Thursday. “All that stuff on paper looks really cool. But if we go out there and stink it up, it will be for nothing.”\nTampa Bay is coming off a 7-9 finish and has missed the playoffs 12 consecutive seasons. Godwin was a Pro Bowl selection for the first time in 2019, leading the club with 86 receptions for 1,333 yards and nine touchdowns.\nHe’s spoken with Brady by telephone since the three-time NFL MVP left the New England Patriots and signed a two-year, $50 million contract with the Bucs in free agency, however the two have yet to have an opportunity to work out together because of the social distancing restrictions instituted because of the coronavirus pandemic.\n“The only thing I’ve been able to do so far is our initial phone conversations. I’m looking forward to whenever we can talk (after) this virus calms down,” said Godwin, adding he’s been working out in the backyard at home since the NFL ordered teams to shut down training facilities.\n“I do a lot of the stuff on my own,” he added. “I like to think I have a complete grasp on the types of things I need to have my body ready.”\nIn Godwin and Mike Evans, who last year joined Hall of Famer Randy Moss as the only receivers in NFL history to begin a career with six consecutive seasons with 1,000 yards receiving, the Bucs have the best tandem of wide receivers Brady has had to work with since Moss joined him in New England in 2007.\nGodwin said every quarterback-receiver relationship is different, so it’s difficult to predict how long it will take for him and Brady to develop their timing — especially with the pandemic limiting the amount of time players will be able to work with each other before training camp.\nThe fourth-year pro said he’s considered calling other receivers who’ve played with Brady to pick their brains about what to expect, but he isn’t sure those conversations would be helpful.\n“At the end of the day, I’m a completely different person than anybody he’s played with, and he’s a completely different quarterback than any quarterback I’ve played with. It’s going to be really hard for somebody to tell me something that’s going to directly relate to me,” Godwin said.\n“I think the biggest thing in terms of getting adjusted will be having conversations with Tom and trying to get a feel for what he likes from receivers and what he expects,” Godwin added, “and make sure we’re on the same page.”\nGodwin is entering the final season of the contract he signed as a third-round draft pick in 2017.\nThe Bucs have said signing him to a long-term extension is a priority, however the 24-year-old receiver said the sides haven’t had “many conversations thus far.”\n“But honestly, I’m not too worried about it. I’m very confident where I am right now. I think the biggest thing for me is to continue to prove I can be an elite player in this league and just be the guy I’ve always been,” Godwin said.\n“I’ve always prided myself on being a good teammate, being a hard worker, and those things won’t change,” he added. “If we’re able to get something done this offseason that would be awesome. But I’m not going to stress myself about things I can’t really control right now.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/94bb1605b8ea9a966c33eeda18e2c9ee"}