{"authors": ["Jackie Wattles", "Cnn Business"], "date_download": "2020-05-04 15:56:37", "date_modify": "2020-05-04 15:56:37", "date_publish": "2020-04-15 16:34:12", "description": null, "filename": "2020_04_15_tech_ventilator-shortage-virgin-orbit-scn_index_1588607797.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408163946-02-virgin-orbit-ventilator-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_tech_ventilator-shortage-virgin-orbit-scn_index_1588607797.html", "title": "He was building rockets. Now he's taking on America's ventilator shortage", "title_page": "He was building rockets. Now he's taking on America's ventilator shortage - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Early on in his career, the young engineer spent a year helping to design the breathing assistance machines at Medtronic, a medical device manufacturer. But then, about four years ago, he made a switch and joined rocket startup Virgin Orbit. He's since spent the past few years helping to design a 70-foot rocket that could launch from beneath the wing of a 747 airplane and deliver small satellites into outer space.\n\"I was completely enamored,\" Radulescu, 29, said of his newfound work in avionics.\nThen, the coronavirus pandemic struck. And by mid-March, Covid-19 was spreading rapidly across the United States.\nVirgin Orbit was granted \"essential business\" status, the company said, because of its partnerships with NASA and the Defense Department. But first, its factory in Long Beach, California, would shut down for a week for a deep cleaning.\nEmployees headed home, and the mission of firing satellites into space seemed to lose some of its urgency. A few engineers, including Virgin Orbit CEO Dan Hart, wondered how the company might help address looming medical supply shortages that threatened to overwhelm the health care community.\nMedtronic MDT That's when Radulescu received the call to help. Virgin Orbit propulsion engineer Kevin Zagorski remembered that Radulescu used to work for, one of only a handful of companies in the world that makes hospital-grade ventilators.\nCould Virgin Orbit make ventilators, too? Zagorski asked him.\n\"In these conversations, my mind — it's like a switch flipped,\" Radulescu said. \"I was all ventilators again.\"\nBy the next day, Radulescu and Zagorski were on a call with a group of US doctors that had organized under the name Bridge Ventilator Consortium. The two engineers heard the doctors chatting excitedly about designs for simple breathing machines that could, in theory, be quickly manufactured on a large scale.\nWithin 15 hours, Virgin Orbit had put an ad hoc team together and built a prototype, Radulescu said.\nWhat the Virgin Orbit team came up with is a far less sophisticated machine than the ventilators Radulescu used to help design at Medtronic. But, if doctors run out of options, these so-called \"bridge ventilators\" could help thousands of Covid-19 patients who begin to lose the ability to breathe on their own, freeing up more sophisticated ventilators for the most critical cases.\nVirgin Orbit engineers (from left to right) Vishal Doshi, Victor Radulescu and Kevin Zagorski, run tests on an early prototype of a bridge ventilator.\nUnder pressure\nGeneral Motors, Manufacturers around the world — including Ford Dyson and Xerox — have been adopting wartime-like efforts to scale up ventilator production. Some are helping medical device makers build more of their devices. Others, like Virgin Orbit, are trying to quickly put together new designs\nBut it's a race against time. US hospitals could need as many as half a million additional ventilators during the pandemic, according to the Johns Hopkins Center for Health Security.\nRadulescu knew from his one-year stint at Medtronic that quickly building thousands of traditional ventilators — the kind typically used by intensive care doctors — wasn't feasible.\n\"I had an appreciation for how complex and sophisticated these devices are,\" Radulescu said. \"We were immediately aware that we would not be able to recreate or replace them.\"\nSo, Virgin Orbit decided to design its own.\nRadulescu notes that there is some overlap in the engineering of ventilators and rockets. The same math and physics apply to pressure — whether it's the pressure of a rocket fuel combustion chamber or the pressure ventilators use to push oxygen into a patient's lungs. But the scale is radically different: Rocket engineers think about pressure in terms of pounds per square inch, a unit 70 times larger than the one used in the medica equipment world.\nRadulescu also understood that making life-supporting medical equipment required exhaustive testing. But things are no different in rocketry.\n\"In some ways, the level of testing and verification we have to meet for aerospace are much more stringent than what I had seen in [the medical device field],\" Radulescu added. After all, \"our electronics have to work in the vacuum of space, being bombarded by solar and cosmic radiation at extreme temperature ranges.\"\nA call to action\nAs the coronavirus outbreak spread into the United States, Dr. Brian Wong, a plastic surgeon at the University of California, Irvine Medical Center, wanted to know what doctors on the front lines could do if they ran out of ventilators. In March, Wong organized daily conference calls on Zoom to brainstorm ideas with a couple of his colleagues, and they adopted the name Bridge Ventilator Consortium. Soon, medical professionals from all over the country began dialing in.\nMany of their discussions centered on Ambu bags, which are cheap, barrel-shaped devices commonly stocked in emergency rooms and ambulances. They're used to resuscitate people who stop breathing. The problem is that physicians have to manually operate the device by squeezing down on the bag, making them an impractical solution for COVID-19 patients who may need breathing assistance for weeks at a time.\nEngineer Vishal Doshi runs tests on an early prototype of a bridge ventilator in Virgin Orbit's Long Beach, California lab.\nThe BVC doctors had heard about a group of engineers in Spain with a plan to automate that process: Using a windshield wiper motor, they rigged a machine that could act like a human thumb, pressing down on the Ambu bag over and over.\nDr. Wong hoped a few US manufacturers could build a similar device . But he didn't expect a 20-something rocket scientist from Long Beach to be among the first to answer that call.\n\"Patients are not motors; they're not rockets; they're not satellites,\" Wong said. \"But when you have an incredible engineering team like that, they get up to speed very quickly.\"\nAfter their first call with the BVC doctors, Radulescu and Zagorski used a white board at Virgin Orbit's rocket factory and engineering software they typically used for rockets, to crunch numbers and sketch out a design.\nThe next morning, they purchased a windshield wiper motor from Autozone and met up with two more of their colleagues for a marathon engineering session. They designed the machine to use as few components as possible and relied on parts that Virgin Orbit could easily find in large numbers.\nBut Radulescu said he also knew it wouldn't be safe to create a device that only did the bare minimum.\n\"If the goal is to allow the clinician to set this machine up and walk away, we should add different alarms and warnings,\" Radulescu said. \"One thing I'd seen on other ventilators is, if the power disconnects, the [device] will actually [make] an extremely loud and audible signal that says, 'Hey, you've lost power here!'\"\nThe team assembled its first prototype within a day, and less than a week later they built a second and third version and sent the design to US regulators for approval, Radulescu said.\n\"I was amazed.\" Dr. Govind Rajan, an anesthesiologist at UCI, said. \"They took all these ideas, synthesized them and they put it together very fast — which is what is critical right now.\"\nFrom prototype to production\nSome Virgin Orbit employees are still focused on rockets. A skeleton staff continues to work toward the company's first orbital launch attempt in the coming weeks. But the startup estimates it can also churn out 100 bridge ventilators within a week, double that rate a week later, and continue scaling up from there. Virgin Orbit says the devices could be manufactured on assembly lines set up right alongside the rocket bodies and engines that litter its 180,000 square-foot factory.\nThe company said the vast majority of its employees are working from home, and those who must be on site at the factory will maintain proper social distancing whenever possible.\nRadulescu, who said the ventilator team has been careful to keep their distance while in the same room together, said they are still working out how to avoid potential kinks in its supply chain, particularly when it comes to the Ambu bags.\n\"We want to make sure we're not in a position where we're competing with hospitals,\" he said. His team is planning to deliver its first batch of ventilators fully assembled, and then allowing hospitals to buy the Ambu bags themselves. The machine is designed to allow doctors to install the bags into the bridge ventilator machine when needed.\nBut before mass production can start, Virgin Orbit needs the green light from the Food and Drug Administration.\nThe agency said last month that it wanted to do everything possible to expedite approvals for such devices, and Will Pomerantz, Virgin Orbit's vice president of special projects, said regulators are helping the startup navigate the application process.\nThat work is ongoing, and Pomerantz isn't sure when final word may come. The FDA did not respond to a request for comment.\nThe agency has to walk a fine line — balancing the urgent need to get lifesaving devices in the hands of doctors, and ensuring stopgap solutions are still safe\nMeanwhile, doctors all over the world fear shortages would force them to choose which patients to save.\n\"There is no ideal solution,\" Wong said. He added that bridge ventilators are among dozens of proposed alternatives to traditional ventilators — and nobody yet knows how effective any given approach will be.\nThere are promising signs in Spain, where Ambu bag ventilators were successfully tested on pigs, received approval for clinical trials and are now being used on Covid-19 patients at several Spanish hospitals, according to Protofy, the engineering firm behind the bridge ventilator design.\nIt's not yet clear if any of those patients have since recovered from the virus.\nFor all their efforts, the Virgin Orbit engineers say they hope doctors will never be forced to use their machines. But they're still working tirelessly, Radulescu said, adding that looming medical supply shortages felt like \"a call to action.\"\n\"I think in the back of our minds,\" he said, \"we're all aware that, the more we delay and the longer we take, it could cost lives.\"\nCorrection: An earlier version of this story incorrectly spelled Victor Radulescu's last name.", "url": "https://www.cnn.com/2020/04/15/tech/ventilator-shortage-virgin-orbit-scn/index.html"}