{"authors": ["Kylie Atwood"], "date_download": "2020-05-04 16:59:29", "date_modify": "2020-05-04 16:59:29", "date_publish": "2020-04-09 22:23:16", "description": "The Trump administration is seeking to block the International Monetary Fund from providing a $5 billion emergency loan to Iran for assistance in combating the coronavirus pandemic, according to three administration officials.", "filename": "2020_04_09_politics_iran-us-imf-corona-aid_index_1588611569.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407163356-01-coronavirus-0406-albania-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_iran-us-imf-corona-aid_index_1588611569.html", "title": "US ready to block Iran's requests for coronavirus aid from the IMF, officials say", "title_page": "US ready to block Iran's requests for coronavirus aid from the IMF, officials say - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Trump administration is seeking to block the International Monetary Fund from providing a $5 billion emergency loan to Iran for assistance in combating the coronavirus pandemic, according to three administration officials.\nUS officials believe the money would not actually go towards the country's public health crisis.\n\"The world's leading state sponsor of terrorism is seeking cash to fund its adventurism abroad, not to buy medicine for Iranians,\" a State Department spokesperson told CNN. \"The regime's corrupt officials have a long history of diverting funds allocated for humanitarian goods into their own pockets and to their terrorist proxies.\"\nAlmost 4,000 Iranians have died as a result of Covid-19, and the country has reported 64,586 cases of the virus since it swept the country in February, according to Johns Hopkins statistics. Many experts believe the real statistics could be much higher.\nThe devastation in Iran is particularly intense because the country is already plagued by a weak economy, in part because of US sanctions, and a shortage of medical resources. The US decision to block the aid could create further friction with the European Union, which announced on March 23 that it will give Tehran 20 million Euros to combat coronavirus and will support its appeal for IMF aid.\nRead More", "url": "https://www.cnn.com/2020/04/09/politics/iran-us-imf-corona-aid/index.html"}