{"authors": ["Stephanie Becker"], "date_download": "2020-05-04 16:18:41", "date_modify": "2020-05-04 16:18:41", "date_publish": "2020-04-04 01:19:30", "description": "A large and influential Russian language church near Sacramento, California, is denying it is at the center of a novel coronavirus outbreak.", "filename": "2020_04_03_us_sacramento-county-church-covid-19-outbreak_index_1588609121.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403023135-sacramento-country-church-covid-19-outbreak-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_us_sacramento-county-church-covid-19-outbreak_index_1588609121.html", "title": "At least 70 people infected with coronavirus linked to a single church, health officials say", "title_page": "At least 70 people infected with coronavirus linked to a single church, health officials say - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A large and influential Russian language church near Sacramento, California, is denying it is at the center of a novel coronavirus outbreak.\nIn an interview with a Sacramento television station on Thursday, Sacramento County Department of Health Services director Dr. Peter Beilenson confirmed at least 70 people at the Bethany Slavic Missionary Church were infected with Covid-19.\nHe said he named the church \"not to cast aspersions on anybody but to really hammer home the importance of not congregating, not only in church but also in prayer gatherings in people's homes.\" It is one of the largest outbreak clusters of the virus in the US.\nIn an archived version of last Sunday's online service, a pastor announced at least three members of the church were infected with Covid-19.\nHowever, the church released a statement Friday saying media reports about the Covid-19 outbreak were \"inaccurate and falsely place emphasis on this church.\" The church also said it hadn't been informed any of its parishioners had died as reported by a local newspaper.\nRead More", "url": "https://www.cnn.com/2020/04/03/us/sacramento-county-church-covid-19-outbreak/index.html"}