{"authors": ["Reporter"], "date_download": "2020-05-04 20:24:11", "date_modify": "2020-05-04 20:24:11", "date_publish": "2020-04-29 19:24:05", "description": "For students who don’t have health insurance or live with medically vulnerable family members, the decision is agonizing.", "filename": "entry_los-angeles-nursing-students-clinicals-covid-19_n_5ea8c267c5b6fb98a2b478a2_1588623851.html", "image_url": "https://img.huffingtonpost.com/asset/5ea9ae0d220000130d827dee.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_los-angeles-nursing-students-clinicals-covid-19_n_5ea8c267c5b6fb98a2b478a2_1588623851.html", "title": "LA County Nursing Students Forced To Choose Between Delaying Graduation Or Risking COVID-19 Infection", "title_page": "LA County Nursing Students Forced To Choose Between Delaying Graduation Or Risking COVID-19 Infection | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Damian Dovarganes/Associated Press Students at a nursing program operated by Los Angeles County's Department of Health Services are required to continue their clinical rotations in hospitals in order to graduate on time, even as other nursing schools have transitioned to online simulations in response to the coronavirus.\nA nursing school operated by Los Angeles County’s Department of Health Services is requiring nursing students to continue their clinical rotation in county-owned hospitals, even as other nursing programs in the country have transitioned to online education in response to the coronavirus pandemic.\nMost hospitals are no longer allowing nursing students to come in for clinicals. Because students require near-constant supervision, their presence in facilities overwhelmed by COVID-19 can create more work for nurses than it can provide relief. With limited supplies of personal protective equipment, hospitals throughout the country have encouraged nursing students to stay home and avoid putting themselves at an unnecessarily high risk of contracting the virus or spreading it to others. Because of this, several states, including California, have loosened restrictions on in-person clinical hours to allow nursing students impacted by the pandemic to graduate on time.\nBut in Los Angeles County, where there are more than 20,000 confirmed cases of the coronavirus, the College of Nursing & Allied Health (CONAH) is still sending students into several county-owned hospitals for unpaid clinical rotations. Of the nearly 200 students in the nursing program, several do not have health insurance or live with elderly parents, who are particularly vulnerable to serious illness or death from COVID-19.\nThere are plenty of students who are eager to continue their clinical rotation, even throughout the pandemic. But few are being forced to choose between accepting that risk and delaying their ability to graduate and earn an income as a nurse. The Association of American Medical Colleges, which called for medical schools to pause clinical rotations back in March, emphasized in later guidance that medical students who do assist in hospitals should do so on a voluntary basis. There is no comparable guidance for nursing students, who have frequent interaction with patients in hospitals.\nCONAH students returned to the county hospitals earlier this month after an extended spring break. Some of the nurses appeared surprised, and at times, annoyed by their presence, several students told HuffPost. “They’re letting you guys come back?” a nurse said to one student, who recalled the interaction in an interview. “We felt like we were walking on eggshells going into the hospital. Everybody’s kind of on edge,” said the student, who, like others interviewed for this story, requested anonymity due to fear of retaliation. Another nurse urged a different CONAH student to try to convince the school to suspend clinical rotations.\nA third nurse who works at a hospital in Los Angeles that is not currently taking students told HuffPost in a text message that nursing students “are not helpful” during the pandemic. The stress and anxiety most nurses are dealing with would impact their ability to teach students, said the nurse, who requested anonymity out of fear of retaliation. “We would prefer [students] to stay home and not spread the virus,” she said.\nCONAH Dean Mildred Gonzales said that the school’s faculty supervise students and are mindful of not creating extra work for nurses. Hospital administrators, she said, have told her they want help from nursing students during the pandemic. Because of the pandemic, the school has paused rotations in intensive care units and operating rooms, instead assigning students to work on the medical surgical floor. CONAH provides students with surgical masks so that they are not cutting into the hospital’s supply of personal protective equipment, Gonzales said.\nIn the past, students at CONAH would go to campus and use the school’s secure computers to select a patient and research their conditions. But because campus is now closed and students can’t access patient information at home, their only chance to prepare is to get to the hospital an hour early.\n“Normally, you would try to find people with a problem you want to learn more about,” another student told HuffPost. “Now we try to just choose one that’s safest for us,” she said. “I, personally, try to find patients who don’t have a fever.”\nStudents get their temperatures checked before entering the facility and are given surgical masks each day, but they aren’t allowed to wear N95 masks. Surgical masks prevent students from spreading their own germs but, unlike N95s, do little to protect them from others.\nAs student nurses who are apprehensive with the crisis, this is also the time, perhaps, to think and reflect if the nursing profession is for you. Mildred Gonzales, dean of the College of Nursing And Allied Health\nAs the risk of the coronavirus started to become apparent last month, CONAH administrators sent students home for an extended spring break in accordance with California’s shelter-in-place order. The school would eventually resume with “web-based presentations,” Gonzales wrote in an email. But midway through their break, Gonzales emailed students again, summoning them back into the hospitals for clinical rotations.\n“For those who are afraid and anxious of coming back to clinical due to potential exposure, I want to reiterate to you that this is the profession wherein we face and care for patients with numerous disease conditions and sometimes with unknown etiology in a daily basis,” Gonzales wrote. “As nurses (your faculty), this is our calling. We go to the hospital to take care of patients as the need arise. As student nurses who are apprehensive with the crisis, this is also the time, perhaps, to think and reflect if the nursing profession is for you,” Gonzales continued.\n“I was insulted by it,” the second student said of the dean’s email.\n“I was pissed,” a third said.\nGonazles told HuffPost she did not intend to put students down or suggest that people with concerns are not fit to be nurses.\nIn her email to students, Gonzales cited California Gov. Gavin Newsom’s creation of a new program called California Health Corps as part of the reason for the school sending students in for clinicals. At the end of March, the governor called on all licensed health care professionals, medical retirees, members of medical disaster response teams and medical and nursing students to sign up to get placed in a facility that needs support. Although the Health Corps program is open to nursing students, those who get accepted are paid and participation is voluntary.\n“In line with [Newsom’s] order, we are resuming clinical earlier than our previous schedule,” Gonzales wrote in an email. But unlike members of the Health Corps, students at CONAH do not get paid to help out at hospitals and they don’t have much of a choice in whether to subject themselves to the risk. If they don’t go into their assigned hospitals for clinicals, they will have to push back their graduation date, which means they will go even longer without the ability to earn an income as a nurse.\nStudents were initially told they would not be asked to treat COVID-19-positive patients or those suspected of having the virus. Asked if that policy could change if the coronavirus overwhelmed the hospitals, Gonzales said the school would have to “evaluate” the situation. Even under the current policy, students are still at risk of contracting the virus from asymptomatic patients. At least one student has treated a patient who later tested positive for COVID-19, Gonzales acknowledged. There are currently coronavirus patients in the wards where CONAH students are assigned.\nNursing students understand they are choosing to enter a profession that carries health risks — and they are ready to take on that risk once they are working nurses with health insurance and income, several CONAH students said in interviews. Students aren’t just worried about their own safety — they have to factor in the risk of exposing their loved ones to COVID-19.\nThe third student said she sometimes thinks about worst-case scenarios. What if she catches the virus at the hospital, brings it home and her partner gets sick and dies? “I think carrying that burden for the rest of my life would be too much weight,” she said.\nSome students who can’t afford their own place live with elderly parents. If they were salaried nurses, students told HuffPost, they could afford to move out or at least find another place to stay during the pandemic. For now, they resort to precautions like changing clothes in the garage after a shift at the hospital and avoiding being in the same room of the house as family members, two students said in interviews.\nFor the students in the program who are parents, being summoned into the hospital poses an additional problem: finding child care and a way to pay for it. Los Angeles County Unified School District closed schools back in March and the hospitals “can only accommodate childcare for employees,” Gonzales wrote in an email. A nonprofit affiliated with one of the county hospitals has since offered to help students with child care, Gonzales told HuffPost.\nThe school gave students until April 17 to decide whether to continue the semester. Twenty-six students pulled out and will have to finish their coursework next semester, Gonzales said. Some of the students who decided to complete the semester only did so because they couldn’t afford to postpone completing their degree. If any of the students who are trying to make it through clinical end up deciding they can no longer do it, their only option will be to withdraw and redo the entire semester. Students who withdraw are not typically guaranteed a spot in future semesters.\nUntil recently, California’s Board of Registered Nursing required nursing students to complete 75% of their clinical hours in-person in direct contact with patients. Because most hospitals are not allowing student nurses in their facilities during the COVID-19 crisis, that requirement would have made it impossible for many nursing students to graduate on time. In March, the deans of several nursing schools in California called on the governor to temporarily lower the in-person requirement to 50%. Ryane Panasewicz, a nursing student at West Coast University, started a Change.org petition with a similar demand, which received more than 137,000 signatures.\nThe lobbying effort worked. Earlier this month, California modified its requirements to allow students who do not have access to in-person clinical training at a hospital within 50 miles of their campus to complete half of their clinical training hours through online simulations. But by the time the state relaxed its rules, CONAH administrators had already reached an agreement with several county-owned hospitals for students to continue in-person clinicals.\n“I feel like we’re disposable to [the Department of Health Services],” the second student said. “Is it going to take a student getting sick for them to change their minds?”", "url": "https://www.huffpost.com/entry/los-angeles-nursing-students-clinicals-covid-19_n_5ea8c267c5b6fb98a2b478a2"}