{"authors": ["Nicole Aschoff", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Jeremy Gong", "David Harvey", "Paul Heideman", "David Elliot Berman"], "date_download": "2020-05-04 19:57:23", "date_modify": "2020-05-04 19:57:23", "date_publish": "2020-03-20 00:00:00", "description": null, "filename": "2020_03_coronavirus-digital-classrooms-cambridge-schools-internet-broadband-access_1588622243.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/20215838/GettyImages-1324422.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-digital-classrooms-cambridge-schools-internet-broadband-access_1588622243.html", "title": "Coronavirus Has Exposed America’s Digital Divide", "title_page": "Coronavirus Has Exposed America’s Digital Divide", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "On Monday, the public schools in Cambridge, Massachusetts officially closed their doors in an effort to prevent the spread of COVID-19. Students were sent home with homework packets, library books, musical instruments, and a Google Chromebook to connect virtually with their teachers during the unexpected break. But in Cambridge, as with so many other cities and towns across the country, not all students have broadband internet access at home. As the coronavirus threatens to wreak havoc on the world, it is laying bare America’s lackluster social provisions and deep societal divides — including its digital divide.\nNew research suggests that forty-two million Americans, including a quarter of rural residents, lack access to broadband internet — and this doesn’t even include the people who don’t have broadband because they can’t afford it. Nearly five million households with children, half of adults earning less than $30,000, and roughly six out of ten households in poor cities like Flint, Michigan and Trenton, New Jersey have no home broadband connection.\nMillions of people end up relying on their smartphones to surf the web. A smartphone internet connection is certainly better than nothing. It provides access to email, social networks, news, information, and much more. But smartphone internet is a poor substitute. Data plans are expensive, and it is nearly impossible to apply for a job, craft a college essay, or complete a research project on a smartphone.\nThe limitations have been made abundantly clear in the present crisis. In Cambridge, teachers are asking students to connect with them daily on Google Classroom. They’re posting assignments and classwork digitally, pointing students toward online educational sites such as Khan Academy and Duolingo. They are encouraging students to work together using Google Hangouts and are making themselves available for virtual music tutorials.\nAt the same time, parents are sharing resources with each other. They’re sending links to virtual museum tours and field trips, posting livestreams of Myrtle the Turtle getting her breakfast at the New England Aquarium, and sharing Mo Willems lunch doodles. These are wonderful resources for children stuck at home. Digital connections can strengthen teacher-student bonds and community ties and make kids feel important and loved.\nBut children with limited or no internet access at home miss out on these important resources. For millions of families, particularly in rural areas and poor urban clusters, something as simple as watching a YouTube video or sending an email is difficult or impossible.\nCambridge teachers, school staff, and administrators were well aware of these challenges as they prepared for a lengthy closure. Despite being a wealthy center of elite education and digital innovation, Cambridge has pockets of deep poverty. Forty-three percent of the city’s public school students qualified for free or reduced-price meals in 2018, and roughly 40 percent of low-income households are without a home broadband connection. Cambridge, along with Boston, New York, San Francisco, and other US cities, have made moves to democratize internet access by offering free wifi in public libraries, youth centers, and public parks. But these public Wi-Fi locations have been closed down during the coronavirus crisis.\nBefore the schools officially called off classes, Cambridge school staff and parents rushed to raise extra money for grocery store gift cards, compiled a list of food resources available in the city during the crisis, and worked to ensure that breakfast and lunch would be available every day for students, either through delivery or pickup.\nTeachers and administrators also recognized the need to get families connected to the internet.\nThey coordinated an effort to make sure all students received a Chromebook and were able to get online at home. Over the past week they’ve been calling families who haven’t answered emails or logged in to Google Classroom, and have been delivering digital notebooks around the city to students who were unable to pick up Chromebooks on the last day of school.\nOn top of that, school staff have been coordinating with Comcast and the city to provide connectivity to families without broadband internet. Comcast offers $10/month internet access through its Internet Essentials program to low-income residents who qualify for public assistance. The program is the product of a 2011 deal with the Federal Communications Commission (FCC): Comcast received the right to purchase NBCUniversal in exchange for setting up the Internet Essentials program, which has been expanded to include veterans and seniors. In response to the coronavirus crisis, Comcast has boosted the speed of its Internet Essentials program from 15/2 Mbps to 25/3 Mbps, meeting the FCC’s official definition of broadband, and is providing two months of free service for new customers.\nYet enrollment in Internet Essentials remains relatively low, in part because its eligibility requirements disqualify many poor applicants. For example, anyone who has been a Comcast customer in the previous ninety days or who has unpaid bills with the telecom company is ineligible. School staff have been developing a workaround, delivering hotspot thumb drives to families who can’t sign up for the subsidized program.\nThe herculean efforts of Cambridge staff and teachers to make sure their most marginalized students are not left hungry or disconnected are not unexpected. Their work is yet another example of how ordinary people and front-line workers are the engine that keeps communities going in crises, especially when help from state and federal agencies is inadequate or absent. In addition to teachers and school staff members, nurses and doctors are pushing themselves to the limits to care for sick patients despite a lack of accurate, rapid test kits and dwindling protective gear. Community groups are making sure both endangered seniors and hospital shift workers get food and supplies.\nIt is heartening to see how hard ordinary Americans are working to bridge the divides exposed by the coronavirus crisis. But the necessity of their efforts raises hard questions about the widespread lack of access to food, housing, health care, and in this case the internet, in the United States.\nWhy, in the richest country in the world, is access to broadband internet not viewed as a human right? Why are teachers and school staff forced to scramble to get their poorest students connected when cities, towns, and rural areas could easily provide free or low-cost high-speed internet to all of their residents?\nA big part of the problem lies in the power of internet provider monopolies (cable and DSL) to determine the provision and price of internet services. Telecom providers such as AT&T and Comcast have engaged in “digital redlining,” investing heavily in some parts of the country, while ignoring others. Broadband providers have spent millions on share buybacks and acquisitions but have shown little appetite for putting money into areas where revenue streams might be lower or costs higher. But telecom companies don’t want other providers to muscle in on their territory either, so they have lobbied dozens of states to pass laws prohibiting rural areas and certain urban clusters from building their own municipal fiber-optic networks.\nThe result is a patchwork of service. Most of the country is linked through high-cost internet — Americans pay more to get on the web than most countries around the world — and in between are gaping holes of limited or no connectivity.\nSubsidized programs like Comcast’s fill some of these holes, but digital rights activists point out that the cheaper internet is also slower — and therefore fall far short of what is necessary to provide high-quality connectivity to everyone. Saul Tannenbaum, cofounder of Upgrade Cambridge — an internet advocacy group that believes the internet is a basic human right — says that many eligible city residents, particularly those in public housing, are not even aware of Internet Essentials. Comcast is not required to advertise the program, so it spends most of its resources marketing higher-priced plans.\nIn relying on slower, subsidized plans to fill the gaps, we also end up with a two-tiered internet where speed is determined by ability to pay. While Comcast’s 25 Mbps subsidized plan reaches the floor of what officially counts as high-speed internet, it lags far behind the 200 Mbps in nonsubsidized plans. In households where family members are expected to join virtual meetings and classrooms, it’s not at all clear whether middling speeds will suffice.\nUltimately, Comcast’s program and others like it act as a corporate bulwark, protecting telecom companies’ lucrative monopolies and blocking the development of public internet options that would provide reliable, high-speed internet for all at a fraction of the cost.\nUpgrade Cambridge has been advocating for municipal broadband for years. Before the COVID-19 crisis broke out, their Broadband Task Force convinced Cambridge’s city manager to conduct a digital equity study to get a clearer picture of the city’s digital divide. And they’re not alone. Across the country groups are fighting for the internet to be deemed a utility — necessary for normal life — rather than an optional luxury.\nAt the national level, the Institute for Local Self-Reliance is coordinating the effort to improve internet access for poor and rural communities through its community broadband initiative. So far the grassroots movement has seen more than eight hundred communities invest in some kind of public internet option, with roughly five hundred forming municipal networks and about three hundred forming cooperatives.\nThe coronavirus crisis will not be a one-off international tragedy. COVID-19 is just one of a number of new viruses that have emerged in recent years, and experts predict that the threat posed by zoonotic diseases (viruses that jump from animals to people) will increase in future decades as population growth increases and habitat destruction continues apace.\nThe upshot is that social distancing, and working and learning from home, may become increasingly common. Those with resources and connectivity will be able to weather these storms, while those without resources and connectivity will find themselves increasingly isolated and vulnerable. That is, unless we do something right now.", "url": "https://www.jacobinmag.com/2020/03/coronavirus-digital-classrooms-cambridge-schools-internet-broadband-access"}