{"authors": ["Devan Cole"], "date_download": "2020-05-04 16:25:13", "date_modify": "2020-05-04 16:25:13", "date_publish": "2020-04-06 20:22:35", "description": "A top New York City official who recently lost his mother from complications after being infected with the novel coronavirus on Monday slammed President Donald Trump's handling of the pandemic.", "filename": "2020_04_06_politics_scott-s_1691d71b2cf929968674b475836cbdbe_index_1588609513.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406142427-scott-string-nyc-comptroller-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_scott-s_1691d71b2cf929968674b475836cbdbe_index_1588609513.html", "title": "NYC official who lost his mother to coronavirus rips Trump's response to pandemic", "title_page": "Scott Stringer: NYC official who lost his mother to coronavirus rips Trump's response to pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) A top New York City official who recently lost his mother from complications after being infected with the novel coronavirus on Monday slammed President Donald Trump's handling of the pandemic.\n\"Look, in New York City, this is playing out in so many families. And I got to tell you, you know, Donald Trump has blood on his hands, and he has my mom's blood on his hands,\" Scott Stringer, the city's comptroller, told CNN's Anderson Cooper. \"This is something that is just outrageous. And so it's very tough to mourn under these circumstances.\"\nLater Monday evening, Stringer told CNN that Trump \"failed to take action quickly and early\" and said the President \"wasted ... precious time with denials and lies (about the crisis) while more cases spread and more Americans got sick.\"\n\"Had the President taken this threat seriously and put people's health before his political interests, he would have acted immediately,\" Stringer said. \"Instead, he wasted months of time -- and spent it talking about how coronavirus was a 'Democratic hoax' and how the problem would disappear 'like a miracle.' It was wrong, it was reckless, it cost lives.\"\nCNN has reached out to the White House for comment on this story.", "url": "https://www.cnn.com/2020/04/06/politics/scott-stringer-coronavirus-donald-trump-cnntv/index.html"}