{"authors": ["Guest Writer"], "date_download": "2020-05-04 20:31:53", "date_modify": "2020-05-04 20:31:53", "date_publish": "2020-04-30 16:30:11", "description": "Stuck at home from college, we wanted to help during the pandemic. We never expected how fast our idea would catch on.", "filename": "entry_app-help-essential-workers-supplies_n_5ea84cf6c5b6c3055e0bd3b0_1588624313.html", "image_url": "https://img.huffingtonpost.com/asset/5ea854c4240000eb008e9e0c.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_app-help-essential-workers-supplies_n_5ea84cf6c5b6c3055e0bd3b0_1588624313.html", "title": "My Roommate And I Made An App To Help Essential Workers Desperate For Supplies", "title_page": "My Roommate And I Made An App To Help Essential Workers Desperate For Supplies | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "As my roommate Rine and I ― both students at Dartmouth College ― left campus for spring break in early March, we celebrated the end of exams. We packed up our apartment, leaving our notebooks on the kitchen table and a pile of winter jackets on the couch — we’d deal with those in the spring — and told each other we’d be back soon.\nLittle did we know that within the next three days, “soon” would become “who knows when,” and between the two of us, we would lose three terms of classes, two internships, and one college graduation.\nAnd yet it was difficult to mourn these personal losses when there were much more immediate problems, like stay-at-home restrictions, to cope with. As the U.S. death rate shot up higher than anywhere else in the world, graduation no longer seemed like a very big deal.\nInstead, we felt stuck — filled with an overwhelming urge to do something to help, but unsure what we could actually do. Quarantine and remote classes meant we had extra time, but neither of us had the medical backgrounds to volunteer in hospitals or for COVID hotlines ― I am studying economics, while Rine is majoring in history ― we couldn’t go outside, and as students, we had limited budgets to donate.\nEver since the coronavirus outbreak hit, we found ourselves troubled by stories of front-line workers in jobs such as grocery delivery, postal service and construction. In New York, 68 MTA workers have died of COVID, while another 2,400 have tested positive. Nationwide, at least 41 grocery store workers have died.\nOver the past few weeks, our communities have asked essential workers to go to work while retreating indoors ourselves. We call them “heroes” in the news and consider their services “essential” to our daily lives, and yet their calls for hazard pay and access to basic necessities have been largely overlooked.\nThe Give Essential platform connects people who have extra items to essential workers who need them — such as masks like these, sent by one donor.\nAs we read more about essential workers, we learned about parents who, despite school cancellations, have had to leave their children at home to go to work. We learned about people who worked graveyard shifts and couldn’t visit stores before all the soap emptied from shelves. We thought about our own closets, filled with outgrown toys and books; our cabinets, which held forgotten bars of soap and bottles of hotel shampoo.\nWe realized that, to some extent, the problems that essential workers were facing arose from resource mismatches.\nJust before midnight on April 8, we came up with Give Essential, a volunteer-run matching platform where essential workers across the U.S. tell us what items they need, and donors tell us what they can give. Both parties fill out forms on our website, and we create matches based on their best-fit needs and donations, facilitating a way for donors to directly send items to essential workers. The donation item categories include kids’ activities, cleaning supplies, feminine hygiene products, and personal hygiene products — household items we thought donors might already have and could easily share.\nWe spent the next 36 hours glued to our screens, Rine writing out content and revising forms while I puzzled over old projects from my former computer science major, trying to remember how to build a website from scratch.\nBy April 10, we were ready to launch.\nThat night, we started posting the link to essential worker groups on Facebook and Reddit. The first 10 minutes passed: nothing. Then, our first response. Then the second, and third.\nPeople are donating everything from spare food and toilet paper to puzzles, soap and masks.\nWithin 24 hours, we reached over 300 essential workers. Suddenly, the variables in our algorithm had names and identities — the pregnant grocery delivery driver who struggled to find detergent for her own family after a long day of delivering necessities to other families; the postal worker running out of cleaning supplies and living with an immunocompromised family member; the warehouse worker living out of her car who showers with water bottles and survives off of peanut butter and tortillas.\nBut with responses from essential workers rapidly outnumbering those from donors five to one, we realized quickly that we were in over our heads.\nWe dedicated the next two days to frantically figuring out how to turn our midnight operation into something functional that we could scale. First, we needed to somehow balance the ratio of essential workers to donor responses. Starting with a Facebook post, we told everyone we knew about Give Essential, pushing for any possible support. We knew there was a huge community of people who, like us, wanted to help with relief efforts but didn’t know how: We just needed to figure out how to reach them.\nWhen people brought up the potential legal issues associated with data sharing, we contacted pro bono lawyers and learned the basics of tax codes. When emailing matches ourselves became too much to handle, we turned to our friends and learned how to delegate. When we needed guidance about building organizations and creating effective impact, we reached out to college alumni and entrepreneurs we admired on Twitter and learned how to take positive and negative feedback.\nOn Monday we celebrated a huge milestone: finding donors for every essential worker request from last week. And on Tuesday ― two weeks after launching ― we finished sending out our second batch of completed matches.\nRine (pictured) and Amy celebrate shipping their second batch of donated items to essential workers two weeks after launching their Give Essential platform.\nJust as we’ve been touched by the essential workers’ stories, the donors’ responses have been overwhelming, too. Many have offered to help multiple essential workers with gifts ranging from stuffed toys and board games to several hundred-dollar gift cards. We’ve had teachers offer online tutoring and donors pledge weekly donations.\nGive Essential started as an idea, grew into a group chat, and snowballed into a community with hundreds of connections across the country. During this time of uncertainty and disappointment, it has uncovered heartwarming stories of people who just want to do good, willing to go miles out of their way to give to strangers who need help.\nLots of donors with spare, unused toys are sending them to essential workers with families.\nIn this state of lockdown, it is easy to feel constrained by the four walls and front door that we’re advised not to leave. With Give Essential, we wanted to remind communities that our ability to connect with and help others is not limited in that same way. A bar of soap sent through the mail can alleviate the anxiety of a single mother who wants to keep her child healthy, and a $50 gift card can help a warehouse worker purchase groceries for the week.\nWe’ve asked ourselves: as work meetings transition to Zoom calls and birthday parties move to FaceTime, how will our humanity evolve with the challenges of the changing world around us?\nIf it’s anything like what we’ve seen over the past two weeks, we’re not too worried.\nGive Essential was set up by Dartmouth Students Amy Guan and Rine Uhm, and Crystal An, a recent graduate of Case Western Reserve University.\nTo check out Give Essential and sign up as an essential worker or donor: https://giveessential.org.\nA HuffPost Guide To Coronavirus\nFor more content and to be part of the “This New World” community, follow our Facebook page. HuffPost’s “This New World” series is funded by Partners for a New Economy and the Kendeda Fund. All content is editorially independent, with no influence or input from the foundations. If you have an idea or tip for the editorial series, send an email to thisnewworld@huffpost.com.", "url": "https://www.huffpost.com/entry/app-help-essential-workers-supplies_n_5ea84cf6c5b6c3055e0bd3b0"}