{"authors": ["Senior Reporter"], "date_download": "2020-05-04 20:26:31", "date_modify": "2020-05-04 20:26:31", "date_publish": "2020-04-28 20:42:27", "description": "\"They’re putting me and my family at risk,” a health care worker said of the \"ReOpen NC\" rallygoers in Raleigh.", "filename": "entry_healthcare-workers-reopen-north-carolina-protesters_n_5ea87e8cc5b6e50adaf4b160_1588623991.html", "image_url": "https://img.huffingtonpost.com/asset/5ea882f03000009a11155130.jpeg?cache=omxvbbd27b&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_healthcare-workers-reopen-north-carolina-protesters_n_5ea87e8cc5b6e50adaf4b160_1588623991.html", "title": "Health Care Workers Stand Up To Anti-Lockdown Protesters In North Carolina", "title_page": "Health Care Workers Stand Up To Anti-Lockdown Protesters In North Carolina | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Health care workers in North Carolina on Tuesday held a counterprotest against yet another “ReOpen NC” rally in the state capital.\nAbout a dozen nurses, doctors and other health care workers, wearing scrubs and masks, stood outside the State Archives of North Carolina in Raleigh with their arms crossed. Some carried signs reading “Stay Home For ME” and “I Can’t Believe I Have to Show Up Here Too.”\nThey stood in a formation that allowed them to practice social distancing, which the Centers for Disease Control and Prevention recommends.\nJade Wilson Health care workers holding a counterprotest against anti-lockdown demonstrators in Raleigh, North Carolina, on Tuesday.\nAcross the street, hundreds of ReOpen NC protesters crowded together for the third time in as many weeks, once again demanding that Gov. Roy Cooper (D) reopen the state’s economy during the coronavirus pandemic ― the dire warnings of public health officials be damned. Cooper announced last week that the state’s stay-at-home order had been extended into May.\nThese protesters carried signs promoting debunked conspiracy theories about COVID-19, which has already infected over 1 million people and killed over 57,000 in the U.S. alone. There have been over 9,500 reported cases of COVID-19 in North Carolina, according to state health officials, resulting in over 340 deaths.\nOne of ReOpen NC’s lead organizers, Audrey Whitlock, revealed this week that she had tested positive for the coronavirus.\nThe protesters also heckled and harassed the health care workers ― front-line workers in the fight against both COVID-19 and a right-wing campaign to downplay the dangers of the virus ― who remained silent and stoic.\n“My grandma taught me not to argue with a fool because onlookers can’t tell who’s who,” Amber Brown, a nurse from Kernersville who attended the protest, told HuffPost over the phone Tuesday.\nJade Wilson Health care workers at their counterprotest across from the “ReOpen NC” rally in Raleigh.\n“They’re putting me and my family at risk,” Sekia Royall, who works in nutrition services at O’Berry Hospital in Goldsboro, said in a press release.\n“My daughter and I both have pre-existing conditions, and if someone gets the virus at our facility, it will spread like wildfire,” she said. “For some of our patients it could be fatal.”\nCarrie Shropshire, a medical student at Campbell University in Raleigh, joined the health care workers protesting Tuesday.\n“We take an oath to ‘do no harm,’ and these protesters are literally causing harm,” she said in the press release.\nShropshire also tweeted that some anti-lockdown protesters yelled at her and her fellow health workers Tuesday, asking if they are citizens.\n“The people who are trying to reopen our state to infection and death want to know if we are American,” Shropshire tweeted.\nAs people screamed at them, our health care workers stood in silence defending our state.\nThis is courage and composure in it's purest form.#HealthWorkersDefendNC pic.twitter.com/VCBHAUHE5S — Red T Raccoon (@RedTRaccoon) April 28, 2020\nThe ReOpen NC protests are just a few of the many “reopen” demonstrations that have taken place across the country in recent weeks. They’re often attended by heavily armed militias and other extremists, and many are organized, in part, by groups with ties to right-wing billionaires including Charles Koch and Robert Mercer.\nThe anti-lockdown protesters — who are largely supportive of President Donald Trump and who view the economic impact of the pandemic as worse than the pandemic itself — are not representative of the majority of the country. A recent Yahoo News/YouGov poll found that only 22% of Americans support the anti-lockdown protests. Most Americans support stay-at-home orders and the continued closure of nonessential businesses.\nThe poll found that a majority of Republicans also oppose the protests, even though Trump and Fox News have expressed support for them.\nJade Wilson Health care workers staging a counterprotest at the ReOpen NC rally on Tuesday.\nCris Batista Many of the protesters at the ReOpen NC rally did not wear protective equipment such as masks.\nBrown, the nurse from Kernersville, stood in opposition to the anti-lockdown protest in Raleigh last week too, where she was heckled over her weight.\n“I am, and will always be, a nurse,” Brown tweeted from the demonstration Tuesday. “I carry each patient with me in my heart and it is for them that I take a stand. It’s why I was out here last week to speak out against reopening North Carolina. It’s why I’m out here again today.”\nShe also posted a video showing anti-lockdown protesters marching around without wearing masks.\n“A thing about this virus: Many who die from it can’t have their loved ones hold their hands in their last moments,” Brown tweeted. “I’ve held people’s hands while they’ve passed because no one should die alone. The more these reckless protests happen, the more people will.”\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/healthcare-workers-reopen-north-carolina-protesters_n_5ea87e8cc5b6e50adaf4b160"}