{"authors": ["Scott Bauer", "Steve Peoples"], "date_download": "2020-05-04 20:06:13", "date_modify": "2020-05-04 20:06:13", "date_publish": "2020-04-06 14:43:47", "description": "MADISON, Wis. (AP) — Voters in Wisconsin will face a choice Tuesday of participating in a presidential primary election or heeding warnings from public health officials to stay away from large...", "filename": "_97db30e6564b9b5eedfc300234ea6630_1588622773.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3f99efbee88640af82cfa1649e5e26dc/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_97db30e6564b9b5eedfc300234ea6630_1588622773.html", "title": "Wisconsin moves forward with election despite virus concerns", "title_page": "Wisconsin moves forward with election despite virus concerns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This April 6, 2020 photo provided by Scott Trindl shows one of the tables, fitted with protective plexiglass, at the sole polling location for city of Waukesha, Wis., residents. Wisconsin Gov. Tony Evers on Monday, April 6, 2020 moved to postpone the state's presidential primary for two months because of the coronavirus pandemic, prompting a court challenge and adding to confusion about whether voters will be able to head to the polls on Tuesday. (Scott Trindl via AP)\nThis April 6, 2020 photo provided by Scott Trindl shows one of the tables, fitted with protective plexiglass, at the sole polling location for city of Waukesha, Wis., residents. Wisconsin Gov. Tony Evers on Monday, April 6, 2020 moved to postpone the state's presidential primary for two months because of the coronavirus pandemic, prompting a court challenge and adding to confusion about whether voters will be able to head to the polls on Tuesday. (Scott Trindl via AP)\nMADISON, Wis. (AP) — Voters in Wisconsin will face a choice Tuesday of participating in a presidential primary election or heeding warnings from public health officials to stay away from large crowds during the coronavirus pandemic.\nHours after Democratic Gov. Tony Evers issued an order postponing the election for two months, the conservative-controlled Wisconsin Supreme Court on Monday sided with Republicans who said he didn’t have the authority to reschedule the race on his own. Conservative justices on the U.S. Supreme Court quickly followed with a ruling blocking Democratic efforts to extend absentee voting.\nThe decisions leave Wisconsin as the only state with an election scheduled in April that is proceeding as planned. As other states prepare to vote in May or June, Wisconsin will be closely watched for signs that fears of the coronavirus may depress turnout or cause other problems at the polls.\nEvers said he had no other options after the state court ruled against him.\n“There’s not a Plan B. There’s not a Plan C,” Evers said earlier Monday.\nJoe Biden already has a commanding delegate lead over Bernie Sanders and the Wisconsin results aren’t likely to slow his march to the Democratic presidential nomination. But the tumult in one of the most critical general election battlegrounds was a reminder of how the coronavirus has upended politics during an election year. Beyond the shifts in the primary calendar, Biden and President Donald Trump have not been able to hold in-person campaign events and have moved most of their operations online. Sanders called Tuesday’s election “dangerous” and said his campaign will not engage in any traditional get-out-the-vote efforts.\nThe tension in Wisconsin over whether and how to proceed with the election has been building for weeks. Evers and Republicans initially agreed it was imperative for the election to proceed because thousands of local offices are on the ballot Tuesday for terms that begin in two weeks. There is also a state Supreme Court election.\nEvers himself had questioned whether he had the power to reschedule the election, but said the worsening situation, including an increase in COVID-19 deaths from 56 on Friday to 77 on Monday, made clear there was no way to safely move forward. Evers said he sought the delay because he was motivated by protecting public health, not politics.\n“The people of Wisconsin, the majority of them, don’t spend all their waking hours thinking about are Republicans or Democrats getting the upper hand here,” Evers said earlier Monday. “They’re saying they’re scared. They’re scared of going to the polls.”\nHe was thwarted by conservatives on two courts. The Wisconsin Supreme Court ruled 4-2, with four conservatives in support and two liberals against, that Evers lacked the authority to move the election on his own.\nThe U.S. Supreme Court split 5-4, with the five Republican-appointed justices siding with the national and state party to overturn a lower court ruling that expanded absentee voting. In an unsigned opinion, the court said absentee ballots must be hand-delivered by Tuesday evening or postmarked by Tuesday, although they can arrive at clerks’ offices as late as April 13.\nIn dissent, Justice Ruth Bader Ginsburg wrote for her liberal colleagues that the lower court acted amid the virus outbreak “to safeguard the availability of absentee voting in Wisconsin’s spring election. This Court now intervenes at the eleventh hour to prevent voters who have timely requested absentee ballots from casting their votes.”\nGinsburg said the coronavirus outbreak had caused a surge in absentee ballot requests and thousands of voters who requested them will not have received their ballots by Tuesday. “The Court’s order, I fear, will result in massive disenfranchisement,” she wrote.\nAs of Monday, nearly 1.3 million absentee ballots had been requested but only about 57% of those had been returned. It’s unclear how many of the outstanding 539,000 ballots will be in voters’ hands by Tuesday to meet the April 7 postmark deadline.\nThe conservatives said “the dissent’s rhetoric is entirely misplaced and completely overlooks the fact that the deadline for receiving ballots was already extended to accommodate Wisconsin voters, from April 7 to April 13.”\nWisconsin Democratic state Sen. Jon Erpenbach said Republicans fought efforts to delay the election because they want to suppress turnout, particularly in Democrat-heavy Milwaukee, because that will benefit Republicans.\n“Democrats have always been good about getting out the vote on the day of,” Erpenbach said. “If you’re looking at the newspapers, watching TV, you know right now it’s dangerous.”\nDemocratic U.S. Rep. Mark Pocan said the U.S. Supreme Court’s was “brazenly suppressing thousands of voters in Wisconsin.”\n“This is NOT how democracy works,” Pocan tweeted.\nOhio saw a similar eleventh-hour flurry the day before its primary last month. After the Republican governor and secretary of state failed to persuade a judge to shift the election date, the state health director stepped in and ordered voting shut down. Legislators set a new, almost all-mail primary for April 28, sparking new legal challenges from voting rights groups, but a federal judge on Friday said the election could go forward.\nAhead of the Wisconsin primary, thousands of poll workers said they wouldn’t work, leading Milwaukee to reduce its planned number of polling sites from 180 to just five. More than 2,500 National Guard troops were dispatched to staff the polls. They were also distributing supplies, including hand sanitizer, to polling sites across the state. In Madison, city workers were erecting Plexiglas barriers to protect poll workers, and voters were encouraged to bring their own pens to mark the ballots.\nGeorge Dunst, 76, of Madison, who has volunteered at his local polling site for nearly every election since he retired, said he’s not going Tuesday amid fears of contracting COVID-19.\n“No matter what safety precautions you take, there’s going to be exposure,” he said. “Who knows who comes into the polling place?”\n___\nPeoples reported from New York. Associated Press writers Todd Richmond from Madison, Wis., Julie Carr Smyth from Columbus, Ohio, and Mark Sherman from Washington contributed to this report.", "url": "https://apnews.com/97db30e6564b9b5eedfc300234ea6630"}