{"authors": [], "date_download": "2020-05-04 20:15:01", "date_modify": "2020-05-04 20:15:01", "date_publish": "2020-04-16 00:28:07", "description": "HOUSTON (AP) — A federal judge has reluctantly denied a motion to allow Harris County judges to release some county jail inmates on no-cost bonds as officials try to reduce jail populations...", "filename": "_5a740b7b31e0a1a158b98219cdd86c0f_1588623301.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5a740b7b31e0a1a158b98219cdd86c0f_1588623301.html", "title": "Federal judge denies Harris County pretrial bond relief", "title_page": "Federal judge denies Harris County pretrial bond relief", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HOUSTON (AP) — A federal judge has reluctantly denied a motion to allow Harris County judges to release some county jail inmates on no-cost bonds as officials try to reduce jail populations because social distancing is nearly impossible behind bars.\nAttorneys for inmates had wanted relief from an executive order by Gov. Greg Abbott that prevented state and county judges from releasing people accused or previously convicted of violent crimes on no-cost bonds. The attorneys said they want to lower the jail population to protect inmates and staff during the coronavirus outbreak emergency, calling it “a matter of life and death.”\nU.S. District Judge Lee Rosenthal clearly wrestled with the case.\n“There is no good, clearly safe, constitutionally, and jurisdictionally right solution to many of the short-term problems and disagreements the pandemic has made so acute,” she wrote in a 29-page opinion filed Tuesday in Houston.\nHowever, the Texas Supreme Court had already overturned a state district judge’s ruling restraining parts of the governor’s order dealing with pretrial bonds. That ruling came in a separate lawsuit filed by Harris County misdemeanor court judges and civil rights attorneys.\n“And when, as here, these disagreements appear to have been somewhat resolved, at least to the extent necessary to achieve a workable, voluntary process for the safe release of appropriate pretrial, not convicted, arrestees within the present pandemic constraints, that is a powerful reason for a federal court to decline to intervene through the blunt instrument of a temporary restraining order,” Rosenthal ruled.\nShe ordered all interested parties to give her twice-weekly updates on: the size of the pretrial felony inmate population of the jail; the number of them released on personal recognizance bonds; those whose release has been challenged by the district attorney; how long formalized bond hearings were being delayed for those requesting them; and the number of inmates testing positive for COVID-19, the illness caused by the novel coronavirus, and the number for whom test results were pending.\nRosenthal indicated that she may reconsider her order later.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nAs of Wednesday afternoon, 15,904 of the 151,810 people tested in Texas have the virus. Of those, 1,538 are hospitalized, and 375 have died, according to the Center for Systems Science and Engineering at Johns Hopkins University.", "url": "https://apnews.com/5a740b7b31e0a1a158b98219cdd86c0f"}