{"authors": ["Rebecca Wright"], "date_download": "2020-05-04 15:59:29", "date_modify": "2020-05-04 15:59:29", "date_publish": "2020-04-01 03:01:03", "description": "When India imposed a nationwide lockdown a week ago, it was designed to stop the imminent spread of the novel coronavirus.", "filename": "2020_03_31_asia_coronavirus_1db66a5d93362966da32b3b55ffe9e20_index_1588607969.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401105309-20200401-indian-gate-air-pollution-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_asia_coronavirus_1db66a5d93362966da32b3b55ffe9e20_index_1588607969.html", "title": "India's coronavirus lockdown is having a dramatic impact on pollution", "title_page": "India's coronavirus lockdown is having a dramatic impact on pollution - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When India imposed a nationwide lockdown a week ago, it was designed to stop the imminent spread of the novel coronavirus .\nBut grinding this country of 1.3 billion people to a near halt has also provided a temporary remedy to another pressing health issue: suffocating pollution levels.\nThe world's largest lockdown means all factories, markets, shops, and places of worship are now closed, most public transport suspended and construction work halted, as India asks its citizens to stay home and practice social distancing. So far, India has more than 1,300 confirmed cases of Covid-19, including 35 deaths.\nAlready, data shows that the main cities are recording much lower levels of harmful microscopic particulate matter known as PM 2.5, and of nitrogen dioxide, which is released by vehicles and power plants.\nPM 2.5, which is smaller than 2.5 micrometers in diameter, is considered particularly dangerous as it can lodge deep into the lungs and pass into other organs and the bloodstream, causing serious health risks.\nThe sudden fall in pollutants and the subsequent blue skies signal a dramatic shift for India -- which has 21 of the world's 30 most polluted cities , according to the IQAir AirVisual's 2019 World Air Quality Report.\nIn the capital, New Delhi, government data shows the average concentration of PM 2.5 plunged by 71% in the space of a week -- falling from 91 microgram per cubic meter on March 20, to 26 on March 27, after the lockdown began. The World Health Organization considers anything above 25 to be unsafe.\nThe data from the Central Pollution Control Board (CPCB), part of India's Environment Ministry, was collated by the Centre for Research on Energy and Clean Air (CREA).\nNitrogen dioxide went from 52 per cubic meter to 15 in the same period -- also a 71% fall. Mumbai, Chennai, Kolkata and Bangalore have also recorded a fall in these air pollutants.\n\"I have not seen such blue skies in Delhi for the past 10 years,\" said Jyoti Pande Lavakare, the co-founder of Indian environmental organization Care for Air, and author of upcoming book \"Breathing Here is Injurious To Your Health.\"\n\"It is a silver lining in terms of this awful crisis that we can step outside and breathe.\"\nLowest traffic pollution\nEven before the national lockdown started on March 25, the phased shutdowns in India were having an impact.\nDuring the first three weeks of March, the average nitrogen dioxide levels declined by 40-50% in the cities of Mumbai, Pune and Ahmedabad, compared with the same period in 2018 and 2019, said Gufran Beig, a scientist with the System of Air Quality and Weather Forecasting And Research (SAFAR) under India's Ministry of Earth Sciences.\n\"The reduced fossil fuel emissions due to (the) transport sector and slowdown in other emissions-related activity is slowly reducing the air pollutants,\" Beig said.\nThe nationwide curfew in India on March 22 also resulted in the lowest one-day traffic pollution levels on record, analysis from CREA said. Other dangerous pollutants, PM2.5 and the larger PM10, which are less than 10 micrometers in diameter, also dropped steeply, the report added.\n\"It is most likely that even the record of March 22 will be broken, and we are seeing more and more cleaner days as industries, transportation and energy generation and demand are reducing across the country,\" said Sunil Dahiya, an analyst based in New Delhi for CREA.\nSimilar patterns showing drastic falls in pollution levels were seen in parts of Europe and China since their lockdowns, as industry and transport networks grind to a virtual halt.\nBut this data is no reason to celebrate, Dahiya said.\n\"This is a really grave situation which the entire world is grappling with,\" Dahiya said.\n\"Pollution is going down, but we cannot let the suffering of so many human beings be the way to clean the air,\" Dahiya said.\"We can only use the outbreak of coronavirus as a learning lesson for us.\"\nPollution protest\nIt's a lesson that is badly needed in India, activists say.\nIn November 2019, hundreds of Indians took to the streets in New Delhi to protest the levels of air pollution, after the city was blanketed in a dark yellow haze for several days.\nAir pollution hit record high levels, forcing schools to close and flights to be diverted. Other cities in northern India also suffered.\nFour months later, the skies are now clearing up. But the impact of living in such badly polluted conditions has left a hidden problem for residents: a potential vulnerability to the coronavirus pandemic -- a severe respiratory disease.\nIndia has one of the highest rates of respiratory disease in the world, and the world's highest number of tuberculosis cases. Such widespread lung damage could potentially increase the risks associated with the coronavirus.\n\"(There are) very high levels of respiratory disease, even among young children, they have asthma, the nebulizer has become a normal thing to have in the house for families who can afford them,\" said Lavakare from Care for Air\nAccording to the WHO, older people, and people with pre-existing medical conditions, including asthma, appear to be a higher risk of becoming severely ill with the virus.\nInvesting in a cleaner future\nGlobally, deaths related to exposure to air pollution are of pandemic proportions, with 7 million deaths every year, the World Health Organization (WHO) said.\nCare for Air said this should be a wake-up call for India to address the problem.\n\"Obviously, this is not the most ideal way to bring down air pollution, but it does prove that air pollution is manmade,\" Lavakare said. \"It gives a lot of encouragement and hope that we can bring pollution down.\"\nThe coronavirus crisis also presents India with an opportunity to invest in a clean energy future, said Dahiya from CREA.\nThese pictures taken on March 25 show deserted streets across India. The top row, from left to right, shows Ghaziabad, New Delhi, Mumbai. The middle row, left to right, is Allahabad, Chennai, Kashmir. The bottom row, left to right, depicts Siliguri, Kolkata, and Bangalore.\n\"India (is) a highly fossil-fueled country,\" said Dahiya. \"In order to tackle pollution, we need to tackle that.\"\n\"When we come out of the outbreak, it will be interesting to see if we invest money in the cleaner future,\" he added. \"(Do) we ramp up the old fossil fuel based intensive industries, or we go towards more sustainable options.\"\nLavakare said that at the minimum, the government should commit to keeping existing policy pledges.\n\"Governments cannot use this disruption as an excuse to go back against the gains that have been made,\" she said. \"Right now, we have a priority, we need to stop this big crisis.\n\"But when things are under better control ... we need to move towards renewable energy faster. It would be really sad (if) we make the same mistake again, using coal and non-renewable energy.\"", "url": "https://www.cnn.com/2020/03/31/asia/coronavirus-lockdown-impact-pollution-india-intl-hnk/index.html"}