{"authors": ["Tales Azzoni"], "date_download": "2020-05-04 20:17:43", "date_modify": "2020-05-04 20:17:43", "date_publish": "2020-04-07 14:46:24", "description": "MADRID (AP) — Finishing off domestic soccer seasons could take precedence over completing the Champions League. Spanish league president Javier Tebas said Tuesday that several ideas are...", "filename": "_58c14903e2e3a0a6231d1020e82e80ff_1588623463.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b6ecf52f06af479395b4267dd6f1319f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_58c14903e2e3a0a6231d1020e82e80ff_1588623463.html", "title": "European competitions could wait for domestic leagues to end", "title_page": "European competitions could wait for domestic leagues to end", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Tuesday March 10, 2020 file photo a general view of the Mestalla stadium during the Champions League round of 16 second leg soccer match between Valencia and Atalanta in Valencia, Spain. The match is being in an empty stadium because of the coronavirus outbreak. All Champions League and Europa League games were postponed by UEFA on Friday March 13, 2020 because of the coronavirus outbreak. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. (AP Photo/Emilio Morenatti)\nFILE - In this Tuesday March 10, 2020 file photo a general view of the Mestalla stadium during the Champions League round of 16 second leg soccer match between Valencia and Atalanta in Valencia, Spain. The match is being in an empty stadium because of the coronavirus outbreak. All Champions League and Europa League games were postponed by UEFA on Friday March 13, 2020 because of the coronavirus outbreak. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. (AP Photo/Emilio Morenatti)\nMADRID (AP) — Finishing off domestic soccer seasons could take precedence over completing the Champions League.\nSpanish league president Javier Tebas said Tuesday that several ideas are being studied by the leagues and UEFA, including having the European competitions restarting only after the national leagues finish.\n“The most probable (scenarios) are starting on May 29th, or June 6 or June 7, or June 28 for all the European leagues,” Tebas said in a conference call with international journalists.\nTebas said the Spanish league has been in talks with other leagues almost daily to discuss how the coronavirus pandemic is affecting the sport. He said there is still some time before a final decision can be made on when to resume play in each country. But he added that leagues should try to restart as soon as possible, even before the end of May in some cases.\nThere are two types of calendars being considered, Tebas said. One has the domestic and European leagues playing simultaneously like before, beginning around June 6. Another has the European tournaments played after the national leagues are over, either in July or August.\nIf the leagues start in late May, the European tournaments would resume in July. If the leagues start in late June, the European competitions would resume in August.\n“These scenarios will be studied in the next few weeks, considering how the pandemic progresses,” Tebas said through a translator. “Personally, it makes me feel assured that both the domestic leagues and the European leagues will be able to be finished.”\nTebas said UEFA has made “a considerable effort” reaching agreements about its competitions, “more than the national leagues.”\nHe said it is very likely the Spanish league will restart with games in empty stadiums.\n“We are not considering at all that we are not going to get back to playing matches,” he said. “What I can’t assure is whether it will be with or without spectators, but I’m sure that the leagues will be finished.”\nTebas said losses from not completing the season could reach 1 billion euros ($1.1 billion) in Spain alone. The losses if the league resumes with matches in empty stadiums would be about 300 million euros ($324 million), and if it restarts with fans it would be nearly 150 million euros ($162 million).\nNearly half of the total losses would be carried by the players, and Tebas said it has been impossible to reach a deal with them on the salary cuts needed to reduce the financial impact of the crisis. He expected “almost all Spanish clubs” to reach agreements with players in the coming days — either individually or through government furloughs.\n“It’s obviously very complicated to get the players to accept less money,” Tebas said. “We have tried to come to a global agreement with the trade union, but we haven’t managed to reach that agreement. It was totally impossible.”\nTebas said eight teams have already requested the government put their players on furlough to temporarily reduce labor costs. Players said they have always been open to reducing their salaries to help the clubs, but not to the extent the league wanted.\nTebas said clubs have already collected about 90% to the money from television broadcast rights, and some of that revenue would have to be returned if the season didn’t finish.\nTebas said the league already has a protocol “drafted by three medical teams” with recommendations for when practice resumes, though he doesn’t expect normal training sessions to start until the government lockdown ends on April 26.\n“Our training protocol has been sent to the different leagues so that they can study it and they can give us their contributions on it,” Tebas said. “Obviously this is a global problem, so what happens in one country we are going to either try to copy it or improve it.”\nSpain has been one of the hardest-hit countries by the pandemic, with more than 140,000 confirmed cases of COVID-19 and nearly 13,800 deaths.\n___\nMore AP soccer: https://apnews.com/Soccer and https://twitter.com/AP_Sports\n___\nTales Azzoni on Twitter: http://twitter.com/tazzoni", "url": "https://apnews.com/58c14903e2e3a0a6231d1020e82e80ff"}