{"authors": ["Jeffrey Collins"], "date_download": "2020-05-04 20:11:43", "date_modify": "2020-05-04 20:11:43", "date_publish": "2020-04-08 05:18:10", "description": "COLUMBIA, S.C. (AP) — The South Carolina Legislature's attempt to meet as quickly as possible Wednesday to assure the state can keep operating while they stay out of session and safe from the peak...", "filename": "_2f5bfe9236a1bafa2885e88553abd30f_1588623103.html", "image_url": "https://storage.googleapis.com/afs-prod/media/de023108332e476ab945d2c493fedc53/2798.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2f5bfe9236a1bafa2885e88553abd30f_1588623103.html", "title": "Santee Cooper roadblock stops SC Legislature spending plan", "title_page": "Santee Cooper roadblock stops SC Legislature spending plan ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "House Reading Clerk Bubba Cromer, left, stands next to House Speaker Jay Lucas, center, and House Ways and Means Chairman Murrell Smith, lower right, during a special, one-day session of the South Carolina Legislature on Wednesday, April 8, 2020, in Columbia, S.C. This year's session has been paused for several weeks amid the new coronavirus outbreak. (AP Photo/Meg Kinnard)\nHouse Reading Clerk Bubba Cromer, left, stands next to House Speaker Jay Lucas, center, and House Ways and Means Chairman Murrell Smith, lower right, during a special, one-day session of the South Carolina Legislature on Wednesday, April 8, 2020, in Columbia, S.C. This year's session has been paused for several weeks amid the new coronavirus outbreak. (AP Photo/Meg Kinnard)\nCOLUMBIA, S.C. (AP) — The South Carolina Legislature’s attempt to meet as quickly as possible Wednesday to assure the state can keep operating while they stay out of session and safe from the peak of the coronavirus outbreak ran into a familiar roadblock in a surprising way.\nSeveral senators opposed a bill to allow the state to keep spending money if it doesn’t pass a budget by the end of June because it placed restrictions on state-owned utility Santee Cooper.\nHouse Speaker Jay Lucas said the failure of negotiations over Santee Cooper meant the House and Senate also couldn’t reach an agreement to set the parameters of any special session needed after the May 14 deadline in the state constitution for the session to end.\nAnd the Senate altering the House’s bill means the House will have to come back in session and deal with the new proposal before June 30 or risk the state can no longer spend money.\nWednesday’s debate took place as the state recorded 12 additional COVID-19 deaths — the most in a single day. As of Wednesday afternoon, South Carolina reported more than 2,550 coronavirus cases and 63 deaths.\nThe House approved the bill 108-0 and then left after an hour of debate. Lucas told The Associated Press shortly afterward that he cannot guarantee getting everyone back and the Senate was trying to alter deals House leaders and some senators spent weeks making.\nAfter the Senate’s vote, Lucas texted through a spokeswoman: “Today’s vote in the Senate is a shameless abdication of leadership.”\nSenate leaders did not comment after the session.\nThe spending proposal sets aside $200 million for emergency COVID-19 spending and gives the governor wide power in using it. It sets aside $15 million for adjustments needed to assure South Carolina’s June 9 primary can continue with the flexibility to make more changes to voting.\nThe proposal allows the state Education Superintendent wide powers to adjust requirements like class time, freezes teacher salaries and lets state agencies furlough employees if their budgets get out of balance.\nThe deliberate two-year debate over what to do Santee Cooper and its $4 billion in debt over two nuclear plants never finished halted when the General Assembly stopped meeting as COVID-19 started to spread. House and Senate leadership included a proposal in the broad emergency bill to freeze Santee Cooper in place, not allowing it to approve any contracts longer than a year to buy more time to decide its fate.\nBut Republican Sen. Larry Grooms, who represents Moncks Corner where Santee Cooper is headquartered, said that could keep the utility from operating, especially in an emergency where people are being told not to go out.\n“Imagine trying to stay at home without the lights,” Grooms said.\nRepublican Sen. Luke Rankin said the House is asking senators to pull down their masks and swallow what they want.\nThe Senate then changed the bill so Santee Cooper could enter into contracts only if the governor, House speaker, Senate president and leaders of each chamber’s budget committee approve in writing.\nThe Senate also passed a proposal allowing a special session in September and other times as needed to address the budget, COVID-19 and other matters.\nLucas didn’t say if the House would come back to consider either bill before the last day of the regular session on May 14.\nLucas also said Santee Cooper lied to House members, saying the electric cooperatives whose 2 million South Carolina customers buy the utility’s power agreed to their ideas when they didn’t.\nSantee Cooper said the email was presumptive and premature and apologized, utility spokeswoman Mollie Gore said in an email.\nLucas sent a letter to Santee Cooper saying any communication must be in writing. The speaker said he would fire the entire utility board and all senior managers if he could.\n“Unfortunately, for the people of South Carolina, I do not have that authority. However, I do predict and will applaud your ultimate removal from your positions in the appropriate manner,” Lucas wrote.\nGov. Henry McMaster accused Santee Cooper of exploiting a pandemic to stave off a sale or reform.\n“There appears to be no tactic or action too deceitful or reckless for the leaders of Santee Cooper to employ,” McMaster said on Twitter.\nMore than 20 of the 170 lawmakers stayed home Wednesday. There were gloves, masks and bandannas. Some senators stayed outside the chamber, only entering to vote or when needed. House members spread out into the balcony and into chairs against the wall.\nWhen the House adjourned, it set no date to return.\n___\nFollow Jeffrey Collins on Twitter at https://twitter.com/JSCollinsAP .\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/2f5bfe9236a1bafa2885e88553abd30f"}