{"authors": ["Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 16:57:12", "date_modify": "2020-05-04 16:57:12", "date_publish": "2020-04-09 10:10:03", "description": "Stores are scrambling to protect their workers from coronavirus.", "filename": "2020_04_09_business_walmart_18381afec4c56b107bd515848a07516f_index_1588611432.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408141126-whole-foods-market-brooklyn-0331-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_business_walmart_18381afec4c56b107bd515848a07516f_index_1588611432.html", "title": "Why stores could start taking customers' temperatures", "title_page": "Why stores could start taking customers' temperatures - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Stores are scrambling to protect their workers from coronavirus.\nSome have begun taking employees' temperatures to keep sick workers home. But that doesn't keep employees safe from sick customers.\nThat's why a number of stores are considering taking customers' temperatures before they enter. Public health experts say it is a prudent step: Grocery stores are one of the few public spaces still open. Millions of Americans are visit them every day and come into close contact with stores' employees.\n\"If they decided to roll such a program to their workers, under the assumption that it would prevent infected individuals from being at their stores, I do not see a reason why that wouldn't be rolled out to customers as well,\" said Dr. Luciana Borio, former director for medical and biodefense preparedness at the National Security Council under President Donald Trump and former acting chief scientist at the FDA. \"Even a modest benefit can be of value when our public health options are so limited in the absence of diagnostic tests, capacity for large scale contact tracing or a vaccine.\"\nMatthew Freeman, associate professor of environmental health and epidemiology at Emory University's Rollins School of Public Health, said it \"makes sense for businesses to take the temperatures of shoppers to protect employees and patrons, but what would be the response if someone did indeed have a fever? A plan of action is critical.\"\nWalmart will start taking its workers' temperatures. The company has said \"clear guidance\" would have to come from government leaders if it were to begin screening customers.\nRead More", "url": "https://www.cnn.com/2020/04/09/business/walmart-amazon-home-depot-whole-foods-temperatures/index.html"}