{"authors": ["Hollie Silverman"], "date_download": "2020-05-04 16:22:59", "date_modify": "2020-05-04 16:22:59", "date_publish": "2020-04-06 07:20:21", "description": "A California man who was diagnosed with the coronavirus and recovered has donated his plasma to help others fighting the potentially deadly virus.", "filename": "2020_04_06_us_plasma-donor-coronavirus_index_1588609379.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406020756-plasma-donor-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_plasma-donor-coronavirus_index_1588609379.html", "title": "He recovered from the coronavirus and now his plasma donation could save the lives of others", "title_page": "He recovered from the coronavirus and now his plasma donation could save the lives of others - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A California man who was diagnosed with the coronavirus and recovered has donated his plasma to help others fighting the potentially deadly virus.\nWhat you need to know about coronavirus\nOn March 6, Jason Garcia noticed he had a mild cough and some congestion.\nThe 36-year-old aerospace engineer from Escondido, California, didn't think that much of it. But later while on a work trip, he noticed a headache had begun accompanying his cough. Within a day, he also had a fever and body aches that quickly came and went. Then he began experiencing shortness of breath.\nGarcia called his doctor and based on his symptoms was told to go to the hospital and get tested for coronavirus.\nA positive test result\nHe was sent home and received a call on March 14 letting him know he had tested positive.\n\"They said stay isolated,\" Garcia said. \"That's what I did.\"\nJason Garcia's home isolation.\nHe spent nearly 10 days inside his home, confined to his office or his guest room, staying away from his active-duty Navy wife and their 11- month-old daughter.\nHe started to feel better and on March 18, he said, he considered himself \"symptom free.\"\nHe received a letter from the county of San Diego saying that it was safe for him to come out of isolation and rejoined the world on March 23.\nGarcia said although the protocol for coming out of isolation was 72 hours without symptoms, he wanted to be extra careful. \"I decided to do five days just to be safe,\" he said.\nVictory over the virus\nTo celebrate his recovery, he posted on social media to let his friends know he had been infected with coronavirus and was better.\nGarcia said he wrote: \"I claimed victory over this deadly virus. I won over Covid-19.\"\nAround the same time, health officials at St. Joseph's Hospital in Orange County, California, also took to social media to say they were looking for someone who had been diagnosed with coronavirus and had recovered to help with an experimental treatment to potentially save the life of another coronavirus patient.\nA friend who saw both social media posts reached out and the hospital called Garcia just a few days after his quarantine had ended, he said.\nA potentially lifesaving donation\nThey asked him for a plasma donation to be given to a coronavirus patient who was in dire condition and unresponsive to other treatments, Garcia said.\nHe said yes. \"This can be turned into a lifesaving opportunity for someone who can't fight off this disease,\" Garcia said.\nThe plasma donation will allow the current coronavirus patient to receive antibodies from Garcia, a recovered patient, to help fight the disease, Wendy Escobedo, director of nursing for renal services at St. Joseph's Hospital said in a video provided by the hospital.\nOn April 1, Garcia donated his plasma for experimental transfer into three patients.\nJason Garcia and family\nAs of Sunday, he said, doctors told him that all of his plasma has been donated. The patient who was in the worst condition has since improved, Garcia said doctors told him.\nThe patient was taken off some medication, is healthier in terms of oxygenation and is doing incrementally better day by day, a spokesperson for the hospital told CNN in an email late Sunday night.\n\"When I was diagnosed, the feeling of dread and fear, the fact this was a positive,\" Garcia explained. \"This thing ended up possibly saving someone's life.\"\nAlthough Garcia doesn't know how he became infected with the virus, he's glad he might contribute to a treatment until a vaccine is ready.\n\"If this works there's going to be an awesome chance for people to save a lot of heartache for others and fight the fight for their lives.\"", "url": "https://www.cnn.com/2020/04/06/us/plasma-donor-coronavirus/index.html"}