{"authors": ["Schuyler Dixon"], "date_download": "2020-05-04 20:22:12", "date_modify": "2020-05-04 20:22:12", "date_publish": "2020-04-20 17:57:17", "description": "With the distinct possibility of pro sports resuming in empty venues, a recent poll suggests a majority of U.S. fans wouldn't feel safe attending games anyway without a COVID-19...", "filename": "_042f3129785918a87bb6a38ec09174e5_1588623732.html", "image_url": "https://storage.googleapis.com/afs-prod/media/c7a1864984564e2d824c94aaf137d64f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_042f3129785918a87bb6a38ec09174e5_1588623732.html", "title": "Fans feeling unsafe without vaccine plays into revenue issue", "title_page": "Fans feeling unsafe without vaccine plays into revenue issue", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this June 8, 2018, long exposure file photo, Golden State Warriors fans celebrate outside Oracle Arena in Oakland, Calif. With the distinct possibility of pro sports resuming in empty venues, a recent poll suggests a majority of U.S. fans wouldn't feel safe attending games anyway without a coronavirus vaccine. (AP Photo/Josh Edelson, File)\nFILE - In this June 8, 2018, long exposure file photo, Golden State Warriors fans celebrate outside Oracle Arena in Oakland, Calif. With the distinct possibility of pro sports resuming in empty venues, a recent poll suggests a majority of U.S. fans wouldn't feel safe attending games anyway without a coronavirus vaccine. (AP Photo/Josh Edelson, File)\nWith the distinct possibility of pro sports resuming in empty venues, a recent poll suggests a majority of U.S. fans wouldn’t feel safe attending games anyway without a COVID-19 vaccine.\nAccording to the Seton Hall Sports Poll, 72% of Americans said they would not feel safe attending games without a vaccine, though the number dropped to 61% among people who identified themselves as sports fans. Nearly half the respondents in the poll, which had a margin of error of plus or minus 3.6 percentage points, said they either didn’t follow sports closely or didn’t follow sports at all.\nSo even if fans are allowed back in stadiums or arenas, many may not come. And the financial losses in such a scenario will be significant without the revenue that comes from tickets, concessions and merchandise, among other things — even if money is flowing from lucrative media rights deals.\nIf the NBA and NHL have to cancel the rest of their seasons and Major League Baseball and Major League Soccer play only half their regular schedules, the losses in fan-related revenue could reach $3 billion, according to Patrick Rishe, director of the sports business program at Washington University in St. Louis.\n“Those losses that I mentioned, both in ticket revenue and game day-related spending at the venues on food, beverage, parking, merchandise, you name it, that’s money that’s gone,” Rishe said. “Even if money on tickets is credited to next season, it’s still an opportunity lost. So it’s pretty sizable.”\nDavid Carter, a professor in the sports business school at Southern California, said there is a difference between a sports fan and a sports consumer. The latter is more likely to return whenever fans are allowed into venues.\n“I can’t imagine that the sports consumers, or you might call them the committed fans or the hardcore fans, they’re not going to stay away for a year,” Carter said. “They’re champing at the bit right now.”\nBaseball’s TV deal averages about $1.5 billion annually and runs through next year, and the NBA is roughly halfway through a nine-year deal that pays about $2.6 billion each year. The NHL’s rights deal is just $2 billion total for 10 years — an average of $200 million per season.\nCarter wondered if owners and league officials are weighing TV money that comes with resuming play against the lost revenue of empty stadiums and arenas.\n“Right now, are the media dollars at permanent risk or they just at risk of being deferred?” Carter asked. “And I would argue that because these teams and leagues are working with their media partners as that, as partners, it’s more likely that they’ll come up with a workaround that might not be ideal, but might be better than the optics of having to move forward with fans in the building and protecting the turnstile revenue that they would have otherwise made.”\nCollege football is facing its own set of questions, including whether students will be allowed back on campuses and when. The sport is critical to nearly all athletic department budgets and officials are bracing for significant dips in revenue even if games are played.\n“If public health officials say it’s safe to return large events, I don’t think it’s realistic that everybody is going to feel good about coming to games,” Baylor athletic director Mack Rhoades said. “And then, because of the economy, people are going to be impacted and not everybody is going to be able to afford a ticket.”\nAmong other findings in the poll, most fans thought U.S. pro sports leagues acted at the right time to suspend their seasons. The vast majority also agreed that the International Olympic Committee didn’t move too quickly in postponing the Tokyo Games until the summer of 2021.\nAbout 70% of respondents said the NFL shouldn’t start in the fall, even with social distancing. And 76% said they would have the same interest in watching live sports on TV even if fans are not in the stands.\n___\nAP Sports Writer Stephen Hawkins in Fort Worth, Texas, contributed to this report.", "url": "https://apnews.com/042f3129785918a87bb6a38ec09174e5"}