{"authors": ["Associate Reporter"], "date_download": "2020-05-04 20:03:38", "date_modify": "2020-05-04 20:03:38", "date_publish": "2020-05-04 19:06:07", "description": "Tim Bray, an engineer overseeing operations at Amazon Cloud, called the firings \"chickens**t\" in his public resignation.", "filename": "entry_amazon-vp-engineer-quits-over-recent-firings-of-protesting-workers_n_5eb05c1cc5b62efb9d7e175c_1588622618.html", "image_url": "https://img.huffingtonpost.com/asset/5eb05d5c3000003615155679.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_amazon-vp-engineer-quits-over-recent-firings-of-protesting-workers_n_5eb05c1cc5b62efb9d7e175c_1588622618.html", "title": "Amazon VP Quits Over Recent Firings Of Protesting Workers", "title_page": "Amazon VP Quits Over Recent Firings Of Protesting Workers | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "A vice president at Amazon Cloud quit his job Monday, saying in his public resignation that he opposed the recent firings of Amazon employees who have protested for improved work conditions during the coronavirus pandemic.\nTim Bray, a senior engineer and vice president at the Amazon company, announced his resignation on his website, saying warehouse workers being fired was “evidence of a vein of toxicity running through the company culture.”\n“I choose neither to serve nor drink that poison,” Bray wrote.\nOn March 30, Amazon fired Chris Smalls, an employee working in a New York City warehouse, after he helped organize a walkout to demand Amazon temporarily close the facility to be sanitized. Amazon claimed Smalls was fired for “violating social distancing guidelines,” but the company faced public backlash and New York Attorney General Letitia James called the firing “immoral and inhumane.” Days later, Vice News reported on a leaked memo in which Amazon leadership called Smalls “not smart, or articulate” and outlined a plan to counteract his reports to the press.\nA number of other employees at various Amazon locations have been fired for whistleblowing and raising concerns about worker conditions at warehouses, Bray wrote, adding that “every one of them is a person of color, a woman, or both.”\nBray called the firings “chickenshit,” “kill the messenger” and “designed to create a climate of fear.”\n“Remaining an Amazon VP would have meant, in effect, signing off on actions I despised,” he said. “So I resigned.”\nHe ended his resignation letter with a call to empower warehouse employees: “Any plausible solution has to start with increasing their collective strength.”\nBray is reportedly the highest-ranking Amazon employee to speak out against the company’s treatment of workers during the coronavirus pandemic.", "url": "https://www.huffpost.com/entry/amazon-vp-engineer-quits-over-recent-firings-of-protesting-workers_n_5eb05c1cc5b62efb9d7e175c"}