{"authors": [], "date_download": "2020-05-04 20:11:17", "date_modify": "2020-05-04 20:11:17", "date_publish": "2020-03-16 23:50:39", "description": "AMAZON SEEKS TO HIRE 100,000 TO KEEP UP WITH SURGE IN ORDERS NEW YORK (AP) - Amazon said Monday that it needs to hire 100,000 people across the U.S. to keep up with a crush of orders as the...", "filename": "_33d59d9af6244575b747567f5f6ae52e_1588623077.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_33d59d9af6244575b747567f5f6ae52e_1588623077.html", "title": "AM Prep-Cyber Corner", "title_page": "AM Prep-Cyber Corner", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "AMAZON SEEKS TO HIRE 100,000 TO KEEP UP WITH SURGE IN ORDERS\nNEW YORK (AP) - Amazon said Monday that it needs to hire 100,000 people across the U.S. to keep up with a crush of orders as the coronavirus spreads and keeps more people at home, shopping online. The online retailer will also temporarily raise pay by $2 an hour through the end of April for hourly employees, who work at its warehouses, delivery centers and Whole Foods grocery stores. Amazon said this weekend that a surge of orders is putting its operations under pressure. It warned shoppers that it could take longer than the usual two days to get packages. It also said it was sold out of many household cleaning supplies and is working to get more in stock.\nUS OFFICIALS: FOREIGN DISINFORMATION IS STOKING VIRUS FEARS\nWASHINGTON (AP) - The Trump administration is alleging that a foreign disinformation campaign is underway aiming to stoke fear amid the coronavirus pandemic. Three U.S. officials said Monday that federal officials began confronting what they said was a deliberate effort by a foreign entity to sow fear of a nationwide quarantine. At a press briefing Monday, President Donald Trump said it could be that there are some foreign entities “playing games.” But he said it didn’t matter because he was not ordering a nationwide lockdown. The three U.S. officials did not name the foreign entity they believe to be responsible. They spoke on the condition of anonymity to discuss the sensitive matter.\nGOOGLE SIBLING VERILY LAUNCHES COVID-19 SCREENING WEBSITE\nSAN FRANCISCO (AP) - Google sibling company Verily launched a website to screen people who think they might have COVID-19 and point them to testing sites, though it may be of limited use initially. Verily, a health tech company owned by Google parent Alphabet, launched the screening tool for those that live in or near Santa Clara County and San Mateo County south of San Francisco. But as of Monday morning, the website was unable to help more people schedule testing appointments. Verily launched the website quickly after President Trump gave an exaggerated and misleading account of it during a press conference last Friday.\nHHS INVESTIGATES CYBER INCIDENT\nWASHINGTON (AP) - National security officials report a “cyber incident” involving the computer networks of the Department of Health and Human Services, but they says the networks have been operating normally. The official have not detailed the scope of the incident. Secretary Alex Azar says the networks were not penetrated and the department has taken strong defensive action. He says the source of the enhanced activity remains under investigation, but there was no data breach.\nISRAEL TAKES STEP TOWARD MONITORING PHONES OF VIRUS PATIENTS\nJERUSALEM (AP) - Israel’s Cabinet has authorized the Shin Bet internal security agency to use mobile-phone tracking technology to monitor the movements of coronavirus patients, despite an outcry from privacy advocates. Prime Minister Benjamin Netanyahu says he understands the privacy concerns, but that drastic steps are needed to prevent the spread of the virus. The Shin Bet has used its technology for years to keep tabs on Palestinian militants. Officials believe that same technology can determine with great precision where infected patients have been before they were diagnosed, and who may have come into contact with them. Netanyahu says it can be an “effective tool for locating the virus.” Israel has detected over 200 cases.", "url": "https://apnews.com/33d59d9af6244575b747567f5f6ae52e"}