{"authors": ["Kristen Drybread", "On Assignment For Huffpost"], "date_download": "2020-05-04 20:20:54", "date_modify": "2020-05-04 20:20:54", "date_publish": "2020-04-29 15:52:02", "description": "People raising kids alone need more help than two-parent families, not less.", "filename": "entry_cares-act-stimulus-single-parents_n_5ea1ffd4c5b6bb28aa34c486_1588623654.html", "image_url": "https://img.huffingtonpost.com/asset/5ea2155f300000b80f154cb2.jpeg?cache=hvl0gxexk4&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_cares-act-stimulus-single-parents_n_5ea1ffd4c5b6bb28aa34c486_1588623654.html", "title": "The Coronavirus Stimulus Is A Raw Deal For Single Parents", "title_page": "The Coronavirus Stimulus Is A Raw Deal For Single Parents | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "This story was supported by the journalism nonprofit the Economic Hardship Reporting Project.\nEven in the best of times, Samantha Coleman, a 36-year-old widowed single mother in Aurora, Colorado, had only pennies left at the end of the month after paying for her mortgage, her young son’s after-school care and her teenage daughter’s art lessons.\nAs a nurse educator at Presbyterian/St. Luke’s Medical Center in Denver, she is now performing a near-impossible juggling act: stressing over her precarious finances, fearing for her own health after spending days in a hospital full of high-risk patients and trying to figure out how to look after her children with schools closed.\n“I keep asking myself: If I were to get sick and not recover, who would take care of my children?” she said. “I don’t know the answer, and that scares me.”\nThen there’s Isabella Grandbois, 29, a single mother in Yukon, Oklahoma, who took a job as an Instacart shopper on March 16, just five days after the World Health Organization declared COVID-19 a pandemic. Right before the crisis hit, she’d given up a position in the cannabis industry because her employer expanded its hours well beyond those covered by her son’s after-school program. To continue working, she would have needed to hire a babysitter, which would have left her with just $7 in her pocket at the end of each month.\nI’m getting really freaked out about taking him to the store. But it’s my job. And if I don’t work, we don’t eat. Isabella Grandbois\n“Besides being broke, I would have gotten home every night after my son was asleep,” she said. “I know some people have to do that to survive, but that’s not the kind of mom I want to be.”\nSearching for a new job and paying regular expenses has depleted Grandbois’ savings. With her 7-year-old’s school shuttered and no money for child care, she has been forced to bring him on many of the grocery store runs she makes daily for people who have the means to shelter at home.\n“I’m getting really freaked out about taking him to the store. But it’s my job. And if I don’t work, we don’t eat,” she said. “When I can’t leave him with a neighbor, what other choice do I have?”\nAs a single mom of two myself, whose salary as contingent university faculty is rarely sufficient to pay the monthly bills, I often consider similarly agonizing questions. When my semester contract ends a few weeks from now, I’ll have no guaranteed paycheck. But former students will still ask me to write letters of recommendation and advise them on graduate school applications. How can I attend to the needs of these young adults when I’m not sure how I am going to feed my own kids?\nOn March 27, Congress passed a stimulus package intended to help keep the national economy afloat. But the CARES Act failed to consider the specific needs of a constituency that will take one of the biggest financial hits from the coronavirus pandemic: single parents. Nor has Congress made any special provision for the many single parents who work on the front lines: in health care, at essential businesses, as domestic workers and more.\nEconomic stimulus payments, which are still being distributed, gave two-parent families with annual incomes of up to $150,000 at least $1,200 more than any single-parent household with the same number of children. And yet dual-parent homes are likely to have more savings, more income and two people to juggle child care and household responsibilities in the months we’re likely to all be practicing social distancing.\nI know that everyone’s having a hard time adjusting to what we’re being asked to do to get through this. Still, it’s a bit aggravating to see all these parents bragging about the means they’ve set up to deal with it. Samantha Coleman\nSingle-parent households are, by definition, sustained by just one income. They typically have fewer resources than two-parent households, not only because single parents tend to earn much lower incomes than their married peers, according to multiple studies, but also because most solo moms and dads have to take on all the labor of parenting alone.\nColeman, who’s new to being a single parent, has felt this most acutely when checking out her Facebook feed, which has recently been dominated by dual-parent families posting their plans for tag-team co-parenting.\n“I know that everyone’s having a hard time adjusting to what we’re being asked to do to get through this. Still, it’s a bit aggravating to see all these parents bragging about the means they’ve set up to deal with it,” she said. “There’s two of them to help pick up the slack. All I have is me.”\nThe stimulus amounts to yet another government policy intentionally crafted to favor married couples over single parents. Ever since President Bill Clinton signed the Personal Responsibility and Work Opportunity Reconciliation Act of 1996, assistance for struggling single parents has plummeted, even as the percentage of children living with one parent has steadily increased and entitlement payments for the elderly, the disabled and the unemployed have continued to rise.\nToday, 15 million children under the age of 18 live with a solo mother, while 3 million live with a single father. All told, nearly 1 in 4 children in the United States is currently being raised in a household led by a single adult. More than half of these families are headed by a parent who works full time, and, contrary to popular assumptions, most do not receive any form of public assistance.\nEric Gay/ASSOCIATED PRESS The stimulus checks that are being sent to most Americans are higher for two-parent households.\nMireya Salas, who lives in Boulder, Colorado, is another single parent whose daily struggles have been compounded by the pandemic. The 37-year-old domestic worker and mother of a 9-year-old usually takes home about $1,200 a month for housecleaning, but the last time she was asked to clean someone’s house was nearly two months ago. Her rent and other bills are past due, and she has no way to pay them.\n“I haven’t been sleeping at all lately,” she said. “I lie in bed worrying about how to get work, how to buy my son the things he needs, how to do something to get money.”\nLike many single parents who live near the poverty line, Salas shuns “handouts.” At the same time, she hasn’t been able to find the kind of job that single parents normally get: in the gig economy, retail or the service industry. “My mind is spinning and spinning with thoughts about how to make money right now,” she said.\nSalas does not have a computer, so she can’t join the legion of parents frantically setting up home offices or updating their LinkedIn profiles. She can’t apply for unemployment assistance and does not even know if she’s eligible to do so. Nor can she access the vast resources available to parents online to raise emergency funds, to entertain their children, or to locate food banks and other sources of support.\nAlthough a stimulus check will undoubtedly help Salas somewhat, Congress can do more to recognize the economic strain single adults face. At the very least, Congress should provide equal assistance to single- and dual-parent households caring for the same number of children. They could easily do this by increasing payments to individuals who filed as head of household on their most recent tax return. (Though not all people who took advantage of this filing status are single moms or dads, all are supporting a qualifying young or needy relative on their own.)\nThe United States currently has the highest rate in the developed world of single-parent families in poverty. According to the Pew Research Center, 27% of solo parents live below the poverty line. The pandemic has made the solo parents I spoke to even more acutely aware of how close they are to losing everything they’ve worked so hard to provide. As Salas told me: “I’ve never been more worried about what the future is going to bring.”\nKristen Drybread is a lecturer at the University of Colorado Boulder.", "url": "https://www.huffpost.com/entry/cares-act-stimulus-single-parents_n_5ea1ffd4c5b6bb28aa34c486"}