{"authors": ["Scott Bauer"], "date_download": "2020-05-04 20:19:23", "date_modify": "2020-05-04 20:19:23", "date_publish": "2020-04-16 13:20:40", "description": "MADISON, Wis. (AP) — Gov. Tony Evers on Thursday closed all K-12 schools for the remainder of the academic year and extended Wisconsin's stay-at-home order for another month, keeping most...", "filename": "_d060353b5a8d95dde8e85327bcd6c018_1588623563.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8feaf2876d824168969e5a37da5de747/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d060353b5a8d95dde8e85327bcd6c018_1588623563.html", "title": "Evers extends Wisconsin stay-at-home order until May 26", "title_page": "Evers extends Wisconsin stay-at-home order until May 26", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this Wednesday April 15, 2020, photo, State Street is mostly empty around noontime due to the coronavirus pandemic in Madison, Wis. Gov. Tony Evers has extended Wisconsin’s stay-at-home order for another month. The extension issued Thursday keeps nonessential businesses closed until May 26 to slow the spread of the coronavirus. (Steve Apps/Wisconsin State Journal via AP)\nIn this Wednesday April 15, 2020, photo, State Street is mostly empty around noontime due to the coronavirus pandemic in Madison, Wis. Gov. Tony Evers has extended Wisconsin’s stay-at-home order for another month. The extension issued Thursday keeps nonessential businesses closed until May 26 to slow the spread of the coronavirus. (Steve Apps/Wisconsin State Journal via AP)\nMADISON, Wis. (AP) — Gov. Tony Evers on Thursday closed all K-12 schools for the remainder of the academic year and extended Wisconsin’s stay-at-home order for another month, keeping most nonessential businesses shuttered until after the Memorial Day holiday weekend to slow the spread of the coronavirus.\nWisconsin Republicans reacted with anger to Evers’ extension, threatening lawsuits, the firing of his health secretary and other curbs on his power. The president of Wisconsin Manufacturers and Commerce, the powerful state chamber of commerce, also called the legality of the order into question, saying it will lead to more businesses closing and people losing their jobs.\nMore than 1,400 people said on Facebook that they planned to attend a rally at the state Capitol on April 24, the day the original order was to end, demanding that Evers reopen the state.\nThe action came on the same day that President Donald Trump’s administration outlined a phased approach to restoring normal commerce and services, but only for places with strong testing and a decrease in COVID-19 cases.\nEvers stood firm, saying the stay-at-home order in place since March 25 has already saved between 300 and 1,400 lives.\n“Folks, we’ve saved lives together,” Evers said. “At the end of the day, my bottom line is keeping people safe and we’re not out of the clear just yet.”\nBut Republicans voiced their loudest objections to date, especially in the state Senate which has yet to confirm Department of Health Services Secretary Andrea Palm and could vote to fire her. The Senate has already fired Evers’ agriculture secretary.\n“She must not be allowed to continually trample on the constitution or the state’s economy,” Republican Sen. David Craig said of Palm. “Enough is enough!”\nRep. Barb Dittrich, of Oconomowoc, called Evers a “tyrant.”\nSenate Majority Leader Scott Fitzgerald and other Republicans called for loosening restrictions on more rural parts of the state that haven’t been as greatly affected by COVID-19 as urban areas like Milwaukee.\nFitzgerald said senators were looking at “legal or legislative relief.”\nBefore the order can be lifted, there needs to be a “massive” expansion of testing, more contact tracing to determine the spread of the virus and additional public health measures to prevent another wave, Evers said.\n“You can’t think of this like flipping a light switch. It’s like turning a dial,” Evers said. “Things won’t get back to normal until there’s a vaccine and treatment for this disease.”\nEvers also loosened restrictions starting April 24 on nonessential businesses, allowing them to make deliveries and have curbside pickup available. That includes arts and crafts stores making material available to produce face masks and other personal protective equipment. Libraries will be able to make books available for curbside pickup. Lawn care services are allowed, as long as the work is done by just one person.\nHe also opened golf courses starting at 8 a.m. on April 24, but not pro shops or club houses.\nEvers said people are strongly encouraged to stay close to home, not travel to cabins or second homes, and not travel out of state.\nThe planned rally next week at the Capitol comes after similar events in Oklahoma and Michigan attracted thousands. Evers said he respected the protesters’ free-speech rights, but he hopes they remain 6-feet apart from one another so they stay healthy.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nAs of Thursday, there were 197 deaths from COVID-19 in Wisconsin and more than 3,800 confirmed cases, although health officials have said that represents only a fraction of the people who are actually infected.\nEvers told Trump in a letter mailed Wednesday that Wisconsin faces more than $2 billion in revenue losses due to skyrocketing unemployment and other hits to the economy caused by the coronavirus. He signed the letter with the governors of Michigan and Pennsylvania, all Democrats. They asked Trump to work with Congress to send $500 billion to states and local governments facing budget shortfalls.\nOn Thursday, Evers joined with six other Midwestern governors to coordinate reopening their state economies after similar pacts were made in the Northeast and on the West Coast. Other states joining are Illinois, Ohio, Michigan, Indiana, Minnesota and Kentucky.\n___\nFollow Scott Bauer on Twitter: https://twitter.com/sbauerAP", "url": "https://apnews.com/d060353b5a8d95dde8e85327bcd6c018"}