{"authors": ["Nikki Carvajal"], "date_download": "2020-05-04 16:24:56", "date_modify": "2020-05-04 16:24:56", "date_publish": "2020-04-06 23:10:31", "description": "President Donald Trump said Monday that he may \"get involved\" in the case of Navy captain removed from the command of the USS Theodore Roosevelt.", "filename": "2020_04_06_politics_trump-navy-captain-coronavirus_index_1588609496.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405192138-03-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_trump-navy-captain-coronavirus_index_1588609496.html", "title": "Trump says he may 'get involved' in case of Navy captain removed from duty", "title_page": "Trump says he may 'get involved' in case of Navy captain removed from duty - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump said Monday that he may \"get involved\" in the case of Navy captain removed from the command of the USS Theodore Roosevelt.\nAt a Monday briefing, Trump was asked about comments made by acting Secretary of the Navy Thomas Modly , who attacked Capt. Brett Crozier as either \"too naive or too stupid\" to be in command before later apologizing for the comments.\n\"I haven't heard it exactly, I heard they heard,\" Trump said, referring to the crew of the USS Theodore Roosevelt. \"I heard they had a statement that was made, if that were the statement, it's a strong statement.\"\nCrozier was relieved of command after a letter he sent to Navy leadership was leaked to the media. The letter flagged his concerns about the Roosevelt's crew of more than 4,000, saying in part \"sailors do not need to die,\" discussed the challenges of trying to contain an outbreak of coronavirus aboard the ship and urgently requested that sailors be allowed to quarantine on land. The Navy cited loss of confidence in his command and failure to adhere to the chain of command.\n\"The letters shouldn't have been sent, and certainly they shouldn't have been leaked,\" Trump said. \"This is a military operation. I must tell you, I've heard very good things about the gentlemen. Both gentlemen, by the way, I will say this, about both gentlemen. And I may look into it from the standpoint of something should be resolved because I'm hearing good things about both of people.\"\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/trump-navy-captain-coronavirus/index.html"}