{"authors": ["Danica Kirka"], "date_download": "2020-05-04 20:25:22", "date_modify": "2020-05-04 20:25:22", "date_publish": "2020-04-20 12:09:10", "description": "LONDON (AP) — Dr. Meenal Viz cut a solitary figure as she staged a one-woman protest outside the prime minister’s Downing Street residence. She held a hand-lettered placard bearing a simple...", "filename": "_3a6202e950592f2387e048998c9791fd_1588623922.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7550011e81df4557b684cd9aa5e0a6d4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3a6202e950592f2387e048998c9791fd_1588623922.html", "title": "Reverence for Britain's NHS complicates supply shortages", "title_page": "Reverence for Britain's NHS complicates supply shortages", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 19, 2020, file photo, Dr. Meenal Viz holds a banner as she protests outside the prime minister's residence on Downing Street in London as the country continues its lockdown to help curb the spread of the coronavirus. Hospital organizations are lambasting Britain’s government for failing to give medical staff the appropriate clothing and equipment needed to deal with the COVID-19 outbreak. Viz staged a one-woman protest on Sunday to express her dismay. (AP Photo/Kirsty Wigglesworth, File)\nFILE - In this April 19, 2020, file photo, Dr. Meenal Viz holds a banner as she protests outside the prime minister's residence on Downing Street in London as the country continues its lockdown to help curb the spread of the coronavirus. Hospital organizations are lambasting Britain’s government for failing to give medical staff the appropriate clothing and equipment needed to deal with the COVID-19 outbreak. Viz staged a one-woman protest on Sunday to express her dismay. (AP Photo/Kirsty Wigglesworth, File)\nLONDON (AP) — Dr. Meenal Viz cut a solitary figure as she staged a one-woman protest outside the prime minister’s Downing Street residence. She held a hand-lettered placard bearing a simple message: “Protect Healthcare Workers.”\nBut she wasn’t truly alone. Four weeks after the British government ordered most people to stay indoors to slow the spread of the coronavirus, health care workers across the country complain they still do not have enough masks, face shields, gowns and other protective equipment. Hospital officials have threatened to discipline workers if they do not stop publicizing the problem, they say.\nHealth care workers worldwide have reported similar shortages, but the frustration is heightened in Britain because of the revered position held by the National Health Service, which has provided medical care for free since 1948. Physicians complain that government action does not seem to match the rhetoric of politicians who laud NHS doctors and nurses for risking their lives to treat the sick. The failure of a shipment of some 400,000 surgical gowns to arrive as promised over the weekend was only the latest disappointment.\nViz refused to be silent after the deaths of at least 27 NHS employees — a figure the government acknowledges is certain to grow. One death hit close to home: Mary Agyeiwaa Agyapong, a 28-year-old London nurse who died after her baby was delivered by emergency caesarean section. Viz, 27, is six months’ pregnant.\n“It’s affecting our work as doctors because we show up on a daily basis to fight for our patients, and if we’re given the right protection, we will run a marathon for them. But ... we don’t have that support,” she said. “We are stuck in a dilemma, a moral dilemma. How much can I help my patient? But I also need to help myself as well.”\nSome doctors and nurses are relying on donated goggles designed for school science projects, handmade masks and equipment purchased at home-improvement stores, according to the Doctors Association UK, which lobbies on behalf of front-line doctors.\nNurses report holding their breath during some procedures for fear that flimsy masks will not shield them from the virus, the association said.\nIn a survey of 6,000 medical professionals released Sunday by the British Medical Association, around half of doctors working in high-risk areas said there were shortages of long-sleeved disposable gowns and disposable goggles. In other hospital settings, 50% said scrubs and eye protection were in short supply.\n“Two months into the COVID-19 crisis in Britain, we shouldn’t still be hearing that doctors feel unprotected when they go to work,” said Dr. Chaand Nagpaul, chairman of the council of British Medical Association, the union that represents doctors. “The government says that 1 billion items will soon have been shipped, and while there have been signs of improvement, our research clearly shows that equipment is not reaching all doctors working on the front line.”\nIn a tacit acknowledgement that more action is needed, the government on Sunday tapped the man who led the organizing committee for the 2012 London Olympics to spearhead improvements. In a statement that compared Paul Deighton to World War II aircraft czar Lord Beaverbrook, the government issued a “call to arms” to U.K. manufacturers.\nNishant Joshi, an emergency doctor at a hospital north of London, said hospitals are rationing inconsistent supplies.\n“So you could have a supply of hospital gowns one day and then the next day, for example, you’re being told to make do with a flimsy apron,” Joshi said. “So really, we don’t know what we’re going to get when we turn up each day.”\nIn the face of such shortages, volunteer groups are springing up to help supply some protection. At least one hospital trust has compiled a list of donations that meet acceptable standards and those that do not. (Yes, to science goggles, no to knitted masks.)\nThe uncertainty about protection fuels fear among health care workers, which will ultimately hurt patient care, said Bharat Pankhania, an expert in communicable diseases and senior clinical lecturer at the University of Exeter Medical School.\n“A mind that is full of fear and tiredness and anxiety will inevitably underperform,″ Pankhania said. “They need to be protected psychologically, physically and spiritually. And if they are in a good place, they perform better.”\nThe pandemic is hitting Britain at a time when NHS funding is being squeezed by government efforts to control spending at a time of increasing demand.\nCost pressures and a focus on acute care rather than preventive medicine have hurt the NHS’s ability to respond to this crisis, said Caitjan Gainty, a historian of medicine at King’s College London.\n“The NHS is a national treasure,” she said. “Even if it semi-collapses under the weight of this, I think the national sentiment will be that it did a heroic job.”\nThe doctors are also victims, caught in the middle of budget pressures and demand, she said.\nViz, for her part, wants to hold the government to account. The doctor said she chose to speak out now because no matter what happens to her, she wants her child to know that she did her best.\n“This is no time to be silent, and this is no time to be scared. There’ll be plenty of time to be silent after all this is over,” she said. “If I don’t speak up, many more people could die. Many more health care workers could die, and many more children could be left without a mother, without a father. And that’s not OK.”", "url": "https://apnews.com/3a6202e950592f2387e048998c9791fd"}