{"authors": ["Laura He", "Cnn Business"], "date_download": "2020-05-04 15:59:55", "date_modify": "2020-05-04 15:59:55", "date_publish": "2020-04-01 11:56:28", "description": "China's economy is showing some tentative signs of recovery from the devastation caused by the novel coronavirus pandemic but the path ahead remains hugely uncertain and growth could be entirely wiped out in 2020, putting millions of jobs at risk.", "filename": "2020_04_01_economy_china-economy-stimulus-coronavirus_index_1588607995.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401112205-01-china-workers-0320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_economy_china-economy-stimulus-coronavirus_index_1588607995.html", "title": "China's economy may not grow at all in 2020. That hasn't happened in 44 years", "title_page": "China's economy may not grow at all in 2020. That hasn't happened in 44 years - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Hong Kong (CNN Business) China's economy is showing some tentative signs of recovery from the devastation caused by the novel coronavirus pandemic but the path ahead remains hugely uncertain and growth could be entirely wiped out in 2020, putting millions of jobs at risk.\nGDP growth this year in the world's second biggest economy could sink to just 1% or 2%, down from 6.1% in 2019, according to recent estimates by analysts, including a Chinese government economist. In a worst case scenario, the $14 trillion economy may not grow at all, the World Bank warned earlier this week.\nThat would be its weakest performance in 44 years, worse even than the troughs hit during the 2008-2009 global recession and in 1990, when the West imposed sanctions on China after the Tiananmen Square massacre\nAnalysts from UBS and Goldman Sachs recently slashed their estimates for China's growth this year to 1.5% and 3% respectively.\nEven Chinese officials, who have set annual GDP targets every year since 1985, are wary of making predictions. A policymaker at the People's Bank of China (PBOC) said this week that the government should not set a target for 2020.\n\"It's difficult to even realize growth of between 4% and 5%. Many have predicted growth to fall to just 1% or 2% [this year]. These circumstances are all possible,\" Ma Jun, a member of the monetary policy committee at the Chinese central bank told the state-owned Economic Daily.\nGiven the huge uncertainties in the outlook, China is finding it hard to determine how much fiscal and monetary stimulus to unleash, Ma said. An \"unrealistic\" growth target may encourage local governments to splurge on infrastructure investments, which do little to ease unemployment or improve people's livelihoods in the short term, he added.\nMore help needed\nStill, an official survey this week showing an anemic recovery in China's vast manufacturing industry last month, following a collapse in activity in February, was followed by news of more stimulus measures.\nChina's cabinet on Tuesday announced more than 3 trillion yuan ($423 billion) in extra financial support for small businesses\nThe PBOC will provide an additional 1 trillion yuan ($141 billion) to small and medium-sized banks, and cut the amount of cash they must hold as reserves. Both measures are aimed at boosting lending to small and medium-sized enterprises (SMEs).\nPreviously, the central bank had injected liquidity or allocated additional lending worth more than 1.65 trillion yuan ($232 billion). The government had also allocated at least 116.9 billion yuan ($16.4 billion) in financial relief and stimulus aimed at fighting the virus.\nTuesday's announcement included a promise from the government to double \"temporary cash handouts\" to low-income families and the unemployed from March to June. The government didn't specify how much it would give out, but said the move is estimated to benefit more than 67 million people.\n\"We believe ramping up financial relief for enterprises (especially SMEs) and households inflicted by the pandemic should be the best economic and social policies at the moment,\" Ting Lu, chief China economist for Nomura, said in a note on Wednesday.\nBeijing is also trying to revive the automotive industry after sales plunged 42% in January and February. The government will extend subsidies and tax breaks on electric vehicles by two years, while cutting sales tax on used cars from May through the end of 2023.\nA private survey published Wednesday showed that China's manufacturing activity expanded ever so slightly in March, as factories reopened following the easing of widespread shutdowns and travel restrictions.\nThe Caixin/Markit manufacturing Purchasing Managers' Index rose to 50.1 last month from a record low of 40.3 in February. A reading above 50 indicates expansion, below 50 contraction.\nThe PMI data suggest the contraction in activity has bottomed out, but the economy has not recovered yet, analysts for Capital Economics said in a note on Wednesday.\n\"The [Caixin] survey suggests that just over half of firms saw conditions improve last month — implying that activity improved marginally relative to February's dismal showing but remains very weak,\" they wrote.\n\"The slow pace of improvement implied by last month's PMIs is consistent with our view that China faces a drawn out recovery from the Covid-19 outbreak,\" they said.\nTens of millions of jobs at risk\nCapital Economics has one of the most bearish forecasts for China's economy this year. It estimates GDP shrank by as much as 16% in the first quarter, and predicts a contraction of 3% for 2020 as a whole.\nChina faces two major headwinds as it tries to get back on its feet — weakening foreign demand due to the global pandemic and a potential second wave of coronavirus cases.\nNomura estimates China's economy will grow by only 1% in 2020, causing millions of job losses.\n\"We estimate that slumping exports alone could lead to a loss of 18 million jobs in [the second quarter],\" Lu wrote on Tuesday.\nCaixin will publish its survey of activity in China's services industry — which accounts for roughly 60% of GDP — on Friday. Whatever it shows, analysts expect the government will have to provide more help for the economy.\nTao Wang, chief China economist for UBS, said Beijing is likely to announce more support for individuals, the labor market and health care systems, more infrastructure investment, and additional cuts in interest rates.\n\"Moreover, we expect the government to either lower this year's GDP growth target significantly or ... [focus it] instead on coronavirus control, work resumption, poverty reduction and supporting labour market,\" she said.", "url": "https://www.cnn.com/2020/04/01/economy/china-economy-stimulus-coronavirus/index.html"}