{"authors": ["Veronica Stracqualursi", "Ryan Browne"], "date_download": "2020-05-04 16:16:58", "date_modify": "2020-05-04 16:16:58", "date_publish": "2020-04-03 13:56:05", "description": "A US Navy hospital ship currently docked in New York City harbor is treating only 22 patients as of Friday afternoon, despite having a 1,000 bed capacity to treat non-coronavirus patients, according to a US Navy official.", "filename": "2020_04_03_politics_navy-ho_9f5ecabb6d51d536b0ef6ef46e1402e9_index_1588609018.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330104746-02-usns-comfort-arriving-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_navy-ho_9f5ecabb6d51d536b0ef6ef46e1402e9_index_1588609018.html", "title": "Navy hospital ship with 1,000 bed capacity is only treating 20 patients", "title_page": "Navy hospital ship with 1,000 bed capacity is only treating 20 patients - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A US Navy hospital ship currently docked in New York City harbor is treating only 22 patients as of Friday afternoon, despite having a 1,000 bed capacity to treat non-coronavirus patients, according to a US Navy official.\nNavy officials told CNN that they expect the number of patients being treated to increase significantly in the coming days as the process of referring patients to the ship is refined.\nThe USNS Comfort was deployed to New York City, the epicenter of the virus outbreak in the United States, to free up capacity in the city's civilian hospitals so that they can focus on treating coronavirus patients.\nNew York City's hospitals have been overwhelmed with coronavirus cases and are struggling to respond to patients constantly streaming in. A shortage of personal protective equipment has also placed medical workers at risk of contracting the virus. On Thursday, New York Gov. Andrew Cuomo announced that the temporary hospital facility at the Javits Convention Center , which holds 2,500 beds, will now treat Covid-19 patients.\nAsked about the lack of patients being treated by the Comfort, New York City Mayor Bill de Blasio told CNN's John Berman on Friday, \"There's no question in my mind that will get resolved quickly. You'll see that number grow.\"\n\"Having the Comfort here is a very, very important thing for New York City in terms of the number of patients served, but also an extraordinary morale boost when we needed it,\" De Blasio said. \"I don't have a doubt in my mind, the Comfort will be filled up soon.\"\nAmbulances are not taking people directly to the ship, which docked in New York City on Monday. Patients are referred to the ship by shore-based hospitals and must be screened and tested for the virus before being admitted on board.\nPentagon working to admit patients more quickly\nThe Department of Defense said Friday that it would begin streamlining the process to admit patients onto the ship.\n\"Screening for care on the USNS Comfort will be modified and will now occur pier-side in an effort to reduce the backlog at some of the nearby New York hospitals,\" the Pentagon said in a statement. \"The screening effort for the USNS Comfort will no longer require a negative test (for coronavirus), but each patient will still be screened by temperature and a short questionnaire.\"\nThere are some patients that the Comfort can't bring on board, mainly those who are immunosuppressed due to the fact the ship is open bay and does not have the ability to isolate patients, according to a Navy official familiar with operations on the ship.\n\"We are conducting data analysis to see how we need to change our configuration -- bottom line we've been here 48 hours, and this is a scenario no one has ever seen before,\" the official told CNN. \"No one wants to get this wrong. We hear the feedback from medical professionals, and are fine tuning,\" but the Comfort will still only treat non-coronavirus patients.\nOn Thursday morning, the Comfort was treating \"three\" patients, according to Capt. Patrick Amersbach, the ship's commanding officer. A US Navy spokesperson confirmed late Thursday that the number of patients on board the Comfort had reached 20, which The New York Times first reported. Two more patients were admitted on Friday.\n\"The ship really seems kind of useless,\" a city hospital physician caring for coronavirus patients told CNN Friday.\nThe Comfort has more than 1,100 personnel on board to treat patients. It also contains 12 fully equipped operating rooms, radiology services, a medical lab, pharmacy, optometry lab, a CAT-scan and two oxygen producing plants, according to the Navy.\nAnother Navy hospital ship, the USNS Mercy, deployed to Los Angeles, has treated 15 patients so far, five of whom have since been discharged, Capt. John Rotruck, the ship's medical facility commanding officer, said Thursday.\nRotruck said the Mercy was treating patients recovering from traumatic accidents, heart and lung problems, and gastrointestinal issues.\nTemporary hospitals being converted to treat coronavirus patients\nThe Pentagon also announced Friday that the military will convert three temporary medical facilities in New York, New Orleans, and Dallas into facilities capable of treating patients with the virus.\n\"At the request of (Federal Emergency Management Agency), the Department of Defense will expand its medical support to include COVID-19 positive patients at the Javits Federal Medical Station (FMS) in New York City, the Morial FMS in New Orleans, Louisiana, and the Kay Bailey Hutchinson FMS in Dallas, Texas,\" the Defense Department said in a statement.\n\"These three DoD-supported locations will now provide support to COVID-19 positive patients in convalescent care, as well as low-acuity patients. These patients, who require a lower level of medical care, must first be screened at a local hospital,\" the statement added.\nOriginally all three facilities were intended to treat non-coronavirus patients in order to free up capacity at civilian hospitals.\nOne hospital administrator told CNN that he's relieved the Javits Center will now be used to treat patients with the virus.\n\"We thought it was completely unrealistic for both the Javits Center and the Comfort to accept non-Covid patients. As a practical matter in New York, everybody's Covid,\" he said, adding that the \"best thing to do would be to move patients who are stable from the hospitals to Javits or to (the) Comfort.\"\nLater on Friday, Lt. Gen. Todd Semonite, commander of the Army Corps of Engineers, said to date, the Corps has received 750 requests for site assessments across the country to look into possible facilities that could be used in the coronavirus response. Semonite said the Corps has completed 673 of those site assessments.\nHe said to date, the Army Corps of Engineers are \"not resource strained\" in terms of being able to carry out site assessments as they continue their work running and setting up treatment sites across the United States.", "url": "https://www.cnn.com/2020/04/03/politics/navy-hospital-ship-comfort-new-york-coronavirus/index.html"}