{"authors": ["Jason Hanna"], "date_download": "2020-05-04 16:05:15", "date_modify": "2020-05-04 16:05:15", "date_publish": "2020-04-01 16:12:04", "description": "While Sundee Rutter was dying in her hospital room, her children said their last words to her from the other side of a glass barrier.", "filename": "2020_04_01_health_us-corona_1740af58c6c8294b6f147b8207aa559a_index_1588608315.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200320154458-01-sundee-rutter-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_us-corona_1740af58c6c8294b6f147b8207aa559a_index_1588608315.html", "title": "Before a Washington mother died of coronavirus, her children used a walkie-talkie to say goodbye", "title_page": "Before a Washington mother died of coronavirus, her children used a walkie-talkie to say goodbye - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Just weeks ago, Sundee Rutter was told she was beating breast cancer. But suddenly she was dying of a different disease, and her six children were saying goodbye -- from the other side of a window.\nRutter, 42, died on March 16 in Everett, Washington, after contracting coronavirus . Shortly before she passed, staff at Providence Hospital were keeping visitors out her room, hoping to prevent the virus's spread.\nSundee Rutter, 42, a breast cancer survivor and mother of six, died from coronavirus in Everett, Washington, on March 16.\nHer children, ages 13 to 24, were losing another parent, eight years after their father died. They gathered outside her hospital room, and staff came up with an arrangement to let them talk to her.\n\"They took a walkie-talkie, and they placed (it) right by her bedside, on the pillow,\" her son Elijah Ross-Rutter, 20, told CNN's Alisyn Camerota on Wednesday.\nLooking at her through a window, \"We got to say our final words and goodbyes to our mom,\" he said.\nRead More", "url": "https://www.cnn.com/2020/04/01/health/us-coronavirus-sundee-rutter-death-children-walkie-talkie/index.html"}