{"authors": ["Jeffrey Collins"], "date_download": "2020-05-04 20:07:32", "date_modify": "2020-05-04 20:07:32", "date_publish": "2020-04-16 17:51:42", "description": "COLUMBIA, S.C. (AP) — Gov. Henry McMaster is promising he will call the South Carolina General Assembly back at the time of their choosing if they don't want to meet in the next month because of...", "filename": "_bce9bb2de2c108ace1c680caf086eaa0_1588622852.html", "image_url": "https://storage.googleapis.com/afs-prod/media/45f5a2d6d4324592b1470cbe8a4a86da/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bce9bb2de2c108ace1c680caf086eaa0_1588622852.html", "title": "SC governor offers June special session because of COVID-19", "title_page": "SC governor offers June special session because of COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Personal bottles of hand sanitizer sit on the desk of each South Carolina House member ahead of a special one-day legislative session, Wednesday, April 8, 2020, in Columbia, S.C. (AP Photo/Meg Kinnard)\nPersonal bottles of hand sanitizer sit on the desk of each South Carolina House member ahead of a special one-day legislative session, Wednesday, April 8, 2020, in Columbia, S.C. (AP Photo/Meg Kinnard)\nCOLUMBIA, S.C. (AP) — Gov. Henry McMaster is promising he will call the South Carolina General Assembly back at the time of their choosing if they don’t want to meet in the next month because of the cornavirus .\nThe Legislature’s term ends by law on May 14 and the House and Senate couldn’t agree last week on a bill setting the framework on what they can do in special session and a proposal allowing the state to keep spending money if a new budget isn’t passed by June 30.\nMcMaster’s letter on Thursday to House Speaker Jay Lucas and Senate President Harvey Peeler said the governor will call the General Assembly back “on a date and time of your choosing” to give them an option if they think COVID-19 makes it too unsafe to return before mid-May.\nLucas immediately agreed. House leadership blames a small group of senators for objecting to the House’s proposal limiting how Santee Cooper operates until the COVID-19 crisis is over and lawmakers can again start meeting to discuss the state-owned utility’s future and how to handle $4 billion in debt from its minority stake in two nuclear reactors that were never finished.\nPeeler said he appreciates the offer from his fellow Republican and views it as an insurance policy.\n“Like all insurance policies, I hope it is one that is never needed. I, like most South Carolinians, hope that our state and our legislature can be back at work much sooner so that his offer will not be necessary,” Peeler from Gaffney said in a statement.\nThe Senate’s decision to change the House proposal when they briefly met April 8 and the House’s choice to promptly adjourn instead of waiting to see what senators decided left the state in the lurch over whether it can continue to spend money after June 30 without a new budget.\nThe senators who changed the proposal said banning Santee Cooper from entering contracts that last more than a year prevented the utility from responding to potential problems. They passed a proposal requiring permission from state leaders before long term contracts could be signed.\nIf nothing is done, the state would shut down on July 1. Everyone has said they don’t want that to happen.\nLucas again called Santee Cooper a “rogue state agency” in a statement responding to the governor’s letter.\nThe Republican from Hartsville and McMaster have worked closely since the governor took office in 2017, consulting each other while writing budgets together and working on legislation — a sharp change as previous governors have pursued their own agenda outside the Legislature.\n“A minority of members of one chamber have delayed the will of the majority of the General Assembly. However, the House remains unified and ready to overcome those obstacles,” Lucas said.\nWithout a continuing resolution, the state can’t spend money after June 30. And if lawmakers don’t agree on a proposal outlining what they can do after May 14, only the governor can bring the General Assembly back.\nState health officials estimate the peak of coronavirus cases in South Carolina should come around April 30 and in his letter McMaster said he thinks returning before May 14 could put lawmakers at elevated risk from the virus.\n“However, I believe — and hope — that by late June that risk will have diminished to the extent that businesses and activities in our state may be safely resumed and conducted using personal safety precautions,” the governor wrote.\n___\nFollow Jeffrey Collins on Twitter at https://twitter.com/JSCollinsAP .", "url": "https://apnews.com/bce9bb2de2c108ace1c680caf086eaa0"}