{"authors": [], "date_download": "2020-05-04 20:26:13", "date_modify": "2020-05-04 20:26:13", "date_publish": "2020-04-10 15:21:41", "description": "PORTLAND, Ore. (AP) — Two large health care operations in Oregon are furloughing employees and cutting costs because of a lack of revenue due to the coronavirus outbreak, furthering cuts to...", "filename": "_abbc4607def5203d3304c06ed0b3cb40_1588623973.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_abbc4607def5203d3304c06ed0b3cb40_1588623973.html", "title": "Lack of business forces Portland clinics to cut staff", "title_page": "Lack of business forces Portland clinics to cut staff", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Ore. (AP) — Two large health care operations in Oregon are furloughing employees and cutting costs because of a lack of revenue due to the coronavirus outbreak, furthering cuts to medical facilities in the state.\nThe Oregonian/OregonLive reports the Oregon Clinic has furloughed about 820 employees. The Portland Clinic, another physician-owned chain, furloughed 180 employees and cut the pay and hours of 250 others earlier this week.\nOregon Gov. Kate Brown on March 17 ordered that all elective and non-urgent medical procedures be cancelled or rescheduled until at least June 15 to preserve masks and other protective equipment for the state’s COVID-19 response.\nRichard Jamison, president of The Oregon Clinic, said the company has suffered an 80% decline in revenue. The Portland Clinic’s in-patient revenue has fallen by 90%, said Dick Clark, president of the operation.\n“We’re all in the same spot,” Jamison said. “If there isn’t some sort of financial assistance or if things don’t get back to normal most of the big groups will not survive.”\nThe Portland Clinic also closed its downtown and Tigard clinics.\nJamison, at The Oregon Clinic, is trying to stay optimistic. The clinic began reducing staff hours and put some employees on furlough starting in mid-March. By the beginning of April, about 80% of the clinic’s workers had been impacted.\nBoth The Oregon Clinic and Portland Clinic hope to bring furloughed staff back to full-time work in June.\nOregon’s hospitals say they too are taking enormous financial hits and are seeking $200 million in state financial assistance.\nThe Oregon Health Authority on Friday reported four more deaths from COVID-19, raising the state’s death toll to 48. The agency also reported 51 new cases, bringing the state total to over 1,370.", "url": "https://apnews.com/abbc4607def5203d3304c06ed0b3cb40"}