{"authors": ["Jonathan Lemire", "Amanda Seitz", "Jill Colvin"], "date_download": "2020-05-04 20:31:46", "date_modify": "2020-05-04 20:31:46", "date_publish": "2020-04-03 19:14:29", "description": "WASHINGTON (AP) — The Trump administration has abruptly changed its description of the Strategic National Stockpile and put forward a narrower vision of the role the federal government’s...", "filename": "_74926f591522b30cbd96853bbcf2dbbd_1588624306.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bd07f5cc6732499e98a204a68fd93dfe/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_74926f591522b30cbd96853bbcf2dbbd_1588624306.html", "title": "Trump admin tries to narrow stockpile's role for states", "title_page": "Trump admin tries to narrow stockpile's role for states", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "President Donald Trump points to a reporter to ask a question as he speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Thursday, April 2, 2020, in Washington, as White House adviser Jared Kushner listens. (AP Photo/Alex Brandon)\nPresident Donald Trump points to a reporter to ask a question as he speaks about the coronavirus in the James Brady Press Briefing Room of the White House, Thursday, April 2, 2020, in Washington, as White House adviser Jared Kushner listens. (AP Photo/Alex Brandon)\nWASHINGTON (AP) — The Trump administration has abruptly changed its description of the Strategic National Stockpile and put forward a narrower vision of the role the federal government’s repository of life-saving medicines and equipment should play in supplying states’ needs.\nThe change comes as the White House already is facing growing anger and worry from governors over federal assistance to fight the coronavirus outbreak. But it conforms with President Donald Trump’s insistence that the stockpile is only a short-term backup for states, not a commitment to ensure supplies get quickly to those who need them most during an emergency, the latest front in a concerted White House effort to try to put the onus for battling the crisis on the states, with Washington meant to play more of a supporting role.\nTrump angrily defended the approach in his Friday news conference, his early sunny demeanor darkening as he was pressed on expected death rates and his son-in-law Jared Kushner’s comments suggesting the national stockpile is not intended for states. He sparred with reporters and insisted his administration was “doing our best for New York,” the pandemic’s epicenter, even as Governor Andrew Cuomo warns the state is in danger of not having enough ventilators to help patients stricken with coronavirus in a matter of days.\nThe alteration of the language describing the stockpile was reflected on government websites on Friday, a day after Kushner, a White House senior adviser who has taken a larger role in the coronavirus response, offered a new argument about the supplies.\nAfter saying that states should use their own stockpiles first, Kushner on Thursday said, “And the notion of the federal stockpile was it’s supposed to be our stockpile. It’s not supposed to be states’ stockpiles that they then use.”\nAnd asked what Kushner meant by “our stockpile,” Trump snapped at a reporter, “You know what our means: United States of America...our. Our. It means the United States of America.”\nTrump on Friday touted the number of supplies it was sending to the states, including 8.1 million masks to New York. The president also directed FEMA to prevent export of the N95 masks under the Defense Production Act. In new guidance, the Centers for Disease Control and Prevention urged Americans to wear masks in crowded areas, particularly in hot spots, but Trump immediately said that he would not personally follow the recommendation.\nUntil Friday, the federal Health and Human Services website had described the stockpile as “the nation’s largest supply of life-saving pharmaceuticals and medical supplies for use in a public health emergency severe enough to cause local supplies to run out.\n“When state, local, tribal, and territorial responders request federal assistance to support their response efforts, the stockpile ensures that the right medicines and supplies get to those who need them most during an emergency.”\nBut the changed version available Friday morning said the stockpile’s “role is to supplement state and local supplies during public health emergencies. Many states have products stockpiled, as well. The supplies, medicines, and devices for life-saving care contained in the stockpile can be used as a short-term stopgap buffer when the immediate supply of adequate amounts of these materials may not be immediately available.”\nDemocratic senators, including Tammy Duckworth of Illinois and Elizabeth Warren of Massachusetts, demanded an immediate investigation into the stockpile. Rep. Diana DeGette, D-Colo., called the website alteration “despicable” and said the administration “should be spending every waking moment getting life-saving supplies to our health care providers on the frontlines. Instead, they’re spending valuable time editing the Strategic National Stockpile website.”\nOfficials at the agency said the change had been in the works for weeks, downplaying any connection to Kushner’s comments. Kushner made his claim during his first appearance at the daily White House briefing, a moment meant to highlight his growing role in managing the federal response to the pandemic, particularly in delivering vital supplies.\nTrump has long insisted that the primary responsibility lies with the states in managing the pandemic. He has resisted calls to issue a national stay-at-home order and said that he didn’t want to overly use his authority to mobilize private companies for the effort, because he believed the states should take the lead in obtaining supplies.\n“I leave it up to the governors,” Trump said Friday about whether every state should have a stay-at-home order. “I like that from the standpoint of governing.”\nBut in statehouses across the nation, there has been increasing frustration at the lack of assistance from Washington.\nTrump scoffed at New York Gov. Andrew Cuomo’s request for 30,000 ventilators for the state, a virus hotbed. In neighboring Connecticut, Gov. Ned Lamont told CNN on Tuesday that the state couldn’t get personal protective equipment from the national stockpile and was only able to get 50 ventilators from the federal supply. He said he was told that he’ll have to secure the rest on his own.\nStates have also reported multiple issues with the equipment the federal government has managed to send.\nIllinois was supposed to receive a federal shipment of 300,000 N95 masks in March, but instead received less-effective surgical masks, Gov. J.B. Pritzker revealed during a Tuesday briefing. California Governor Gavin Newsom announced on Twitter last week that he had received 170 broken ventilators from the national stockpile, far less than the 10,000 breathing machines he’s seeking.\nTrump said the mask export ban was necessary to assure that the supplies are available for domestic medical use. The move came a day after the White House announced Trump invoked the DPA to compel Minnesota-based 3M to make as many N95 masks as FEMA determines are needed.\nMeanwhile, the White House on Friday stepped up precautions to protect Trump and Vice President Mike Pence from contracting the new coronavirus. Anyone who is expected to be in “close proximity” to Trump or Pence will be given a new, quick COVID-19 test, White House spokesman Judd Deere said.\nAll visitors to the White House complex already have their temperatures taken when entering the building and if they will be near either Trump or Pence. Trump took the new test on Thursday and the White House doctor said results were back in 15 minutes. He tested negative.\n___\nLemire reported from New York. Seitz reported from Chicago. Associated Press writer Ricardo Alonso-Zaldivar contributed from Washington.", "url": "https://apnews.com/74926f591522b30cbd96853bbcf2dbbd"}