{"authors": ["Elizabeth Cohen", "Marshall Cohen"], "date_download": "2020-05-04 16:28:24", "date_modify": "2020-05-04 16:28:24", "date_publish": "2020-04-07 21:02:15", "description": "When Elaine MacKenzie hears President Trump talk about how a particular drug might be a \"game-changer\" for people with coronavirus, it's more than just news to her -- it's personal.", "filename": "2020_04_07_health_hydroxych_6160099ad3a12a8439be297b41f23a3a_index_1588609704.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323224325-medicina-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_hydroxych_6160099ad3a12a8439be297b41f23a3a_index_1588609704.html", "title": "Lupus and arthritis patients facing hydroxychloroquine shortage", "title_page": "Lupus and arthritis patients facing hydroxychloroquine shortage - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When Elaine MacKenzie hears President Trump talk about how a particular drug might be a \"game-changer\" for people with coronavirus, it's more than just news to her -- it's personal.\nHer doctor wants her to take hydroxychloroquine for her rheumatoid arthritis. Trump's been enthusiastic about this drug for coronavirus patients, causing people hoard it -- even though it's still being tested and might not even work against the virus.\nMacKenzie, 58, went to several pharmacies near her New Canaan, Connecticut, home, and found they they were all out.\nHer joints ache, and some days she even has trouble walking, which makes it hard to cook and care for her 91-year old mother, her husband, and their four children who live at home.\n\"Trying to do all the work I've been trying to do keeping everyone healthy exacerbates the swelling and pain. It becomes pretty daunting,\" said MacKenzie, who lives in New Canaan, Connecticut.\nDr. Alfred Kim, a rheumatologist in St. Louis, said his patients are facing the same difficult situation because of Trump's comments about hydroxychloroquine.\nAfter Trump's initial embrace of the drugs in mid-March, Kim checked in with nearby pharmacies and found that \"the entire local supply was depleted\" within days, he told CNN.\nKim co-wrote a column in a medical journal last month warning doctors of the \"looming public health crisis\" -- on top of the pandemic -- that the run on chloroquine and hydroxychloroquine could cause for Americans who rely on the drugs to treat chronic diseases.\nWhen lupus patients who regularly take hydroxychloroquine stop taking it, they often develop withdrawal symptoms and flare-ups that require hospitalization, Kim said. That spike could come at a time when hospitals beds are already filled with Covid-19 patients. And it could disproportionately affect women, who make up about 90% of adults with lupus.\nTrump's optimism about hydroxychloroquine\nTrump has been a cheerleader for the combination of hydroxychloroquine and the antibiotic azithromycin, otherwise known as a Z-pack, even though they're still being studied and might not be safe or effective at preventing or treating coronavirus infections.\n\"I think it could be a game-changer and maybe not,\" Trump said at a White House briefing on March 19. \"It could be based on what I see, it could be a game changer. Very powerful. They're very powerful.\"\n\"I think it could be something really incredible,\" he added about chloroquine, a related drug.\nTrump has mentioned it again several times, including at another briefing on March 23.\n\"The hydroxychloroquine and the Z-pack I think as a combination probably is looking very, very good,\" he said.\nAt a briefing Saturday, he claimed that lupus patients were less likely to contract the virus because they were already taking hydroxychloroquine, but then quickly backtracked.\n\"Now maybe that's correct, maybe it's false. You're going to have to check it out,\" he said.\nHis science adviser, Dr. Anthony Fauci, then said the question \"is now being looked at, but we don't have any data to be able to say anything definitively.\"\nKim, the St. Louis rheumatologist, said the President's most recent statements will make the shortages even more dire.\n\"We have a fraction of our patients who can't get it now, and we expect that to worsen because of the comments that were made this weekend, Trump's doubling and tripling down of the preventative use of hydroxychloroquine,\" Kim said.\nDoctors hoarding hydroxychloroquine\nSince Trump started touting the combination in mid-March pharmacists have found doctors writing prescriptions of the two drugs -- for themselves and for their family and friends.\n\"A dentist just tried to call in scripts for hydroxychloroquine + azithromycin for himself, his wife, & another couple (friends),\" Oregon pharmacist Katherine Rowland tweeted on March 22 . \"NOPE. I have patients with lupus that have been on HCQ for YEARS and now can't get it because it's on backorder.\"\nTwo weeks later, Atlanta pharmacist Ira Katz is still experiencing the same thing.\n\"I'm getting electronic prescriptions from all over the country from doctors I don't know for patients I don't know,\" he said. \"We want to make sure that there's enough out there for the patients that are going to need it.\"\nThe American Medical Association and other professional organizations put out a statement calling on physicians and pharmacists to be \"just stewards of health care\" during the coronavirus crisis.\nPatients' groups reached out to Vice President Pence.\n\"We are concerned that increased demand for these drugs attributed to COVID-19 has exacerbated their already limited availability for patients who rely on them to meet their medical needs,\" according to a letter to Pence from several groups, including The Lupus Foundation of America and the Arthritis Foundation. \"We urge you to work with us and the broader health care community to help ensure continued availability of these drugs for the patients who are maintained on them to avoid disability, illness and even early death.\"\nRelief for patients who need hydroxychloroquine\nAt least 22 states have passed regulations to limit hydroxychloroquine prescriptions, according to the National Alliance of State Pharmacy Associations. Typically, the regulations require doctors to write a diagnosis on the prescription.\nThe Arthritis Foundation and the Lupus Foundation have tips and information for patients who are taking hydroxychloroquine.\nMacKenzie, the Connecticut patient who can't find hydroxychloroquine, is trying remedies such as ginger , which she says hasn't helped.\nShe says she wishes Trump had left discussion of hydroxychloroquine to medical professionals.\n\"That's who we should be listening to, and I think he needs to back off,\" she said.\nThe same situation is playing out in all corners of the country, affecting young and old.\nRachel Alder, a 24-year-old social worker in Utah, said she has taken hydroxychloroquine for three years as she battles a chronic autoimmune disease. It has been \"kind of a miracle drug,\" she said, because the medicine reduces her fatigue and swelling without serious side effects.\n\"I recently reached out to the pharmacy and tried to fill my next refill, because that's what my doctor recommended, just to have a stockpile,\" Alder said. \"They wouldn't let me do it. That was frustrating and scary. I'm set for the next couple weeks but there's a lot of uncertainty and fear after that. If you run out of your medication, there's a lot of consequences for people like me.\"\nWith only about 1,700 confirmed coronaviruses cases, Utah is in the middle of the pack right now, compared to other states. But as the disease spreads, Alder said she is worried that it might become impossible to refill her hydroxychloroquine prescription as things get worse.\nOne lupus patient who couldn't get his hydroxychloroquine found relief through the kindness of strangers.\nOn March 26, for a CNN Town Hall with Anderson Cooper and Dr. Sanjay Gupta, Edward Sabatini , 55, who lives in Miami, sent in a video explaining that he had only a 10-day supply of hydroxychloroquine, and that his pharmacy told him it had run out.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nLiterally overnight, he received four different offers of the drug from lupus and rheumatoid arthritis patients. Another eight offers followed.\n\"They took the time to find me and went through all this trouble just for a stranger,\" said Sabatini, a retired restaurant executive. \"They gave me medicine from their own supply, and I told them they'll need it down the road. But they said, 'No, I have a 90-day supply, I'll worry about this three months from now. Right now, I'm worried about you.' \"\nHis pharmacy also came up with pills. He now has enough for about a month and a half.\n\"These people, complete strangers, were so kind and compassionate and generous,\" he said. \"It was the most heartwarming feeling.\"", "url": "https://www.cnn.com/2020/04/07/health/hydroxychloroquine-shortage-lupus-arthritis/index.html"}