{"authors": ["Akinwumi Adesina", "For Cnn"], "date_download": "2020-05-04 16:22:27", "date_modify": "2020-05-04 16:22:27", "date_publish": "2020-04-03 15:53:33", "description": "These are very difficult days, as the world faces one of its worst challenges ever: the novel coronavirus pandemic. And it seems almost no nation is spared. As infection rates rise, so does panic across financial markets, as economies drastically slow down and supply chains are severely disrupted.", "filename": "2020_04_03_africa_adesina-fiscal-distancing-opinion_index_1588609347.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/150512120400-akinwumi-adesina-eric-piermont-afp-getty-images-super-169.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_africa_adesina-fiscal-distancing-opinion_index_1588609347.html", "title": "Opinion: The pandemic is no time for fiscal distancing", "title_page": "Opinion: The pandemic is no time for fiscal distancing  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Akinwumi Adesina is the President of the African Development Bank . He was formerly Nigeria's Minister of Agriculture and Rural Development and and is the 2017 World Food Prize laureate. The views expressed are solely those of the author.\n(CNN) These are very difficult days, as the world faces one of its worst challenges ever: the novel coronavirus pandemic. And it seems almost no nation is spared. As infection rates rise, so does panic across financial markets, as economies drastically slow down and supply chains are severely disrupted.\nExtraordinary times call for extraordinary measures. As such, it can no longer be business as usual.\nEach day, the situation evolves and requires constant reviews of precautionary measures and strategies. In the midst of all this, we must all worry about the ability of every nation to respond to this crisis. And we must ensure that developing nations are prepared to navigate these uncharted waters fully.\nThat's why I support the UN Secretary-General Antonio Guterres' urgent call for special resources for the world's developing countries.\nIn the face of this pandemic, we must put lives above resources and health above debt. Why? Because developing economies are the most vulnerable at this time. Our remedies must go beyond simply lending more. We must go the extra mile and provide countries with much-needed and urgent financial relief -- and that includes developing countries under sanctions.\nAccording to the independent, global think tank ODI in its report on the impact of economic sanctions, for decades, sanctions have decimated investments in public health care systems in quite a number of countries.\nToday, the already stretched systems as noted in the 2019 Global Health Security Index will find it difficult to face up to a clear and present danger that now threatens our collective existence.\nOnly those that are alive can pay back debts.\nSanctions work against economies but not against the virus. If countries that are under sanctions are unable to respond and provide critical care for their citizens or protect them, then the virus will soon \"sanction\" the world.\nIn my Yoruba language, there is a saying. \"Be careful when you throw stones in the open market. It may hit a member of your family.\"\nThat's why I also strongly support the call by the UN Secretary-General that debts of low-income countries be suspended in these fast-moving and uncertain times.\nBut I call for even bolder actions, and there are several reasons for doing so.\nFirst, the economies of developing countries, despite years of great progress, remain extremely fragile and ill equipped to deal with this pandemic. They are more likely to be buried with the heavy fiscal pressure they now face with the coronavirus.\nSecond, many of the countries in Africa depend on commodities for export earnings. The collapse of oil prices has thrown African economies into distress. According the AFDB's 2020 Africa Economic Outlook , they simply are not able to meet budgets as planned under pre-coronavirus oil price benchmarks.\nThe impact has been immediate in the oil and gas sector, as noted in a recent CNN news analysis\nIn the current environment, we can anticipate an acute shortage of buyers who, for understandable reasons, will reallocate resources to addressing the Covid-19 pandemic. African countries that depend on tourism receipts as a key source of revenue are also in a straightjacket.\nThird, while rich countries have resources to spare, evidenced by trillions of dollars in fiscal stimulus, developing countries are hampered with bare-bones resources.\nThe fact is, if we do not collectively defeat the coronavirus in Africa, we will not defeat it anywhere else in the world. This is an existential challenge that requires all hands to be on deck. Today, more than ever, we must be our brothers and sisters' keepers.\nAround the world, countries at more advanced stages in the outbreak are announcing liquidity relief, debt restructuring, forbearance on loan repayments, relaxation of standard regulations and initiatives.\nIn the United States, packages of more than $2 trillion have already been announced, in addition to a reduction in Federal Reserve lending rates and liquidity support to keep markets operating. In Europe, the larger economies have announced stimulus measures in excess of 1 trillion Euros. Additionally, even larger packages are expected.\nAs developed countries put in place programs to compensate workers for lost wages for staying at home for social distancing, another problem has emerged -- fiscal distancing.\nThink for a moment what this means for Africa.\nThe African Development Bank estimates that Covid-19 could cost Africa a GDP loss between $22.1 billion, in the base case scenario, and $88.3 billion in the worst case scenario. This is equivalent to a projected GDP growth contraction of between 0.7 and 2.8 percentage points in 2020. It is even likely that Africa might fall into recession this year if the current situation persists.\nThe Covid-19 shock will further squeeze fiscal space in the continent as deficits are estimated to widen by 3.5 to 4.9 percentage points, increasing Africa's financing gap by an additional $110 to $154 billion in 2020.\nOur estimates indicate that Africa's total public debt could increase, under the base case scenario, from $1.86 trillion at the end of 2019 to over $2 trillion in 2020, compared to $1.9 trillion projected in a 'no pandemic' scenario. According to a March 2020 Bank report, these figures could reach $2.1 trillion in 2020 under the worst case scenario.\nThis, therefore, is a time for bold actions. We should temporarily defer the debt owed to multilateral development banks and international financial institutions. This can be done by re-profiling loans to create fiscal space for countries to deal with this crisis.\nThat means that loan principals due to international financial institutions in 2020 could be deferred. I am calling for temporary forbearance, not forgiveness. What's good for bilateral and commercial debt must be good for multilateral debt.\nThat way, we will avoid moral hazards, and rating agencies will be less inclined to penalize any institution on the potential risk to their Preferred Creditor Status. The focus of the world should now be on helping everyone, as a risk to one is a risk to all.\nThere is no coronavirus for developed countries and a coronavirus for developing and debt-stressed countries. We are all in this together.\nMultilateral and bilateral financial institutions must work together with commercial creditors in Africa, especially to defer loan payments and give Africa the fiscal space it needs.\nWe stand ready to support Africa in the short term and for the long haul. We are ready to deploy up to $50 billion over five years in projects to help with adjustment costs that Africa will face as it deals with the knock-on effects of Covid-19, long after the current storm subsides.\nBut more support will be needed. Let's lift all sanctions, for now. Even in wartime, ceasefires are called for humanitarian reasons. In such situations, there is a time to pause for relief materials to reach affected populations. The novel coronavirus is a war against all of us. All lives matter.\nFor this reason, we must avoid fiscal distancing at this time. A stitch in time will save nine.\nSocial distancing is imperative now. Fiscal distancing is not.", "url": "https://www.cnn.com/2020/04/03/africa/adesina-fiscal-distancing-opinion/index.html"}