{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:18:14", "date_modify": "2020-05-04 16:18:14", "date_publish": "2020-04-04 09:55:27", "description": "As health care workers across the US put their lives at risk to battle the coronavirus, an unlikely industry has stepped up to help them get the protective gear they need -- custom auto shops.", "filename": "2020_04_04_us_coronavirus-auto-shops-face-shields-trnd_index_1588609094.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402192814-02-coronavirus-auto-shops-face-shields-super-tease.jpeg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_coronavirus-auto-shops-face-shields-trnd_index_1588609094.html", "title": "Custom auto shops across the US are banding together to make 20,000 face shields for health care workers", "title_page": "Custom auto shops across the US are banding together to make 20,000 face shields for health care workers  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As health care workers across the US put their lives at risk to battle the coronavirus , an unlikely industry has stepped up to help them get the protective gear they need -- custom auto shops.\nFace shields made by Katz and Collins ready to be donated to health care workers.\nNurses, doctors and other health care workers face an extreme shortage of personal protective equipment, and they are being told to ration face masks or even reuse them\nJK owner Jeremy Katz and coworker Evan Collins first tried using a 3D printer and a design they found on the internet. But printing just two face shields took five hours.\n\"There's no way we could have waited that long, so Evan went downstairs and made a new design,\" Katz told CNN.\nUsing it and the shop's laser machine, they made 45 shields every 10 minutes, and 19 straps every 20 minutes.\nHelping nurses and others 'afraid to go to work'\nWith the help of Faith Michaels, who runs non-profit organization Kids Clothes Club , Katz and Collins have donated hundreds of masks to health care workers in Massachusetts, New York, Florida and Puerto Rico.\n\"We've seen grown men cry,\" Katz said. \"They're appreciative because there's none around. I've had emails and Facebook requests from nurses across the country begging for one of them because they're afraid to go to work.\"\nKatz made the design public for other custom auto shops, and it caught on quickly.\nShops in California, Nebraska, and Alaska are making the face shields and delivering hundreds to local hospitals. Katz estimates that more than 20,000 masks have been manufactured and donated.\nHealth care workers at Alaska Regional Hospital in Anchorage wearing face shields designed by Katz and Collins.\nDaniel Williams, owner of DJ Designs in Hayward, California, started a week ago.\n\"(The health care workers are) the ones keeping us healthy and going. They're the ones sacrificing their health,\" Williams said. \"We're just sacrificing some time, so it was a very easy decision.\"\n'It just feels right'\nIn Plattsmouth, Nebraska, Tracy Weaver, owner of Recovery Room Hot Rod Interiors , has made more than 500 and said the production costs are coming out of his own pocket.\n\"I contacted the Methodist Hospital here in Omaha and they wanted to take every one that we made,\" Weaver said. \"We're just thankful that we have the skills and the creativity to do this, and we're going to have something to look back on and be proud to say that I had a small part in that.\"\nTo help lift some of that financial burden, Katz has started a GoFundMe campaign that has raised more than $40,000. That's enough money to make another 30,000 face shields, and Katz said he's also ramping up production of intubation boxes, which act as a barrier between the doctor and patient.\nA doctor at Norwood Hospital in Massachusetts simulates intubating a patient with one of Katz' intubation boxes.\nKatz said he and his nationwide network of friends will continue to make face shields until the hospitals don't need them anymore.\n\"It just feels right,\" Katz said. \"We have the skillset to do it and the tooling. So why not try to make a little bit of difference until all the big guys come along and flood the hospitals with the shields they need right now.\"", "url": "https://www.cnn.com/2020/04/04/us/coronavirus-auto-shops-face-shields-trnd/index.html"}