{"authors": ["Geneva Sands", "Pamela Boykoff"], "date_download": "2020-05-04 16:55:24", "date_modify": "2020-05-04 16:55:24", "date_publish": "2020-04-09 00:51:37", "description": "The cost to ship goods to the US has jumped up in recent weeks as demand for medical supplies and other goods has skyrocketed and the number of flights has dropped amid the global coronavirus pandemic.", "filename": "2020_04_08_politics_cargo-p_97b253472085b369bb0bb8dbf48f9564_index_1588611324.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407133710-american-airlines-plane-0320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_cargo-p_97b253472085b369bb0bb8dbf48f9564_index_1588611324.html", "title": "Cargo prices skyrocketing as companies and the federal government rush medical supplies to the US", "title_page": "Cargo prices skyrocketing as companies and the federal government rush medical supplies to the US - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The cost to ship goods to the US has jumped up in recent weeks as demand for medical supplies and other goods has skyrocketed and the number of flights has dropped amid the global coronavirus pandemic .\nHospitals, states and numerous front-line businesses have been desperate to acquire personal protective equipment , much of it coming from China. The urgent need for supplies has come at the same time that much of the world's travel has ground to a halt. Around 50% of the world's cargo flies in the bellies of passenger planes, so as flight capacity has dropped 65% this quarter, the amount of air cargo space has plummeted and prices jumped sharply.\nThe shortage of air cargo space is making it substantially more expensive and more difficult for importers to bring urgently needed medical supplies into the country. In the worst cases, goods are getting stuck at airports or rerouted and trucked over land in an attempt to speed up shipments.\nThe US has banned most foreign nationals traveling from China, Europe and the United Kingdom. Meanwhile, countries around the world have locked down their populations in an effort to slow the spread of the virus.\nRichard Thompson, president of the Americas for Air Charter Service, said prices are fluctuating a great deal, but a month ago, the cost to charter a full 747 from East Asia to the United States was $500,000. Now, he's seen pricing on the same route as high as $1.2 million. Shippers are also often having to pay a round trip price for airlifting goods from China, because the economic shutdown means very little is being sent in the opposite direction.\nHis company is seeing a surge in requests for cargo charters and has arranged flights for everything from hospital beds to ventilators to hand sanitizers. \"It's the busiest I have ever seen it in 15 years,\" he said.\nTwo million flights will be canceled by the end of June, according to the International Air Transport Association.\nAs the pandemic took hold, shipping by sea from Asia also slowed as vessels were canceled, said Brandon Fried, executive director of Airforwarders Association.\n\"Capacity becomes constrained. And, the law of supply and demand hasn't been repealed yet. So, obviously, prices go up as a result,\" said Fried. \"And that's what you're seeing.\"\nThere is a lot of \"rapid, high demand ordering\" by US companies trying to import medical supplies, personal protection equipment and medical technology, like ventilators, as well as perishable food and perishable pharmaceuticals, he said.\nLarge airlines have \"stepped up to the plate\" and are flying the passenger planes as all cargo flights because they can't fly passengers, said Fried. \"But it comes at a price,\" he said, because passengers are no longer paying for the operational cost to fly the plane.\n\"When demand is high, people will do anything to expedite the movement of that cargo,\" added Fried.\nFor instance, Lufthansa is rebuilding its planes to take seats out to accommodate more cargo.\n\"When we operate passenger planes as freighters, it's only 25% of capacity but the price is for the full plane,\" said Peter Gerber, CEO of Lufthansa Cargo.\nUS businesses are feeling the impact of the price increases.\nThe crunch in cargo availability is making it tough for medical suppliers like Michael Einhorn, the president of Dealmed. He imports products including isolation gowns, N95 masks and face shields for New York and New Jersey hospitals.\nHe said the price of his average air shipment has doubled in just two weeks. It's not just the cost, it's also unloading delays as airports deal with their own staffing issues because of the outbreak.\n\"We can have products sit at JFK for three days,\" he said. He's decided to start flying goods into Chicago and trucking them down to New York, which he said seems to be faster at this point.\nThe prices of freight are going up and the time for which a price quote is accurate is shrinking, according to Michael Brugger, president of Fully Promoted, a franchise uniform and promotional product business.\n\"Decisions need to be made faster and most customers are not used to making a decision on products and shipping in 24 hours, but with prices going up and available space going down this is the market we are in,\" he said.\nRecently a large order was rerouted to another country to get it to the US, because there was such a backlog, said Brugger, adding that the \"additional cost was absorbed, but these cost increases end up by costing everyone time and money.\"\nLeo Friedman, CEO of iPromo, a Chicago-based promotional products distributor, told CNN that air cargo prices jumped two to three times the normal cost.\nFor example, a $20,000 shipment of hand sanitizers cost $32,000 to ship three weeks ago, said Friedman, who has shifted his business to import respirator masks and other personal protective gear from China into the US when the pandemic hit.\nTwo weeks ago it cost $47,000. Last week, it was up to $65,000 to ship the same hand sanitizer on the same airplane, he said.\nAnother issue delaying some shipments: red tape. Slow processing of permits and customs approvals can seriously hamper the movement of medical supplies. For example, Thompson said a permit for a charter to take off out of China can take as long as 10 days.\nThe International Air Transport Association (IATA) is calling on governments to fast track every layer of the bureaucracy around cargo transport, things like landing permits, overfly permits, customs and ground handling.\n\"This is where governments need to step up,\" said Glyn Hughes, IATA's global head of cargo.\nFEMA has teamed up with UPS to try to expedite the arrival of critical supplies needed in US hospitals.\nThe goal of FEMA's Project Air Bridge is to reduce the time it takes for US medical supply distributors to receive personal protective equipment and other supplies into the US for their respective customers, according to the agency.\nAs of April 6, 13 flights have landed, containing equipment such as gloves, gowns, goggles, and masks, according to an advisory obtained by CNN. Seven flights were scheduled to arrive Tuesday and an additional 72 flights are scheduled over the next three weeks.\nFifty percent of supplies on each plane are designated for customers within the hotspot areas with most critical needs and 50% is fed into distributors' normal supply chain, according to FEMA.\nUPS said FEMA is paying for the flights , some of which use UPS aircraft, while others are brokered by UPS using third-party carriers.\nEinhorn complained that smaller suppliers like him with existing contracts with hospitals and contacts in China have been left out, leaving him to struggle with high prices and delays on the open market.\n\"Small companies based at the epicenter of the crisis, sitting in New York City, serving health care systems... we are having a very difficult time bringing in supplies,\" he said.\nFEMA did not respond to CNN's request for comment.", "url": "https://www.cnn.com/2020/04/08/politics/cargo-prices-skyrocketing-medical-supplies-us/index.html"}