{"authors": ["Bethany Hines"], "date_download": "2020-05-04 16:26:55", "date_modify": "2020-05-04 16:26:55", "date_publish": "2020-04-05 05:00:30", "description": "Cavanaugh Bell of Gaithersburg, Maryland, is a 7-year-old on a mission during the coronavirus pandemic: He's helping elderly neighbors get groceries by assembling and delivering care packages.", "filename": "2020_04_05_us_7-year-old-care-packages-elderly-iyw-trnd_index_1588609615.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402120215-03-cavanaughbell-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_7-year-old-care-packages-elderly-iyw-trnd_index_1588609615.html", "title": "7-year-old helps elderly get groceries; he buys and delivers care packages", "title_page": "7-year-old helps elderly get groceries; he buys and delivers care packages  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Cavanaugh Bell is a 7-year-old on a mission: \"To help other people and let them know that I got their back,\" he told CNN.\nAt a time when senior citizens must stay in to avoid the coronavirus, the spirited boy in Gaithersburg, Maryland, decided to make them care packages.\nInteractive: A guide to helping and getting help during the coronavirus crisis\n\"The packages include toilet paper, some flushable wipes, hygiene products and a bunch of food,\" he said.\n'She's my best friend'\nThe idea came when Bell realized his 74-year-old grandmother is in a high-risk age group for coronavirus.\n\"One day I was thinking about my grandma and I was like 'Oh, mommy she shouldn't be going out to the grocery store because it's coronavirus season. She's my best friend.' \"\nCavanaugh Bell, 7, shops for items to make care packages for the elderly.\nAfter helping his grandma, the boy with the big smile and bigger heart looked at his grandmother's neighbors at her senior citizen home -- and worried.\n\"He was so heartbroken that he didn't have enough to give to everyone,\" Llacey Simmons, Bell's mom, told CNN.\nSo Bell used $600 he'd saved up to fund his first batch of care packages.\n\"I asked him how much money he wanted to use from his savings-- $50 or $100? He's like 'let's use all of it.' \"\nBell assembled more than 100 care packages and hot meals to deliver.\nCavanaugh Bell delivers a care package.\nThe community joins in\nWhen news spread of the first-grader's good deed, donations began to roll in.\nIt's become more of a community project that way. But only Bell and his mother make the deliveries.\n\"We aren't allowed to gather in large groups,\" the supportive mom shared.\nCavanaugh Bell and his mother, Llacey Simmons, loaded care packages into their car to deliver to senior citizens in Gaithersburg.\nAnd with an overflow of donations, Simmons and Bell have created a community care pantry in Gaithersburg.\n\"Hopefully we can help a thousand people. We plan to do this until we run out of donations or until the pandemic is over,\" Simmons said,\n\"It makes me feel beautiful inside because I like giving back.\" Bell said.", "url": "https://www.cnn.com/2020/04/05/us/7-year-old-care-packages-elderly-iyw-trnd/index.html"}