{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:13:36", "date_modify": "2020-05-04 16:13:36", "date_publish": "2020-04-02 19:54:03", "description": "In 2008, when the global economy was last in tatters, big banks were largely to blame. Their bad bets on subprime mortgages and other loans were what pushed the world into the Great Recession.", "filename": "2020_04_02_investing_banks-_8cb5380b59e9582d359ca963b70398b3_index_1588608816.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402101650-pnc-bank-0111-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_investing_banks-_8cb5380b59e9582d359ca963b70398b3_index_1588608816.html", "title": "Banks were the problem in 2008. They can help this time", "title_page": "Banks were the problem in 2008. They can help this time - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) In 2008, when the global economy was last in tatters, big banks were largely to blame. Their bad bets on subprime mortgages and other loans were what pushed the world into the Great Recession.\nSince then, banks have become much more financially responsible, thanks to a combination of more stringent rules and regulations and smarter business practices.\nAs a result, financial firms may be the ones to help keep the economy afloat now that it's tanking a dozen years later due to the Covid-19 pandemic.\nWe asked workers how the virus changed their lives. Here's what they said\nWe asked workers how the virus changed their lives. Here's what they said 03:55\nWe asked workers how the virus changed their lives. Here's what they said\n\"Unlike 2008, banks are not part of the problem. And they will be a big part of the solution,\" said Dan Genter, CEO of Genter Capital Management, an investment firm that owns shares ofand-- the new bank formed from the merger of BB&T and SunTrust\nBanks need to act quickly to prop up small business\n\"The SBA can't handle all the loan volume that will be needed. The only way to meet the demand is for the banks to lend more,\" Genter added.\nSeveral large banks have already started.\nGoldman Sachs GS unveiled a $300 million aid package Thursday, which includes $250 million in emergency loans for small businesses.\nCitigroup CEO Michael Corbat said in a CNBC interview Wednesday its small business bankers are fielding questions around the clock, including weekends, from merchant customers. And Citi is doing most of this digitally so small business owners need not leave their homes.\n\"We don't want to have people having to come out, so we're making sure that we've got the digital interface set up so that people can apply online,\" Corbat said. \"We can turn this money and get it into small business hands as quickly as we can.\"\nCNN Business reached out to several other large banks to find out what they are doing to help.\nTruist told CNN Business that it has a $2 million commitment set aside to support small businesses affected by the pandemic.\n\"For our small business clients, we're here to help. We're offering numerous relief options, including deferred loan payments and fee waivers to help support short-term operating capital needs, as well as a special loan program without bank fees or closing costs,\" a Truist spokesman said.\nFlexibility is key for banks working with small businesses\nTD Bank TD said it is doing what it can for its small business customers, too. A spokeswoman said that it is offering refunds of monthly maintenance and overdraft fees, waiving several monthly service fees and providing \"flexibility\" on paying back existing loans due to any hardship as a result of the coronavirus.\nJUST WATCHED Small businesses are the tip of the spear in economic downturn Replay More Videos ... MUST WATCH Small businesses are the tip of the spear in economic downturn 01:31\nIt also plans to make Paycheck Protection Program loans as well.\n\"TD Bank is committed to helping our business customers during this trying time,\" the spokeswoman said, adding that it will \"provide loans for businesses to cover payroll, employee benefits, mortgage interest, utilities, rent and interest on other debts.\nPNC PNC said that it is working with small business customers that are struggling and will offer some \"the ability to postpone payments for a period of time\" and \"a range of modification options with no late fee.\" It also plans to take part in the SBA's PPP.\nUS Bancorp USB A spokesman forsaid the company is reducing the rate on certain short-term small business loans by as much as 2%, waiving fees on businesses receiving digital payments via Zelle and cutting rates on lines of credit.\n\"We recognize many small business owners have been hard hit by COVID-19,\" the US Bancorp spokesman said.\nWells Fargo WFC And aspokesman told CNN Business that \"we are committed to supporting our small business customers in a variety of ways, including payment relief for up to 90 days, fee waivers, payment deferrals, increases to lines of credit...and other expanded assistance for deposits.\"\nWells Fargo will make loans through the SBA PPP as well.\n\"Our customers are experiencing challenges during the COVID-19 crisis and we want to help during these unprecedented times,\" the Wells Fargo spokesman said.\nMore help is needed -- now\nBut some think banks and other financial firms must do even more to help keep small businesses afloat.\n\"Financials can provide loans but they may need more to do than that. The situation is dire and severe,\" said Guy Goldstein, CEO of Next Insurance, an online broker that caters to small businesses.\nNext Insurance did a survey of 1,000 small businesses two weeks ago and found that only 34% of them felt they were prepared for the current crisis while 41% have already begun to cut expenses.\nThat's one reason why Goldstein said his firm has cut monthly premiums for small business customers and is giving back some money to companies who already paid for annual coverage.\n\"The impact from the coronavirus will have a lasting effect on the small business economy,\" said NFIB chief economist Bill Dunkelberg in a report Thursday.\n\"The small business labor situation has been altered. The severity and duration of the coronavirus outbreak and the mobility of regulations imposed will determine owners' ability to remain operational,\" he added.", "url": "https://www.cnn.com/2020/04/02/investing/banks-small-business-lending-stimulus-coronavirus/index.html"}