{"authors": ["Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:53:27", "date_modify": "2020-05-04 16:53:27", "date_publish": "2020-04-08 16:36:14", "description": "Geico is giving car insurance customers a break on premiums because of the drop in claims associated the the coronavirus outbreak.", "filename": "2020_04_08_business_geico-customer-credits-coronavirus_index_1588611207.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408113406-lone-car-usa-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_business_geico-customer-credits-coronavirus_index_1588611207.html", "title": "Geico giving credits to customers due to coronavirus-related drop in driving", "title_page": "Geico giving credits to customers due to coronavirus-related drop in driving - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Geico is giving car insurance customers a break on premiums because of the drop in claims associated the the coronavirus outbreak.\nWith most of America under stay-at-home orders, driving is significantly down -- and so are accidents. Geico said its policy will give customers a 15% credit on six-month policies when they are renewed or if they were started between now and Oct. 8.\nGeico's break on premiums follows similar moves by Allstate and a smaller insurer. Geico is the second largest auto insurer in the country, behind State Farm, and insures 28 million vehicles. It estimates the credits will be worth $2.5 billion.\nBerkshire Hathaway BRKA \"This ongoing crisis has widespread effects that will linger. That is why we wanted to give this credit for at least six months,\" said Todd Combs, CEO of Geico, which is owned by. \"Our customers have been loyal, and we are committed to doing all we can to help them.\"\nLast month, Geico said it was pausing cancellations of coverage due to non-payment and policy expiration through at least April 30. Beyond that, the company said it will offer maximum flexibility in payments to customers.\nRead More", "url": "https://www.cnn.com/2020/04/08/business/geico-customer-credits-coronavirus/index.html"}