{"authors": [], "date_download": "2020-05-04 20:25:24", "date_modify": "2020-05-04 20:25:24", "date_publish": "2020-04-20 09:25:39", "description": "SINGAPORE (AP) — Singapore reported a record 1,426 new coronavirus cases on Monday, mostly among foreign workers, pushing its total number of confirmed infections to 8,014. The tiny...", "filename": "_90e300932a63702808c41a3ccf7ebd33_1588623924.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6c116f8e8f604565a068f82488e54bd3/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_90e300932a63702808c41a3ccf7ebd33_1588623924.html", "title": "Singapore reports a record 1,426 new cases, total past 8,000", "title_page": "Singapore reports a record 1,426 new cases, total past 8,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "People walk along the balconies of the S11@Punggol complex, a dormitory building for migrant workers in Singapore on Monday, April 20, 2020. Singapore announced their biggest single-day spike in new coronavirus cases on Monday, as the crisis intensifies in parts of Asia. The city state reported a record 1,426 new coronavirus cases on Monday, mostly among foreign workers. The S11 Dormitory@Punggol is one of two foreign worker dormitories that have been announced as isolation areas, which means that foreign workers who stay there are under quarantine. (AP Photo/YK Chan)\nPeople walk along the balconies of the S11@Punggol complex, a dormitory building for migrant workers in Singapore on Monday, April 20, 2020. Singapore announced their biggest single-day spike in new coronavirus cases on Monday, as the crisis intensifies in parts of Asia. The city state reported a record 1,426 new coronavirus cases on Monday, mostly among foreign workers. The S11 Dormitory@Punggol is one of two foreign worker dormitories that have been announced as isolation areas, which means that foreign workers who stay there are under quarantine. (AP Photo/YK Chan)\nSINGAPORE (AP) — Singapore reported a record 1,426 new coronavirus cases on Monday, mostly among foreign workers, pushing its total number of confirmed infections to 8,014.\nThe tiny city-state now has the highest number of cases in Southeast Asia, a massive increase from just 200 infections on March 15, when its outbreak appeared to be nearly under control. About 3,000 cases have been reported in just the past three days.\nLow-wage migrant workers, a vital part of Singapore’s workforce, now account for at least 60% of its infections.\nMore than 200,000 workers from Bangladesh, India and other poorer Asian countries live in tightly packed dormitories. Clusters of infections have expanded rapidly in the dorms after they were overlooked in the government’s earlier health measures.\nSocial distancing is impossible in the dormitories, which house up to 20 men per room with a shared kitchen, toilets and other facilities. Most work in construction, shipping and maintenance jobs.\nOver half of the 43 registered dormitories have reported active viral clusters. At least 18 of the dormitories were declared isolation areas where workers have been quarantined. Several thousand other workers have been moved to other locations to reduce crowding.\nThe government expects cases to rise further as testing at the dorms continues, but hopes that the country’s partial lockdown until May 4, mandatory wearing of masks and strict social distancing will help curb the spread of the virus.\nNational Development Minister Lawrence Wong said Sunday that many of the workers in the affected dormitories work in construction. He said in a Facebook post that there was evidence that transmission across multiple dormitories could have occurred at work sites or at places where the workers congregate on their days off to shop and socialize.\nWong said the government has ordered construction workers who live outside the dorms to be quarantined at home until May 4.\nLabor advocates earlier warned that confinement en mass in dormitories may put the workers at greater risk. Some also say the pace of testing, reportedly less than 3,000 a day, cannot keep up with infections and that many thousands of workers live outside the 43 registered dormitories.\nPrime Minister Lee Hsien Loong said Saturday it will take time to break the chain of transmission in the dorms. He has said the vast majority of cases among migrant workers are mild since most of the men are young. Despite the high number of cases, Singapore has only recorded 11 deaths, among the lowest in the region.\nLee said the government is preparing more health care and isolation facilities to handle a greater number of infections. He also vowed to take care of the workers’ welfare.\n___\nThis story corrects the total number of cases to 8,014.", "url": "https://apnews.com/90e300932a63702808c41a3ccf7ebd33"}