{"authors": ["Manuel Rueda"], "date_download": "2020-05-04 20:14:13", "date_modify": "2020-05-04 20:14:13", "date_publish": "2020-04-16 04:00:14", "description": "BOGOTA, Colombia (AP) — Engineers in Colombia have developed a mechanical ventilator for COVID-19 patients that could cost as little as $2,000 — one of numerous crash projects around the world...", "filename": "_6e9d8fc5ed49436e8529eaf5f1873c9f_1588623253.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e75d415c52b64d11a9c3d80433b9d668/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6e9d8fc5ed49436e8529eaf5f1873c9f_1588623253.html", "title": "Colombia rushes to make cheap ventilators for COVID patients", "title_page": "Colombia rushes to make cheap ventilators for COVID patients", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The prototype for a low-cost ventilator for patients with COVID-19 is calibrated by engineering professors from La Sabana University, Julian Echeverry, left, and Andres Ramirez, in Bogota, Colombia, Tuesday, April 14, 2020. Scientists in Colombia have developed a mechanical ventilator for COVID-19 patients that could cost as little as $2,000 and help the South American country to cope with a global shortage of these devices. (AP Photo/Fernando Vergara)\nThe prototype for a low-cost ventilator for patients with COVID-19 is calibrated by engineering professors from La Sabana University, Julian Echeverry, left, and Andres Ramirez, in Bogota, Colombia, Tuesday, April 14, 2020. Scientists in Colombia have developed a mechanical ventilator for COVID-19 patients that could cost as little as $2,000 and help the South American country to cope with a global shortage of these devices. (AP Photo/Fernando Vergara)\nBOGOTA, Colombia (AP) — Engineers in Colombia have developed a mechanical ventilator for COVID-19 patients that could cost as little as $2,000 — one of numerous crash projects around the world aimed at helping ease a global shortage of the devices.\nThe bedside machine is about the size of a small television, and is made up of valves and pressure sensors that regulate the amount of oxygen pumped into a patient’s lungs through a plastic tube.\nIt’s one of the latest efforts around the world to produce pared down, emergency versions of full feature ventilators, which have become more expensive as governments try to outbid each other to purchase them.\n“Commercial ventilator factories around the world are struggling to keep up with orders,” said Julian Echeverry, a mechanical engineering professor who helped to develop the emergency ventilator at Bogota’s Sabana University. “For us, it was crucial to develop an in-house solution that can be deployed quickly in (local) hospitals.”\nWhile most people infected with the new coronavirus experience only mild to moderate symptoms, such as fever and cough, some — notably older adults and people with existing health problems — suffer life-threatening illnesses, including pneumonia. A small percentage become so sick they cannot breathe on their own and need a ventilator. According to New York governor Andrew Cuomo ventilators are currently selling for $50,000 each.\nGrowing concern over ventilator shortages has prompted engineers around the world to make emergency versions, particularly in countries that have fewer resources.\nIn Afghanistan, a female team of robotics experts announced last week they had created a COVID-19 ventilator made out of Toyota car parts that will cost $400.\nIn Argentina, the National University of Rosario says it has come up with a ventilator that has fewer than 20 components, and has shared its design online.\nIn Colombia, at least five universities have been working separately on their own ventilators and three of them have built prototypes that are already being tested to comply with standards set by national regulators.\nThe ventilator produced by Sabana University has been tested successfully on a pig. It must still undergo further tests on animals and humans before it can go into production.\nBut regulators are speeding up the approval process, Echeverry said, and plans to mass produce the ventilator are already in the works.\nColombia’s military announced it could make up to 80 of the emergency ventilators per day at a factory that is usually used to make military equipment. The government of Colombia’s Cundinamarca state said it would order 100 ventilators from the university once they have been approved by regulators.\nEcheverry said that his university is only getting into the production of COVID-19 ventilators as an “emergency measure” and not to become a commercial manufacturer.\nBefore the virus broke out, he specialized in designing parts for electric cars and robots. A team headed by Echeverry was second in last year’s RoboCup, a championship for robot soccer.\n“Lots of universities around the world are now focusing on making ventilators” Echeverry said. “The current situation has forced us to be self sufficient.”", "url": "https://apnews.com/6e9d8fc5ed49436e8529eaf5f1873c9f"}