{"authors": ["Eliza Mackintosh"], "date_download": "2020-05-04 16:15:22", "date_modify": "2020-05-04 16:15:22", "date_publish": "2020-04-03 11:16:35", "description": "As global cases cross the 1 million mark and an international battle to procure life-saving equipment mounts, President Donald Trump has invoked a Korean War-era law to force the production of ventilators, N95 masks and other vital supplies.", "filename": "2020_04_03_world_coronavirus-newsletter-04-03-20-intl_index_1588608922.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200130165125-corona-virus-cdc-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_world_coronavirus-newsletter-04-03-20-intl_index_1588608922.html", "title": "What you need to know about coronavirus on Friday, April 3", "title_page": "What you need to know about coronavirus on Friday, April 3 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story appeared in the April 3 edition of CNN's Coronavirus: Fact vs. Fiction newsletter. Sign up here to receive the need-to-know headlines every weekday\n(CNN) As global cases cross the 1 million mark and an international battle to procure life-saving equipment mounts, President Donald Trump has invoked a Korean War-era law to force the production of ventilators, N95 masks and other vital supplies.\nIn the absence of federal intervention, or national coordination, states have been left to scramble for resources needed to fight the virus solo. One remarkable mission emerged yesterday: Massachusetts turned to the New England Patriots for help with a delivery of masks from China\nAs the US grapples with how to contain a virus that has infected a quarter of a million Americans, the CDC is expected to urge all citizens to wear cloth masks in public , despite Trump saying such a move would not be mandatory.\nWhile the rest of the world digs in on lockdown measures, China is cautiously opening back up . Next week, for the first time in two months, people will be allowed to leave Wuhan — ground zero of the pandemic. But as China appears to be turning a page on the virus, questions are being raised about whether its recovery can be trusted.\nYOU ASKED. WE ANSWERED", "url": "https://www.cnn.com/2020/04/03/world/coronavirus-newsletter-04-03-20-intl/index.html"}