{"authors": [], "date_download": "2020-05-04 20:04:43", "date_modify": "2020-05-04 20:04:43", "date_publish": "2020-04-08 22:50:43", "description": "AUSTIN, Texas (AP) — Abortion clinics in Texas are again trying to reopen for some women during the coronavirus pandemic after a federal appeals court allowed an executive order by Republican Gov....", "filename": "_38bf24a8e184c65cdb08eb83e6ddeac6_1588622683.html", "image_url": "https://storage.googleapis.com/afs-prod/media/bf2d4e2db56e438db1172ae0e3ac2542/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_38bf24a8e184c65cdb08eb83e6ddeac6_1588622683.html", "title": "Texas abortion clinics try again to undo ban during outbreak", "title_page": "Texas abortion clinics try again to undo ban during outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Texas abortion clinics try again to undo ban during outbreak\nThis Feb. 25, 2020 shows Preterm executive director Chrisse France in the procedure room, in Cleveland. Court decisions in two U.S. states Monday, April 6, allowed abortions to continue after the procedure was caught in the crosshairs of governors’ orders suspending non-essential elective surgeries due to the new coronavirus. (AP Photo/Tony Dejak)\nThis Feb. 25, 2020 shows Preterm executive director Chrisse France in the procedure room, in Cleveland. Court decisions in two U.S. states Monday, April 6, allowed abortions to continue after the procedure was caught in the crosshairs of governors’ orders suspending non-essential elective surgeries due to the new coronavirus. (AP Photo/Tony Dejak)\nAUSTIN, Texas (AP) — Abortion clinics in Texas are again trying to reopen for some women during the coronavirus pandemic after a federal appeals court allowed an executive order by Republican Gov. Greg Abbott to stand.\nPlanned Parenthood and other clinics Wednesday asked for a narrower ruling that would only allow abortions in some cases, including abortions performed by medication. It comes a day after the 5th U.S. Circuit Court of Appeals sided with Texas and allowed it to ban most abortions under an Abbott order that limits non-essential surgeries during the coronavirus outbreak.\nTexas bans most abortions after 20 weeks. Abbott’s original March 22 order was to expire April 21 but can be extended.\nSimilar legal fights are being waged in Alabama, Ohio, Oklahoma and Iowa.", "url": "https://apnews.com/38bf24a8e184c65cdb08eb83e6ddeac6"}