{"authors": ["Analysis Chris Cillizza", "Cnn Editor-At-Large"], "date_download": "2020-05-04 16:01:21", "date_modify": "2020-05-04 16:01:21", "date_publish": "2020-04-01 14:32:38", "description": "On Tuesday, President Donald Trump seemed to get it.", "filename": "2020_04_01_politics_donald-trump-coronavirus-tragedy_index_1588608081.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331230558-01-trump-coronavirus-briefing-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_donald-trump-coronavirus-tragedy_index_1588608081.html", "title": "Why Donald Trump shouldn't get credit for (finally) realizing coronavirus is actually deadly serious", "title_page": "Why Donald Trump shouldn't get credit for (finally) realizing coronavirus is actually deadly serious - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "He stood in front of his coronavirus task force and, in somber terms, told the public that the next two weeks would see more illness and more death. He acknowledged that the death toll, if America keeps to its current social distancing guidelines, will likely fall somewhere between 100,000 and 240,000 dead Americans.\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!\n\"Our country is in the midst of a great national trial unlike any it has ever faced before,\" Trump said.\nWhich, well, it's about time.\nThe truth here is that everything Trump said on Tuesday about the spread and dangers -- and even the number of dead -- has been known publicly for weeks. The only leader who failed to acknowledge it was, well, the President.\n\"So last year 37,000 Americans died from the common Flu. It averages between 27,000 and 70,000 per year. Nothing is shut down, life & the economy go on. At this moment there are 546 confirmed cases of CoronaVirus, with 22 deaths. Think about that!\"\nEven when he sent that tweet, scientists and infectious disease experts were telling anyone who would listen that this was NOT the flu -- its mortality rate was far higher, we had no herd immunity to it and there was no vaccine.\nTrump didn't want to believe that. So he decided it was wrong. And through his words and actions -- whether his tweets and public statements downplaying the threat or his administration's too-slow reaction to the lack of adequate testing -- Trump's decisions helped get us to this bad place.\nNow, to be clear: This is not to lay blame for the coronavirus at Trump's feet. This was -- and is -- a virus that had never before been transmitted to humans. There is no vaccine. Governments around the world are struggling with combating it and protecting their citizens even as I write.\nBut there is NO question that Trump's downplaying of the virus in these critical last few weeks has played a role in the fact that we are now faced with the blunt reality of significantly more deaths of Americans from coronavirus than died in the Vietnam War ( 58,220 ).\n\"There's no question the United States missed the opportunity to get ahead of the novel coronavirus,\" Bill Gates wrote in an op-ed for The Washington Post on Wednesday.\nThe Boston Globe editorial board was even more blunt, writing in an editorial headlined \" A president unfit for a pandemic :\"\n\"While the spread of the novel coronavirus has been aggressive around the world, much of the profound impact it will have here in the United States was preventable. As the American public braces itself for the worst of this crisis, it's worth remembering that the reach of the virus here is not attributable to an act of God or a foreign invasion, but a colossal failure of leadership.\n\"The outbreak that began in China demanded a White House that could act swiftly and competently to protect public health, informed by science and guided by compassion and public service. It required an administration that could quickly deploy reliable tests around the nation to isolate cases and trace and contain the virus's spread, as South Korea effectively did, as well as to manufacture and distribute scarce medical supplies around the country. It begged for a president of the United States to deliver clear, consistent, scientifically sound messages on the state of the epidemic and its solutions, to reassure the public amid their fear, and to provide steady guidance to cities and states. And it demanded a leader who would put the country's well-being first, above near-term stock market returns and his own reelection prospects, and who would work with other nations to stem the tide of COVID-19 cases around the world.\"\nTrump is in the process of doing what he always does: Rewriting history -- and, specifically, his own actions to ensure that he is the hero of the story. Over the past 48 hours, he has repeatedly cited estimates that without any interventions -- like social distancing -- more than 2 million Americans could lose their lives as a result of the coronavirus.\nWhich, sure. But there was never ANY question as to whether the US needed to follow best practices on how to flatten the curve on the spread of the coronavirus. Especially given that Trump -- and the rest of the country -- saw how coronavirus had affected China and led to an effective shuttering of society to stop its spread.\nWhat Trump is doing is the equivalent of taking out your parents' brand-new car, getting in an accident because you were looking at your phone while driving and then telling them that they are lucky that the smashed-up front end is the only damage because it would have been worse without your amazing driving skills. Your parents wouldn't buy that. They'd want you to not have been looking at your phone and for their new car not to be damaged.\nAgain, I am not saying that Trump and his administration could have prevented all deaths in America from the coronavirus. Because of the openness of our society and the infection/mortality rate of this virus, that would have been totally impossible.\nBut what I am suggesting is that Trump doesn't deserve plaudits for finally realizing and acknowledging the severity of this crisis when there are already 3,000+ Americans dead and even the rosiest projections suggest tens of thousands more will die.\nKeep in mind that South Korea and the United States both got their first cases on the same day: January 20. The two countries took very different approaches in responding to the virus. South Korea has so far reported 165 deaths from the coronavirus and successfully flattened its curve due to aggressive testing and isolation practices\nThere were ways in the US -- stocking up earlier on needed medical equipment like masks and ventilators, widespread availability of testing, a federal shelter-in-place edict -- in which the catastrophic loss of life we are now facing could have been mitigated. Trump didn't do those things and, worse, he publicly dismissed concerns about the virus, sending a signal to many Americans that they should go on with their daily lives. (Trump isn't the only politician guilty of this; New York City Mayor Bill de Blasio did the same earlier this month .)\nThose decisions inarguably made things worse. And played a major role where we are today -- hoping that only 100,000 of our fellow Americans die from coronavirus.", "url": "https://www.cnn.com/2020/04/01/politics/donald-trump-coronavirus-tragedy/index.html"}