{"authors": ["Kathleen Foody", "John O'Connor"], "date_download": "2020-05-04 20:15:01", "date_modify": "2020-05-04 20:15:01", "date_publish": "2020-04-15 20:08:15", "description": "CHICAGO (AP) — Illinois could face a $7 billion state budget deficit during the next two years as the coronavirus takes a toll on the economy, Gov. J.B. Pritzker said Wednesday. The economy...", "filename": "_cf8dd434357371b531f8994614bdaaac_1588623301.html", "image_url": "https://storage.googleapis.com/afs-prod/media/6b1f577b60f14fdbb5edfa6ba33172ac/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cf8dd434357371b531f8994614bdaaac_1588623301.html", "title": "Illinois could face $7B deficit over 2 years after COVID-19", "title_page": "Illinois could face $7B deficit over 2 years after COVID-19", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Chicago Police officer Cheryl Clark, right, greets co-workers while she is waiting to get vital PPE from the World Vision in Chicago, Wednesday, April 15, 2020. One of Chicago's first responders World Vision is supplying personal protective equipment (PPE) for hundreds of members in the Chicago Police and Fire Departments and the Cook County Sheriff's Office at the World Vision Storehouse. (AP Photo/Nam Y. Huh)\nChicago Police officer Cheryl Clark, right, greets co-workers while she is waiting to get vital PPE from the World Vision in Chicago, Wednesday, April 15, 2020. One of Chicago's first responders World Vision is supplying personal protective equipment (PPE) for hundreds of members in the Chicago Police and Fire Departments and the Cook County Sheriff's Office at the World Vision Storehouse. (AP Photo/Nam Y. Huh)\nCHICAGO (AP) — Illinois could face a $7 billion state budget deficit during the next two years as the coronavirus takes a toll on the economy, Gov. J.B. Pritzker said Wednesday.\nThe economy has suffered as residents are under a stay-at-home order that has forced the closure of nonessential businesses and led to 500,000 first-time unemployment claims in Illinois since March 1.\nThe additional economic pain for state government comes on top of billions of dollars in debt Illinois built up during years of overspending and political infighting.\n“We will need to make extraordinarily difficult decisions on top of the difficult decisions that we’ve already made,” Pritzker said after explaining that he expects a deficit of $2.7 billion in the current budget year, which ends June 30. “But together with the state Legislature, we will make them and we will do so with an unswerving dedication to fairness.”\nThe assessment from the Governor’s Office of Management and Budget is similar to the one put out March 31 by the General Assembly’s fiscal forecaster.\nPritzker and his state public health director, Dr. Ngoze Ezike, have expressed optimism in recent days that the level of infection in Illinois is leveling off. Ezike reported 80 additional deaths Wednesday, for a total of 1,346 deaths amid 24,593 cases, up 948 from a day earlier.\nEzike and Chicago Mayor Lori Lightfoot credited adherence to social distancing and other strategies for slowing the spread of the virus, particularly Pritzker’s stay-at-home order, which is scheduled to expire April 30.\nGovernors have begun discussing strategies for reopening economies without risking a second spike in illness and deaths. Pritzker on Tuesday said people should prepare for a “new normal” rather than an immediate return to normal movement and interaction.\nLightfoot, whose city is one of the nation’s hot spots with 361 deaths among 10,192 cases, said restrictions would stay in place until there’s a downward trend in reported infections.\n“We still have a long way to go,” Lightfoot said. “Many things are needed for us to lift the restrictions we have placed on our city.”\nPublic health and city authorities are paying particular attention to data on the number of new COVID-19 cases per day, capacity in city hospitals’ intensive care units and the number of patients using ventilators, Lightfoot said.\nThe availability of tests for coronavirus must increase substantially and public health authorities must be able to monitor new cases and use “contact tracing” to investigate potential spread of the virus as part of a “new normal,” she said.\n“We are hard at work thinking about and planning for a world in which we reopen before there is a vaccine,” she said. “I know these restrictions have been frustrating and challenging for every Chicagoan but this is exactly the wrong time to let our guard down.”\nFor most people, the virus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nDr. Allison Arwady, commissioner of the city’s Department of Public Health, said restrictions in Illinois and others specific to Chicago have made a difference.\nA month ago, the city was seeing new cases double every two or three days. At that rate, Chicago could have had 1.5 million cases and 48,000 deaths by now, she said.\n“We knew that if we didn’t work quickly to start bending that curve we were going to be on an upward trajectory that would absolutely overwhelm the health system,” Arwady said.\nData tracked by the city shows Chicago hospitals were “stretched” but still had 25% of ICU beds available and about 50% of ventilators available early this week, Arwady said.\n___\nO’Connor reported from Springfield, Ill.\n___\nFollow Kathleen Foody at https://twitter.com/katiefoody and John O’Connor at https://twitter.com/apoconnor", "url": "https://apnews.com/cf8dd434357371b531f8994614bdaaac"}