{"authors": ["Cnn Staff"], "date_download": "2020-05-04 17:01:53", "date_modify": "2020-05-04 17:01:53", "date_publish": "2020-04-10 14:41:06", "description": "In the age of social distancing, faith leaders are using the internet to find other ways to keep important religious traditions. CNN's Chief Medical Correspondent Dr. Sanjay Gupta speaks with Reverend Jennifer Bailey about finding and keeping faith.", "filename": "2020_04_10_health_sanjay-gupta-coronavirus-podcast-april-10_index_1588611713.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402114757-gupta-coronavirus-podcast-top-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_health_sanjay-gupta-coronavirus-podcast-april-10_index_1588611713.html", "title": "Faith in a Pandemic: Dr. Gupta's podcast 4/10", "title_page": "Faith in a Pandemic: Dr. Gupta's podcast 4/10 - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In the age of social distancing, faith leaders are using the internet to find other ways to keep important religious traditions. CNN's Chief Medical Correspondent Dr. Sanjay Gupta speaks with Reverend Jennifer Bailey about finding and keeping faith in the midst of loss and change.\nYou can listen on your favorite podcast app or read the transcript below.\nDr. Sanjay Gupta: This month, many people all over the world are celebrating religious holidays.\nIt's supposed to be a time for communities to gather and celebrate together in houses of worship or at home -- but because of social distancing, people have to find other ways to keep those traditions.\nSome religious leaders have adapted to this by using video calls to hold services, but this is a time of loss and suffering as well -- when people look to their faith as a touchstone. And I wondered if that virtual connection was still enough.\nSo in this episode, I invited Rev. Jennifer Bailey to talk about how faith leaders are leading their communities. And to help us answer this question: Does your faith change in a pandemic?\nI'm Dr. Sanjay Gupta, CNN's Chief Medical Correspondent. This is \"Coronavirus: Fact vs. Fiction.\"\nGupta: Rev. Bailey is an associate minister for the Greater Bethel AME Church in Nashville, Tennessee. She founded an organization called the Faith Matters Network, and is ordained in the African Methodist Episcopal Church.\nGupta: Reverend Bailey, thank you so much for joining us. I want to talk a little bit about what's been going on in the world. What has your life been like with Covid-19?\nRev. Jennifer Bailey: One of the things that I've been trained up in as a clergy person is accompanying people through the best and worst moments of their lives. And in this season, where we're not able to physically be present with one another in the same ways, figuring out new ways to be present.\nI'm a millennial. And so figuring out that my phone can be used for something other than email or texting has been a revelation for me. So, picking up the phone and having weekly calls with my grandma and others has been a really beautiful invitation back into connection and community for me.\nGupta: What do you tell people, for example, your friends, who may call you and they're leaning on you. How do you approach those conversations?\nBailey: As I have been offering pastoral care and support for friends, I think the first thing that I offer them is the affirmation that they are doing the best they can. I also tell them that it's okay to be angry at God. If my God's not big enough to hold my questions or hold my anger in this season, I don't know if I have much use for that God -- and I say that as a clergy woman, right, who very much believes that God is real. And so I think there is a tendency sometimes to pivot towards this sort of blind optimism or theology that is more akin to positive psychology than it is true, true theology in my own mind's eyes, and that there's a distinction between blind optimism and hope. And that hope is, at least in the Christian faith of which I'm a part of, born out of a suffering.\nI find great hope in my ancestors, both in my tradition and in, you know, as someone who's African American, seeing the ways in which the church mothers of my church have made a way out of no way for a long time and find solace in that.\nGupta: That's beautiful. It is a month of significant religious tradition: Easter and Passover. Ramadan is later this month as well. Typically, you know, people think about these traditions as being gatherings of people coming together -- families, friends connecting. Real human touch. And at the same time, given this pandemic that we're all, everyone in the world, is living under, that is not advised at this point to come together. How do you approach that then? Because that connection is such a part of the tradition. Is something going be lost because of that?\nBailey: I think the first thing that we do is acknowledge and lament the fact that we can't be together, right? That that is an important part of any ritual practices that are happening in the season. I'm also an odd duck who is a Christian clergy person that's married to a practicing Jew.\nAnd so ... last night we had a virtual Seder with my husband's family, and it was imperfect. You know, his parents had some issues adjusting the iPads to get the angle right and the sound right.\nAnd there was laughter, right, as we were saying the blessings and we're telling the Passover story. There was laughter through the imperfection. And so I think that there is a beautiful way in which even as we adapt these traditions to be virtual, or for the first time, maybe folks are experiencing some of these things alone, that there is space for joy.\nThere is a distinction between joy and happiness, like you can put the word \"un\" in front of happiness and it means something very different, but you can't say \"unjoy\" and so that there is something revolutionary about joy, even in the mess of Zoom Seders that don't go perfectly well.\nEven as we lament in this season, the inability to be able to touch hands or see one another in person or give each other hugs or laugh around the same Seder table, I think there are also these opportunities for great joy -- these opportunities to innovate and think about how community can look different in the 21st century.\nGupta: Let me let me ask you about the multiple faiths that exist within your household because I deal with the same thing. Can you just talk about that?\nBailey: So I am married to my beloved husband, Ira, who has grown up and is generationally Jewish and practicing. So it's been a real journey walking with him in both a multi-faith and interracial relationship. We live in the South. So you know, we got a lot going on in our household.\nYou know, I think, in many ways I was built for this. My first week of high school was 9/11, and I got involved in interfaith work when I was 16 years old. And so, I saw that the great religious traditions of the world could be a force for real devastation, or they could be a force for good.\nGupta: As you know, there are governors around the country, and including in the South, where you live, who are mostly abiding by the stay-at-home, sort of, recommendations but have made exceptions for religious gatherings. I'm just wondering what you think of that. Is that a reasonable exception to make or would you do the same thing?\nBailey: I understand the desire and impulse of folks when things are going wrong in the world to go to our religious spaces, to be present with our religious communities. And my grandma taught me not to be foolish.\nFrom my perspective, the truly faithful thing to do, the most loving thing that we could do, is stay home, so that we might care for those who do have compromised immune systems, care for those who are vulnerable because of their age, care for those who are pregnant, right? And so, I personally, very strongly disagree with those who are choosing to gather, particularly over 10 people, in spaces.\nWe know that some of these outbreaks started in religious communities, right?\nOur churches will be there, God willing, on the other end of this, and that perhaps the most faithful action that we can take during this season is to be physically distanced from one another, but not socially distanced from one another.\nGupta: And I think it is worth reminding people, there will be another side of this. This isn't forever. I think science, public health officials all agree on that. We don't know when that will be. But there is a tunnel and we can see the light.\nSomething I thought that was interesting that Dr. Fauci said, though, even though we will get back to some sense of normalcy, what he actually thinks maybe even shouldn't change is things like hand-shaking, because even outside of a pandemic, there are other pathogens -- flu virus, things like that which still takes significant toll on societies. I've wondered what you thought of that, Reverend. Do you think that should or would become a new normal?\nBailey: Not with my folks. I come from a community of huggers. I come from a community that passes the peace by shaking hands, right.\nGupta: So do I.\nBailey: So you know, I think we are, we are longing for that physical touch again. We might, for those first couple of weeks or months as we're adjusting back, think of alternative ways. I don't know if it's a fist bump for Jesus or whatever we might need to do initially.\nMy sense is that as things become clear, as the picture becomes clear, that we will certainly move back. And we know that touch has a healing power as well, right? That there is something about physical touch that is deeply, not just soothing, but that -- you're the scientist, Doctor, I think that there have been studies that physical touch can actually help heal people, right? That that closeness can be a thing that is positive to folks.\nGupta: You're right. They talk of it as the 'laying on of hands.' You know, that's one of the, I think, convergence points, Reverend, dare I say, between your world and my world.\nOne of the things we've seen as well is that this pandemic has not affected people equally. Even though it's a virus that doesn't discriminate, how it's impacted black America -- the data coming out of these states, was tragic.\nIn Michigan, where I'm from originally, 41% of the people who have died from Covid-19 have been black. Fourteen percent of the state's population is black. As a leader in a historically black church, how do you and your community of people, do you talk about this? How do you deal with this?\nBailey: For my community, I think we know that health disparities disproportionately impact black and brown folks. We know that many of the jobs that we've now discovered are essential are jobs that are, (and) have historically been, viewed as working-class positions, (and) are in many cities and states and places inhabited by black and brown folks and low-income folks. And so, it has been devastating, but if not unsurprising, to me. I think, in my more cynical and less gracious moments -- and I try really hard not to be cynical and ungracious -- I think when we were finally starting to get the aggregated data, it only affirmed what I knew and was seeing as somebody who's originally from Chicago, and hearing reports from back home about who was passing away.\nAnd at the same time, I've seen an outpouring in the black community of which I'm a part of, of folks really caring for one another and spreading correct information around mutual aid and health and safety and how we ought protect one another in this moment.\nAnd so I do think that there are lights at the end of this tunnel.\nGupta: I imagine you would hate the question: has your faith been challenged by what's going on right now? Because it seems to me that inherent in the word faith is that it's not really challenged. It's there. But has it changed?\nBailey: In this season, as we face a global pandemic, as we face just this season of uncertainty in terms of knowing where we're going, the one thing that I hold onto is that nothing can separate us from the love of God.\nMy God is big enough to hold my anger, my God is big enough to hold my unbelief, even as I believe. And so, you know, I think in this season for myself, I have found myself leaning deeper into the old school rituals and practices of my tradition. I've sang more hymns than I've ever sang in my life. I don't see myself as somebody who is necessarily enthralled with hymns. And I think in a time where everything is urgent and nothing is urgent, where we're wrestling with figuring out how to deal with these challenges, being able to sing the songs that my great-great grandmother sang, people who survived the horror of Jim and Jane Crow, who survived the horror of slavery, who survived the reality of structural inequality in this country. If it was good enough for them, then I think this faith is good enough for me.\nEven as I question, even as I get angry, I know that nothing can separate me from God's love.\nGupta: These days, humanity as a whole has suffered great losses -- whether it's the loss of a job, a routine, someone we love.\nI've lost people who mean a lot to me in the last few weeks.\nRight before my interview with Rev. Bailey, I reported on the death of Charlotte Figi, a little girl who changed the world and my own life.\nI first met her back in 2013. She was 6 years old and I was told that she had intractable epilepsy. And that nothing was working for her. She had been having 300 seizures a week. And then her family tried CBD, an ingredient in the cannabis plant. It's a non-intoxicating part of the plant and considered to have some medicinal properties. And yet it was still illegal, and her mom, Paige, had to make the CBD oil in her own kitchen. She gave it to Charlotte and it worked.\nIt was an amazing story, and it inspired me to search the world and find out if there were other patients like her, and what scientists were saying in other places. And what I found changed my mind. Not only would it be a medical failing to withhold a plant that could help so many people, I started to wonder aloud if it was a moral failing as well. The CBD movement in so many ways is something that everyone knows about now, but if you go back and look at the history, look at the origins, in many ways it started with a little girl. A movement wrapped up in this sweet little girl with a big smile, and an even bigger heart.\nI spent a lot of time with her while I was filming the documentary series about medical marijuana called \"Weed.\" You get really close to people that you cover sometimes. I became close to Charlotte, and I became close to her family. I was devastated to learn that she'd passed away.\nI asked Reverend Bailey about loss, and if she had any advice on how to come to terms with it, especially at this time.\nBailey: We want to take a breath together or just hold some silence for Charlotte's life.\nGupta: So we, you know, we got really close. And I have three daughters, and they all kind of felt like they knew -- felt like they grew up with Charlotte. So then you know, she got pneumonia. They don't know if it was ... this novel coronavirus or not. Everybody in the family got it. She didn't actually, it never got confirmed. They'd actually gotten her home, they thought she had turned the corner, and then they had to rush her back into the hospital. And, you know, she passed away.\nIt's just a lot, Reverend, you know. I mean, it's, I think everyone is feeling tremendous loss.\nBailey: Yeah. It sounds like she was a really incredible young lady and I've already lit a candle on my altar behind me.\nGupta: Thank you, Reverend. You know, I found that as I walk around my house, I have these objects of strength that I just put around there sometimes -- silly objects I don't even know at the time why I decided to put it there. It could be a little memento that I picked up somewhere, It could be a mug that for some reason had meaning to me. And I find my hand sort of lingering on these objects longer than before. I felt like I never had time to really appreciate these touchstones in my life. And now with all that's going on, in part because I'm home-bound like everybody else, but also in part because I think we're all drawing on sources of strength through this time, I think in ways that maybe we hadn't allowed ourselves to do before. And I found it very, very powerful. I have been dealing with some loss. We all have, I think, in one form or another.\nEverybody who's listening probably has. They've lost either someone or they've lost a way of life or they've lost something that they consider meaningful. And I'm wondering if you could just leave us with anything that you think you would like our listeners to take away from you and from this conversation?\nBailey: I guess I would say that grief is a natural part of this journey, that we're all collectively on together. Acknowledging it, speaking it, naming it, whether that loss be the loss of a loved one or to my high school seniors out there, the dream of prom, right, the loss of something that we were anticipating or have been moving towards, for a long time. And that the gift of grief is that it opens us up to greater feeling, to a greater sense of what's really going on for us. And when we are reminded of those deeper, more vulnerable feelings, we're reminded that we are deeply human. And as being deeply human, we are connected to other humans in the world and that we're not alone. I'd also say that when things feel overwhelming, when things feel like we don't know which way to turn in this season, my invitation to so many is to take a deep breath. For this is a disease that is literally trying to steal our breath.\nAnd to be reminded of that breath is to again be reminded that we are human and that we are surviving.\nGupta: Reverend, thank you. And I hope to meet you in person and - your people, my people like to give hugs. So I will not hold back if I see you.\nBailey: Yes. Yes. Speaking it into the universe. Let's make it happen.\nGupta: Continue to be such a good source of strength for people. We need you. Thank you, Reverend.\nBailey: Yeah, thank you.\nGupta: It seems now more than ever, it's important to hold on to faith -- whether it's in God or in each other. Remember that we all share a connection that's beyond anything virtual.\nFaith is the belief that there's something greater than us. And in this case I think that no one is alone -- that no matter how bleak things might get, we're all facing this together. I hope you remember that, and find some peace in it.\nWe'll be back Monday. Thanks for listening.\nYou can also head to cnn.com/coronavirus and sign up for our daily newsletter, which features the latest updates on this fast-moving story from CNN journalists around the globe.", "url": "https://www.cnn.com/2020/04/10/health/sanjay-gupta-coronavirus-podcast-april-10/index.html"}