{"authors": ["Laura Smith-Spark"], "date_download": "2020-05-04 16:16:21", "date_modify": "2020-05-04 16:16:21", "date_publish": "2020-04-03 16:38:47", "description": "Perhaps half the world's population is under some form of lockdown to help curb the spread of coronavirus. Many are starting to wonder when and how these tough restrictions on everyday life will end. Could a so-called immunity passport be the answer?", "filename": "2020_04_03_health_immunity-_0c1ff6d8c1be26537da92ac769fcbdde_index_1588608981.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403102412-coronavirus-testing-london-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_health_immunity-_0c1ff6d8c1be26537da92ac769fcbdde_index_1588608981.html", "title": "Is an 'immunity certificate' the way to get out of coronavirus lockdown?", "title_page": "Is an 'immunity certificate' the way to get out of coronavirus lockdown? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Perhaps half the world's population is living under some form of restriction to help curb the spread of coronavirus. Many are starting to wonder when and how these tough limits on everyday activities will end.\nMost experts agree that the only way out of a lockdown is testing. Reliable tests would allow people to know whether they have had the virus, and therefore enjoy at least a degree of immunity. They would give officials the ability to isolate new outbreaks when they emerge.\nBut just how would people prove their status -- and just what rights would that status confer? These are big questions that countries around the world are grappling with.\nIn the UK, Health Secretary Matt Hancock -- who has himself just emerged from self-isolation after testing positive for Covid-19 -- suggested that Britons who've had the virus might be issued with a certificate, which has already been dubbed an immunity passport.\n\"We are looking at an immunity certificate, how people who've had the disease, have got the antibodies and therefore have immunity, can show that and get back as much as possible to normal life,\" he said. On the BBC later, he said it could take the form of a wristband.\nFor many who have already lost their jobs or are desperate to return to work and keep businesses alive, the idea sounds like a godsend. But little is yet known about how feasible or reliable such a scheme would be -- not least because the evidence surrounding Covid-19 immunity is not clear. \"It's too early in the science of the immunity that comes from having had the disease\" to take any firm decisions now, Hancock said.\nPotential challenges include finding a reliable test to determine who has antibodies for the coronavirus, establishing the level of immunity conferred by previous infection and how long it lasts, and the capacity of overstretched health systems to carry out reliable, widespread antibody tests in the general population.\nDifficult social questions could also be thrown up. Could immunity passports create a kind of two-tier society, where those who have them can return to a more normal life while others remain locked down?\nThe UK government has already been widely criticized this week over its limited coronavirus testing capacity for frontline health care workers and others, prompting skepticism about whether it could deliver a more ambitious program.\nBritain's Health Secretary Matt Hancock is seen at the opening of the NHS Nightingale field hospital in London on Friday.\nPressed about the immunity passport idea Friday, Hancock told UK broadcaster ITV that the UK government had not so far found an antibody test that works.\nThe idea of immunity certificates is \"a really smart one,\" he said. \"But as yet we're not going to bring them in because we don't know yet that the immunity is strong enough and there's still more science that needs to be done about the levels of immunity in people after they've had the disease.\n\"So it's only when we have the confidence that that's reasonable are we going to do that.\"\nScientists are looking seriously at the idea, he added, including at Public Health England's laboratories at Porton Down, a top-secret government research site.\nTwo-tier society?\nPaul Hunter, professor of health protection at England's University of East Anglia, told CNN that his first reaction on hearing Hancock's proposal was \"what a brilliant idea\" but that his thoughts had quickly turned to what could go wrong.\nOn the positive side, he said, \"if you get something like this, you can get people back into areas where they are going to be meeting lots of others -- health care workers, front line workers, supermarket workers, who would otherwise be at risk but once they've had the infection know that they don't need to worry they will take the infection back to their families.\"\nOne big downside, however, is the potential for people to act fraudulently. \"Could people pretend they were immune when they weren't because they needed to go out and earn money?\" Hunter asked.\nIt's also not clear whether the antibody test, once a reliable type has been developed, would be administered at home or in a healthcare setting.\n\"If you are basing it on home tests, how does whoever signs your 'passport' know that you have actually read it right?\" said Hunter. \"How do they know that you have tested properly, read it properly, and the result is accurate? If you go somewhere else, how do they know that you are who you say you are and that you haven't swapped with someone who looks like you on your driving license?\"\nAnother more serious issue, he said, is whether people might deliberately seek to get infected in order to -- hopefully -- recover and go back to work. \"If that happens, that might undermine a lot of what we are trying to do with social distancing.\"\nBut while such an immunity passport would be divisive, the inequality wouldn't last forever, Hunter points out.\nA vaccine will most likely be developed by early next year, he said, allowing those most at risk to be protected, and by then more of the population would in any case be immune.\nMedical staff work at a National Health Service drive-through coronavirus testing facility in an IKEA car park in Wembley, London.\nChina's color-based QR codes\nThe United Kingdom is not alone in grappling with the idea of how safely to end its population's confinement and get people back to work.\nChina, which is cautiously beginning to open back up after weeks of restrictions, is using smart phone technology to try to prevent a resurgence of the coronavirus.\nResidents of Hubei province, except for the city of Wuhan, were told last month that they would be allowed to leave the province if they have a green QR code on their mobile phones.\nHubei had previously ordered all its residents to obtain the color-based QR code -- which comes in red, yellow and green -- and acts as an indicator of people's health status.\nThe colors are assigned according to the provincial epidemic control database: people who have been diagnosed as confirmed, suspected or asymptomatic cases, or people with a fever will receive the red color code; their close contacts will receive the yellow code; and people without any record in the database will get the green code -- meaning they're healthy and safe to travel.\nOn April 8, the easing of restrictions will be extended to Wuhan , where the coronavirus first emerged in December, and residents with a green QR code will be able to leave the city and the province for the first time in more than two months.\nOfficials in the city of some 11 million residents have warned people not to go out too much, however, amid fears of a renewed wave of cases\nThe authorities last week introduced strict new limits on foreigners arriving in the country, in order to prevent just such a second wave.\nSouth Korea, which has relied on aggressive testing and contact tracing to curb the coronavirus' spread, introduced a GPS-based app to make sure that people who were self-quarantined at home stayed put.\nDenmark looks to testing\nOne European nation, Denmark, is perhaps closer than most to lifting its lockdown.\nJUST WATCHED This Spanish town is taking isolation to another level Replay More Videos ... MUST WATCH This Spanish town is taking isolation to another level 01:28\nPrime Minister Mette Frederiksen said Wednesday that restrictions to curb the spread of the virus appear to be working, with hospital admissions rising at a stable rate although the virus has yet to peak there.\nUnforeseen developments aside, officials say the next step will be a gradual and controlled opening of society starting mid-April.\nPart of the plan will be to offer as much testing as possible -- not just for the virus but also for antibodies -- so people may know whether or not they have acquired a level of immunity.\nSince the first case was diagnosed in Denmark on February 27, more than 104 people have died and more than 535 have been hospitalized. Denmark was among the first European countries to close its borders on March 13, and in that same week closed schools, cafes and shops, as well as banning gatherings of more than 10 people and visits to hospitals.\nA combination of widespread testing with social distancing seems for now to be the most reliable way to stop the virus' spread.\nAs Hancock told Britons, \"The number one thing people can do to get out of this as fast as possible is to stay at home.\"", "url": "https://www.cnn.com/2020/04/03/health/immunity-passport-coronavirus-lockdown-intl/index.html"}