{"authors": ["Culture", "Parenting Reporter"], "date_download": "2020-05-04 21:10:17", "date_modify": "2020-05-04 21:10:17", "date_publish": "2020-04-30 22:05:47", "description": "Experts weigh in on the risks of floral deliveries during the pandemic.", "filename": "entry_is-it-safe-send-flowers-mothers-day-coronavirus_l_5eaa4bc9c5b62eaf043edfeb_1588626617.html", "image_url": "https://img.huffingtonpost.com/asset/5eab310824000054028ea0c2.jpeg?cache=3aKWSTf8Yx&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_is-it-safe-send-flowers-mothers-day-coronavirus_l_5eaa4bc9c5b62eaf043edfeb_1588626617.html", "title": "Is It Safe To Send Flowers For Mother's Day Amid Coronavirus?", "title_page": "Is It Safe To Send Flowers For Mother's Day Amid Coronavirus? | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Boris SV via Getty Images\nMother’s Day 2020 is going to be a bit ... different compared to years past. There will be no group brunches at restaurants or other big in-person family gatherings. Kids won’t be bringing home cute crafts they made with their art teachers at school. And the holiday may feel less festive for families dealing with loss, economic hardship and other trauma amid the COVID-19 pandemic.\nSo people are getting creative and figuring out new ways to celebrate Mother’s Day while social distancing. They’re also trying to keep some traditional aspects alive through Zoom brunches, at-home crafts and even flower deliveries.\nMany retailers in the flower industry are still operating and they’re offering Mother’s Day arrangements for delivery. But is it wise to send flowers to the moms in your life this year? HuffPost asked experts for their thoughts on the safety of Mother’s Day flowers in 2020 and their guidance for those who decide to go for it.\nConsider the supply chain.\n“The question is safe for whom? You the buyer? Your mother? The merchant? The grower?” said Jim Thomas, an associate professor of epidemiology at the University of North Carolina and lead author of the American Public Health Association’s code of ethics.\n“Ordering online seems so antiseptic,” he said. “All we touch is our keyboards. But there are lots of interactions in the supply chain to get those flowers to appear at a door ― all of them an opportunity for transmission between each other.”\nYour level of comfort with a flower delivery may depend on how you’ve felt about other types of deliveries amid the pandemic.\n“Sending your mom flowers has no more risk than if you send her gifts from an online retailer or have a nice meal from a restaurant delivered,” said Brian Labus, a professor at the University of Nevada, Las Vegas’ School of Public Health. If you’re avoiding delivery food and nonessential packages, you’ll likely want to skip flower deliveries for the same reasons.\nKeep it contactless.\n“The risk of contracting infection is low, but caution must be exercised,” said Jagdish Khubchandani, an associate chair and professor of health science at Ball State University.\nOne way to exercise caution is to opt for contactless delivery.\n“The risk from any delivery comes from the contact with the person making the delivery,” Labus noted. “Touchless delivery, which minimizes contact with the person making the delivery, eliminates this risk, and this is very easy to do for floral deliveries.”\nWhen placing your order, you can request that the delivery person leave the flowers on the porch or just outside the door or front gate, depending on the recipient’s living situation. If you and your mom live in the same area, you could also keep the handoff contactless by purchasing flowers at a grocery store or farmers market and dropping them off at her home yourself.\nd3sign via Getty Images If you live in the same town as your mom, you may consider buying flowers at a grocery store or farmers market and dropping them off yourself.\nChoose a florist you trust.\nMany different types of florists are still offering deliveries during the pandemic. Labus said the risks are the same with local and national services, especially because many of the national services partner with local florists.\nBut if you work with a local florist, he noted, “you can more easily discuss their delivery options and ensure that the flowers can be left outside the door without a signature.”\nKhubchandani advised taking company reputation, reviews and treatment of delivery workers into consideration. He said he would be more likely to choose a local florist and call to ask about their hygiene and sanitation practices.\n“Sellers must ensure delivery people are wearing masks and do not have any signs of flu-like illness,” he said.\nFrom an economic standpoint, Thomas said he would feel more inclined to use a local florist and support a small business. But from a transmission standpoint, he thinks it’s “a hard call.”\n“A local grower is more likely to sell on the street or in a farmers market, requiring you ― or someone shopping for you ― to go out in public to buy them,” he said. “Their supply chain is shorter and involves flowers passing through fewer hands, but then they interact with more customers.”\nAdvise handwashing.\nOnce your mom has received the flowers and placed them in a vase, she can exercise caution by washing her hands.\n“There isn’t anything you need to do to the flowers themselves, other than remembering to keep them in water,” said Labus. “We generally recommend that people wash their hands after handling deliveries, so that it is a simple step your mom can take to help protect herself.”\nAs an extra precaution, Khubchandani suggested staying away from the flowers for at least one to two hours and wearing gloves or a plastic bag while handling them. If they’re already arranged in a vase or other holder, you can wipe that down with Clorox.\n“No need to touch repeatedly or smell before a few hours pass,” he said. “Actually, just keep it in a place where you generally keep flowers. Cherish and be grateful.”\n“Flowers are the autopilot, nonthinking option for expressing love to a mother. This is an opportunity to think more widely about our options, and possibly (very likely) about purchases or acts of kindness that are more meaningful.” - Jim Thomas, an associate professor of epidemiology at the University of North Carolina\nKnow that it’s OK to skip the flowers this year.\nYou should not feel pressure to order any nonessential deliveries right now, including floral arrangements.\n“I understand the value of expressions, but love goes beyond that. If the mothers in your life are older, ill or isolating for some reason, avoiding flower delivery is OK,” said Khubchandani. “I foresee a huge drop in flower sales and delivery this time around. Financial and safety concerns are big on people’s minds.”\nHe said he’s opting for masks, gift cards and rainchecks for the holiday this year.\n“The pandemic is making us think again about so many things,” Thomas said. “Flowers are the autopilot, nonthinking option for expressing love to a mother. This is an opportunity to think more widely about our options, and possibly (very likely) about purchases or acts of kindness that are more meaningful. What about a contribution in her name to a cause she cares about? Maybe even one that helps us fight the pandemic.”\nWhatever you do, keep social distancing.\nThomas noted that we’re still “in a fragile place” with the pandemic, and any reductions in social distancing measures should happen gradually and with markers like a decline in cases and greater availability of tests.\nLess essential businesses “should remain closed or on pandemic footing for those that have adapted their business model,” he added. “Flowers are about as likely as anything to fall into the nonessential category. They don’t present a compelling reason to ask all the people involved to risk transmission.”\nLabus emphasized complying with public health guidance and keeping any Mother’s Day festivities online (unless, of course, you and your mom are living in the same home).\n“Those of us who live near our moms are used to taking them flowers or gifts and taking them out to dinner for Mother’s Day,” he said. “While taking mom a meal and spending the day with her or taking the grandkids over to see her might seem like a nice alternative, that is one of the things that we should still avoid until the outbreak is over, especially if your mom is older or is at high risk for serious complications from coronavirus.”", "url": "https://www.huffpost.com/entry/is-it-safe-send-flowers-mothers-day-coronavirus_l_5eaa4bc9c5b62eaf043edfeb"}