{"authors": ["Tales Azzoni"], "date_download": "2020-05-04 20:29:00", "date_modify": "2020-05-04 20:29:00", "date_publish": "2020-04-20 12:04:50", "description": "MADRID (AP) — The soccer team based in the epicenter of the coronavirus pandemic in China is back home, nearly four months after it left for a preseason tour and got stuck abroad. Wuhan Zall...", "filename": "_9fdf333da927d45ac3991f46a11daa97_1588624140.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d1e99c59ebb645ae983ffeb7107c56f4/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9fdf333da927d45ac3991f46a11daa97_1588624140.html", "title": "Soccer team from Wuhan returns home nearly 4 months later", "title_page": "Soccer team from Wuhan returns home nearly 4 months later", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A worker in protective clothing waits to guide passengers from Wuhan to board buses after they arrive on a high speed train in Beijing on Sunday, April 19, 2020. Wuhan, the city at the center of the global coronavirus epidemic, lifted a 76-day lockdown early April and allowed people to leave for destinations across China. (AP Photo/Ng Han Guan)\nA worker in protective clothing waits to guide passengers from Wuhan to board buses after they arrive on a high speed train in Beijing on Sunday, April 19, 2020. Wuhan, the city at the center of the global coronavirus epidemic, lifted a 76-day lockdown early April and allowed people to leave for destinations across China. (AP Photo/Ng Han Guan)\nMADRID (AP) — The soccer team based in the epicenter of the coronavirus pandemic in China is back home, nearly four months after it left for a preseason tour and got stuck abroad.\nWuhan Zall returned home this weekend after the government lifted the last restrictions on movement in the city where the COVID-19 outbreak emerged late last year.\nThe nearly 50 members of the squad had been away since Jan. 2, when the team left to begin training for the Chinese league season that was supposed to start in February but was eventually suspended.\nThe team’s preseason started in the Chinese city of Guangzhou, nearly 1,000 kilometers (620 miles) from Wuhan. It was told about 20 days later that it would not be allowed to return to its base because of the coronavirus outbreak. Wuhan ended its 76-day lockdown in early April, allowing people to leave for destinations across China.\nWuhan Zall had already planned a training period in southern Spain, where it arrived in late January. The team’s presence near the city of Málaga prompted fear among local residents in the midst of the rapidly spreading outbreak. The team had been away from Wuhan for nearly a month but members of the squad had to be repeatedly tested in Spain before concerns about their condition abated.\nNone of the squad members tested positive in Spain, but Spanish coach José González said at the time that one of them lost a family member back home because of the virus.\nThe team went to the Santiago Bernabéu Stadium in Madrid to watch the Spanish league “clásico” between Real Madrid and Barcelona on March 1, which González called a “well-deserved reward” for the team.\nThe squad was expected to leave Spain in mid-February but had to extend its stay as conditions back home hadn’t fully improved. The team was going to stay training in Spain until at least the end of March but plans had to change again after the situation in Europe took a turn for the worse. Spain became one of the hardest-hit countries by the pandemic and Wuhan Zall officials decided it was time to leave.\nThe team left on March 14, the day the Spanish government declared a state of emergency and said the entire nation would have to abide by lockdown measures to try to contain the spread of the virus. González said at the time that “things were well” in China so it was better to leave Spain as soon as possible.\nThe team initially went to the city of Shenzen as restrictions in Wuhan remained in place when the team left Spain. Members of the squad had to enter a mandatory quarantine after arriving in China.\nThe team went to the nearby city of Foshan after the quarantine was over, and it finally returned home to Wuhan on Saturday.\n___\nMore AP soccer: https://apnews.com/Soccer and https://twitter.com/AP_Sports\n___\nTales Azzoni on Twitter: http://twitter.com/tazzoni", "url": "https://apnews.com/9fdf333da927d45ac3991f46a11daa97"}