{"authors": ["Aj Willingham"], "date_download": "2020-05-04 16:51:12", "date_modify": "2020-05-04 16:51:12", "date_publish": "2020-04-08 10:19:47", "description": "Here's what you need to know to Get Up to Speed and Out the Door.", "filename": "2020_04_08_us_five-things-april-8-trnd_index_1588611072.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408083824-wuhan-train-station-after-lockdown-lift-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_us_five-things-april-8-trnd_index_1588611072.html", "title": "5 things to know for April 8: Coronavirus, White House, health, Navy, stimulus bill", "title_page": "5 things to know for April 8: Coronavirus, White House, health, Navy, stimulus bill - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "If your day doesn't start until you're up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n(CNN) A tiny bit of optimism: Public health officials now say the US death toll from coronavirus could be much lower than predicted , thanks to (most) everyone's scrupulous social distancing. Here's what else you need to know to Get Up to Speed and On with Your Day .\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. Sign up here .)\n1. Coronavirus\nAfter 76 days of isolation, China has lifted lockdown restrictions in Wuhan , the city where the novel coronavirus was first detected. Trains and flights are now operating, and healthy residents and visitors will be allowed to leave. However, Chinese officials warn there is still work to be done to prevent another outbreak. In the UK, London Mayor Sadiq Khan says the country is \"nowhere near\" lifting its lockdown, and estimates the peak of the virus is still a week and a half away. UK Prime Minister Boris Johnson is still in an intensive care unit battling coronavirus symptoms. There's also concern that the methodology behind the UK's daily death toll updates could be leading to an underreporting of the true number . Tuesday marked the deadliest day yet for coronavirus cases in the US , with 1,858 recorded deaths. The new nadir came as President Trump picked a fight with the World Health Organization, which he inaccurately claimed underrepresented the threat of the virus. Follow updates here\n2. White House\n3. Health\nJUST WATCHED See the question Trump wouldn't let Dr. Fauci answer Replay More Videos ... MUST WATCH See the question Trump wouldn't let Dr. Fauci answer 02:29\n4. US Navy\nJUST WATCHED Acting Navy Secretary resigns after this audio leaked Replay More Videos ... MUST WATCH Acting Navy Secretary resigns after this audio leaked 01:47\nActing Navy Secretary Thomas Modly has resigned after calling the ousted commander of the USS Theodore Roosevelt \"stupid\" for sounding the alarm over coronavirus cases on the aircraft carrier. Capt. Brett Crozier, the then-commanding officer of ship, sent a memo warning of coronavirus spreading among the sailors on the aircraft carrier. Modly removed him from his post and then insulted him for being \"too naive or too stupid\" during an address to the ship's crew, who had given Crozier a warm farewell just days earlier. Though Modly initially defended his remarks against criticism, he apologized after being reprimanded by Defense Secretary Mark Esper\n5. Stimulus bill\nJUST WATCHED Your questions about the new small business loans, answered Replay More Videos ... MUST WATCH Your questions about the new small business loans, answered 01:45\nLawmakers are rushing to get their priorities included in the next coronavirus stimulus bill . The \"phase four\" bill would attempt to patch over some of the parts missing from last month's massive $2.2 trillion package. How could so much money not cover everything? For starters, the Treasury Department wants to ask Congress for an additional $250 billion for the Small Business Administration's new loan program after the $350 billion program experienced a rocky rollout. Top Democrats want more money for state and local governments, funds for personal protective equipment, more payments for individuals, and assistance for those still on the job despite coronavirus restrictions.\nBREAKFAST BROWSE\nUFC President Dana White wants to stage the UFC 249 fight on a private island\nChurches are stocking up on disposable, pre-filled communion cups before Easter\nThe ABC series \"Modern Family\" signs off tonight after 11 years\nThe MLB is considering having teams play all their games in just the Phoenix area, with no fans\nDisney is releasing a series of shorts called \"At Home with Olaf\"\nTODAY'S NUMBER\n45,000\nThat's how many Americans abroad have been repatriated by the State Department since the end of January due to the coronavirus pandemic. The citizens have been flown back home on 374 flights from more than 75 countries.\nTODAY'S QUOTE\n\"I know that you all are making sacrifices. I want everyone to take this seriously.\"\nDr. Deborah Birx, one of the leaders of the White House coronavirus task force, who admits , one of the leaders of the White House coronavirus task force, who admits she couldn't even see her own sick granddaughter because of the risk of catching or transmitting coronavirus.\nTODAY'S WEATHER\nJUST WATCHED Summer heat and storms for the south-central US Replay More Videos ... MUST WATCH Summer heat and storms for the south-central US 01:54\nAND FINALLY\nRavel's Boléro, piece by piece", "url": "https://www.cnn.com/2020/04/08/us/five-things-april-8-trnd/index.html"}