{"authors": ["Dan Merica"], "date_download": "2020-05-04 16:13:13", "date_modify": "2020-05-04 16:13:13", "date_publish": "2020-04-03 11:08:48", "description": "The coronavirus crisis has prompted new calls to expand access to voting ahead of November's election and intensified the long-running partisan fight over voting rights.", "filename": "2020_04_03_politics_vote-by-mail-coronavirus_index_1588608793.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200310183843-07-super-tuesday-ii-0310-washington-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_vote-by-mail-coronavirus_index_1588608793.html", "title": "Vote by mail: Coronavirus intensifies Democrats' push and ignites longstanding fight over voting rights", "title_page": "Vote by mail: Coronavirus intensifies Democrats' push and ignites longstanding fight over voting rights - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The coronavirus crisis has prompted new calls to expand access to voting ahead of November's election and intensified the long-running partisan fight over voting rights.\nThe pandemic has reshaped much of American life, and the prospect of having millions of Americans head to the polls in November is raising serious questions about balancing the right to vote with public health.\nThe solution proposed by Democrats and voting rights experts and advocates is to expand voting by mail. But those calls are facing resistance from many state and national Republicans, who have long opposed efforts to expand voting access and instead have supported stricter measures like voter identification laws, which they argue ensure the integrity of the electoral process.\nCongressional Democrats asked for billions to expand the use of absentee voting but got just $400 million in the $2 trillion stimulus package approved last week. Before that, Democratic Sens. Ron Wyden of Oregon and Amy Klobuchar of Minnesota introduced a bill in March that would have added $500 million in federal money to prepare state election systems for the coronavirus. And House Speaker Nancy Pelosi has said she wants money dedicated to vote-by-mail to be part of the next coronavirus bill.\nSome Republicans, though, view the push for expanding voting rights as opportunism, accusing Democrats of using the deadly virus as a way to enact the kind of voting changes the party has long sought. Many Republicans have resisted calls to expand mail-in and absentee balloting for decades and are now lined up firmly against this most recent push, with some responding by noting bluntly that expanded voting could be bad for the party.\nLeading that charge is President Donald Trump\nIn a \" Fox & Friends\" interview on Monday, the President bluntly referenced the voting provisions Democrats were asking for as the opposing party hoping for \"levels of voting that, if you ever agreed to it, you'd never have a Republican elected in this country again.\"\nThe Republican National Committee has backed the President, with spokeswoman Mandi Merritt arguing that \"Democrats are attempting to use this crisis as a way to get wholesale election changes that fit their far-left agenda.\"\n\"While the RNC of course supports efforts to ensure that no voters are disenfranchised due to emergency protocols, national vote by mail would open the door to its own set of problems, such as potential election fraud and ballot harvesting. Imposing a new system onto states unnecessarily will result in significant problems in the November election, and it is critical we work to preserve the integrity of the democratic process.\"\nThe same argument is being made in Republican-controlled states like Georgia.\nGeorgia's Republican Secretary of State Brad Raffensperger, in an effort to encourage more voting during the pandemic, has approved the mass mailing of absentee request forms to the state's nearly 7 million active voters. Voters who return the form will be sent a ballot for the May 19 primary.\nThat, however, has enraged some Republicans in the state, many citing the possibility of fraud.\n\"This will be extremely devastating to Republicans and conservatives in Georgia,\" State House Speaker David Ralston, a Republican, told FetchYourNews , a small outlet from North Georgia.\nStacey Abrams, the Democrat who ran and lost against Georgia Gov. Brian Kemp in 2018, created the voting rights group Fair Fight after her loss and has pushed the use of vote by mail, not only in the Georgia primary, but in the general election in November.\nVoting rights was a flashpoint in Abrams' race against Kemp, who was overseeing the Georgia election as secretary of state at the time of the election. The Republican enforced some of the most restrictive voting laws in the nation and was repeatedly accused during the campaign of seeking to suppress the minority vote, which he denied.\n\"We know that the best solution is access to vote by mail,\" Abrams said on a recent video conference with donors. \"We know it works.\"\nAbrams and her group lobbied Congress for more money to move elections towards vote-by-mail, pushing for the billions that initial Democratic proposals included.\n\"What we need more is investment,\" Abrams said on the video conference. \"We got $400 million... it is not as much as we were asking for but it is a strong down payment.\"\nThe prospect of a bill with billions for funding vote by mail moving through Congress is highly unlikely, though, as Republicans begin to line up against the proposal and raise questions about Democrats using the pandemic to usher in wholesale voting changes.\n\"Of course, our Democratic friends want the federal government to take over elections,\" said Texas Sen. John Cornyn, a top Republican in the Senate, who said he advocates for more early voting to spread out the opportunity to vote.\nAsked directly about absentee balloting on Thursday, Cornyn said because people \"can go to the grocery store, they can go to the polls.\"\nVote by mail is more prevalent in primary elections and states like Ohio, where Republican Secretary of State Frank LaRose released the postcard that will be used for voters to vote by mail in the state's 2020 state primary. Some states, like Washington, Utah and Oregon, mandate all elections be conducted by mail, while others use the practice to varying degrees.\nBut an array of groups -- both non-partisan and Democratic-leaning organizations -- would like the use to expand.\nThe Brennan Center for Justice, an organization aimed at expanding voting rights, has published a series of papers on the need for election changes, including expanded early voting, universal vote by mail and expanded online voter registration.\nThe group has estimated it would cost at least $2 billion to implement every aspect of their plan, which they argue is needed now more than ever because of the spreading coronavirus.\n\"Given the scope of the challenge, large-scale preparation, backed by the concerted support of the government and the public, is needed immediately to ensure that the 2020 election is free, fair, accessible, and secure,\" The Brennan Center's Wendy Weiser and Max Feldman wrote in a post about the election and coronavirus.\nPartisan organizations, too, have also added their voices to the push.\nStand Up America, a group founded by former Democratic congressional candidate Sean Eldridge, has tried to lobby Congress to provide at least the $2 billion in election assistance funding in the coronavirus packages.\n\"We're running out of time to get this right,\" Eldridge said. \"None of us know how long this pandemic will last, and no American should have to choose between protecting their health and exercising their right to vote.\"\nAnd groups like Voter Protection Project, a Democratic organization that plans to spend millions to attack Republicans standing in the way of election changes, have begun backing candidates, including some running for the Texas statehouse and North Carolina Senate.\n\"I am skeptical that Republicans are going to do anything to make voting more accessible,\" said Matt Liebman, the group's top operative. \"It is time for folks to do the right thing. ... There need to be political repercussions for those who make it hard for people to vote.\"", "url": "https://www.cnn.com/2020/04/03/politics/vote-by-mail-coronavirus/index.html"}