{"authors": ["Opinion Stan Mcchrystal", "Terry Mcauliffe"], "date_download": "2020-05-04 17:00:31", "date_modify": "2020-05-04 17:00:31", "date_publish": "2020-04-10 03:58:56", "description": "We can't win this fight with governors bidding against each other for supplies. Instead, we need a network that connects them to make informed, cross-border decisions, writes Stan McChrystal and Terry McAuliffe.", "filename": "2020_04_09_opinions_lessons_b3c978e62692933ea4585ce1734de40e_index_1588611631.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408144616-health-care-worker-new-york-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_opinions_lessons_b3c978e62692933ea4585ce1734de40e_index_1588611631.html", "title": "How to win the fight against a virus that knows no boundaries", "title_page": "How to win the fight against a virus that knows no boundaries - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Terry McAuliffe is a CNN commentator. He was the 72nd governor of the Commonwealth of Virginia from 2014-2018, chair of the National Governors Association from 2016-2017, and chair of the Democratic National Committee from 2001-2005. He is the author of the recent book \"Beyond Charlottesville\" about the white nationalist violence in Virginia in 2017. Stan McChrystal is a retired four-star Army general and co-founder of the management consulting company McChrystal Group. He is a senior fellow at Yale University's Jackson Institute for Global Affairs and the author of several best-selling books, including \"Team of Teams: New Rules of Engagement for a Complex World.\" The opinions expressed in this commentary are those of the authors. View more opinion at CNN.\n(CNN) It was the summer of 2019 and in cities across the country normally bustling streets were empty. BBQs, birthday parties, and get-togethers were all cancelled -- the entire country was locked in quarantine. The silence was only broken by the occasional screeching sirens of an emergency vehicle rushing through deserted streets.\nThe United States was brought to her knees by a mysterious respiratory virus originating in China. The virus first hit Chicago and within months federal, state, and local entities were overrun, having neither the operational clarity nor the resources needed to effectively respond. State governments found no clear path to requesting resources from the federal government and the global medical supply chain shattered, forcing a painful prioritization of resources.\nYou probably don't remember this pandemic -- because it never actually happened. Months before anyone had even heard of Covid-19, the Department of Health and Human Services ran a functional table exercise called Crimson Contagion , according to The New York Times. The purpose of the exercise was to understand the US's preparedness to battle a viral pandemic. The report was conclusive -- in the summer of 2019, we were underprepared\nThe Covid-19 pandemic is quickly beginning to resemble Crimson Contagion. Unclear federal, state, and local roles and responsibilities, shortages in medical equipment, a federal government that was slow to acknowledge the scale of the situation and inconsistent crisis response standards are hampering our ability to fight the battle against this virus.\nWe have not faced a crisis on this scale perhaps since World War II -- but what we know from years of experience leading in crisis is that the principles of leadership in crisis remain the same -- no matter the crisis. Whether it was defeating Al Qaeda in Iraq or preventing an Ebola outbreak in Virginia, leading a unified, effective response though crisis requires leaders that can overcome structural barriers.\nStan McChrystal: What I learned fighting Al Qaeda in Iraq\nIn 2003, I took command of our nation's elite counter terrorism force, Joint Special Operations Command (JSOC), and in the first few weeks it became apparent we were losing the battle to Al Qaeda in Iraq (AQI). JSOC was highly effective in defeating traditional terrorist organizations -- but AQI wasn't traditional.\nWe spent days and nights hunkered around whiteboards trying to piece together AQI's hierarchy. Each time we thought we had it down, we would show it to a detainee -- without fail they would be absolutely baffled by what we had come up with. The answer may be obvious now, but in the early 2000s, no terrorist organization like AQI had ever existed. AQI had no hierarchy.\nAl Qaeda was a networked organization that communicated and executed at the speed a terrorist could text a message on their cellphone. It had a clear set of priorities and objectives. Each member was encouraged to act on their understanding of the mission - without any centralized command. Terrorists with cellphones were sharing information instantly and out pacing our highly trained, well equipped operatives. We were in crisis.\nAt that time, JSOC was tribal -- built to operate as individual, small unit teams conducting precise strikes. We didn't share information and, because there was no common understanding of the operating picture, I had to approve every raid. Only I had enough information and understanding of the strategy to do so -- but this model just doesn't work against a group such as AQI. The power of its network came from the raw speed of execution, allowing a single individual to have an oversized impact in the fight.\nToday, the United States is facing a threat that moves and changes at a rate which overwhelms centralized control. Covid-19 requires no chain of command to spread rapidly and as the ensuing health crisis intensifies existing issues across the nation, the ponderous bureaucracies of our government just can't keep up. The problems we are running into -- the same ones predicted by Crimson Contagion -- aren't the fault of any individual; they are structural. We, now more than ever, need leaders of state and local governments -- governors and mayors -- that can build networks within the hierarchy.\nTerry McAuliffe: What I learned confronting the Ebola scare\nAs the Governor of Virginia, I took the threat of Ebola seriously in 2014, especially given Dulles International Airport's location, which made the state particularly vulnerable. As the main point of international entry for the DC region, Ebola was a specific threat to Northern Virginia . Some states instituted preemptive quarantines -- a measure that while appropriate now, certainly comes at significant cost. Instead, my team and I made the decision to actively monitor and identify cases -- a task that was logistically much more challenging.\nActively monitoring cases required use of a broad network connecting with other governors, federal agencies, and local Virginia health districts. I quickly established a constant communication loop with President Barack Obama's team, including Ebola Response Czar Ron Klain, Governor Martin O'Malley and Mayor Vincent Gray. And we went out of our way to coordinate guidelines and public communications in DC, Maryland and Virginia.\nThe policy that worked in Maryland might not work in DC and what worked in DC might not work in Virginia. However, in the regional coordination effort, shared understanding of what was going on, and ability to share best practices was invaluable. The cooperation between O'Malley and Gray wasn't formalized and certainly didn't replace an internal command team led by the Virginia Department of Health, but that fusion of ideas and information allowed each of us to effectively execute the policy that was most appropriate at our state and local levels. This cooperation enabled the identify and monitor method to be effective in Virginia, with monitoring programs for over 1,500 travelers arriving in Virginia. No preemptive bans were necessary and there were no cases of Ebola in Virginia.\nMayor G.T. Bynum of Tulsa, Oklahoma recently put it very simply, \" So how do you navigate [the right decision] as you try to protect the people who elected you to keep them safe? By following logic and science -- adapting daily and communicating with other mayors ... the greatest resource in all of this has been other local governments that are in the same spot.\"\nBuild cohesion where the battle lines meet\nThe single weakest point in any battle formation is where two lines meet. On the battlefield that is where coordination and communication breaks between two forces, allowing a gap for the enemy to seize. In the political landscape that is where the federal, state, and local forces muddle messages and compete with each other. A networked enemy, such as Al Qaeda in Iraq, Ebola, or Covid-19 doesn't care about our hierarchies. The divisions between Army companies or between state and local entities are arbitrary. We invented them for good reason -- they provide stability -- but trying to beat a network with a hierarchy is futile. We will never be fast enough. The longer we think of Covid-19 as a problem for New York City, a problem for Detroit, a problem for LA, and not a problem for the United States, the longer we will spend playing catch-up as the virus won't stop for the lines between New York and California.\nToday's front line is made up of doctors, nurses, and first responders all putting their lives at risk to treat and save Americans. Government leaders must never forget that their job is not to tell these men and women how to do their jobs. Instead, governors and mayors must enable the front line to be as effective as possible. Leaders set the tone for the fight; they don't fight themselves. They must provide a consistent, honest, and hopeful message. Governors and mayors across the country need to pick up the phone and work together to break down our artificial silos, learn from each other, share best practices, offer resources, understand what's working and what isn't, and coordinate our messaging. All of this is done to support those on the front-lines -- our structural challenges cannot stand in the way.\nWe need to provide our new front lines with everything we can. The results of building a communication network of governors, mayors, federal agencies, and business leaders will be apparent immediately. News of a new drug developed in Houston, for example, will immediately be sent to San Francisco. Accurate numbers of available ventilators will go straight from Miami to New York City without needing to go through a bureaucratic, centralized system. Once a need for masks in Detroit and a surplus in Topeka has been identified, the Air National Guard can quickly transport masks to hospitals in Detroit.\nWe can't win this fight with governors bidding against each other for supplies. Instead, we need a network that connects them to make informed, cross-border decisions. For example, that could take the form of a consortium between FEMA and the National Governor's Association to coordinate the distribution of supplies based on need and coordinate pricing to prevent gouging.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWe must set aside our political differences and rally around the common cause. The network is exponentially more powerful than any individual entity. We need our most visible leaders to be working to simplify the operating picture for everyone, while trusting and enabling human ingenuity and spirit to solve local problems with local solutions. Federal level solutions are not going to come out of nowhere to save us. The right solution won't look the same in every state and every city. The war will be won by winning each local battle -- but local battles don't have to be won alone. We will win the local battles by building cohesion where the battle lines meet and ensuring every locality has access to the information and resources they need to save lives.", "url": "https://www.cnn.com/2020/04/09/opinions/lessons-for-coronavirus-mcchrystal-mcauliffe-opinion/index.html"}