{"authors": [], "date_download": "2020-05-04 20:24:46", "date_modify": "2020-05-04 20:24:46", "date_publish": "2020-04-14 21:38:02", "description": "BISMARCK, N.D. (AP) — A top state oil regulator estimates that North Dakota producers have idled thousands of wells — amounting to more than a quarter of the oil wells in the state — as the U.S....", "filename": "_b55e153bebdce5000a627b2eddefc5d3_1588623886.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b55e153bebdce5000a627b2eddefc5d3_1588623886.html", "title": "Regulator: Thousands of North Dakota oil wells idled", "title_page": "Regulator: Thousands of North Dakota oil wells idled", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "BISMARCK, N.D. (AP) — A top state oil regulator estimates that North Dakota producers have idled thousands of wells — amounting to more than a quarter of the oil wells in the state — as the U.S. oil industry crashed during the coronavirus outbreak.\nState Mineral Resources Director Lynn Helms said Tuesday that companies have shut 4,600 wells since the start of March. The idled wells account of about 260,000 barrels per day of oil, The Bismarck Tribune reported.\nOperators are temporarily idling wells that produce smaller quantities of oil, in addition to wells that flare large amounts of natural gas.\nHelms said oil industry estimates indicate even more rigs will stop drilling for oil in North Dakota. He said the rig count could bottom out at 50% to 75% below pre-pandemic levels. On Tuesday, 33 rigs were active in North Dakota, down 18 from the March average.\n“We’ve lost about 40% of our drilling rigs in just three or four short weeks,” Helms said.\nSeveral businesses are considering building large tank farms to store oil while prices are low, he said.\nCompanies might build storage tank farms next to existing facilities they operate, such as a saltwater disposal well or a waste treating plant, Helms said. When prices increase, the operators of those sites could later sell the oil for a profit, he said,\nBefore the pandemic devastated the U.S. oil industry, daily oil production in North Dakota rose slightly in February, regulators said.\nAccording to the Department of Mineral Resources, North Dakota produced an average of 1.45 million barrels of oil daily in February. That’s up 1% from 1.43 million barrels a day in January.\nNatural gas production in North Dakota slipped in February. The state produced nearly 90 billion cubic feet of natural gas in February, down from 93.6 billion cubic feet in January. But daily natural gas production of 3.1 billion cubic feet in February was a record.\nStatewide, companies flared 13% of all gas produced in February, above the 12% target.\nThere were 16,118 wells producing in February, up from 16,014 in January.", "url": "https://apnews.com/b55e153bebdce5000a627b2eddefc5d3"}