{"authors": ["Maegan Vazquez"], "date_download": "2020-05-04 17:03:22", "date_modify": "2020-05-04 17:03:22", "date_publish": "2020-04-10 21:43:36", "description": "US Surgeon General Dr. Jerome Adams on Friday laid out how communities of color are disproportionately impacted by the coronavirus pandemic, previewing how the Trump administration plans to assist them specifically.", "filename": "2020_04_10_politics_jerome-_505f1b68ccfbd7075874e5539de1e336_index_1588611802.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410143642-jerome-adams-asthma-inhaler-0410-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_jerome-_505f1b68ccfbd7075874e5539de1e336_index_1588611802.html", "title": "Surgeon general explains how coronavirus disproportionately affects people of color", "title_page": "Surgeon general explains how coronavirus disproportionately affects people of color - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) US Surgeon General Dr. Jerome Adams on Friday laid out how communities of color are disproportionately impacted by the coronavirus pandemic , previewing how the Trump administration plans to assist them specifically.\n\"The chronic burden of medical ills is likely to make people of color less resilient to the ravages of Covid-19 and it is possibly, in fact, likely, that the burden of social ills is also contributing,\" Adams said during a White House press briefing.\nAdams has previously described how his own health issues represent a \"legacy of growing up poor and black in America.\" During Friday's briefing, he pulled out his inhaler, which he said he's carried around for 40 years, \"out of fear of having a fatal asthma attack.\"\nIt's long been known that black Americans and Hispanic Americans are more likely to suffer from chronic health conditions that can detrimentally impact how their bodies handle an additional illness. These minority communities also have less access to health care.\nAnd early data suggest that a racial disparity has been playing out in the outcomes of coronavirus patients, with data from coronavirus deaths in Louisiana, Illinois, Michigan and New Jersey showing African Americans make up a higher percentage of the victims.\nIn Maryland, race also appears to be having an impact on the outcomes of residents infected by the coronavirus.\nRecently released data from the Maryland Department of Health show that the rate of coronavirus infections and deaths is higher among African Americans than whites or other groups, according to the Baltimore Sun\nAnd Prince George's County Executive Angela Alsobrooks said on public radio's \"Kojo Nnamdi Show\" Friday that the county in Maryland she represents -- which is the most affluent, predominantly African American county in the country -- has struggled with its health care system and getting access to healthy foods.\n\"The coronavirus is indiscriminate. It does not know race. What it knows instead is chronic medical conditions,\" Alsobrooks said, adding that those conditions are more frequently seen \"in poor people, black and brown people who have generally had disproportionate shares of it because of the health care systems in this country.\"\nDescribing how social outcomes can have an impact on health outcomes, Adams also pointed out how people of color are more likely to live in densely populated areas, are more likely to live in multi-generational housing and are less likely to work in jobs that allow them to work remotely.\n\"In summary, people of color experience ... likely exposure to Covid-19 and increased complications from it,\" Adams said. \"But let me be crystal clear: We do not think people of color are biologically or genetically predisposed to get Covid-19. There is nothing inherently wrong with you.\"\nAdams said the administration is \"taking steps now\" to reach and strengthen communities of color.\n\"More details will be forthcoming, but we are actively working ... (on it through) data collection, targeted outreach to communities of color and increasing financial, employment, education, housing, social and health supports so that everybody has an equal chance to be healthy,\" he said.\nCenters for Medicare and Medicaid Administrator Seema Verma announced on Tuesday that her agency will be using Medicare data to analyze how race may play a factor into the health outcomes of coronavirus patients.\n\"Going forward, we now have a code for coronavirus, so we can actually stratify by demographic information. So we can look at race as a factor,\" Verma said.\nBut asked during Friday's briefing why a minority public health effort like this didn't exist prior to the coronavirus pandemic, given that the disparities have existed for such a long time, President Donald Trump pivoted to what he's done for the economic outcomes of minority communities.\n\"One of the things I'm most proud of is what I've been able to do for the African American community. The lowest job numbers in the history of our country,\" Trump said, adding that they've also had \"better health care than they've ever had before.\"\nAdams on Friday also underscored how important it is for these communities to follow the administration's social distancing guidelines and to refrain from drug, tobacco and alcohol abuse.\n\"We need you to do this, if not for yourself, then for your abuela. Do it for your granddaddy. Do it for your big mama. Do it for your pop pop,\" Adams said.\nAsked later if that language was offensive, Adams said: \"We need targeted outreach to the African American community and I use the language that is used in my family. I have a Puerto Rican brother-in-law. I call my granddaddy, 'granddaddy'. I have relatives who call their grandparents 'big mama'. So, that was not meant to be offensive.\"\nAdams also said that it was \"absolutely\" important for all Americans to refrain from substance abuse.", "url": "https://www.cnn.com/2020/04/10/politics/jerome-adams-minority-communities-coronavirus/index.html"}