{"authors": [], "date_download": "2020-05-04 16:26:35", "date_modify": "2020-05-04 16:26:35", "date_publish": "2020-04-07 15:03:55", "description": "Stay home. Wash your hands. Don't click that link. As the coronavirus pandemic continues to sweep across the world, consumers have yet another thing to worry about: scammers.", "filename": "2020_04_07_cnn-underscored_coronavirus-fraud_index_1588609595.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406160701-coronavirus-scams-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_cnn-underscored_coronavirus-fraud_index_1588609595.html", "title": "How consumers can protect themselves from coronavirus scams", "title_page": "Coronavirus fraud: How consumers can protect themselves from scams - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Stay home. Wash your hands. Don't click that link. As the coronavirus pandemic continues to sweep across the world, consumers have yet another thing to worry about: scammers.\nThe Federal Trade Commission has had nearly 8,000 fraud reports from consumers related to the virus since the beginning of the year, with reported losses totaling $4.77 million. Security experts say cybercriminals and slimy marketers are taking advantage of the global crisis to peddle bogus products and services to frightened consumers, hack people's personal information, and even blackmail people for direct payments. Following news of the government's $2 trillion rescue package, scammers are also working hard to get their hands on people's $1,200 stimulus checks — desperately needed by those who've recently lost their jobs.\nIt's easy to get swindled in the current climate, according to Aaron Foss, founder of the popular robocall-blocking service Nomorobo. He says anxiety and uncertainty surrounding both treatment and government assistance have created a field day for scammers. \"With all of the confusion around the mobilization efforts, you really don't know what to believe,\" Foss says. \"With everyone in social isolation, many, many more people are at home, especially seniors. Lots of people [are] terrified and looking for help.\"\nThat means it's vital that consumers learn to protect themselves and vulnerable family members from coronavirus scams — and we're here to help. We've compiled a checklist you can use to spot scammers and keep yourself safe. For more information on what specific scams look like and what's being done to stop them, keep reading.\nWhat kind of scams should consumers be aware of?\nAccording to a recent FTC press release, \"The top categories of coronavirus-related fraud complaints include travel and vacation related reports about cancellations and refunds, reports about problems with online shopping, mobile texting scams, and government and business imposter scams.\"\nThe cybersecurity company Sophos has also identified an exponential surge in coronavirus email scams since January, with campaigns including extortion schemes \"threatening to infect the target's family with COVID-19 if they didn't pay,\" fake World Health Organization fundraising pleas, and a \"sales pitch for a $37 video download, purporting to offer insider information from a 'military source' on how to survive Coronavirus.\"\nSome scammers are saying they can help people reserve a spot in line for treatment — for an upfront payment, of course. Others, Foss says, are offering supposedly free supplies with the catch that there's \"some sort of shipping or handling charge and the victim needs to provide their credit card number to pay it.\" Some of the most egregious examples Foss provided include calls claiming to offer free tests for Medicare members and offers from a \"Biohazard Deep Cleaning Agency\" to \"test the level of the germs and viruses\" in people's homes. The products and services, of course, never appear.\nSophos principal research scientist Paul Ducklin told CNN that scammers may also \"offer you substandard items that you really shouldn't buy, sell you on items or investments that are totally bogus, trick you into paying debts you don't owe, [and] scare you into paying for a service you don't need.\"\nWhat's being done?\nThe FTC has released tips for consumers (complete with a bingo card to help people recognize when they're being swindled), and is also cracking down on deceptive advertising and robocalls. It's issued warnings to a growing list of companies for allegedly selling products \"by making deceptive or scientifically unsupported claims about their ability to treat or cure coronavirus.\" It's also warned nine internet phone companies against \"assisting and facilitating\" illegal telemarketing calls, and sent joint letters with the Federal Communications Commission to three companies, warning them against \"routing and transmitting illegal coronavirus-related robocalls.\" The FTC and Nomorobo have also listed recordings of \"scammy calls\" related to the virus to help consumers learn what to recognize.\nA slap on the wrist can only go so far, though, and scammers are evolving along with the news cycle. Plus, Ducklin adds, other scams haven't just up and disappeared in the wake of the virus. \"It would be a crushing irony,\" he says, \"if fear of coronavirus-specific scams meant people took their eyes off all the other scams out there and therefore starting falling for those more readily.\"\nAll that's to say that it's ultimately up to consumers to protect themselves by staying vigilant and skeptical of websites, calls and emails related to the virus. There are also specific actions you can take to reduce the likelihood of being scammed, which we've outlined below.\nHow to protect yourself from online seller scams\n1. Research sellers before making a purchase. The FTC warns, \"Online sellers may claim to have in-demand products, like cleaning, household, and health and medical supplies when, in fact, they don't.\" That means that when shopping with an unfamiliar seller, including Amazon third-party sellers, it's a good idea to run an internet search for the company or individual's name alongside keywords like \"review,\" \"complaint,\" or \"scam.\" It's best to interact only with sellers and businesses you know and trust. Foss also adds the simple rule: \"Never buy anything from someone who calls you on the phone.\"\n2. Don't buy into hype. Remember that there are no treatments or preventives for Covid-19 currently approved by the US Food and Drug Administration, according to the Centers for Disease Control and Prevention, and there are no bona fide at-home test kits or vaccinations for sale. Any product claiming otherwise is lying and may be violating federal law.\n3. Don't use payment shortcuts. Ducklin advises people never to make payments or log into company websites \"via links in emails or texts.\" Instead, \"If you need to pay a company online, reach the payment page by following your own research, or using a link from a document you already have, such as a contract or a recent bill. Don't get begged, cajoled or frightened into taking exactly the 'short cut' the crooks want and visiting their fake site instead of the real one.\" Take your time, Ducklin insists: \"Even if it takes a few more clicks, it's time well spent because you will automatically miss out on fake logins on bogus sites that could compromise your security.\"\n4. Do pay by credit card, and always keep a record of the transaction. Don't wire someone money, and don't send payments to people you don't know through apps like Zelle that don't offer the same fraud protections as credit cards.\n5. Don't click links or download attachments from unknown senders. Ducklin says that scammers may try to \"persuade you to install a program or open a file that will harm your computer\" or \"drive you to a fake website where they capture passwords and personal data.\" Even simply clicking a link can infect your computer with malware, meaning that you should \"avoid opening unexpected or unsolicited email attachments if you can,\" and that if \"a document asks you to [enable content] when you open it, or make some other security downgrade, don't do it — it's a trick.\"\n6. Stay in charge. Finally, Ducklin says, \"never give unsolicited callers remote access to your computer, no matter how much they threaten to 'fine' you or cut you off from the internet, and even if they claim to be Microsoft or the police.\"\nHow to protect yourself from stimulus check scams\n1. Hang up. Delete the email. Don't respond. The IRS will never call you demanding immediate payment, nor will it threaten to get local law enforcement or immigration officers involved should you fail to comply with such a demand. Likewise, banks will never ask for personal information via phone or email. Don't respond to these emails, and hang up on calls.\n2. Be patient. Remember that the government is still working out the details and that the vast majority of people don't need to do anything to receive their stimulus checks. If you've filed taxes in the past two years, the IRS already has the information it needs. No one is receiving the money early, and anyone who claims that they can help you get your money sooner for a fee is lying.\n3. Keep calm. Framing such requests as urgent or demanding that you \"act now\" are just ways for scammers to scare you into acting irrationally. Don't fall for it. Says Ducklin, \"Never feel forced to react to emails that unsettle you, and always hang up immediately if you receive threatening phone calls, especially if they claim to be offering technical support to 'fix' a problem that you didn't ask for help with.\"\n4. Be suspicious of unknown numbers. Foss understands that it's probably not practical to expect people to ignore any unfamiliar calls during this time of uncertainty. \"I know a lot of people recommend not picking up numbers you don't recognize,\" he says, \"but I think that's bad advice, especially now. Are you not going to answer every call if you're waiting for your test results? Instead, I suggest that everyone be suspicious if it's a number you don't recognize.\"\nWhat to do if you get scammed\nIf you do get sucked in, all is not necessarily lost. \"Don't delay calling your financial institution,\" Ducklin says. \"If you put your card details into a website and then realize you shouldn't have, the sooner you act, the less time the crooks have to sell your card details on. (Use the number on the back of your card.)\"\nAnd finally, do report scams you come across — but do so in a way that actually makes a difference. \"Now, more than ever,\" says Foss, \"traditional advice is pretty ineffective. Reporting robocallers to the FTC or the police just wastes time and resources.\" But Ducklin adds, \"Even if law enforcement can't help you right now, your report could help someone else in the future. In the US, start at the Internet Crime Complaint Center.\"", "url": "https://www.cnn.com/2020/04/07/cnn-underscored/coronavirus-fraud/index.html"}