{"authors": [], "date_download": "2020-05-04 20:12:51", "date_modify": "2020-05-04 20:12:51", "date_publish": "2020-04-06 20:26:05", "description": "COLUMBIA, S.C. (AP) — South Carolina freshman Aliyah Boston has won the Lisa Leslie Award given to the top center in women’s college basketball. Other winners in the Naismith Starting Five...", "filename": "_5bba09174a485aea16e786abe863ef7c_1588623171.html", "image_url": "https://storage.googleapis.com/afs-prod/media/a8fd3efc829a4b9081354bdc28b9a7cb/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_5bba09174a485aea16e786abe863ef7c_1588623171.html", "title": "Gamecocks’ Boston wins Leslie Award as nation’s best center", "title_page": "Gamecocks’ Boston wins Leslie Award as nation’s best center", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Arkansas' Chelsea Dungee (33) shoots while defended by South Carolina's Aliyah Boston (4) during a semifinal match at the Southeastern Conference women's NCAA college basketball tournament in Greenville, S.C., Saturday, March 7, 2020. (AP Photo/Richard Shiro)\nArkansas' Chelsea Dungee (33) shoots while defended by South Carolina's Aliyah Boston (4) during a semifinal match at the Southeastern Conference women's NCAA college basketball tournament in Greenville, S.C., Saturday, March 7, 2020. (AP Photo/Richard Shiro)\nCOLUMBIA, S.C. (AP) — South Carolina freshman Aliyah Boston has won the Lisa Leslie Award given to the top center in women’s college basketball.\nOther winners in the Naismith Starting Five announced Monday by the Basketball Hall of Fame and Women’s Basketball Association included Oregon’s Sabrina Ionescu as the Nancy Lieberman Point Guard of the Year, Arizona’s Aari McDonald as the Ann Meyers Drysdale Shooting Guard of the Year, Oregon’s Satou Sabally as the Cheryl Miller Small Forward of the Year, and Oregon’s Ruthy Hebard as the Katrine McClain Power Forward of the Year.\nThe 6-foot-5 Boston became the second South Carolina center in three seasons to earn the Lisa Leslie Award, joining 2018 winner A’ja Wilson.\nBoston was the Southeastern Conference freshman and defensive player of the year. She averaged 12.5 points and 9.4 rebounds per game this season while setting a South Carolina freshman mark with 86 blocked shots.\nBoston helped the Gamecocks win the SEC regular season and tournament titles. The team went 32-1 and ended the COVID-19-shortened season ranked No. 1 in the country.", "url": "https://apnews.com/5bba09174a485aea16e786abe863ef7c"}