{"authors": ["Opinion David Gergen", "James Piltch"], "date_download": "2020-05-04 16:22:29", "date_modify": "2020-05-04 16:22:29", "date_publish": "2020-04-06 12:19:30", "description": "David Gergen and James Piltch argue that, in the fight against the coronavirus pandemic, President Trump could learn from former wartime presidents -- most notably Franklin D. Roosevelt, who oversaw the US's mobilization during World War II.", "filename": "2020_04_06_opinions_coronav_463c95e5255b45ac8a220d7074240a7d_index_1588609349.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/120427013603-gergen-fdr-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_coronav_463c95e5255b45ac8a220d7074240a7d_index_1588609349.html", "title": "The wartime president who Trump should learn from", "title_page": "The wartime president who Trump should learn from - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "David Gergen has been a White House adviser to four presidents and is a senior political analyst at CNN. A graduate of Harvard Law School, he is a professor of public service at the Harvard Kennedy School, where he founded the Center for Public Leadership. James Piltch is Gergen's chief research assistant. His writing on civic life and education has appeared in The Washington Post, The Boston Globe, and The Chronicle of Higher Education. The opinions expressed in this commentary are those of the authors. View more opinion on CNN.\n(CNN) Since declaring war against the coronavirus, President Donald Trump and his team have struggled to exercise effective, consistent leadership against an invisible enemy. On some days, Trump seems to listen to his health experts and understand the gravity of the situation. On other days, he reverts to narcissism, erratic decisions and petty fights.\nDavid Gergen\nJames Piltch\nTo steady the ship, the President should look to his predecessors and apply the lessons of leadership from American history. Surely, there is no better source of wisdom than former President Franklin D. Roosevelt, who oversaw the US's mobilization during World War II.\nIn 1940, President Roosevelt was publicly committed to staying out of the war raging in Europe and Asia, even though he understood the growing danger of Adolf Hitler and knew America would likely be sucked into the fight. He also knew that the US was woefully unprepared. Its army was pitifully inadequate -- with only about 180,000 servicemen, it was smaller than Portugal's -- and the US simply didn't have the manufacturing capacity to arm itself, let alone other friendly nations, too.\nEven so, FDR thought the US simply could not wait; it could hope for the best but needed to prepare for the worst. That is why he declared that America would become \"an arsenal of democracy\" and promised to help provide military supplies to the United Kingdom in the fight against Nazi Germany. FDR publicly set a goal to manufacture 50,000 planes a year -- even though the US military produced less than 6,000 in 1939. Experts scoffed, but FDR believed that the US could do damn near anything when it pulled together.\nRoosevelt turned to the American private sector and found others to lead the charge with him. William Knudsen, the president of General Motors at the time, was well versed in mass production and turned his expertise toward manufacturing armaments. Soon, with FDR's blessing, Knudsen went to other companies and began to pull in those that wanted to work with the government. It didn't take long before more than 900 companies came on board in the war effort.", "url": "https://www.cnn.com/2020/04/06/opinions/coronavirus-covid-wartime-president-trump-roosevelt-gergen-piltch/index.html"}