{"authors": [], "date_download": "2020-05-04 20:04:46", "date_modify": "2020-05-04 20:04:46", "date_publish": "2020-04-07 21:09:11", "description": "GALVESTON, Texas (AP) — The U.S. Coast Guard has determined that crew members on cruise ships and vessels in Galveston present a public health risk of spreading the new coronavirus and urged...", "filename": "_08974871da55ab268000d9af3008f8a3_1588622686.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_08974871da55ab268000d9af3008f8a3_1588622686.html", "title": "Coast Guard orders cruise companies to form medical plans", "title_page": "Coast Guard orders cruise companies to form medical plans", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "GALVESTON, Texas (AP) — The U.S. Coast Guard has determined that crew members on cruise ships and vessels in Galveston present a public health risk of spreading the new coronavirus and urged operators to form medical plans to care for sick workers.\nIn letters sent Friday to Royal Caribbean Cruises and Carnival Cruise Line, Coast Guard Capt. K.D. Oditt said the vessels’ crews pose “an unacceptable risk” of spreading COVID-19, the illness caused by the new coronavirus.\n“I have determined your vessel poses an unacceptable risk of medical emergency due to the inherent and high probability of transmission of COVID-19 aboard, which presents a risk to the safety of the personnel aboard your vessel, first responders and the port,” Oditt wrote.\nTwo Carnival Cruise Line and two Royal Caribbean Cruises ships have been at the Port of Galveston since March 13 as they wait for business to return, the Galveston County Daily News reported Tuesday.\nNo passengers are on the ships, but they carry thousands of workers.\nThe companies must prepare to treat sick workers on the ships and plan to bring the critically ill to medical facilities, according to the letter.\nThe Coast Guard also directed the companies to identify medical facilities that would take in people who get evacuated from ships. Oditt urged the companies to arrange for private, commercial resources to take sick workers and care for them.\nThe companies confirmed to the newspaper that they received the orders, and they’re complying. Not following the Coast Guard’s orders could lead to fines of up to $25,000 or Class D felony charges, the letter says.\nThe Coast Guard is also requiring cruise ships to notify it of passengers who display flu-like symptoms and of attempts to evacuate critically ill people.\nRoyal Caribbean said last month that two crew members aboard Liberty of the Seas got infected with the coronavirus. One was evacuated from the ship, but the other was left aboard and isolated, officials said.\nMeanwhile, the number of coronavirus cases and deaths continued to grow in Texas, with more than 8,200 infections and 154 deaths, state officials said Tuesday.\nIn Texas, more than 8,200 people tested positive for the virus, state officials said Tuesday , while 154 have died.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause death or severe illness, including pneumonia.", "url": "https://apnews.com/08974871da55ab268000d9af3008f8a3"}