{"authors": ["Lauren Fox", "Jeremy Herb"], "date_download": "2020-05-04 17:03:13", "date_modify": "2020-05-04 17:03:13", "date_publish": "2020-04-10 20:43:32", "description": "The US Postal Service is giving Congress a dire warning, telling lawmakers in a video briefing this week that the agency will \"run out of cash\" by the end of September if Congress does not step in with financial assistance.", "filename": "2020_04_10_politics_postal-service-congress-help_index_1588611793.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200316110132-post-office-package-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_postal-service-congress-help_index_1588611793.html", "title": "US Postal Service warns Congress it could become insolvent amid coronavirus", "title_page": "US Postal Service warns Congress it could become insolvent amid coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US Postal Service is giving Congress a dire warning, telling lawmakers in a video briefing this week that the agency will \"run out of cash\" by the end of September if Congress does not step in with financial assistance.\nAccording to Democrats on the House Oversight Committee, Postmaster General Megan Brennan warned lawmakers Thursday that in light of the global pandemic, the Postal Service believes they will see a \"$13 billion revenue loss\" this year with projections that coronavirus could cost the agency another $54 billion over the next decade.\n\"The Postal Service was technically insolvent to begin with, but the pandemic has completely changed the environment here. The mail volume drop is catastrophic,\" said Rep. Gerry Connolly, a Virginia Democrat and the chairman of the oversight subcommittee that oversees the USPS.\nThe threat to the US mail system caused by coronavirus and the resulting economic downturn has prompted the Postal Service to ask Congress for a $75 billion boost to help keep it afloat as hundreds of thousands of mail carriers and postal workers continue working during the pandemic. House Democrats say the postal service is asking for $25 billion in direct funding, another $25 billion in \"unrestricted borrowing authority from Treasury\" and $25 billion in grants to help \"modernize\" the post office.\nBut the fight over funding the Postal Service isn't likely to be resolved anytime soon, even as lawmakers look for ways to prop up industries across the economy. The battle lines between Republicans and Democrats on funding the Postal Service remain entrenched, and an effort to give the agency a cash infusion in the last $2.2 trillion stimulus package fell flat.\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/postal-service-congress-help/index.html"}