{"authors": ["John Wawrow", "Stephen Whyno"], "date_download": "2020-05-04 20:24:00", "date_modify": "2020-05-04 20:24:00", "date_publish": "2020-04-06 18:24:05", "description": "Shorts and skates don’t usually mix. Maintaining NHL-quality ice in August or holding a Stanley Cup Final in September? Those are far from the norm, too. With the NHL playoffs, which were...", "filename": "_50c7e3f35d92c7fa79e884185e986014_1588623840.html", "image_url": "https://storage.googleapis.com/afs-prod/media/94cd6d6bbc74436b9a44f8c7becd9456/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_50c7e3f35d92c7fa79e884185e986014_1588623840.html", "title": "NHL playoff scenarios run the gamut of where, when and how", "title_page": "NHL playoff scenarios run the gamut of where, when and how", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NHL playoff scenarios run the gamut of where, when and how\nFILE - In this April 10, 2019, file photo, New York Islanders players take the ice as a man holds a makeshift Stanley Cup prior to Game 1 of an NHL hockey first-round playoff series against the Pittsburgh Penguins in Uniondale, N.Y. (AP Photo/Julio Cortez, FIle)\nFILE - In this April 10, 2019, file photo, New York Islanders players take the ice as a man holds a makeshift Stanley Cup prior to Game 1 of an NHL hockey first-round playoff series against the Pittsburgh Penguins in Uniondale, N.Y. (AP Photo/Julio Cortez, FIle)\nShorts and skates don’t usually mix. Maintaining NHL-quality ice in August or holding a Stanley Cup Final in September? Those are far from the norm, too.\nWith the NHL playoffs, which were to begin Wednesday, on indefinite hold because of the coronavirus pandemic, anything and everything is on the table if Commissioner Gary Bettman’s objective to complete the season is to be realized.\nWhat the format will be, when play might realistically resume and whether the NHL might require games at neutral sites — how’s North Dakota sound? — is anyone’s guess.\n“Those are all fair questions but not ones that we have to resolve right away,” NHL Deputy Commissioner Bill Daly told The Associated Press by email, likening the situation for the league to a “a multi-faceted puzzle.”\nOver the weekend, the governors of New York and California both tamped down President Donald Trump’s hope of sports resuming in August. New York Gov. Andrew Cuomo said: “I would love to see sports back to help with cabin fever. … But this is not about hopes and dreams and aspirations and what you would like to see.”\nThe NHL, which postponed play March 12, has several times pushed back its self-quarantine guideline — it’s now April 15 — before players can even think about reporting to team facilities. The date is expected to be extended again.\nWherever and whenever the Stanley Cup is awarded, one thing will still hold true as far as Pittsburgh general manager Jim Rutherford is concerned.\n“Whoever wins it, it is going to feel the same whenever they win it, on whatever day they win it, as it would winning it normally in the middle of June,” Rutherford said.\nThe latest the Cup has ever been awarded is June 24, in 1995 and 2013, with both instances following lockout-shortened seasons. The pandemic, however, has no timetable.\nThat leads to questions over whether the NHL will have time to squeeze in any of the remaining 189 regular-season games to determine seedings, or skip directly to the playoffs based on the current standings, be it based on total points or points percentages.\nIn the percentage scenario, the ninth-place New York Islanders would have the edge over the eighth-place Columbus Blue Jackets in the Eastern Conference. In the West, seventh-place Winnipeg would be the odd team out with Vancouver in.\nOther possibilities include expanding the playoff format to take into account the uneven amount of games teams have played.\nThe various formats led to amusing exchanges between players during recent video calls.\n“I’d rather start the playoffs right away,” said Alex Ovechkin, whose Washington Capitals lead the Metropolitan Division. He then laughed and said, “Sorry guys,” referring to the other three players on the call.\n“Don’t say sorry to me,” Blue Jackets captain Nick Foligno said. “We’re in a playoff spot.”\nNew Jersey defenseman P.K. Subban proposed a 31-team format — every team in the league — which might be the only way the Metropolitan’s last-place Devils qualify.\nOthers raised the need to play as many regular-season games as feasible to preserve the integrity of the playoffs, as well as a need to re-acclimate to the speed and intensity of the action.\nThe need for tune-up games was not lost on Oilers captain Connor McDavid. Edmonton faces the prospect of opening the playoffs against Calgary — a rivalry that featured several penalty-filled regular-season matchups already this season.\n“I don’t think you can just step into the playoffs, Game 1, have Calgary come to Edmonton and guys just run around and kill each other and haven’t played a game in two months,” McDavid said.\nFlames captain Mark Giordano noted the playoffs would be additionally competitive because teams would feature healthy rosters, given the amount of time players have had to rest and recover.\nAnd don’t forget the goalies.\n“You can train and practice and stuff, but when you get to camp, I find the NHL shot and speed of the game is something you have to catch up on,” Vegas goaltender Marc-Andre Fleury said. “It would be nice to have a few to get back in touch.”\nFoligno raised a concern over the number of games some players might have to play over a calendar year should the playoffs stretch into September, and the following season being a month or two later.\n“You’ve got to think about the longevity of guys’ careers and their health as well,” Foligno said. “Any idea is worth it at this point. But we’ve got to think about how we’re going to go ahead here and smartly both on the business side and the health side.”\nWith the pandemic affecting regions of the continent at different times, the NHL is also considering having playoff games played at neutral sites. Sportsnet.ca reported over the weekend that North Dakota has been mentioned as a potential site.\nA person familiar with discussions told the AP the Buffalo Sabres’ two-rink downtown practice facility, and connected to their home arena and full-service hotel, has also been mentioned among the numerous options raised. The person spoke on the condition of anonymity because the talks are private.\nThe Sabres sit 13th in the East and aren’t expected to qualify under most playoff scenarios.\nJets coach Paul Maurice was on board for any scenario, so long as it meant providing fans a distraction.\n“God, it’d be playoffs with fresh hockey players and it’d be pretty darn exciting,” Maurice said Monday. “We’d play anywhere.”\n___\nAP Sports Writer Will Graves contributed to this report.\n___\nFor more AP NHL coverage: https://apnews.com/NHL and https://twitter.com/AP_Sports", "url": "https://apnews.com/50c7e3f35d92c7fa79e884185e986014"}