{"authors": ["Steve Reed"], "date_download": "2020-05-04 20:24:08", "date_modify": "2020-05-04 20:24:08", "date_publish": "2020-04-20 21:55:51", "description": "CHARLOTTE, N.C. (AP) — With the Panthers in the midst of a roster overhaul, Christian McCaffrey could have forced his way out of Carolina in hopes of finding a team better prepared to challenge...", "filename": "_499bc2995c1d9fd4b0beff9f06852e0d_1588623848.html", "image_url": "https://storage.googleapis.com/afs-prod/media/37b7236887f64b068410e6e2505a640c/2815.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_499bc2995c1d9fd4b0beff9f06852e0d_1588623848.html", "title": "McCaffrey embracing new role as face of Panthers franchise", "title_page": "McCaffrey embracing new role as face of Panthers franchise ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Dec. 22, 2019, file photo, Carolina Panthers' Christian McCaffrey runs during the second half of an NFL football game against the Indianapolis Colts, in Indianapolis. McCaffrey's versatility and superb statistics helped him to a rare double: The Carolina Panthers running back has made The Associated Press NFL All-Pro Team at two positions. (AP Photo/Michael Conroy, File)\nFILE - In this Dec. 22, 2019, file photo, Carolina Panthers' Christian McCaffrey runs during the second half of an NFL football game against the Indianapolis Colts, in Indianapolis. McCaffrey's versatility and superb statistics helped him to a rare double: The Carolina Panthers running back has made The Associated Press NFL All-Pro Team at two positions. (AP Photo/Michael Conroy, File)\nCHARLOTTE, N.C. (AP) — With the Panthers in the midst of a roster overhaul, Christian McCaffrey could have forced his way out of Carolina in hopes of finding a team better prepared to challenge for a Super Bowl title.\nBut the All-Pro running back said that notion never crossed his mind.\nInstead, he signed a four-year, $64 million contract extension last week that makes him the NFL’s highest-paid running back and the face of the Panthers franchise now that quarterback Cam Newton and linebacker Luke Kuechly are gone.\n“I never focused on signing somewhere else — it never occurred to me,” McCaffrey said during a video conference call Monday. “I want to be in Carolina for my whole career. ... I bought a place in Charlotte. I love the Carolinas more than anything in the world. It is somewhere I would like to call home forever.”\nMcCaffrey, who turns 24 in June, will be playing for a new coach in Matt Rhule, catching passes from a different quarterback in Teddy Bridgewater and running behind a revamped offensive line in 2020, if the season proceeds as scheduled amid the coronavirus pandemic.\nThe changes don’t seem to bother him.\n“There is change that goes on in the NFL all of the time,” McCaffrey said. “You look around the league and see what’s happening. You look at some of the great players of all time and the teams they have gone to. You can stay close friends with people and build great relationships but if you stay attached it’s tough, because it a revolving door. It’s such a business.”\nHe earned the contract extension after becoming only the third player in NFL history to record 1,000 yards rushing and receiving in a single season.\nMcCaffrey is the first player in league history to eclipse 2,500 yards in both categories in his first three seasons. The elusive playmaker already has scored 29 touchdowns.\nThe Panthers are counting on McCaffrey to be the “centerpiece of the offense,” according to Rhule.\n“To hear that from coach means a lot,” McCaffrey said. “It shows that he has faith in me and the front office has faith in me and I really appreciate that.”\nThe money helps too.\n“It shows that I am on a team whose owners and front office believe in me the way that I believe in myself,” McCaffrey said.\nMcCaffrey said he’s been impressed with new offensive coordinator Joe Brady, who helped LSU win a national championship last season behind likely No. 1 overall draft pick Joe Burrow.\nHe said Brady has a “unique mind” for designing an offense.\nMcCaffrey got to know Rhule and Brady a little better on Monday as the Panthers began their virtual offseason program with a series of video conference meetings between players and coaches.\nMcCaffrey attended the meetings from his parents’ home in Colorado, where he is waiting out the coronavirus pandemic with his family and his girlfriend. He’s been catching passes from his younger brother Luke, a quarterback at Nebraska. He loaded up on weights after the virus hit and has a football field nearby where he can train.\nHe wants do everything he can to make sure Carolina’s rebuilding process is a quick one despite an uncertain offseason.\n“We can’t make excuses for ourselves because we are talking over a camera,” McCaffrey said.\nAsked about the possibility of the NFL playing games this season in empty stadiums, McCaffrey said, “If that’s what we have to do, then that’s what we have to do.”\n___\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL", "url": "https://apnews.com/499bc2995c1d9fd4b0beff9f06852e0d"}