{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:57:40", "date_modify": "2020-05-04 16:57:40", "date_publish": "2020-04-09 14:41:06", "description": "Bernie Sanders made the unthinkable seem possible, briefly -- that a democratic socialist could capture a major US party nomination. But in the the end, Democrats didn't want his \"revolution.\"", "filename": "2020_04_09_world_meanwhile-in-america-april-9_index_1588611460.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200315205900-29-cnn-debate-0315-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_world_meanwhile-in-america-april-9_index_1588611460.html", "title": "Goodbye, Bernie Sanders", "title_page": "Goodbye, Bernie Sanders - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "This analysis was excerpted from the April 9 edition of CNN's Meanwhile in America, the daily email about US politics for global readers. Click here to read past editions and subscribe.\n(CNN) Bernie Sanders made the unthinkable seem possible, briefly -- that a democratic socialist could capture a major US party nomination. But in the the end, Democrats didn't want his \"revolution.\"\nThe Vermont senator, who folded his Democratic campaign Tuesday , built a vibrant progressive movement advocating the biggest role for the state since the 1960s, in health care, education, business and environmental policy. He gave voice on the left, as Donald Trump did on the right, to voters alienated by globalization and the school of free market economics defined by Ronald Reagan and Margaret Thatcher.\nSanders ran against what he branded as corrupt party elites, thrilling northern liberals and younger voters. But rival Joe Biden's victory suggests that the 'establishment' remains the party's best hope of winning in November, uniting votes from African Americans, working class whites, suburban women and more educated voters. Moderates and not liberals took back the House for Democrats in the 2018 midterms, so party leaders will be relieved Sanders is out.\nThat's not to say Sanders didn't change the party. Democrats need his millions of voters to embrace Biden, if they are to beat Donald Trump. So, a Biden administration would likely be slightly more liberal on issues like financing college, providing health care and reining in Wall Street excess than the Obama White House.\nThough a terse and rumpled character, there is no doubting the sincerity of Sanders' lifelong beliefs. As he shuffles out of the race, taking his Brooklyn-accented speeches on millionaires and billionaires with him, he may find satisfaction that his principles have fresh resonance. One outcome of the coronavirus pandemic will likely be a reinvigorated role for the state in taking care of the common welfare of the people. It might not go as far as Sanders might like, but that's his campaign in a nutshell.\nNo one points a finger like Bernie Sanders. Farewell to the Vermonter and his tireless finger jabs. (Which you can still catch in the Senate, if it ever reopens.) Above, Sanders at a campaign rally on March 8 in Ann Arbor, Michigan.\n'Not me, Us'", "url": "https://www.cnn.com/2020/04/09/world/meanwhile-in-america-april-9/index.html"}