{"authors": ["Christina Maxouris"], "date_download": "2020-05-04 16:56:57", "date_modify": "2020-05-04 16:56:57", "date_publish": "2020-04-09 08:24:00", "description": "The number of inmates infected with coronavirus in the California prison system grew by more than seven times in a little more than a week, while staff cases nearly tripled, leaving some behind bars fearful that cases will explode even as officials have begun taking steps to slow the spread.", "filename": "2020_04_09_us_california-prisons-coronavirus_index_1588611417.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408025915-california-prisons-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_california-prisons-coronavirus_index_1588611417.html", "title": "California prisons: Coronavirus cases multiplied in days and inmates fear further spread", "title_page": "California prisons: Coronavirus cases multiplied in days and inmates fear further spread - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The number of inmates infected with coronavirus in the California prison system grew by more than seven times in a little more than a week, while staff cases nearly tripled, leaving some behind bars fearful that cases will explode even as officials have begun taking steps to slow the spread.\nTwenty-nine inmates and more than 60 staff members have now tested positive for the virus, the California Department of Corrections and Rehabilitation said Wednesday.\nThat's up significantly from last week when the department reported that just four inmates and about 22 staffers had tested positive for the deadly disease.\n\"You have people in Italy dying, people in Spain dying, people in America dying, people are panic buying, people are concerned and people are scared,\" Samuel Brown, an inmate at California State Prison, Los Angeles County told CNN. \"And the truth of the matter is prisoners are people. So we're also afraid.\"\n\"And there's a potential of us dying, too.\"\nNine inmates infected with the coronavirus are in Brown's facility, 17 others at the California Institution for Men in Chino, and one each at the California Institution for Women in Chino, the North Kern State Prison in Delano and the Substance Abuse Training Facility in Corcoran.\nIn Brown's facility, four staff members have tested positive.\nThe department told CNN it was responding to the outbreak with a mandatory two-week plan across all adult institutions that will modify inmates' routines to include social distancing as well as proper disinfecting.\n\"For the next 14 days there are going to be a lot of changes within our institutions, but we do it with the overall health and safety of all those who live and work in them, and the health and safety of the public, at the forefront,\" CDCR Secretary Ralph Diaz said in a statement.\nInside prisons, keeping a distance isn't so easy\nBut social distancing is not easy to pull off in prisons, where inmates share cells, showers and other close quarters.\nBrown told CNN he has to share a space as small as \"a closet\" with another inmate.\n\"A looming demise is waiting for us all and we don't really know what to expect or what to anticipate,\" the 43-year-old inmate said. \"The potential of the ... virus to spread like wildfire (in the prison) is really high.\"\nThe department said to support social distancing measures, inmates throughout the state would be receiving their meals in their cells or individual housing units, and while yard time will still be allowed, fewer inmates will be released at a time to allow for more space between them. Showers and telephones will also be wiped down after each use, the department said.\nThe department also said it is trying to prevent the virus from entering from the outside by requiring staff and visitors to undergo temperature screenings before entering any of the department's facilities. They also are required to disclose any symptoms they've experienced, CDCR spokeswoman Dana Simas told CNN.\n\"Those attempting to enter a state prison or office building at any time are required to verbally respond if they currently have new or worsening symptoms of a respiratory illness,\" Simas said. \"If the individual's response is that they are experiencing symptoms, they will be restricted from entering the site that day.\"\nAt least 1,300 inmates released\nTo help curb further spread of the virus and create more spaces for those who need to be placed in quarantine or isolation, the department announced last week it could release as many as 3,500 inmates.\nInmates eligible for release are those who have 60 days or less remaining and are not serving sentences for violent, sex or domestic violence crimes.\nBy Tuesday, the department had released about 1,300 people, Simas said. CDCR said it was expecting to have released 3,442 inmates by Monday.\nThose who could be released will be screened for medical and health problems to ensure they can be placed in a community, CNN affiliate KCRA reported.\n\"We are also focusing on transferring inmates from dorm environments and making creative use of vacant space within some institutions in order to house inmates in places where we can increase physical distancing,\" Simas told CNN.\nAbout 500 inmates who are in overcrowded units will be transferred to areas like gymnasiums and vacant housing, the affiliate reported.", "url": "https://www.cnn.com/2020/04/09/us/california-prisons-coronavirus/index.html"}