{"authors": ["Gregory Krieg", "Annie Grayer"], "date_download": "2020-05-04 16:59:52", "date_modify": "2020-05-04 16:59:52", "date_publish": "2020-04-10 00:01:43", "description": "Bernie Sanders launched his first presidential campaign in near obscurity. He ended his second on Wednesday having inspired a movement that changed American politics.", "filename": "2020_04_09_politics_bernie-sanders-progressive-movement_index_1588611592.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200312182349-12-week-in-photos-0313-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_bernie-sanders-progressive-movement_index_1588611592.html", "title": "Bernie Sanders: Progressives take stock after they fall short again", "title_page": "Bernie Sanders: Progressives take stock after they fall short again - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Bernie Sanders launched his first presidential campaign in near obscurity. He ended his second on Wednesday having inspired a movement that changed American politics.\nSanders never fully embraced the Democratic Party, even as he sought its nomination. But many in the party -- including the voters who cast a ballot for another candidate this year -- have largely embraced his ideas. Ultimately, however, Sanders' message outperformed his campaigns.\nNow it's up to a new generation of progressive leaders to do what he could not: win. One of their first tasks will be to look back and determine what the next standard bearer can learn from Sanders' efforts -- identifying what worked, what didn't, and how to tell the difference.\nBiden greets Sanders with an elbow bump before the start of a debate in Washington in March 2020. They went with an elbow bump instead of a handshake because of the coronavirus pandemic.\nBiden greets Sanders with an elbow bump before the start of a debate in Washington in March 2020. They went with an elbow bump instead of a handshake because of the coronavirus pandemic.\nSanders speaks to reporters in Burlington, Vermont, a day after Super Tuesday II. Sanders said it \"was not a good night for our campaign from a delegate point of view\" but that he looked forward to staying in the race and taking on Joe Biden in an upcoming debate.\nA triumphant Sanders raises his fist in San Antonio after he was projected to win the Nevada caucuses.\nSanders laughs during a primary-night rally in Manchester, New Hampshire, in February 2020. Sanders won the primary, just as he did in 2016.\nIn a tense and dramatic exchange moments after a Democratic debate, Warren accused Sanders of calling her a liar on national television. Sanders responded that it was Warren who called him a liar. Earlier in the debate, the two disagreed on whether Sanders told Warren, during a private dinner in 2018, that he didn't believe a woman could win the presidency.\nUS Rep. Alexandria Ocasio-Cortez introduces Sanders at a New York rally after endorsing him for president in October 2019.\nUS Rep. Alexandria Ocasio-Cortez introduces Sanders at a New York rally after endorsing him for president in October 2019.\nSanders campaigns at the University of New Hampshire in September 2019. A few days later, he took himself off the campaign trail after doctors treated a blockage in one of his arteries. Sanders suffered a heart attack, his campaign confirmed.\nSanders grabs the hand of US Sen. Elizabeth Warren during the Democratic debates in Detroit in July 2019.\nSanders grabs the hand of US Sen. Elizabeth Warren during the Democratic debates in Detroit in July 2019.\nSanders speaks next to former Vice President Joe Biden at the first Democratic debates in June 2019.\nSanders speaks next to former Vice President Joe Biden at the first Democratic debates in June 2019.\nSanders looks at his notes as he watches President Trump deliver the State of the Union address in February 2019. That month, Sanders announced that he would be running for president again.\nSanders looks at his notes as he watches President Trump deliver the State of the Union address in February 2019. That month, Sanders announced that he would be running for president again.\nSanders brings a giant printout of one of Donald Trump's tweets to a Senate debate in January 2017. In the tweet, Trump had promised not to cut Social Security, Medicare and Medicaid.\nSanders addresses delegates on the first day of the Democratic National Convention in July 2016.\nSanders speaks at a rally in Santa Monica, California, in June 2016. He pledged to stay in the Democratic race even though Clinton secured the delegates she needed to become the presumptive nominee.\nSanders speaks at a rally in Santa Monica, California, in June 2016. He pledged to stay in the Democratic race even though Clinton secured the delegates she needed to become the presumptive nominee.\nSanders speaks at a campaign rally in Ann Arbor, Michigan, in March 2016. He won the state's primary the next day, an upset that delivered a sharp blow to Clinton's hopes of quickly securing the nomination.\nSanders and his wife, Jane, wave to the crowd during a primary night rally in Concord, New Hampshire, in February 2016. Sanders defeated Clinton in the New Hampshire primary with 60% of the vote, becoming the first Jewish candidate to win a presidential primary.\nComedian Larry David and Sanders appear together on \"Saturday Night Live\" in February 2016. David had played Sanders in a series of sketches throughout the campaign season.\nSanders sits with rapper and activist Killer Mike at the Busy Bee Cafe in Atlanta in November 2015. That evening, Killer Mike introduced Sanders at a campaign event in the city. \"I'm talking about a revolutionary,\" the rapper told supporters. \"In my heart of hearts, I truly believe that Sen. Bernie Sanders is the right man to lead this country.\"\nSanders embraces Remaz Abdelgader, a Muslim student, during an October 2015 event at George Mason University in Fairfax, Virginia. Asked what he would do about Islamophobia in the United States, Sanders said he was determined to fight racism and \"build a nation in which we all stand together as one people.\"\nSanders embraces Remaz Abdelgader, a Muslim student, during an October 2015 event at George Mason University in Fairfax, Virginia. Asked what he would do about Islamophobia in the United States, Sanders said he was determined to fight racism and \"build a nation in which we all stand together as one people.\"\nSeconds after Sanders took the stage for a campaign rally in August 2015, a dozen protesters from Seattle's Black Lives Matter chapter jumped barricades and grabbed the microphone from the senator. Holding a banner that said \"Smash Racism,\" two of the protesters -- Marissa Johnson, left, and Mara Jacqueline Willaford -- began to address the crowd.\nIn July 2015, two months after announcing he would be seeking the Democratic Party's nomination for President, Sanders spoke to nearly 10,000 supporters in Madison, Wisconsin. \"Tonight we have made a little bit of history,\" he said. \"You may know that some 25 candidates are running for President of the United States, but tonight we have more people at a meeting for a candidate for President of the United States than any other candidate has.\"\nIn March 2015, Sanders speaks in front of letters and petitions asking Congress to reject proposed cuts to Social Security and Medicare.\nIn March 2015, Sanders speaks in front of letters and petitions asking Congress to reject proposed cuts to Social Security and Medicare.\nSanders and US Rep. Jeff Miller, chairman of the House Committee on Veterans' Affairs, walk to a news conference on Capitol Hill in 2014. Sanders was chairman of the Senate Committee on Veterans' Affairs.\nSanders and US Rep. Jeff Miller, chairman of the House Committee on Veterans' Affairs, walk to a news conference on Capitol Hill in 2014. Sanders was chairman of the Senate Committee on Veterans' Affairs.\nSanders speaks to reporters in 2010 about the Obama administration's push to extend Bush-era tax cuts. Three days later, Sanders held a filibuster against the reinstatement of the tax cuts. His speech, which lasted more than eight hours, was published in book form in 2011. It is called \"The Speech: A Historic Filibuster on Corporate Greed and the Decline of Our Middle Class.\"\nSanders speaks to reporters in 2010 about the Obama administration's push to extend Bush-era tax cuts. Three days later, Sanders held a filibuster against the reinstatement of the tax cuts. His speech, which lasted more than eight hours, was published in book form in 2011. It is called \"The Speech: A Historic Filibuster on Corporate Greed and the Decline of Our Middle Class.\"\nSanders chats with Dr. John Matthew, director of The Health Center in Plainfield, Vermont, in May 2007. Sanders was in Plainfield to celebrate a new source of federal funding for The Health Center.\nSanders chats with Dr. John Matthew, director of The Health Center in Plainfield, Vermont, in May 2007. Sanders was in Plainfield to celebrate a new source of federal funding for The Health Center.\nSanders takes part in a swearing-in ceremony at the US Capitol in January 2007. He won his Senate seat with 65% of the vote.\nSanders takes part in a swearing-in ceremony at the US Capitol in January 2007. He won his Senate seat with 65% of the vote.\nSanders sits next to President Bill Clinton in 1993 before the Congressional Progressive Caucus held a meeting at the White House. Sanders co-founded the caucus in 1991 and served as its first chairman.\nSanders sits next to President Bill Clinton in 1993 before the Congressional Progressive Caucus held a meeting at the White House. Sanders co-founded the caucus in 1991 and served as its first chairman.\nIn 1990, Sanders defeated US Rep. Peter Smith in the race for Vermont's lone House seat. He won by 16 percentage points.\nIn 1990, Sanders defeated US Rep. Peter Smith in the race for Vermont's lone House seat. He won by 16 percentage points.\nSanders reads mail at his campaign office in Burlington in 1990. He was running for the US House of Representatives after an unsuccessful bid in 1988.\nSanders reads mail at his campaign office in Burlington in 1990. He was running for the US House of Representatives after an unsuccessful bid in 1988.\nIn 1987, Sanders and a group of Vermont musicians recorded a spoken-word folk album. \"We Shall Overcome\" was first released as a cassette that sold about 600 copies. When Sanders entered the US presidential race in 2015, the album surged in online sales. But at a CNN town hall, Sanders said, \"It's the worst album ever recorded.\"\nSanders, right, tosses a baseball before a minor-league game in Vermont in 1984. US Sen. Patrick Leahy, center, was also on hand.\nSanders, right, tosses a baseball before a minor-league game in Vermont in 1984. US Sen. Patrick Leahy, center, was also on hand.\nSanders takes the oath of office to become the mayor of Burlington, Vermont, in 1981. He ran as an independent and won the race by 10 votes.\nSanders takes the oath of office to become the mayor of Burlington, Vermont, in 1981. He ran as an independent and won the race by 10 votes.\nSanders, right, leads a sit-in organized by the Congress of Racial Equality in 1962. The demonstration was staged to oppose housing segregation at the University of Chicago. It was Chicago's first civil rights sit-in.\nSanders, right, leads a sit-in organized by the Congress of Racial Equality in 1962. The demonstration was staged to oppose housing segregation at the University of Chicago. It was Chicago's first civil rights sit-in.\nUS Sen. Bernie Sanders speaks at a campaign rally in Chicago in March 2019. Sanders, an independent from Vermont, is the longest-serving independent in the history of Congress.\nUS Sen. Bernie Sanders speaks at a campaign rally in Chicago in March 2019. Sanders, an independent from Vermont, is the longest-serving independent in the history of Congress.\nIt is a big question. New York Rep. Alexandria Ocasio-Cortez joked to CNN that you could fill a \"thesis\" trying to answer it. Still, she took a stab -- offering five lessons.\n\"The electorate is quite willing to support so-called 'radical' policies when they are properly framed and explained; there is enormous potency in movement candidacies; intersectionality is only going to get more important as the electorate diversifies; we can and should lean into building stronger, broader multiracial and intergenerational coalitions.\"\nShe concluded, pulling it all together: \"Who the candidate is and when they're running shapes all of that.\"\nPieces of Ocasio-Cortez's outline popped up in interviews about Sanders' exit, and what it means for the movement he galvanized, with more than a dozen leading progressive activists, operatives, writers and elected officials. Like Ocasio-Cortez, they all drove -- by one route or another -- toward the same point: the importance, from the candidates to the voters, of broadening and diversifying the new progressive coalition.\nSanders, as a candidate, ultimately failed to translate the popularity of his politics into electoral success. And in a year when Democrats routinely put denying President Donald Trump a second term as their top priority, Sanders -- by his own admission -- failed to convince primary voters that he was the best positioned to do it.\nA missed opportunity\nDemocratic presidential candidate Sen. Bernie Sanders (I-VT) and his wife Jane Sanders wave to the crowd at the end of a campaign rally at Vic Mathias Shores Park on February 23, 2020 in Austin, Texas.\nSanders the candidate often struggled to keep pace with public support for his signature policies. But for a week in late February, after he won the Nevada caucuses , the gap appeared to be closing -- the nomination coming into reach.\nBut the tide would turn fast, and Sanders was beaten back again from the shore.\nThe week between Nevada and the next primary, in South Carolina , presented an opportunity for Sanders -- whom many at the time believed was cruising to victory -- to reach out and attempt to bring on board, or at least give pause, to some of the same figures who would ultimately rally behind Biden.\nInstead, Sanders doubled down on his rhetoric attacking the party establishment. A source close to the campaign, frustrated after an underwhelming showing on Super Tuesday, boiled over in frustration at Sanders' refusal to step out of his comfort zone and attempt to persuade potential allies.\n\"I think a big part of what it could be doing, that he's not doing, is leaning into a lot of the stuff that makes him uncomfortable, which is obviously media and politics. There's a rejection of doing, the typical political game. Calling people, doing the work that needs to be done to get endorsements, to get momentum,\" the source said. \"We need more people involved. We need more people to feel connected to this thing.\"\nAhead of the South Carolina primary, Sanders did not personally ask for influential Rep. Jim Clyburn's support, which eventually -- and perhaps inevitably -- went to Biden shortly before the primary.\nAsked by MSNBC's Rachel Maddow why he did not even attempt to court Clyburn, Sanders suggested it would have been a futile effort.\n\"Jim is a very nice guy, I like him and respect him -- his politics are not my politics,\" Sanders said. \"And I respect him, but there's no way in God's earth he was going to be endorsing me.\"\nThe episode underscored one of the Sanders campaign's fatal flaws -- an inability to expand its base of support by means of persuasion. Though his coalition was more diverse than in 2016, due in large part to the campaign's targeted and sustained outreach to Latinos, it again fell short of its own rhetoric.\nA stinging rejection\nDemocratic presidential candidate Sen. Bernie Sanders (I-VT) speaks during a campaign rally at the University of Houston on February 23, 2020 in Houston, Texas.\nA week after Nevada, Biden stormed to victory in South Carolina by nearly 30 percentage points over Sanders, whose campaign kicked in a late half-million dollars in ad spending hoping to keep the margin in single digits. Like in 2016, black voters down South asserted themselves and rejected the senator from Vermont.\n\"The most urgent task for the progressive movement is to build a deeper relationship with the African-American community and leaders who have been the true agents of social change in American history,\" California Rep. Ro Khanna, a Sanders campaign co-chair, told CNN. \"We need to sit down with people like Jim Clyburn, Karen Bass, Cedric Richmond, Bennie Thompson, Robin Kelley, Maxine Waters and Barbara Lee with humility and respect to understand how we strengthen the bonds between progressives and the black community.\"\nAna Maria Archila, the co-executive director of the Center for Popular Democracy, which endorsed Sanders, offered a similar prescription.\n\"It is possible to build a progressive, multiracial coalition of working class people of all races,\" Archila said. \"But in order to win a national election, progressive coalitions need to resonate and have authentic and deep relationships with black communities and leaders, especially in the South. We will not win if we cannot win in black communities.\"\nBiden's dominance with black voters underscored the persistence of a problem the new leftists will have to untangle in the months and years to come.\n\"The progressive wing of the party,\" Archila said, \"needs to be more serious about nurturing and supporting women and people of color to run at all levels.\"\nIn the meantime, Biden used those shortcomings to cast Sanders' anti-establishment message as an affront to voters of color in South Carolina.\n\"The establishment are all those hardworking middle-class people, those African Americans,\" Biden said. \"They are the establishment!\"\nLouisiana Rep. Cedric Richmond, a Biden campaign co-chair, hammered home the message: \"I just did not know that African Americans in the South were considered part of the establishment,\" he said.\nA more welcoming movement\nAs the Sanders campaign learned during the unraveling after South Carolina, there is no path to power without winning over open-minded moderates.\nBut by then, the time for aggressive outreach had long passed. Sanders was attempting to complete a hostile takeover of the party and his derisive references to its \"establishment\" -- an amorphous term that means different things to different people -- turned off voters who might have been willing to give him a hearing.\nIn a tweet on April 1, as the window was closing on the campaign's hopes, its deputy distributed organizing director, Jack Califano, zeroed in on a tendency that has undermined the left's work to grow its ranks.\n\"In order to win, we will need to communicate our ideas in a way that feels both safe and exciting to people who don't self identify as 'socialists,'\" Califano wrote. \"If we mistake that effective messaging for a betrayal of our cause, we will never expand our base, & we will never win.\"\nSanders himself repeatedly acknowledged that the popularity of his ideas were not translating to electoral success.\n\"We are losing the debate over electability,\" Sanders said at a press conference in Burlington, Vermont, on March 11, a day after losing five out of six contests.\n\"I cannot tell you how many people our campaign has spoken to who have said, and I quote, 'I like what your campaign stands for, I agree with what your campaign stands for, but I'm going to vote for Joe Biden because I think Joe is the best candidate to defeat Donald Trump,'\" Sanders said. \"We have heard that statement all over this country. Needless to say, I strongly disagree with that assertion. But that is what millions of Democrats and independents today believe.\"\nUltimately, Sanders' strengths as a political figure -- his consistency and stubbornness in support of progressive ideals -- also manifested as weaknesses on the campaign trail.\nHe acknowledged that his inability to \"tolerate bull**** terribly well,\" do the common political \"backslapping,\" or offer the most mundane \"pleasantries\" was a source of \"self-criticism.\"\nBut the campaign's difficulty in coalition-building was also frequently outside of its control.\nFrom the outset of the campaign, Sanders, in private and publicly, pushed for his supporters and surrogates -- especially online -- to take a more civil tone with opponents. Too often, though, they ignored his entreaties and actively sought to kick off feuds that would, over time, create a self-defeating cycle that obscured the candidate's message and alienated would-be allies.\nIn January, Sanders supporters angry at Warren for maintaining, over his denials, that he told her a woman could not win the presidency, launched a Twitter campaign that included hashtags like #WarrenIsASnake and filled her replies with snake emojis.\nWhen Warren dropped out of the race less than two months later, she decided not to endorse his campaign -- or absolve Sanders of personal responsibility for his supporters' behavior.\n\"You know, I shouldn't speak for him,\" she said. \"It's something he should speak for himself on.\"\nThe Sanders campaign kept a respectful distance from the endorsement question, but segments of the pro-Sanders media and high profile online supporters pilloried her for the decision -- unwilling to accept any role in poisoning the waters, while turning indignant at the suggestion that the episode might have affected Warren's thinking.\nWhen Ocasio-Cortez sent Warren a friendly tweet after the Massachusetts senator's appearance on \"Saturday Night Live,\" she too came under criticism from segments of the online left.\nA new, immediate test\nBiden, no longer competing with other moderates to establish himself as their pick, has over the past few weeks sought to make inroads with Sanders' supporters.\nOn Wednesday, he put out a statement -- a 758-word Medium post -- applauding Sanders (\"he doesn't get enough credit\") and his supporters (\"I see you, I hear you\") for their work. Biden's team is clearly intent on forging a peace with the left, which has already begun its efforts, independent of Sanders, to extract commitments going forward -- a key test that could, if Biden wins, allow progressives to get a toehold in the halls of power.\nOn Wednesday afternoon, eight leading progressive groups sent an open letter to Biden, pledged their commitment to \"ending a presidency that has set the clock back on all of the issues that impact our lives,\" while warning the former vice president that campaigning against Trump on a \"return to normalcy\" message would be a loser with young voters.\nThey appended a corresponding list of requests focused on policy, but also personnel -- asking Biden to \"appoint elected leaders who endorsed Bernie Sanders and Elizabeth Warren as co-chairs of his transition team.\" Reps. Pramila Jayapal and Khanna, from Sanders' camp, and Warren-backing Reps. Ayanna Pressley and Katie Porter were the specific names given.\nPhilip Agnew, co-founder of the Dream Defenders and a senior adviser to Sanders during the campaign, suggested that an enduring legacy of the Sanders campaigns is the normalization of ideas that had been dismissed in mainstream politics for decades.\n\"We now know that we are actually not in the minority. That the left and the left values are embraced and appreciated and demanded really by more than half of this country,\" Agnew said, pointing to the poll numbers showing the popularity of policies like Medicare for All. \"So we can't unknow that now. And I think the organizing is only going to get stronger from there.\"\nThat the left is able to make credible demands of the establishment center, in this case a former vice president and presumptive Democratic nominee, is a remarkable achievement in its own right.\nMicah Uetricht, managing editor of Jacobin magazine and co-author, with Meagan Day, of the book \"Bigger than Bernie,\" argued that defeat in the primary should not overshadow a fundamental shift authored, in large part, by Sanders' successes.\n\"Millions of Americans got behind a grouchy, rumpled old democratic socialist who wouldn't stop talking about class struggle,\" Uetricht said. \"Progressives, Berniecrats, socialists, and everyone who makes up the broad left shouldn't shy away from that kind of rhetoric in the future.\"\nSanders, too, has shown no signs that he plans to pull back from the fight over the party's platform in 2020.\nWhen announcing his departure from the race, Sanders said he would remain on the ballot going forward as a means of amassing delegates in order to \"exert significant influence over the party platform and other functions.\"\n\"He's not going to adopt my platform,\" Sanders said of Biden in an interview Wednesday night with Stephen Colbert. \"I got that, alright? But if he can move in that direction, I think people will say, you know what, this is a guy I think who we should support and would support.\"", "url": "https://www.cnn.com/2020/04/09/politics/bernie-sanders-progressive-movement/index.html"}