{"authors": ["Jason Hoffman", "Kelly Mena"], "date_download": "2020-05-04 16:19:49", "date_modify": "2020-05-04 16:19:49", "date_publish": "2020-04-04 21:40:19", "description": "President Donald Trump on Saturday said he is considering a second coronavirus task force focused on reopening the country's economy as pandemic cases rise across the United States.", "filename": "2020_04_04_politics_trump-economy-task-force-coronavirus_index_1588609189.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200404162645-02-coronavirus-briefing-0404-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_politics_trump-economy-task-force-coronavirus_index_1588609189.html", "title": "Trump considering second task force on reopening economy", "title_page": " President Trump said he is considering a second task force focused on reopening the country's economy - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington, DC (CNN) President Donald Trump on Saturday said he is considering a second coronavirus task force focused on reopening the country's economy as pandemic cases rise across the United States.\nTrump was asked about a tweet he'd sent earlier in the day responding to a tweet by Fox News anchor Dana Perino suggesting a second task force focused on the economy.\n\"Thinking about it, getting a group of people and we have to open our country,\" he said. \"You know, I had an expression, the cure can't be worse than the problem itself. Right? I started by saying that and I continue to say it. The cure cannot be worse than the problem itself. We got to get our country open,\" Trump said.\nWhite House officials in recent weeks have been considering opening up the economy while avoiding a health catastrophe as Trump has began agitating for a loosening of his guidelines to get the country back to work.\nThe discussions include a phased system based on age or geographic location, according to officials. Other options include a system that targets specific types of workers to return to work, including people who drive themselves and don't work in large groups. Trump, though in last Sunday's briefing, shot down the idea of a tiered reopening, indicating that he won't rollback the slow-the-spread guidelines within the April 30 date extension.\nRead More", "url": "https://www.cnn.com/2020/04/04/politics/trump-economy-task-force-coronavirus/index.html"}