{"authors": ["David Eggert", "Ed White"], "date_download": "2020-05-04 20:24:17", "date_modify": "2020-05-04 20:24:17", "date_publish": "2020-04-16 16:07:00", "description": "LANSING, Mich. (AP) — Major health care providers in southeastern Michigan reported significant reductions in COVID-19 patients Thursday, while Gov. Gretchen Whitmer said she would work with...", "filename": "_1c64bb70a5d146ae1f6da0aa2d4d6ee9_1588623857.html", "image_url": "https://storage.googleapis.com/afs-prod/media/d378d6ebbaa04544a6718876fec31b10/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1c64bb70a5d146ae1f6da0aa2d4d6ee9_1588623857.html", "title": "Deaths cross 2,000 but hospitals say virus cases flattening", "title_page": "Deaths cross 2,000 but hospitals say virus cases flattening", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Detroit Police Chief James Craig, who was recently cleared to return to work after fighting his own COVID-19 diagnosis, addresses the media during Detroit Mayor Mike Duggan's daily press briefing on the coronavirus, Thursday, April 16, 2020, in Detroit. (AP Photo/Carlos Osorio)\nDetroit Police Chief James Craig, who was recently cleared to return to work after fighting his own COVID-19 diagnosis, addresses the media during Detroit Mayor Mike Duggan's daily press briefing on the coronavirus, Thursday, April 16, 2020, in Detroit. (AP Photo/Carlos Osorio)\nLANSING, Mich. (AP) — Major health care providers in southeastern Michigan reported significant reductions in COVID-19 patients Thursday, while Gov. Gretchen Whitmer said she would work with Midwestern states on a strategy to reopen their virus-stunted economies.\nHenry Ford Health System said it had 617 COVID-19 patients, its lowest number since April 1. Beaumont Health, the state’s largest health provider, had 819 patients, down 19% from last Friday. Another 43 patients had tests pending.\nHenry Ford Health cautioned that the crisis is far from over, but said it’s encouraged enough to start scheduling surgeries unrelated to the coronavirus and suspending plans to create extra space for COVID-19 patients.\nIt “places us more on a plateau phase of this pandemic,” said Dr. Betty Chu, who is leading Henry Ford’s response to the coronavirus. “This is, of course, great reason for hope. We hope that we’re continuing to flatten the curve as we’re not seeing as much of a surge. However, it’s certainly not a time to get complacent.”\nMichigan Medicine at the University of Michigan and St. Joseph Mercy Health System also reported fewer patients.\nLATEST NUMBERS\nThe number of people in Michigan with the coronavirus rose 4% to 29,263, the state said Thursday, although many of them have long recovered. Deaths from COVID-19, the respiratory illness caused by the virus, increased by 172, or 9%, to 2,093. The state noted that 65 of those deaths could have occurred days or weeks ago.\nOFF THE MAT\nWhitmer and six other Midwestern governors said they would work together to reopen their state economies, after similar pacts were made in the Northeast and on the West Coast.\nMeanwhile, Republicans who control the state Senate unveiled a plan to jump-start Michigan’s economy in five phases. They want Whitmer, a Democrat, to align her strict stay-at-home order with federal guidance to reopen businesses whose employees can stay 6 feet apart.\nRepublicans said businesses in regions that aren’t virus hot spots should be allowed to reopen more quickly than in other areas. Senate Majority Leader Mike Shirkey said Whitmer’s “one-size-fits-all” approach was “perfect” in the first weeks of the crisis.\n“But we’ve had time now, and we have 20-20 hindsight of the experiences that we’ve observed, and I believe we’ve got plenty of evidence to support that this can work,” Shirkey said.\nBUDGET WOES\nWhitmer said the state’s tax revenue could drop by $7 billion over the next 18 months. She urged President Donald Trump to work with Congress to send more aid to states and local governments.\nStates are being hit with a double-whammy: reduced tax revenue caused by the pandemic’s economic havoc and the additional costs of fighting the virus. Michigan so far is getting $3.8 billion from Washington, including $800 million for Detroit and the four largest counties: Wayne, Oakland, Macomb and Kent.\nBACK ON THE BEAT\nDetroit police Chief James Craig emerged Thursday as a survivor of the coronavirus. He was at home for days relying on isolation, prayer, exercise and other remedies.\n“I can smile. I’m excited. It’s certainly been a journey. ... To overcome this deadly virus I needed to fight back,” Craig told reporters.\nHe offered a message to the sick at home: “Get up, move around.”\n___\nSTOP THE TRUCK\nAttorney General Dana Nessel said she’s stepping in to stop the eviction of about 80 people who haven’t paid their rent, including senior citizens, at a Detroit apartment building.\n“People cannot be evicted from their homes during this public emergency except under extreme circumstances as outlined in the governor’s executive orders,” Nessel said.\nThe Associated Press left a voicemail seeking comment from a Farmington Hills law firm that represents management at The Jeffersonian apartments.\nAn additional 219,000 people filed for unemployment last week, bringing the total number who have lost their jobs to more than 1 million.\n___\nWhite reported from Detroit. Associated Press writer Corey Williams in West Bloomfield contributed to this report.", "url": "https://apnews.com/1c64bb70a5d146ae1f6da0aa2d4d6ee9"}