{"authors": [], "date_download": "2020-05-04 16:24:15", "date_modify": "2020-05-04 16:24:15", "date_publish": "2020-04-06 22:34:30", "description": "Acting Secretary of the Navy Thomas Modly blasted the now-ousted commander of the USS Theodore Roosevelt, Capt. Brett Crozier, as \"stupid\" in an address to the ship's crew Monday morning.", "filename": "2020_04_06_politics_thomas-modly-transcript_index_1588609455.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406172331-thomas-modly-december-2019-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_thomas-modly-transcript_index_1588609455.html", "title": "Thomas Modly transcript on Capt. Brett Crozier to USS Theodore Roosevelt", "title_page": "Thomas Modly transcript on Capt. Brett Crozier to USS Theodore Roosevelt - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Read the full transcript of Modly's address to the crew, obtained by CNN:\nI've been wanting to come out to the ship since we first found out you had COVID cases on here. I was actually planning on being here last Tuesday after I went to see the Mercy off in Los Angeles. So I want you to know that no one in my level has been ignoring the situation here from the very beginning.\nI reached out to your CO through my Chief of Staff very, very early on in this crisis. On Sunday, told him that I wanted to come out to the ship and if it would be okay or if it would be too disruptive. I told him that because I wanted to be able to help, if there was anything else he needed as this massive effort was underway, to get you guys healthy and clean and safe. He waved me off. He said he felt like things were under control. He had been concerned a day or so before that things weren't moving quickly but things—he still wanted to get more beds—but he didn't think it was necessary. He also talked to my Chief of Staff and emailed back and forth with him.\nOn Sunday night, he sent that email. And that email went out to a broad audience of people. I know that I mentioned that it was over 20. We believe that it was forwarded to even far more than that. And immediately it was picked up by the San Francisco Chronicle, which published sensitive information about the material condition of a Naval war ship. If he didn't think—it was my opinion, that if he didn't think that information was going to get out into the public, in this information age that we live in, then he was A, too naive or too stupid to be the commanding officer of a ship like this. The alternative is that he did this on purpose. And that's a serious violation of the Uniform Code of Military Justice, which you are all familiar with. That message, and all the contents of that message was perfectly fine for him to send to people in his chain of command in a confidential way so they could get acting on it. He in fact could have given it to me, through my Chief of Staff, or to me, as I asked him to do when I first reached out to him on the ship, when we first found out that there were COVID cases here.\nIt was a betrayal of trust with me, with his chain of command, with you, with the 800 to a thousand people who are your shipmates on shore right now, busting their asses every day to do what they need to do to convert what they do in a normal day to get you guys off of here, get you safe and get you healthy, get you clean, and get you back on this ship where you are supposed to be.\n(INDISTINCT YELLING IN BACKGROUND)\nIt was betrayal. And I can tell you one other thing: because he did that, he put it in the public's forum, and it's now become a big controversy in Washington, DC, and across the country [LOW BACKGROUND YELLING: HE WAS ONLY TRYING TO HELP US] about a martyr CO, who wasn't getting the help he needed and therefore had to go through the Chain of Command, a chain of command which includes the media. And I'm gonna tell you something, all of you. There is never a situation where you should consider the media a part of your chain of command. You can jump the Chain of Command if you want, and take the consequences, you can disobey the chain of command and take the consequences, but there is no, no situation where you go to the media. Because the media has an agenda. And the agenda that they have depends on which side of the political aisle they sit. And I'm sorry that's the way the country is now, but it's the truth. And so they use it to divide us. They use it to embarrass the Navy. They use it to embarrass you. (INDISTINCT YELLING IN BACKGROUND)\nWhile you're out here dealing with something that this county hasn't had to deal with in over a hundred years, and the world hasn't ever dealt with anything like this on this scale, the American people believe in you. They think of all the people in the world that can keep their shit together in something like this—it's the United States Navy [INDISTINCT BACKGROUND CHATTER THROUGHOUT] and our sailors—and they're stressed. They may be stressed, they may be tired, they may be scared, but they're keeping their shit together and they're taking care of their people on the shore who are busting their ass to get them off this ship. They're not taking shots at them. They're asking, how can we help them? What can we do? How can I help the E3 that works for me? I'm an E4. I'm concerned. What do I do to help the E2's and E3's that are on this ship? That's your duty. Not to complain.\nEveryone's scared about this thing. But I tell you something, if this ship was in combat and there were hypersonic missiles coming at it, you'd be pretty BLEEP scared too. [BACKGROUND YELLING: WHOA!] But you do your jobs. And that's what I expect you to do, and that's what I expect every officer on this ship to do, is to do your jobs.\nOne of the things about his email that bothered me the most was saying that we are not at war. Well we're not technically at war. But let me tell ya something, the only reason we are dealing with this right now is because a big authoritarian regime called China was not forthcoming about what was happening with this virus. And they put the world at risk to protect themselves and to protect their reputations. We don't do that in the Navy. We are transparent with each other, in the proper channels, and with each other. And that's what we are supposed to do and that's what you're expected to do.\nI got your list of questions. I'm very, very thankful to have gotten them. I know they're all sincere. I don't think there is any agenda in any of those. But there's a lot of them and I'm gonna answer every single one of them, but I've gotta do it respectfully, and I've gotta take some time so you understand all the nuances of the questions you are asking. And there's a lot of them here. So rather than answer them all today, I'm going to take them back with me to Washington and I'm going to answer them.\nAnd let me say one other thing, everything I am telling you guys now, I will never, ever, ever throw you guys under the bus in Washington or anywhere else in the media, anywhere else. And don't, I expect you never to do that to your shipmates either—the ones on the shore right now who told me that when Captain Crozier's email made it to the San Francisco Chronicle after working 15 hour days, they were demoralized because they knew what they had been doing for you guys since the 25th of March to get you guys what you need.\nAnd the other thing you need to understand is we're in Guam. It's a US territory but they have their own government, and they have their healthcare problems, and they're scared too, just like every other part of the world. And the Governor of Guam has stuck her neck out big time with their own population to say that she is willing to open up hotel rooms all over this this country, or this state, this territory, so that sailors from the USS Teddy Roosevelt can go and be safe. Because she believes that you all are her brothers and sisters, her brothers and sisters who are protecting this place for her citizens. And so she's willing to put all that at risk to take care of you guys.\nAnd she told me today when Captain Crozier's letter came out in the public, she had to then deal with all her constituents—who are saying, \"holy crap what's happening? We're going to have 5,000 people with COVID in our city, without proper health care and everything else.\"\nSo think about that when you cheer the man off the ship who exposed you to that. I understand you love the guy. It's good that you love him. But you're not required to love him.\nSo I want to share something with you that I read at the Navy Academy graduation in 2018. I said it to the graduating class, but I'm going to expand it a little bit. I said, as officers and sailors of the United States Military, you are given tremendous responsibility to respect and protect those who are placed under your command. The American people will trust you with their sons and daughters. And they place their security and the security of our nation in your hands. Do not expect to be loved by everyone for this—even though it may happen. As Secretary Mattis my former boss was fond of saying to us who were so honored to work with him in the Pentagon—he said your job is to protect the nation.\nSo l'm going to give you a little bit of advice to make this important—and often difficult—job far easier on yourselves. My best advice to you is don't ever be—don't ever worry about being loved for what you do. Rather, love the country that you are asked to defend. Love the constitution you pledged your lives to protect.\nAnd importantly, love the people you are ordered to lead. Make sure they eat before you do. Care about their families as much as your own. Be invested in their success more than your own accomplishments. Nurture their careers more than you pursue your own advancement. And value their lives to the point that you will always consider their safety at every single decision you make. It's only through this level of servant leadership that you will maximize and empower those you lead to meet the demands that will face us in this century. And those demands are getting more complicated every day, as we're all learning. But it's also going to accrue incredible personal satisfaction to you during time of service.\nCrew of the Teddy Roosevelt. You are no obligation to love your leadership, only to respect it. You are under no obligation to like your job, only to do it. You are under no obligation to expect anything from your leaders other than they will treat you fairly and put the mission of the ship first.\nBecause it is the mission of the ship that matters. You all know this. But in my view, your Captain lost sight of this and he compromised critical information about your status intentionally to draw greater attention to your situation. That was my judgment and I judged that it could not tolerated from the commanding officer of a nuclear aircraft carrier. This put you at great risk even though I am certain he never thought it would. I'm certain he loved you all, as he should. But he lost sight of why the TR exists and fate brought you all together in the middle of this COVID crisis.\nYour nation back home is struggling. No one expected this pandemic. As we are all working our way through it, your fellow sailors in the States are volunteering, putting on uniforms and running into the fire in places like New York, Los Angeles, Dallas, and New Orleans. I've seen them, no fear, running right into COVID.\nNothing is easy in this for anyone. But from the very beginning, we have been engaged from my level down to bring you the help you need as fast as we possibly could. Understand it takes time to flex up for a crisis this unique.\nBut the TR has to stand strong as warriors, not weak like victims. The TR has to work its way through this with grace, not panic. The TR has to demonstrate to the citizens back home that it has its act together, and that it is knocking down this virus, just as it would knock down the Chinese or the North Koreans or the Russians if any one of those nations were ever so stupid enough to mess with the Big Stick, because they thought she was vulnerable.\nI cannot control or attempt to change whatever anger you have with me for relieving your beloved CO. If I could offer you a glimpse of the level of hatred and pure evil that has been thrown my way, my family's way, over this decision, I would. But it doesn't matter. It's not about me. The former Vice President of the United States Joe Biden suggested just yesterday that my decision was criminal. I assure you it was not. [BACKGROUND YELLING: WHAT ARE YOU...] Because I understand the facts, and those facts show that what your captain did was very, very wrong, in a moment when we expected him to be the calming force on a turbulent sea.\nThere was very little upside in this decision for me. You can believe that or not. I made the decision for the Navy I love, for the Navy I served in, and now serve for. And mostly for the sailors I'm responsible for, not just to you here, but on nearly 300 other ships in the fleet. Your captain's actions had implications for them too. Imagine if every other CO also believed that the media was also the proper channel to hear grievances with their chain of command under difficult circumstances. We would no longer have a Navy. And not longer after that, we'd no longer have a country.\nStill, I understand you may be angry with me for the rest of your lives. I guarantee you won't be alone. But being angry is not your duty. Your duty is to each other, and to this ship, and to the nation that built it for you to protect them. Even amidst an unexpected crisis, it is the mission of this ship that matters. Our adversaries are watching, and that is why we are here. We will get you the help you need. You have my personal word on it. Your CO had my personal word on that from Day One. Whatever else you may think of me, I don't go back on my word. And when it comes to the TR, whether you hate me or not, I will never, ever, ever give up this ship and neither should you. Thanks for listening, and I'll get the detailed answers to your questions to you some time later this week. Go Navy.", "url": "https://www.cnn.com/2020/04/06/politics/thomas-modly-transcript/index.html"}