{"authors": ["Opinion Jill Filipovic"], "date_download": "2020-05-04 16:15:46", "date_modify": "2020-05-04 16:15:46", "date_publish": "2020-04-03 15:05:35", "description": "For those of us stuck at home thanks to Covid-19, \"Tiger King\" is just the absurd escapism we crave, says Jill Filipovic. But that gut discomfort you may have about its tabloid-y feel reveals a deeper issue, she says: the documentary's misogyny.", "filename": "2020_04_03_opinions_tiger-king-misogyny-filipovic_index_1588608946.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200329145659-tiger-king-carole-baskin-netflix-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_tiger-king-misogyny-filipovic_index_1588608946.html", "title": "'Tiger King' is addictive, absurd -- and scary", "title_page": "'Tiger King' is addictive, absurd -- and scary (opinion)  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Jill Filipovic is a journalist based in New York and author of the book \" The H-Spot: The Feminist Pursuit of Happiness .\" Follow her on Twitter . The opinions expressed in this commentary are solely her own. View more opinion articles on CNN\n(CNN) If you ever need an example of how misogyny in America is alive and well -- or how we elected Donald Trump as president -- look no further than the victim-blaming response to the new Netflix documentary \"Tiger King.\"\nThe show (spoiler warning!) focuses on Joseph Allen Maldonado-Passage, aka \"Joe Exotic,\" who describes himself as a \"gay, gun-carrying redneck with a mullet\" and who at one point claimed to own more tigers than anyone else in North America. He breeds cubs for petting, an exploitative and cruel money-maker . And he's currently sitting in prison\n\"Tiger King\" is shocking, sensational and addictive to watch, with each new character more absurd than the next, and more twists and turns than should be possible in a series that tells a true(ish) story. The other so-called \"Big Cat\" men in the documentary who have dealings with Joe Exotic include one who is portrayed (in a characterization that he contests) more like a cult leader than anything else. He allegedly keeps a harem of women he first employed as teenage girls, whom he allegedly under-feeds and barely pays.\nFor the millions of us stuck at home thanks to coronavirus, it's exactly the kind of absurd escapism we crave -- even as many of us watch with some discomfort at the tabloid-y feel, and the gut reaction that there's something pretty unethical going on with the documentary's production.\nThe problem is the misogyny.\nNo story is complete without tension, conflict and a villain. In \"Tiger King,\" the villain isn't any of the many sadistic men who allegedly mistreat or abuse women, animals and often both.\nIt's Carole Baskin, a middle-aged woman who runs a big cat sanctuary and greets her fans with a cheesy line: \"Hey all you cool cats and kittens.\"\nBaskin is Joe Exotic's foil, a less brash and more polished nemesis who advocates against roadside zoos and keeping big cats as pets. The documentary-makers portray a \"both sides\" view of the Carole v. Joe conflict, which in reality goes something like this: Carole Baskin advocates for backyard tiger breeding operations, including Joe's, to be shut down; Joe spends about a decade threatening Baskin in grotesque and often sexually violent terms, posting videos of him shoving a dildo into the mouth of a Carole Baskin blow-up doll before shooting the doll in the head, and holding up an item meant to look like her head in a jar.\nIn January, Joe was sentenced to 22 years in prison for a murder-for-hire plot targeting Baskin, and for illegally killing five of his own tigers. And yet thanks to the decision of the documentarians to cast Carole as a moral scold, a hypocrite, and Joe's equal and opposite adversary, viewers walk away convinced that Baskin is just as bad as him.\nNow, many viewers have two demands : #FreeJoeExotic, and jail Carole Baskin.\nWhen it comes to Baskin's alleged wrongdoings, there are no arrests, convictions, admissions or hard evidence, and so the show deals mostly in insinuations, misdirection and disgust at the fact that she had the gall to fight back against sustained abuse.\nThe documentary claims, for example, that Baskin doesn't pay her staff; Baskin says her organization is a non-profit staffed by a few paid employees and assisted largely by volunteers who donate their time. It claims Baskin also profits from big cats because she runs an animal sanctuary -- but there is a huge difference between running a big cat rescue, where the animals can roam and people can observe them, and running a roadside cub petting zoo where wild animals are trained to perform, and babies are taken from their mothers when they are just days or even hours old.\nOne damning bit of the documentary is the claim that Baskin and her former husband used to breed big cats themselves. That's true -- but as happens to a number of people who think a big cat might make a good pet, reality changes their perspective. Baskin learned first-hand the problems of treating wild animals like pets, and it fueled her shift in perspective. She stopped breeding animals, and began to advocate for outlawing the practice. She turned her land into a sanctuary for big cats who were abandoned or abused. Yes, her nonprofit makes money from these same cats; yes, she also cages cats (although Baskin says her enclosures are much larger and more humane than those used by roadside zoos).\nIn response to criticisms of \"Tiger King\" from Baskin and other participants, the producer Rebecca Chaiklin told the Los Angeles Times, \"I would just say we were completely forthright with the characters. With any project that goes on for five years, things evolve and change, and we followed it as any good storyteller does.\"\nIn the same interview , producer Eric Goode added that Baskin talked about her own personal life and \"certainly wasn't coerced.\" Chaiklin denied the critique that \"Tiger King\" is sensationalized entertainment that paid people to participate, noting that producers paid to license archival and personal footage but \"categorically, we do not pay people for interviews.\"\nBaskin may not be anywhere close to a perfect conservation hero -- there are a whole lot of organizations that do better work when it comes to advocating for big cats in the wild, including the National Geographic Big Cats Initiative and Panthera -- but other welfare animal advocates say she has an excellent reputation, and it's clear that her organization is not on par with cub petting zoos. And yet the documentary misses all sense of proportion, implying that her operation and her motivations are comparable to the cub petting zoos she tries to shut down, and the men who run them.\nFinally, there is the sensational implication that Baskin murdered her husband, Don Lewis (whose 1997 disappearance has never been solved), and fed him to her tigers. Baskin was never arrested, let alone charged -- unlike Joe Exotic, who was convicted of murder for hire and currently sits in prison. The sheriff of Hillsborough County, Florida, told the New York Times that, when it comes to Don Lewis, \"We don't have any type of evidence, not one piece, that suggests that he was killed.\"\nThanks to the Netflix documentary, the police are nevertheless receiving new tips, none of them with credible leads.\nEven if you don't walk away from the documentary thinking Baskin was uniquely terrible or the only villain, the message is that, at least, she is just as bad as the long line of ludicrous, narcissistic men who allegedly threaten and abuse women or animals -- that everyone in the series is terrible. And that kind of both-sides moral equivalence between a man who hired someone to murder a woman and the woman he contracted to murder is the whole of the problem.\nAs Willa Paskin wrote in Slate, this portrayal was a choice on the part of the documentary-makers. The saga of Joe Exotic and his attempted hit on Carole Baskin was covered very differently by journalists who covered the story for reputable publications, including Texas Monthly and Longreads\nYou don't have to believe that Carole Baskin is a hero or even a decent person. But even if the bulk of what the documentary alleges and insinuates about her is true, she's still far from the show's most despicable character. And yet she's the one who has received the lion's share of the post-documentary outrage.\nI can't help but watch the conversation about Carole Baskin, Joe Exotic, and all the vile men of \"Tiger King,\" without thinking back to the 2016 presidential election, when a crass but entertaining carnival barker who bragged about grabbing women's genitals and had zero experience in politics nonetheless won against a competent, deeply intelligent, extremely qualified woman.\nThe dynamic, of course, is not identical here. But the reductionism and insistence on using the 'both-sides' approach is: the argument that everyone in politics lies, so it's not such a big deal that Trump does; that everyone in politics is corrupt, and Hillary Clinton is just as bad as Donald Trump. It lets us bring an imperfect but very obviously better candidate down to the level of a truly terrible man, and tell ourselves they're basically the same. Some perhaps think, 'Hey, he's at least entertaining and tells it like it is.'\nHating a woman who challenges a far more loathsome man is particularly easy to do when we see the woman as a scold. That's what seems to have so offended people about Carole Baskin: She was trying to boss around Joe Exotic and ruin his business; she's a hypocritical nag. We have a real cultural problem with women on a mission, especially if we perceive them as berating men, and especially when we see them attempting to exert power over men or take power that we subconsciously believe belongs to men.\nAnd so a lot of us end up cheering for the guy.\nJoe Exotic, like the President, takes any opportunity to brag about the press coverage he's receiving -- and he's loving the popularity of \"Tiger King.\" Carole Baskin, meanwhile, is calling the show \"salacious\" and published her version of the facts on her website while inundated with press calls and, I would guess, a lot of ugliness. Many viewers are perversely demanding that Joe Exotic be freed, and Carole Baskin investigated.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nYou don't have to feel guilty for watching and enjoying \"Tiger King.\" You don't have to like Carole Baskin. But it is a good moment to ask, why do so many larger-than-life men choose outspoken women as their targets for abuse? Why are we so quick to let ourselves believe that the women are the problem, or claim that an abusive and narcissistic man attacking a woman is a conflict stemming from both sides?\nWhy do we find these men entertaining even when we know they're wrong, while we loathe the women they target?", "url": "https://www.cnn.com/2020/04/03/opinions/tiger-king-misogyny-filipovic/index.html"}