{"authors": ["Summer Ballentine"], "date_download": "2020-05-04 20:14:52", "date_modify": "2020-05-04 20:14:52", "date_publish": "2020-04-07 13:33:06", "description": "COLUMBIA, Mo. (AP) — Missouri lawmakers took extraordinary steps to return to the usually crowded state Capitol on Tuesday to work on an emergency coronavirus funding bill. The Capitol has...", "filename": "_4beb786765872ab9ecccc035e2b9f8f3_1588623292.html", "image_url": "https://storage.googleapis.com/afs-prod/media/362994838ebb43329ce9098b6c44cc02/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_4beb786765872ab9ecccc035e2b9f8f3_1588623292.html", "title": "Missouri lawmakers return to Capitol for virus funding bill", "title_page": "Missouri lawmakers return to Capitol for virus funding bill", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "The Missouri Senate chamber sits empty on Thursday, March 12, 2020, in Jefferson City, Missouri, after senators adjourned for the day and announced they would not reconvene in a full session until at least March 30 because of concerns over the new coronavirus. Officials in state capitols across the country have been announcing new precautions intended to guard against the spread of the disease. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. (Photo by David A. Lieb)\nThe Missouri Senate chamber sits empty on Thursday, March 12, 2020, in Jefferson City, Missouri, after senators adjourned for the day and announced they would not reconvene in a full session until at least March 30 because of concerns over the new coronavirus. Officials in state capitols across the country have been announcing new precautions intended to guard against the spread of the disease. For most people, the new coronavirus causes only mild or moderate symptoms, such as fever and cough. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia. (Photo by David A. Lieb)\nCOLUMBIA, Mo. (AP) — Missouri lawmakers took extraordinary steps to return to the usually crowded state Capitol on Tuesday to work on an emergency coronavirus funding bill.\nThe Capitol has been closed to everyone except essential staff since March 24. But lawmaker approval is needed for Republican Gov. Mike Parson to spend what could amount to billions of dollars in federal funding for medical supplies, local governments, nursing homes and other aid.\nExactly how much federal money the state will get, and when, is unclear. Parson’s administration asked for the authority to spend roughly $4.8 billion in federal dollars in response to the pandemic, but at least $1.8 billion of that hasn’t been promised by Congress yet.\nState Budget Director Dan Haug said the purpose is to pad Parson’s spending authority in case more federal funding becomes available so Missouri lawmakers won’t need to return to the Capitol again.\nOut of federal stimulus funding that has already been approved by Congress, Haug said the state is expecting as much as $1 billion for local governments alone. K-12 schools could get at least $300 million for virus-related expenses, and colleges and universities could get $200 million.\nSenators on the Appropriations Committee wore face masks and gloves and went so far as to sit tables apart to ensure social distancing while debating the bill Tuesday.\nOnly 20 members of the public were allowed in the committee room, which normally can seat 100 people, Senate Administrator Patrick Baker said.\nThe committee hearing was livestreamed, although because of technical difficulties it’s unclear whether that provided adequate public access. Live video footage was not always accessible.\nMembers of the full House and Senate are expected to give the measures final approval Wednesday.\nMembers of the public will be allowed in the Capitol to watch the House and Senate proceedings on Wednesday from balcony seating, although Senate Republicans urged people to watch or listen from home.\nThose who come to the Capitol will have their temperatures checked and will be questioned about whether they’ve tested positive for coronavirus or been exposed to someone who has tested positive.\nLawmakers have been encouraged to stay in in their offices until they want to debate, ask questions or vote.\nCommunications Director Trevor Fox said the House aims to have fewer than 10 people in the chamber at any one time. He said the plan is to have each lawmaker in the 163-member House vote one at a time.\nOne state lawmaker, Rep. Joe Runions, has reported testing positive for COVID-19. The Kansas City-area Democrat at one point was hospitalized but is now recovering at home.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.", "url": "https://apnews.com/4beb786765872ab9ecccc035e2b9f8f3"}