{"authors": ["Daniel Dale", "Holmes Lybrand"], "date_download": "2020-05-04 16:13:22", "date_modify": "2020-05-04 16:13:22", "date_publish": "2020-04-03 03:23:50", "description": "President Donald Trump made fewer false claims than usual at Thursday's coronavirus briefing, ceding the floor to administration officials for extended periods and trading his usual inaccuracy for some vague musings and boasts.", "filename": "2020_04_02_politics_fact-ch_d662b0e936a28226056e855565108bc0_index_1588608802.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402181407-trump-coronavirus-test-briefing-04022020-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_fact-ch_d662b0e936a28226056e855565108bc0_index_1588608802.html", "title": "Fact-checking coronavirus briefing: Trump says scarves 'better' than masks, exaggerates Europe travel restriction", "title_page": "Fact-checking coronavirus briefing: Trump says scarves 'better' than masks, exaggerates Europe travel restriction   - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump made fewer false claims than usual at Thursday's coronavirus briefing, ceding the floor to administration officials for extended periods and trading his usual inaccuracy for some vague musings and boasts.\nTrump did, however, offer some more medical advice that is not endorsed by experts, this time claiming that thick scarves make for more effective protective masks than masks themselves. He also repeated his exaggeration that he had cut off travel from Europe.\nHere's our fact check:\nTrump's travel restrictions on Europe\nTouting actions he had taken to combat the coronavirus, Trump said of his travel restrictions on Europe: \"I cut off Europe very early.\"\nFacts First: Trump was exaggerating; he never \"cut off Europe\" entirely. Rather, he imposed restrictions on travel from most European countries but exempted others. And his restrictions did not apply to some people traveling from Europe: US citizens, permanent US residents, certain family members of both citizens and permanent residents, and some other groups of travelers.\nWhat constitutes \"very early\" is subjective. Trump announced his restrictions on Europe on March 11, the day the World Health Organization began calling the outbreak a pandemic. That was more than a month and a half after the first confirmed US case. By that day, Italy had more than 10,000 known cases of the virus, and the US more than 1,000\nTrump's restrictions initially applied to the 26 countries in the Schengen Area, a European zone in which people can move freely across internal borders without being subjected to border checks. Trump later added the United Kingdom and Ireland. That still left out some European countries, including Croatia, Serbia, Romania, Ukraine and Russia.\nYou can read more about the travel restrictions here\nScarves 'better' than masks\nWhile discussing the question of whether his administration will advise citizens to use masks, Trump claimed that some scarves can be more effective against the coronavirus, when used to cover people's faces, than masks themselves.\n\"In many cases the scarf is better; it's thicker. I mean you can -- depending on the material, it's thicker,\" the President said.\nTrump also said that new recommendations for civilians using masks will come out soon.\nFacts First: Though he was addressing what citizens should do, Trump's claim that scarves can work better than masks is not supported by the Centers for Disease Control and Prevention's Though he was addressing what citizens should do, Trump's claim that scarves can work better than masks is not supported by the Centers for Disease Control and Prevention's guidance to health care workers. While scarves may offer some protection, the CDC's advice describes scarves as a possible last resort if masks are not available.\nWhen masks are no longer available, the CDC says, workers \"might use homemade masks (e.g., bandana, scarf) for care of patients with COVID-19 as a last resort.\" The guidance also states that \"caution should be exercised when considering this option\" and that face shields should be used in addition to these homemade masks.", "url": "https://www.cnn.com/2020/04/02/politics/fact-check-trump-coronavirus-briefing-april-2/index.html"}