{"authors": ["Tom Davies", "Darron Cummings"], "date_download": "2020-05-04 20:25:44", "date_modify": "2020-05-04 20:25:44", "date_publish": "2020-04-09 03:44:27", "description": "GREENSBURG, Ind. (AP) — The coronavirus pandemic surged into Sean Durbin’s farm-speckled Indiana county much faster than most other parts of rural America, contributing to at least 10 deaths and...", "filename": "_8804e43e22ed235910bde0568faf5c81_1588623944.html", "image_url": "https://storage.googleapis.com/afs-prod/media/30a790cd60264d588adcfc4f7e8bc2db/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8804e43e22ed235910bde0568faf5c81_1588623944.html", "title": "‘What more could I have done?'", "title_page": "Rural Indiana virus worry: ‘What more could I have done?'", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Amanda Burkhead and Josh Cupit play a card game while sitting on the front porch, Thursday, April 2, 2020, in Greensburg, Ind. The couple worked at Honda will the plant was shut down due to COVID-19. Three southeast Indiana counties have among the highest per-capita coronavirus infection rates in the country. (AP Photo/Darron Cummings)\nAmanda Burkhead and Josh Cupit play a card game while sitting on the front porch, Thursday, April 2, 2020, in Greensburg, Ind. The couple worked at Honda will the plant was shut down due to COVID-19. Three southeast Indiana counties have among the highest per-capita coronavirus infection rates in the country. (AP Photo/Darron Cummings)\nGREENSBURG, Ind. (AP) — The coronavirus pandemic surged into Sean Durbin’s farm-speckled Indiana county much faster than most other parts of rural America, contributing to at least 10 deaths and dozens of serious illnesses.\nDecatur County and two other counties in southeast Indiana have among the highest per-capita infection rates in the country, topping the Seattle area and some counties near hard-hit Detroit.\nAs Decatur County’s public health preparedness coordinator, Durbin is working to stem the spread of the virus, even as he grieves the loss of a close friend to COVID-19 and stays apart from his wife so she can help with their new grandchild.\n“Every death makes me question if I did enough,” said Durbin, who is 57. “We have been ahead of everything the state has done in this county, and I still go to bed every night and ask, ‘What more could I have done to protect this population?’”\nLast Thursday, county officials banned nonessential travel and ordered all restaurants closed, including for takeout orders, going beyond the requirements of the governor’s stay-at-home order that took effect March 25.\nDecatur, Franklin and Ripley counties have a combined population of nearly 78,000 people and nearly 250 confirmed coronavirus cases through Wednesday, placing them among the top 100 counties for high infection rates across the nation, according to data tracked by Johns Hopkins University.\nHealth leaders can’t pinpoint why the area has such a high infection rate. Some point to truckers stopping off from Interstate 74 — the main route between Indianapolis and Cincinnati — and locals who work in those cities. Or suggest it’s linked to the young adults who have left their hometowns for jobs and schools in recent years.\n“With this crisis in the big cities, we’re seeing a lot of license plates from those other states showing up because they’re coming back to mom and grandma and uncle Joe,” said Dr. David Welsh, the Ripley County health officer.\nThere have been more than 20 COVID-19-related deaths in the three counties. At least two dozen patients are seriously ill, while others, including an 11-year-old child, have been recovering at home.\nFor most people, the coronavirus causes mild or moderate symptoms that clear up in two to three weeks. Older adults and people with existing health problems are particularly susceptible to more severe illness, including pneumonia.\nThe three counties have older populations than Indiana as a whole, with more than 17% of residents older than 65, according to census information.\nDecatur County officials imposed tougher travel and business restrictions after officials saw parents still taking their children grocery shopping and teenagers gathering in parking lots, Durbin said.\nOn the first day of the new rules, the streets in the county seat of Greensburg, population 12,000, were largely quiet, and few shoppers roamed the aisles of Walmart.\nGreensburg resident Judith Corner said she believed people were taking the warnings seriously, and that she agrees with the precautions.\n“I’ve had friends that are wearing their masks and gloves to the store,” she said. “If we go for a walk, then we stay 6 feet apart.”\nHonda’s 2,500-worker auto plant in Greensburg has been closed since March 23. A company spokesman said one contractor tested positive, and that person’s colleagues have been notified.\nThe area’s two hospitals, in Greensburg and Batesville, normally operate with 25 available beds each. Both have plans to more than double that capacity and treat more seriously ill patients as cases surge.\nDr. Wayne Perry, chief of staff at Decatur County Memorial, said his hospital has the same concerns as larger ones about the availability of testing, protective gear and ventilators. And he worries about the number of drivers he sees during his five-minute drive from home to the hospital.\n“Until people see and really understand and appreciate the threat, then it’s someone else’s problem,” Perry said. “These measures are so important. Our only fight against this right now is social distancing and following those guidelines.”\nThe Indiana State Department of Health has been assisting with testing and tracking illnesses in rural areas, said Dr. Kristina Box, the state health commissioner. The agency is also trying to help rural hospitals obtain equipment.\nDurbin has been staying away from his wife, including sleeping in a different room. They said their goodbyes on Monday, when she headed to Cincinnati to help their daughter with their new grandson.\nFull Coverage: Virus Outbreak\n“Couldn’t even give her a hug,” Durbin said. “We’ll just have to get used to that. That’s the way of life these days.”\nDurbin said he’s been healthy so far and will keep showing up at the four-employee Decatur County Health Department as long as he can. But he despairs at the prospect of not meeting his grandson for months and for the losses in the community where he’s lived since he was a teenager.\n“I know several of the people who have died. And if I don’t know them, I know somebody who knows them,” Durbin said. “So you see the grief. You see how it hits home. That would be the biggest difference than a big city — is that we all know each other. It’s like somebody from your family dying.”\n___\nDavies reported from Indianapolis. Associated Press video journalist Noreen Nasir in Chicago contributed to this report.", "url": "https://apnews.com/8804e43e22ed235910bde0568faf5c81"}