{"authors": [], "date_download": "2020-05-04 21:09:48", "date_modify": "2020-05-04 21:09:48", "date_publish": "2020-05-01 03:50:24", "description": "The best way Americans can support front-line community workers, Pelosi said, is to make sure they don't lose their jobs to budget cuts.", "filename": "entry_pelosi-one-trillion-dollars-coronavirus-aid_n_5eab9af2c5b6995f13feaf5c_1588626588.html", "image_url": "https://img.huffingtonpost.com/asset/5eab9bb930000008131553be.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_pelosi-one-trillion-dollars-coronavirus-aid_n_5eab9af2c5b6995f13feaf5c_1588626588.html", "title": "Cities And States Request $1 Trillion In Coronavirus Aid, Says Pelosi", "title_page": "Cities And States Request $1 Trillion In Coronavirus Aid, Says Pelosi | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "WASHINGTON (AP) — House Speaker Nancy Pelosi said Thursday that state and local governments are seeking up to $1 trillion for coronavirus costs, a stunning benchmark for the next aid package that’s certain to run into opposition from Senate Republicans.\nPelosi acknowledged the federal government may not be able to provide that much. But she said money for “heroes” is needed to prevent layoffs as governors and mayors stare down red ink in their budgets. Many jurisdictions are facing rising costs from the health pandemic and plummeting revenues in the economic shutdown. The best way Americans can support front-line community workers, Pelosi said, is to make sure they don’t lose their jobs to budget cuts.\n“This is something of the highest priority,” Pelosi said. “It honors our heroes.”\nNurses, transit bus drivers and other workers “are risking their lives to save lives, and now they’re going to lose their jobs,” she said.\nThe $1 trillion price tag comes after Senate Majority Leader Mitch McConnell shifted his tone, suggesting he is “open” to considering additional funds in the next coronavirus relief bill.\nBut the eye-popping figure would be on top of the nearly $3 trillion Congress has already approved to salvage the economy and confront the health crisis.\nAt the White House, President Donald Trump said, “We’ll see what happens.”\nTrump said, “If we do that, we’ll have to get something for it.”\nCongress is partially reopening next week as the House convenes key committee hearings and the Senate gavels into session after being shuttered for more than a month during the pandemic.\nBut the legislative branch will be a changed place.\nSenators are recommended to wear masks, keep 6 feet apart and have most staff work from home, according to official guidance. At the private Republican lunches, it will be just three senators to a table. Democrats will have lunch by conference call.\nSenators are raising alarms about the health risks of resuming operations.\nOn a conference call Thursday, the Capitol physician said his office does not have a testing system available for instant virus checks, as happens at the White House, according to a Republican familiar with the call with chiefs of staff.\nInstead, the physician said the office only checks those lawmakers who are showing symptoms. Test results take up to seven days, he told them.\nNotably, key public hearings may not have many members of the public, under guidance from the Senate Rules Committee that says people can view the proceedings online.\nOfficials are especially concerned about the hundreds of cooks, custodial staff and maintenance workers needed to run the vast Capitol complex for the 100 senators.\nThe House declined this week to bring its 430 members back into session after the Capitol physician warned it was not worth the health risks. McConnell has declined to say if he consulted with the physician in deciding to resume Senate operations.\nAs the new aid package takes shape, McConnell said Thursday on Fox that he’s willing to consider money for the states but isn’t about to send federal dollars to bail out overspending.\n“We’re not interested in borrowing money from future generations to send down to states to help them with bad decisions they made in the past unrelated to the coronavirus epidemic,” the GOP leader said.\nMcConnell insists any fresh funding must be tied to liability reforms to prevent what he calls “an epidemic of lawsuits” against doctors, hospitals and businesses reopening in the pandemic.\nIn meeting with Trump at the White House, Democratic Gov. Phil Murphy of New Jersey said his state alone may need $20 billion to $30 billion.\n“This is a big hit,” Murphy said. “We don’t see it as a bailout.”\nEconomic wreckage from the coronavirus outbreak threatens McConnell’s own home state as well. Kentucky’s state government faces a revenue shortfall, according to a budget report issued Thursday.\nThe grim projections could force Democratic Gov. Andy Beshear to make painful budget cuts at a time when the virus outbreak has shuttered many businesses and put hundreds of thousands of Kentuckians out of work.\nBeshear said he made a pitch for additional federal assistance in a Thursday conversation with McConnell.\n“I appreciate him hearing me out,” Beshear said at his daily briefing. “Now I hope that he will be able to act.”\nIn outlining priorities for the next package, Pelosi said the new funding for state, county and city governments could be spread out over several years.\nThe California Democrat said governors have asked for $500 billion, and county and city governments are requesting a similar amount.\n“We’re not going to be able to cover all of it,” Pelosi said.\nBut to the extent the federal government can provide funds to prevent widespread layoffs, she said, “that’s our goal.”\nCongressional leaders staked out priorities for the next, fifth round of aid, even as key senators sounded alarms over the health risks of reopening the U.S. Capitol.\nSen. Dianne Feinstein, D-Calif., urged McConnell to reconsider. “This is the wrong example for the country,” she said in a statement.\nThe Washington, D.C., region remains a virus hot spot, health officials say. Stay-home orders are in place through mid-May for the District of Columbia.\n“I think we can conduct our business safely,” McConnell said on Fox.\nThe Republican leader faced a storm of criticism from the nation’s governors after panning Democrats’ proposal for more state aid. Last week, he suggested states should be allowed to go bankrupt.\nHis priority as senators return Monday is to consider Trump’s nominees for judicial and executive branch positions, including Rep. John Ratcliffe, R-Texas, Trump’s choice to be the new director of the Office of National Intelligence.\nSenate Democratic leader Chuck Schumer said the Senate instead should focus on congressional oversight of the federal coronavirus response.\n___\nSchreiner reported from Frankfort, Ky. Associated Press writers Kevin Freking, Mary Clare Jalonick and Laurie Kellman in Washington contributed to this report.", "url": "https://www.huffpost.com/entry/pelosi-one-trillion-dollars-coronavirus-aid_n_5eab9af2c5b6995f13feaf5c"}