{"authors": ["Em Steck"], "date_download": "2020-05-04 16:17:23", "date_modify": "2020-05-04 16:17:23", "date_publish": "2020-04-03 23:44:35", "description": "President Donald Trump said Friday evening that he thought Health and Human Services Secretary Alex Azar was referring to the \"concept\" of pandemics after it was reported Azar said last year the threat of a pandemic kept him up at night.", "filename": "2020_04_03_politics_kfile-trump-pandemics-azar_index_1588609043.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403175217-01-trump-coronavirus-presser-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_kfile-trump-pandemics-azar_index_1588609043.html", "title": "Trump says HHS secretary meant the 'concept' of a pandemic kept him up at night in 2019 comment", "title_page": "Trump says HHS secretary meant the 'concept' of a pandemic kept him up at night in 2019 comment - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump said Friday evening that he thought Health and Human Services Secretary Alex Azar was referring to the \"concept\" of pandemics after it was reported Azar said last year the threat of a pandemic kept him up at night.\nCNN's KFile reported earlier Friday that Azar said in April 2019 at the Biodefense Summit that the threat of a pandemic kept him up at night, undercutting Trump's previous claims that \"nobody knew\" there could be a pandemic.\nWhen asked about KFile's reporting by CNN's Jim Acosta, Trump said he assumed Azar's comments referred to the \"concept\" of a pandemic and not any specific threat, and the President said he \"always knew\" pandemics were bad.\n\"I always knew that pandemics are one of the worst things that could happen,\" Trump said at the White House coronavirus task force news briefing. \"I've heard about this for a long time, pandemics. You don't want pandemics. I don't think he was talking about a specific pandemic, he was talking about the threat of a pandemic could happen. And it could happen. Most people thought it wouldn't, and most people didn't understand the severity of it.\"\n\"I assume that he was talking about the concept of a pandemic,\" Trump added.\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/kfile-trump-pandemics-azar/index.html"}