{"authors": ["Mitchell Mccluskey"], "date_download": "2020-05-04 16:21:39", "date_modify": "2020-05-04 16:21:39", "date_publish": "2020-04-06 00:50:48", "description": "An employee at a Prescott, Arizona, hospital was arrested after being accused of stealing $1,700 worth of protective equipment and cleaning supplies, Prescott Police said in a statement on Saturday.", "filename": "2020_04_05_us_arizona-coron_2670badd3e031e871ac9de05c2b00672_index_1588609299.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405152113-keith-brown-mugshot-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_arizona-coron_2670badd3e031e871ac9de05c2b00672_index_1588609299.html", "title": "Arizona hospital employee arrested, accused of stealing protective equipment", "title_page": "Arizona man arrested after being accused of stealing protective coronavirus equipment and cleaning supplies - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An employee at an Arizona hospital was arrested after being accused of stealing $1,700 worth of protective equipment and cleaning supplies, police said.\nKeith Brown, 49, was arrested and booked into the Yavapai County Jail on one count of felony theft and one count of fraud, the Prescott Police Department said in a statement Saturday.\nThe arrest comes at a time when health care workers and others on the frontline of the coronavirus epidemic are facing a critical shortage of protective equipment including masks, gloves, cleaning products and toilet paper, which are hard to find across the country.\nBrown worked in the housekeeping department of the Yavapai Regional Medical Center West Campus, who contacted police on Friday regarding suspicions that Brown had been stealing supplies.\nWhile being interviewed by police, Brown admitted to stealing gloves, hand sanitizer, surgical scrubs, wash cloths, paper towels, masks, bleach cleaner, toilet paper, and an automatic hand sanitizer over the last three weeks, Prescott Police said.\nRead More", "url": "https://www.cnn.com/2020/04/05/us/arizona-coronavirus-hospital-supplies-arrest-trnd/index.html"}