{"authors": ["Senior Editor Of Food", "Style"], "date_download": "2020-05-04 20:13:16", "date_modify": "2020-05-04 20:13:16", "date_publish": "2020-04-30 13:06:57", "description": "A face mask fitted with a pipe cleaner can offer comfortable coronavirus protection and keep your glasses from fogging.", "filename": "entry_how-to-make-face-mask-nose-wire_l_5eaa3fb9c5b6edf4130e0e8b_1588623196.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa4db33000003012155287.jpeg?cache=dUYcX7hOxj&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_how-to-make-face-mask-nose-wire_l_5eaa3fb9c5b6edf4130e0e8b_1588623196.html", "title": "How To Make A Face Mask With Nose Wire", "title_page": "How To Make A Face Mask With Nose Wire | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "If you’re having trouble getting your face mask to fit snugly, get out your pipe cleaners ― this may be the first time you’ve needed them since kindergarten.\nEver since the Centers for Disease Control and Prevention advised every American to wear a face covering in public to slow the spread of COVID-19, each new day has been an immersion course on how to properly wear a mask.\nOne of the biggest mistakes people make is wearing it too loosely, allowing coronavirus particles to freely travel to and from the nose and mouth. Not only that, but a loose mask is tempting to reach up and adjust ― and we all know that touching your face is a terrible idea these days.\nA loose mask is also a problem for those who wear glasses or sunglasses. When warm breath escapes through the top of a loose-fitting mask, it inevitably fogs up lenses, making them difficult to see through. (Check out some additional solutions for foggy lenses here.)\nThe solution is simple: Wear a face mask fitted with a wire nose piece.\nMany DIY tutorials advise inserting pipe cleaners into face masks because their soft, velvety casing is comfortable on the bridge of the nose. Once the wire is affixed to the face mask, one simple pinch on the bridge of your nose can adjust your mask to the contours of your face, providing a closer fit and solving all of the aforementioned problems.\nIf you’ve already learned how to sew a DIY face mask, making one with a wire isn’t much more extra work ― most patterns can accommodate the addition of a pipe cleaner or craft wire at the bridge of the nose.\nIf you’d like some specific DIY tutorials for face masks with wire nose pieces, we’ve got three below: two for pleated masks (one made with a sewing machine and one no-sew version), as well as a more fitted face mask (sewing machine required).\nPleated Face Mask with Filter Pocket and Pipe Cleaner Nose Piece (SEWING MACHINE REQUIRED)\nPleated Fabric Face Mask with Filter Pocket and Pipe Cleaner Nose Piece (NO-SEW)\n(Note: This isn’t as durable in a washing machine as the sewn version above.)\nFitted Face Mask with Removable Wire Casing (SEWING MACHINE REQUIRED)\nThis uses a simple craft wire, but a pipe cleaner would also work.", "url": "https://www.huffpost.com/entry/how-to-make-face-mask-nose-wire_l_5eaa3fb9c5b6edf4130e0e8b"}