{"authors": ["Lauren Fox", "Jeremy Herb"], "date_download": "2020-05-04 16:17:05", "date_modify": "2020-05-04 16:17:05", "date_publish": "2020-04-03 21:57:54", "description": "Technical glitches, lender frustrations and lawmakers even live tweeting their own problems with Friday's rollout overshadowed the first hours of the Small Business Administration's Paycheck Protection Program, the new loan program that was designed to help put millions directly into the hands of small business owners affected by coronavirus.", "filename": "2020_04_03_politics_small-business-loan-problems_index_1588609025.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200326164858-us-main-street-small-businesses-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_small-business-loan-problems_index_1588609025.html", "title": "SBA loan program glitches reveal challenge in rolling out billions in coronavirus aid", "title_page": "SBA loan program glitches reveal challenge in rolling out billions in coronavirus aid - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Technical glitches, lender frustrations and lawmakers even live tweeting their own problems with Friday's rollout overshadowed the first hours of the Small Business Administration's Paycheck Protection Program, the new loan program that was designed to help put millions directly into the hands of small business owners affected by coronavirus.\nIn less than a week, the SBA, which handled just $28 billion in loans in 2019, stood up a platform to try and begin disbursing nearly $350 billion through an entirely new program Friday.\nBut concerns about lender liability, glitches with the interface banks used to upload loan information and delayed participation by major banks all culminated into a rocky first few hours.\nThe issues surrounding the rollout of the small business loan program are an early sign that efforts to quickly dole out funds from the massive $2 trillion stimulus are going to be rocky, including disbursement of direct payments to individuals and states having to disburse a record number of unemployment insurance claims.\nCongressional leaders and aides acknowledged that getting the money out the door so rapidly was never going to be easy.\nThe tensions in the small business program stem from the need to get the funding out quickly to businesses no longer collecting revenue due to coronavirus shutdowns, while ensuring the money goes out where it's intended.\n\"There are bound to be problems,\" Senate Majority Leader Mitch McConnell told McClatchy this week . \"You can't pass a bill of this magnitude in a week and have a perfect implementation of $2.2 trillion, so sure there are going to be glitches.\"\nCNN obtained an email Friday morning SBA sent to stakeholders acknowledging issues with their input system lenders were using to process loans for small businesses.\n\"We've heard about the E-Tran security request issues. Here's what we are doing NOW to improve this now while preserving IT infrastructure security,\" SBA wrote, adding they were running a \"script to enable all lenders that previously had an account with Capital Access Financial Systems\" to be \"automatically reactivated.\"\nNevertheless, throughout the day on Friday, Treasury Secretary Steve Mnuchin continued to tout the successes of the program. \"Update over $1.8 billion in #PPPloan now processed by @SBAgov mostly all from community banks. Big banks taking in large amounts, but not yet submitted in these numbers!\" he tweeted Friday afternoon.\nBut lawmakers and small business advocates said they were hearing a litany of issues.\nVirginia Sen. Mark Warner, a top Democrat on the Senate Banking Committee, tweeted that he had heard directly from lenders saying there were delays in the system.\n\"The #PPPLoan is a lifeline for small businesses... but only if it works. Seeing concerning reports of technical problems with @SBAGov's E-Tran site preventing loans from getting out to small businesses. I know people are working hard on this, but we need to get it sorted out ASAP,\" Warner said.\nSen. Marco Rubio, the chairman of the Senate's Small Business Committee, recorded a video message and took to Twitter to admonish banks that were declining to offer loans to individuals who didn't have both business and credit accounts with their bank.\n\"I'm reading that some of the big banks, not all, but some, are creating all these crazy restrictions about you don't just have to have a small business account with them, you might also have to have a credit card,\" Rubio said. \"So, let me just say this as nicely as I possibly can: please don't be a bunch of jerks, OK.\"\nAdam Temple, vice president of public affairs at the National Federation of Independent Business, told CNN that for the entire day, his group had been inundated with stories about small business owners who were struggling to find a bank that would accept their loan application. With some banks choosing not to process the loans or delaying their rollout, many business owners were forced to go to a new bank to get a loan, only to find the new bank had a requirement that businesses already had to be an existing customer.\nThe process was anxiety inducing for business owners who were watching the Treasury secretary tweet out every few hours how much money had already been distributed by the loan program, Temple said.\n\"In many cases, the bank where they are a customer tells them they're not doing it, forcing them to try elsewhere and they're running into that issue -- that they're not an existing customer. So they can't get anywhere,\" Temple said. \" We did a webinar at noon and had 7,000 small business owners log in. They're also calling us directly, almost all with some version of the same issue.\"\nThe way that Treasury's guidance was written when it was released Thursday night had banks still worried they could be liable for fraudulent loans, one industry source told CNN. Banks were interpreting the Treasury guidance to still require the \"know your customer\" verification and safeguards, and the fastest way to check if a customer had met those requirements was to see if they had a credit account where the more rigorous checks would have already been done.\nRep. Don Beyer, a Virginia Democrat, said he was speaking to lenders in his state on Thursday who still didn't know how the program would operate. \"Here's the problem: SBA and Treasury were still figuring out/telling people how PPP was supposed to work hours before it went online to process loans,\" Beyer tweeted.\nBeyer urged banks to lend anyway. \"I know the guidance is unclear, and there is lots of uncertainty. I've been hearing that the portal SBA set up to process these loans for banks has crashed and isn't working. We have to make this work, millions of Americans are depending on this program. We have to get this right,\" he said.", "url": "https://www.cnn.com/2020/04/03/politics/small-business-loan-problems/index.html"}