{"authors": ["Kristen Rogers"], "date_download": "2020-05-04 16:56:04", "date_modify": "2020-05-04 16:56:04", "date_publish": "2020-04-09 08:13:24", "description": "People have turned to baking as a hobby and source of comfort. Not only is baking pleasing to your senses, but it's good for your mental and emotional health, too.", "filename": "2020_04_09_health_bread-bak_dbb3762b6a5786c3146c89404e65047b_index_1588611364.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403094723-person-baking-bread-oven-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_bread-bak_dbb3762b6a5786c3146c89404e65047b_index_1588611364.html", "title": "Finding solace in baking during a pandemic", "title_page": "Finding solace in baking during a pandemic  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Since the coronavirus pandemic shut down Italy, her hobby has become more important than ever to help her feel connected to herself.\nCorradini and her boyfriend have been on lockdown togetherfor almost a month now, only leaving to buy groceries and deliver food to her boyfriend's parents.\n\"I can say that [baking] is saving my days and my mind ,\" she said. \"It has never been more important to have a hobby than it is now.\"\nShe's in good company. People around the world -- including nearly all Americans -- have been advised or ordered to stay home. Many are taking up bread baking to fill the time and easy their nerves -- and enjoy some good bread as a result.\nmade banana bread so the aroma can comfort me. it worked. pic.twitter.com/8GDJOKnrWZ — josh edwards (@joshuedwrds) March 29, 2020\nbut also to build a Corradini bakes daily, primarily to pass the long hours of isolationbut also to build a community of bread bakers on Instagram , where followers keep each other updated on ingredient availability and exchange advice.\n\"Baking bread to me is really therapeutic. It makes me feel alive and connected with myself and my dexterity,\" she said. \"I think it is very important now to re-evaluate our priorities and stay more in touch with ourselves, too.\"\nA sourdough loaf made by Corradini.\nShe's also happy to slow down.\n\"I enjoy the fact that bread making is a slow process, which goes against the rapid lives that we live normally,\" Corradini said. \"Making bread is slow and engaging, therefore it's a privilege. Having time and energy to dedicate to this hobby is a privilege. [And] it's exciting, because you never know the outcome.\"\nBaking can help your mental health\nIt's no surprise that Corradini's quarantine baking hobby makes her feel better, experts say.\nBaking provides a sense of accomplishment, \"especially in this period of angst and unknowns,\" said Michael Kocet, a licensed mental health counselor and professor and department chair of the Counselor Education Department at The Chicago School of Professional Psychology.\nBaking can give us something concrete to create, control and enjoy when we have the finished product. That can help reduce the anxiety stemming from the unfamiliarity of dealing with a pandemic, he added.\nSpecific parts of the baking process also teach lessons applicable to our daily lives and can lead to a state of mindfulness, Kocet said. Kneading, waiting for it to rise, scoring and standing by while it bakes give us time to reflect -- and those steps all require patience and precision that can help someone feel centered and focused.\n\"You may have to prepare the dough and wait to let it rise overnight. There's a period of waiting that I think is very symbolic of the waiting we're collectively doing,\" Kocet said.\nThe reearch backs Kocet up. One study on baking's impact on mental health found it helped participants gain a sense of purpose, structure their days and increase their motivation levels.\n\"With baking bread there's a lot of physicality, and the kneading of the dough and getting it into the right shape can help you relieve some tension,\" said Elizabeth McKay, author of the study and associate professor of occupational therapy at Edinburgh Napier University.\nTaking on a recipe , such as beginning a sourdough starter, seeing progress from week to week and receiving positive feedback from others can increase confidence levels, McKay said.\n\"That's where social media is so good because people are like, 'Whoa, you made that?' Even in our shutdown days, you can put it on social media where people give you feedback, and I think that really helps as well,\" she added.\nLooking out for loved ones\nAbigail Rudolph has turned to social media to take orders for her bread.\nA teacher who always helped her mother and grandmother in the kitchen when she was young, Rudolph has been baking on and off her whole life, taking what her family matriarchs taught her and making it her own.\nher free time. It also helps ease her depression and When New Mexico closed the public schools, baking was naturally the way she wanted to spendher free time. It also helps ease her depression and anxiety\n\"This whole situation has been hard on all of us,\" she said. \"The baking gives me something positive to focus my mind on, and as a result I get to bring a little happiness into the lives of the people I care about. They're also doing the same for me.\"\nBanana bread baked by Rudolph.\nBaking gives her a way to check in with loved ones to make sure they're not \"falling off the edge.\" It also helps ease her concern that maybe she's not doing enough to help others.\n\"It's something I can do well, a small way that I can put some good out into the world when it feels like it's falling apart,\" Rudolph said. \"It keeps me on track and focused during a time when my normal routines aren't there to support me.\"\nThrough her Instagram profile, Rudolph asks her friends to make baking requests, which she promises to deliver from six feet away within the week.\nBrownies Rudolph baked for a friend.\n\"The process of getting the requests, making my plans, executing them, chronicling the experience and sharing the recipes is what's keeping me sane,\" Rudolph said. \"Each new project keeps me from getting lost in the negativity and guilt, and gives me a sense of purpose.\"\nHow to start baking\nIf you could use a little baking therapy in your life, Kocet encourages starting with a recipe you've always wanted to try, joining a virtual baking club or participating in sharing your photos on social media with the hashtag #quarantinebaking , where other baking fanatics await.\nIf bread flour or yeast is in short supply in your area -- since so many people are baking -- why not try a no-yeast bread recipe or even a gluten-free one? Irish soda bread is yeast-free, and there are more than a few hundred gluten-free recipes online.\nSome quarantined neighbors in San Francisco have gotten creative by swapping sourdough starters at a safe distance by putting them in plastic bags and tacking them to phone poles.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nIf you feel stressed about getting started, know that it's not about creating or baking the perfect loaf of bread. It's about enjoying oneself as much as we can, experimenting, trying something new, then sharing it virtually, Kocet said.\n\"Even though this is a difficult time and we don't know how long this is going to happen, this could clearly go into the summer or much further,\" he added.\n\"How will people maintain their mental health and wellness? Cooking and baking can certainly be a way to do that.\"", "url": "https://www.cnn.com/2020/04/09/health/bread-baking-health-benefits-coronavirus-wellness/index.html"}