{"authors": ["Madeline Holcombe"], "date_download": "2020-05-04 16:01:42", "date_modify": "2020-05-04 16:01:42", "date_publish": "2020-04-01 17:14:09", "description": "Federal guidelines preventing men who have sex with other men from donating blood for clinical trials to treat coronavirus patients are discriminatory, LGBTQ advocacy group GLAAD said.", "filename": "2020_04_01_health_plasma-coronavirus-donation-fda-men-glaad_index_1588608102.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401014642-coronavirus-plasma-donation-fda-men-glaad-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_health_plasma-coronavirus-donation-fda-men-glaad_index_1588608102.html", "title": "GLAAD criticizes FDA ban on blood and plasma donations from gay and bisexual men during coronavirus pandemic", "title_page": "GLAAD criticizes FDA ban on blood and plasma donations from gay and bisexual men during coronavirus pandemic - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Federal guidelines preventing men who have sex with other men from donating blood for clinical trials to treat coronavirus patients are discriminatory, LGBTQ advocacy group GLAAD said.\npetition , nearing 20,000 signatures, calls for an end to the \"antiquated ban\" for donating blood, the media advocacy organization for people who identify as gay, lesbian, bisexual, transgender and/or queer said.\nThe blood donation policy according to the FDA's guidelines, is an attempt to reduce the risk of HIV transmission.\n\"The FDA cannot let an outdated and discriminatory ban on blood donations from gay and bi men get in the way of potentially life-saving treatment for the country's painful current health crisis,\" said GLAAD President and CEO Sarah Kate Ellis. \"Continuing to enforce this antiquated policy is dangerous, irresponsible, and flies in the face of recommendations from medical experts.\"\nAn FDA spokesperson, acknowledging the decline in blood and plasma donations across the US, told CNN, \"At this time, FDA's recommendations regarding blood donor deferral for men who have sex with men have not changed, but we are actively considering the situation as the outbreak progresses.\"", "url": "https://www.cnn.com/2020/04/01/health/plasma-coronavirus-donation-fda-men-glaad/index.html"}