{"authors": ["Matthew Brown"], "date_download": "2020-05-04 20:22:17", "date_modify": "2020-05-04 20:22:17", "date_publish": "2020-04-16 16:58:22", "description": "BILLINGS, Mont. (AP) — Native American tribes and environmental groups pressured a federal judge on Thursday to shut down work on the disputed Keystone XL pipeline from Canada to Nebraska, citing...", "filename": "_0aa2211e597913c4e95c9a6e4c40bc6a_1588623737.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0b5c65d64a9d4cd8b944710226439df7/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0aa2211e597913c4e95c9a6e4c40bc6a_1588623737.html", "title": "Tribes press judge to halt US-Canada pipeline as work starts", "title_page": "Tribes press judge to halt US-Canada pipeline as work starts", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "This March 11, 2020 photo provided by the Bureau of Land Management shows a storage yard north of Saco, Mont., for pipe that will be used in construction of the Keystone XL oil pipeline near the U.S.-Canada border. A Canadian company said Monday, April 6, 2020, that it's started construction on the long-stalled Keystone XL oil sands pipeline across the U.S.-Canada border, despite calls from tribal leaders and environmentalists to delay the $8 billion project amid the coronavirus pandemic. (Al Nash/Bureau of Land Management via AP)\nThis March 11, 2020 photo provided by the Bureau of Land Management shows a storage yard north of Saco, Mont., for pipe that will be used in construction of the Keystone XL oil pipeline near the U.S.-Canada border. A Canadian company said Monday, April 6, 2020, that it's started construction on the long-stalled Keystone XL oil sands pipeline across the U.S.-Canada border, despite calls from tribal leaders and environmentalists to delay the $8 billion project amid the coronavirus pandemic. (Al Nash/Bureau of Land Management via AP)\nBILLINGS, Mont. (AP) — Native American tribes and environmental groups pressured a federal judge on Thursday to shut down work on the disputed Keystone XL pipeline from Canada to Nebraska, citing fears that workers could spread the coronavirus and construction could damage land.\nAfter years of delays, the company is rushing ahead amid the pandemic to get part of the line built so it will be harder to stop, attorneys for the project’s opponents argued in a teleconference to decide if the construction should be halted.\nThey warned that plans to build construction camps housing up to 1,000 workers each pose a risk to tribes and rural communities that already struggle to provide basic health care services and would face challenges responding to coronavirus outbreaks.\nThe first U.S. segment of the 1,200-mile (1,900-kilometer) oil sands pipeline was installed by TC Energy this week across the Canada border in northern Montana. The fight over the line stretches back more than a decade after it became a lightning rod in the debate over fossil fuels’ contribution to climate change.\n“With the rise of the pandemic, it is even more important to protect the tribe to at least put a pause on this activity, take hard look at this,” said Matthew Campbell, an attorney for the Native American Rights Fund representing the Rosebud Sioux Tribe of South Dakota and the Assiniboine and Gros Ventre tribes of the Fort Belknap reservation in Montana.\nU.S. District Judge Brian Morris did not immediately rule following an almost four-hour hearing that also included arguments over whether President Donald’s Trump’s authorization of the border crossing was legal.\nTrump is a champion of the $8 billion project and gave it a presidential authorization last year in a bid to circumvent a 2018 court ruling from Morris that had blocked the project and prompted a new environmental review.\nLate Wednesday, Morris handed another setback to TC Energy with a ruling that invalidated a key U.S. Army Corps of Engineers clean water permit. The so-called nationwide permit applied to a broad range of projects including Keystone XL, and is needed to so the pipeline can cross rivers, streams and other waterways.\nKeystone XL would have hundreds of those crossings along its 1,200-mile (1,930 kilometer) route from Hardisty, Alberta to Steele City, Nebraska. It would carry up to 830,000 barrels (35 million gallons) of crude daily and opponents say a spill is inevitable.\nWorkers on Monday installed the first section of pipe across the U.S.-Canada border in northern Montana, according to court documents. Calgary-based TC Energy says it’s taking steps to prevent any virus transmissions, including checking anyone entering work sites for symptoms and abiding by a 14-day quarantine for anyone who leaves Montana and returns.\nThe border crossing work does not require the Army Corps permit that was thrown out because there are no nearby waterways. But it’s a major obstacle to any further work, and a company spokesman warned the judge’s ruling has broad implications for projects across the U.S.\n“The ruling directly impacts various utilities constructing and maintaining infrastructure projects, including natural gas, liquids, television cable, electrical transmission, telephone, internet, among others,” pipeline spokesman Terry Cunha said. “This decision hampers their ability to build or maintain infrastructure projects in wetlands and water bodies across the U.S.”\nFull Coverage: Montana\nThe Army Corps referred questions to U.S. Justice Department spokesman Wyn Hornbuckle, who said government attorneys were evaluating options but provided no further details.\nTC Energy plans to drill tunnels for the pipeline deep beneath major river crossings and says it will be operated safely. The company has a history of spills from other oil pipelines it operates, including a 2017 accident near Amherst, South Dakota that spilled almost 10,000 barrels (407,000 gallons) of oil.\nTC Energy’s surprise March 31 announcement that it planned to start construction on Keystone XL amid a global economic crisis caused by the coronavirus pandemic came after the provincial government in Alberta invested $1.1 billion to jump-start the work.\nTribal leaders and some residents of rural communities along the pipeline’s route worry thousands of workers needed for the project could spread the virus in small communities that are unprepared.\nTC Energy wants to “use this construction as justification for allowing the project to proceed whether or not it is legal,” the tribes’ attorney said.\nAs many as 11 construction camps, some housing up to 1,000 people, were initially planned for the project. TC Energy says those are under review amid the pandemic and won’t be needed until later in the summer.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.\nThe rural counties along the pipeline’s route so far have seen far fewer infections than other parts of the U.S. But they lack adequate health care services to deal with a large outbreak.\nConstruction on two worker camps could start as soon as this month in Montana and South Dakota, according to court documents filed by the company.\nThe construction under way in Montana involves about 100 workers. It’s exempted from Democratic Gov. Steve Bullock’s March 26 “stay at home” directive, which is aimed at preventing the spread of the virus by discouraging many daily activities, according to state officials.\nThe directive did not address worker camps. Bullock spokeswoman Marissa Perry said the governor wants all coronavirus concerns addressed before TC Energy finalizes its plans in areas requiring camps.\n___\nFollow Matthew Brown at https://twitter.com/matthewbrownap", "url": "https://apnews.com/0aa2211e597913c4e95c9a6e4c40bc6a"}