{"authors": ["Matt Mcfarland", "Cnn Business"], "date_download": "2020-05-04 16:57:00", "date_modify": "2020-05-04 16:57:00", "date_publish": "2020-04-09 12:19:03", "description": "Barney Shapiro, owner of Tenleytown Trash, never expected that he would turn to the Washington National Opera's costume department to design gear for his employees. But when a member of his staff heard the National Opera was sewing masks for workers on the frontlines of the coronavirus pandemic, he jumped at the chance.", "filename": "2020_04_09_economy_trash-collection-coronavirus_index_1588611420.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408150512-tenleytown-trash--recycling-worker-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_economy_trash-collection-coronavirus_index_1588611420.html", "title": "Trash collectors overwhelmed by rising amount of household waste", "title_page": "Trash collectors overwhelmed by rising amount of household waste - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington, DC (CNN) Barney Shapiro, owner of Tenleytown Trash, never expected that he would turn to the Washington National Opera's costume department to design gear for his employees. But when a member of his staff heard the National Opera was sewing masks for workers on the frontlines of the coronavirus pandemic, he jumped at the chance.\nShapiro's staffers haul trash in Washington, DC, and Maryland. Like the entire waste management industry, Shapiro is trying to keep his employees healthy and safe so they can handle the massive influx of household trash that is accumulating as more Americans self-quarantine at home.\n\"Our residential volumes are drastically increased,\" Shapiro said. \"People are calling in and asking for increased services. We can't do that on a short-term basis. It's just a nightmare.\"\nTenleytown Trash workers are wearing masks made by the Washington National Opera's costume department.\nwaste, about 50 communities nationwide have paused curbside recycling pickup and dozens have suspended yard waste collection, according to the Solid Waste Association of America. Other companies are shifting workers to residential routes and away from slower commercial routes where many of the businesses have closed. Republic Services, one of the largest waste management companies in the US, said it expects the volume of residential garbage to increase by as much as 30% . In order to redirect resources and address the growing amount of day-to-day householdwaste, about 50 communities nationwide have paused curbside recycling pickup and dozens have suspended yard waste collection, according to the Solid Waste Association of America. Other companies are shifting workers to residential routes and away fromslower commercial routeswhere many of thebusinesses have closed.\nCompanies are also making contingency plans in case the residential volume becomes too great or their workers get sick.\nRead More", "url": "https://www.cnn.com/2020/04/09/economy/trash-collection-coronavirus/index.html"}