{"authors": ["Zachary Cohen", "Jim Sciutto", "Alex Marquardt", "Evan Perez"], "date_download": "2020-05-04 16:57:59", "date_modify": "2020-05-04 16:57:59", "date_publish": "2020-04-09 02:14:06", "description": "US spy agencies were tracking the rise of the novel coronavirus as early as November, weeks before that information was included in President Donald Trump's daily intelligence briefing, a former US military official told CNN.", "filename": "2020_04_08_politics_intel-agencies-covid-november_index_1588611479.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408191448-trump-task-force-briefing-4-8-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_intel-agencies-covid-november_index_1588611479.html", "title": "US intelligence agencies started tracking coronavirus outbreak in China as early as November", "title_page": "US intelligence agencies started tracking coronavirus outbreak in China as early as November - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) US spy agencies were tracking the rise of the novel coronavirus as early as November, weeks before that information was included in President Donald Trump's daily intelligence briefing, a former US military official told CNN.\nWhile the exact date of the first report remains unclear, sources told CNN that intelligence gathered in November and in the weeks following offered multiple early warnings about the potential severity of the pandemic now surging in the US.\nIntelligence is often only elevated to the highest levels of the government once analysts and officials reach a certain threshold of confidence in their assessment. That day came on January 3, the first day the President's daily briefing included information the US intelligence community had gathered about the contagion in China and the potential it had to spread, including to the US, according to a person briefed on the matter.\nBut behind the scenes, the work had been going on for weeks, with the CIA and other intelligence agencies combing through their collection to find out what China was beginning to grapple with.\n'I don't know exactly'\nABC News reported earlier Wednesday that the National Center for Medical Intelligence, a branch of the Defense Intelligence Agency, compiled information in November warning that a new virus was spreading through China's Wuhan region.\nA defense official denied any such report existed, telling CNN, \"NCMI and the Defense Intelligence Agency spent considerable time over the last 24 hours examining every possible product that could have been identified as related to this topic and have found no such product.\"\nThe Pentagon also issued a statement denying the ABC News report late Wednesday.\n\"As a matter of practice the National Center for Medical Intelligence does not comment publicly on specific intelligence matters. However, in the interest of transparency during this current public health crisis, we can confirm that media reporting about the existence/release of a National Center for Medical Intelligence Coronavirus-related product/assessment in November of 2019 is not correct. No such NCMI product exists,\" Colonel Dr. R. Shane Day, director of the National Center for Medical Intelligence, said.\nVice Chairman of the Joint Chiefs of Staff John Hyten seemed to push back on reports that the US intelligence community was aware of the coronavirus in November, saying Thursday that the first intelligence reports he saw were in January.\nAsked when the first intelligence streams about the virus began to arrive, Hyten said, \"We went back and looked at everything in November, December. The first indication we have were the reports out of China in late December that were in the public forum. And the first intel reports I saw were in January.\nThe question of when the President was first aware of the Covid-19 threat has become politically sensitive as the US death toll surges, the administration's response comes under fire and Trump repeatedly denies it was possible to know how deadly the virus would be.\nOn Wednesday, Trump said that he only learned about the seriousness of the coronavirus \"just prior\" to enacting US travel restrictions on China that took effect February 2.\nAsked about the ABC News report during the daily coronavirus task force briefing, Trump said he \"learned about the gravity of it was some time just prior to closing the country to China and when we closed up the flights coming into China, various other elements and as you know, we closed up to Europe. So, I don't know, exactly, but I'd like to see the information.\"\nAccording to the person briefed on the matter, by early to mid-December, Chinese social media and even state-controlled media had begun providing public clues about the struggle to contain a respiratory illness that at the time was being compared to SARS, a similar 2003 virus outbreak that also emerged from China.\nBeijing officially notified the World Health Organization of an outbreak of a pneumonia of unknown cause on December 31.\nThe Office of the Director of National Intelligence, which is tasked with producing the President's daily briefing, and the National Security Council, declined to comment on the timing of initial warnings about the outbreak in China.\nCIA officials tell CNN they are not aware of a specific report from November warning about an emerging crisis in China and declined to say when their own assessments were entered into what is known as the intelligence cycle, a process that coordinates information flowing among relevant agencies.\nThat process is often fluid, current and former intelligence officials told CNN, noting that reports and assessments are constantly updated as more information comes in.\nOngoing work\nMultiple officials say that open source information served as a jumping off point for intelligence officials early on and was combined with information gathered through other methods before it was ultimately included in the January 3 Presidential Daily Briefing.\nIntelligence work continues on the virus. The CIA has emphasized its expertise in assessing the outbreak's impact on foreign governments and leadership, as well as how that could affect US national security.\nIntelligence officials are also trying to determine how many cases and deaths have occurred in countries like China, where US officials say the publicly reported numbers cannot be trusted.\n\"I trust that the IC was looking very hard at China in the early days when the Chinese were less than forthcoming,\" former Director of National Intelligence and CNN contributor James Clapper said last month. \"It's a crucial role when governments aren't forthcoming.\"\nMuch of the information flowing from the intelligence community on the current crisis comes from National Center for Medical Intelligence, Clapper added. The NCIM is a unique outfit that combines wide-ranging, advanced medical expertise with intelligence gathering and assessments.\n\"I'm sure they're busier than hell right now,\" Clapper, who once ran the DIA, said of the center, which is the main source of medical intelligence for the federal government.\nCNN reported last month that ODNI and the CIA had been providing a steady flow of intelligence to oversight committees on Capitol Hill, giving the intelligence committees in the House and Senate daily briefings and updates on the spread of the virus, according to two congressional aides.\nThe updates focused mainly on the tally of those cases and whether they match what is being reported publicly.", "url": "https://www.cnn.com/2020/04/08/politics/intel-agencies-covid-november/index.html"}