{"authors": ["Fashion", "Lifestyle Editor"], "date_download": "2020-05-04 20:15:14", "date_modify": "2020-05-04 20:15:14", "date_publish": "2020-04-29 09:45:19", "description": "\"My shoes probably think I died.\"", "filename": "entry_funny-lockdown-tweets-clothing_l_5ea8324ac5b6085825797fc0_1588623314.html", "image_url": "https://img.huffingtonpost.com/asset/5ea870e23000002711155108.jpeg?cache=StUyeBE9Dj&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_funny-lockdown-tweets-clothing_l_5ea8324ac5b6085825797fc0_1588623314.html", "title": "27 Spot-On Tweets About Not Wearing Real Clothes During Lockdown", "title_page": "27 Spot-On Tweets About Not Wearing Real Clothes During Lockdown | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Get dressed every morning, they say. It will make you feel better to have some structure, they say. To “them” we say: Thanks, but no thanks.\nOne of the more surprising aspects of lockdown during the coronavirus pandemic is how quickly many of us have gotten used to the home wardrobe groove. We change out of daytime sweats into nighttime sweats, we (sometimes) wash and re-wear the same workout outfits over and over again, and in many cases, forgo things like pants altogether.\nThere are arguments, like the ones mentioned above, in favor of “dressing up” each day. But it’s hard to find motivation to do that when our “offices” are dining room tables and our couches are always close by, beckoning us and our elastic waistbands back into the welcome arms of their warm embrace.\nIf there’s something to take comfort in (besides stretchy pants) right now, it’s that we are very much going through this together: The highs, the lows and the leggings. Below, 27 hilariously spot-on tweets about getting dressed (or rather, not getting dressed) that just ring a little too true at the moment.\nSit back, pull those pajama pants all the way up, and enjoy.\nmy shoes probably think i died — gent (@gentv10) April 8, 2020\nwearing jeans today like a goddamn first class passenger on the titanic — Anne T. Donahue (@annetdonahue) April 21, 2020\nPeople who are quarantining in jeans: what are you trying to prove — sarafcarter (@sarafcarter) March 21, 2020\nWear jeans during quarantine, they said. It will make you feel normal, they said. pic.twitter.com/vKSkNMZC4m — Ali Griffin Vingiano (@alivingiano) April 19, 2020\nif I get through this quarantine without buying a tie-dye sweatsuit i can do anything — Alyssa Limperis (@alyssalimp) April 22, 2020\nI just thought about my purse and laughed. Remember purses?! Hahahhahahha omg fuckin purses — Nikki Glaser (@NikkiGlaser) April 19, 2020\nHey put some pants on my guy pic.twitter.com/PpCIBRrjP5 — Adam Graham (@grahamorama) April 28, 2020\nMONDAY. The theme this week is \"low bar for success.\" Did you brush your teeth? Gold star. Did you get out of bed to do it? Holy fuck, you're amazing. Are you wearing pants? YOU FOOL YOU FELL FOR THE TRAP, PANTS ARE A TOOL OF THE OPPRESSOR, SHIRK YOUR LEG BRIDLES AND RUN FREE — Chuck Wendig (@ChuckWendig) April 27, 2020\nNo one is wearing a bra rn. Our titties are finally free, bitch. https://t.co/JDY6NDRBxm — Crystal Marie Denha (@IamCrystalMarie) April 25, 2020\nI should have worn more intense hats back when wearing real clothes was a thing — JP (@jpbrammer) March 31, 2020\nMe waking up in the morning and changing out of sweatpants and into a new pair of sweatpants pic.twitter.com/WCtB1ERRGZ — Nate Hoerger (@Nateral_Ice) March 30, 2020\nPutting on jeans for the first time in two weeks pic.twitter.com/lYmCPt98QW — Gabriella Paiella (@GMPaiella) March 25, 2020\nMe: sitting in sweatpants wondering why I wasted money on clothes all of these years\nAlso me while checking my email:\nOh a sale! — jilly hendrix (@jillyhendrix) April 20, 2020\nEvery time I attempt to wear something other than a sweatshirt and pajamas pic.twitter.com/eDQryK821u — Marina Fang (@marinafang) April 23, 2020\nIf quarantine has taught me one thing, It’s that all those times I said I was “dressing for myself,” I was lying. — Emily McCombs (@msemilymccombs) April 21, 2020\nwhy do I still have the urge to buy clothes online? like for why? where do I plan to where them? the kitchen? — quinta brunson (@quintabrunson) April 1, 2020\nResentful of anyone outside who looks hot, pls stop breaking the quarantine schlub code we need solidarity — Angelina Chapin (@angelinachapin) April 16, 2020\nChoosing your quarantine character 🍾👏😂\npic.twitter.com/tgsQfH1ZIZ — Danielle Baskin (@djbaskin) April 5, 2020\nquarantine day ???: my husband just walked into the living room wearing in a t-shirt and nothing else, said \"dress for the job you want\" and then disappeared — amy b (@arb) March 20, 2020\nSocial distancing Day 12: Today my kids wanted me to wear my wedding dress at lunch & I couldn’t think of a reason not to pic.twitter.com/2snMmwxuGq — Curtis Sittenfeld (@csittenfeld) March 24, 2020\nthat i wore a bra...nearly every day before this...feels crazy to me — rachel syme (@rachsyme) March 17, 2020\nMy husband is wearing jeans to work from home ... psychotic — Gabriella Paiella (@GMPaiella) March 13, 2020\nI have been wearing hoodies and sweatpants for so long I think I’ve forgotten how to operate buttons. — Josh Gondelman (@joshgondelman) April 26, 2020\nPeople: I can't wait for this to be over. I'm going to spend so much time outside and doing social stuff with others.\nMe: *laughs nervously* Yes, me too. I will be doing all the social things outside my apartment and not laying around in sweatpants and no bra. — Charlotte Clymer 🏳️‍🌈 (@cmclymer) April 26, 2020\nShowered, put on clean clothes, then took a walk. With the day’s hard work out of the way I can now relax. — Mike Ginn (@shutupmikeginn) March 29, 2020\nlot of talk on here about not wearing a bra during ~these uncertain times~ but not enough acknowledgement of my go-to: waking up and putting a sports bra on under my pajamas, thereby transforming sleep clothes into maybe-i'll-exercise-later clothes while still wearing pajamas — Hannah Keyser (@HannahRKeyser) April 23, 2020", "url": "https://www.huffpost.com/entry/funny-lockdown-tweets-clothing_l_5ea8324ac5b6085825797fc0"}