{"authors": ["Opinion Leana S. Wen"], "date_download": "2020-05-04 16:00:32", "date_modify": "2020-05-04 16:00:32", "date_publish": "2020-03-31 22:59:46", "description": "Leana Wen writes that \"The next phase of this Covid-19 pandemic will be extremely challenging as people we know and love come down with the disease.\" She suggests making a plan, relying on your support system, and prepare for sudden change.", "filename": "2020_03_31_opinions_coronav_53328717b9014b87c3cc171fe94412a2_index_1588608032.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200319091241-iyw-coronavirus-hth-trnd-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_opinions_coronav_53328717b9014b87c3cc171fe94412a2_index_1588608032.html", "title": "We must prepare for what's next: when we and our loved ones become ill", "title_page": "We must prepare for what's next: when we and our loved ones become ill - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Leana S. Wen is an emergency physician and a visiting professor at George Washington University Milken Institute School of Public Health. Previously, she served as Baltimore's health commissioner. Follow on Twitter: @DrLeanaWen. View more opinion articles on CNN.\n(CNN) The next phase of the Covid-19 pandemic will be extremely challenging as people we know and love come down with the disease. Some may become gravely ill and even die. But we are not powerless against the virus. We must prepare ourselves for what's ahead and have a plan, starting with ourselves and our own loved ones.\nLeana S. Wen\nAccording to epidemiological modeling , about one in three Americans -- 100 million people -- could become infected by October without early and aggressive intervention. If we implement these interventions to \" flatten the curve ,\" we could reduce the rate of spread. In fact, there are glimmers of hope that this number could be much lower as social distancing shows early signs that it might be working. This is essential to avoid overtaxing the health care system and rationing resources and attention to patients in need of intensive care. Still, even in the most conservative estimates, we could expect millions to acquire Covid-19 in the coming months.\nNow is the time to prepare for what happens when Covid-19 comes to us.\nAbout 80% of those with Covid-19 will have mild symptoms and can recover at home . If this is an adult who normally cares for themselves, they can keep themselves self-isolated during this period. Designate a room in the house for the infected person to reduce the risk of transmission. Have enough supplies -- including over-the-counter cough and cold medicines, food and toiletries -- to last at least two weeks. Plan ahead for who will take over that person's other responsibilities, especially if they are normally the caregiver to young children or elderly parents.\nIf the ill person is a child and there are uninfected children at home, consider which parent will take care of the ill child and which one will take care of the well. Think through variations of what could happen: What if the parent who is well also falls ill? What if someone needs to go into a quarantine facility or requires in-hospital care? What if you're a single parent -- are there relatives and friends you can bring into your planning?\nRead More", "url": "https://www.cnn.com/2020/03/31/opinions/coronavirus-covid-19-sick-prepare-plan-wen/index.html"}