{"authors": [], "date_download": "2020-05-04 17:02:50", "date_modify": "2020-05-04 17:02:50", "date_publish": "2020-04-10 19:25:24", "description": "Apple's free in-store classes — known as Today at Apple — teach anyone who joins how to get more out of their Apple devices. These have been a part of Apple's retail stores since the first location opened in 2001. But with almost all Apple Stores closed due to covid-19, these classes are going digital.", "filename": "2020_04_10_cnn-underscored__253a9d0dc4cfaeb9ccc61cc3d6fd6c38_index_1588611770.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200410150651-1-underscored-today-at-apple-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_cnn-underscored__253a9d0dc4cfaeb9ccc61cc3d6fd6c38_index_1588611770.html", "title": "Today at Apple classes and sessions are going digital", "title_page": "Today at Apple classes and sessions are going digital - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Apple's free in-store classes — known as Today at Apple — teach anyone who joins how to get more out of their Apple devices. These have been a part of Apple's retail stores since the first location opened in 2001. But with almost all Apple Stores closed due to covid-19, these classes are going digital.\nApple introduced Today at Apple @ Home early this afternoon. It's a cute name for sure, and it's exactly what it sounds like. Apple has turned those in-person classes into short digital sessions that you can stream directly from your web browser. Creative Pros from Apple retail stores from all over the world were tasked with hosting these sessions. And these gracious hosts shoot the full courses on the iPhone. Pretty cool, right?\nCourses range between three to five minutes, so they're quite digestible. The first session is how to draw playful portraits on the iPad, taught by Harriet, who works at the London Regent Street store.\nYou start by taking a photo or two with your iPad, and then use an Apple Pencil or your finger to get creative on top of the photo. This way, you can use your artistic skills to transport yourself from your home to, say, a scenic waterfall. The sky's the limit!\nThe built-in markup tools at your disposal include a pencil, a paintbrush, watercolors and even markers. You can also do this on the iPhone, but you'll likely want a larger surface, like that offered by the iPad.\nBetter yet, a few iPad models are on sale right now.\n7th Gen iPad (Starting at $279.99, originally $329; amazon.com or bhphotovideo.com)\n4th Gen 11-inch iPad Pro (Starting at $786.11; amazon.com or bhphotovideo.com)\nWant to see your home in new ways? Cameron from Singapore's Orchard Road store will lead you through a quick 3½-minute course on architecture photography.\nEssentially, you'll use your iPhone and a few neat tricks to see something as simple as a shelf in a whole new way. If you have an iPhone with multiple lenses, you likely know you can switch on the fly to get closer or appear farther. But you can also lock focus and raise or lower the exposure while shooting (or before hitting the shutter button) on any iPhone. It's neat and is sometimes an overlooked feature. After you have an image you'll like, Cameron walks you through the expanded photo editing capabilities in iOS 13.\nAnd if you want to take portraits to the next level, Adrian from Santa Monica's Third Street Promenade store will show you. For this, an iPhone with Portrait Mode capabilities will capture the best effect, but don't be afraid to use an older model, especially with the tricks on editing from Cameron's class.\nIf you have a tripod, that's a great way to prop up your phone, but a lamp or stack of books can do the trick. You can set a timer on the iPhone, or if you have a paired Apple Watch, you can snap the shutter from your wrist. On newer iPhones, you get access to multiple Portrait Mode styles that can change the lighting and even effect on photos. There are a lot of possibilities.\nThe first three sessions are available now. You can expect more sessions to roll out in the coming weeks.\nNote: The prices above reflect the retailer's listed prices at the time of publication.", "url": "https://www.cnn.com/2020/04/10/cnn-underscored/today-at-apple-at-home-digital-courses/index.html"}