{"authors": [], "date_download": "2020-05-04 20:27:06", "date_modify": "2020-05-04 20:27:06", "date_publish": "2020-04-09 04:35:54", "description": "OAKLAND, Calif. (AP) — A man awaiting retrial in a fire that killed 36 partygoers at a San Francisco Bay Area warehouse may be released from jail because of the coronavirus outbreak. An...", "filename": "_2ed7a8229f173de4933b9210a52aeaea_1588624026.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2612a97566084c0bbb7161625f35944d/2640.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2ed7a8229f173de4933b9210a52aeaea_1588624026.html", "title": "Man awaiting retrial in deadly warehouse blaze may be freed", "title_page": "Man awaiting retrial in deadly warehouse blaze may be freed", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "1 of 3 FILE - This Monday, June 5, 2017, file photo released by the Alameda County Sheriff's Office shows Derick Almena at Santa Rita Jail in Alameda County, Calif. Almena who is man charged with manslaughter in the Ghost Ship blaze that killed 36 partygoers at a firetrap warehouse in Northern California may be released from jail because of the coronavirus outbreak, a judge ruled. An Alameda County Superior Court Judge has decided to release Almena from custody at Santa Rita Jail in Dublin and place him in an electronic monitoring program while he awaits retrial, officials said Wednesday, April 8, 2020. (Alameda County Sheriff's Office via AP, File)\n1 of 3 FILE - This Monday, June 5, 2017, file photo released by the Alameda County Sheriff's Office shows Derick Almena at Santa Rita Jail in Alameda County, Calif. Almena who is man charged with manslaughter in the Ghost Ship blaze that killed 36 partygoers at a firetrap warehouse in Northern California may be released from jail because of the coronavirus outbreak, a judge ruled. An Alameda County Superior Court Judge has decided to release Almena from custody at Santa Rita Jail in Dublin and place him in an electronic monitoring program while he awaits retrial, officials said Wednesday, April 8, 2020. (Alameda County Sheriff's Office via AP, File)\nOAKLAND, Calif. (AP) — A man awaiting retrial in a fire that killed 36 partygoers at a San Francisco Bay Area warehouse may be released from jail because of the coronavirus outbreak.\nAn Alameda County Superior Court Judge is likely to release Derick Almena from the Santa Rita Jail and place him in an electronic monitoring program while he awaits retrial, officials said Wednesday. Almena’s attorney Tony Serra also told the San Jose Mercury News that there is a “strong” possibility that officials will release his client.\nAlmena, 49, has been jailed since 2017. He is charged with involuntary manslaughter in the Dec. 2, 2016, fire at an electronic music party at the Ghost Ship warehouse in Oakland. Prosecutors allege Almena, who was the master tenant on the lease, was criminally negligent when he illegally converted the industrial building into a residence for artists and held events without proper permits.\nThe building was packed with furniture, extension cords and other flammable material but had only two exits and no smoke detectors, fire alarms or sprinklers, prosecutors say.\nA jury deadlocked on the charges in September and a new trial is scheduled for July. His co-defendant, Max Harris, was acquitted of the same charges.\nAlmena is scheduled for a court teleconference on Friday and could be released as early as this weekend, probably to house arrest, Vincent Barrientos, one of his defense lawyers, told the San Francisco Chronicle.\nEleven cases of COVID-19 have been reported at the Santa Rita Jail. In a report, jail medical staff said Almena’s psychological and physical health were in jeopardy, Barrientos said.\nTeresa Drenick of the Alameda County district attorney’s office said prosecutors have opposed releasing Almena and will seek a court order barring Almena from contacting witnesses or victims in the case.\n“We strongly disagree with the court’s decision,” Drenick said.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death. The vast majority of people recover.\nCounty jails and California state prisons have already released thousands of inmates in response to the pandemic, with more releases likely. Prison officials have halted intakes from jails and are releasing as many as 3,500 nonviolent inmates who had been scheduled for parole within the next two months.\nCalifornia judicial leaders on Monday approved no bail for misdemeanor and lower-level felony offenses, a move intended to limit the number of suspects who otherwise would have to await trial in jail. Reducing bail also means fewer court hearings for those who remain in custody.", "url": "https://apnews.com/2ed7a8229f173de4933b9210a52aeaea"}