{"authors": ["Christina Maxouris"], "date_download": "2020-05-04 17:00:51", "date_modify": "2020-05-04 17:00:51", "date_publish": "2020-04-10 04:34:22", "description": "NBA legend Magic Johnson says he's hopeful health experts will soon come up with effective treatment to help patients beat coronavirus -- but added important parts in overcoming the pandemic will be expanding testing and healthcare access to African American communities who have been hit the hardest.", "filename": "2020_04_10_us_magic-johnson-coronavirus-sports_index_1588611651.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409223120-magic-johnson-april-9-2020-01-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_us_magic-johnson-coronavirus-sports_index_1588611651.html", "title": "Magic Johnson says beating coronavirus should include tackling racial disparities", "title_page": "Magic Johnson says beating coronavirus should include tackling racial disparities - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) NBA legend Magic Johnson says he's hopeful health experts will soon come up with effective treatment to help patients beat coronavirus -- but added important parts in overcoming the pandemic will be expanding testing and healthcare access to African American communities who have been hit the hardest.\n\"We've got to make sure, first ... every American can get a test,\" Johnson told CNN Thursday night. The former Los Angeles Lakers player announced nearly 30 years ago he was HIV positive.\n\"The reason why I'm still living is because (of) early detection. I had a test, I had a physical. It came up that I had HIV and that saved my life,\" he said. \"So people want to get tested. Until they get tested, people won't be comfortable because that's going to tell them whether they have this virus or not.\"\nBut tests, Johnson said, should be made available in all parts of the country so that all communities have equal access.\n\"The problem is people want us to drive to suburban America to get that test,\" he said. \"Why can't you have that testing done right in urban America, right in the inner cities?\"\nRead More", "url": "https://www.cnn.com/2020/04/10/us/magic-johnson-coronavirus-sports/index.html"}