{"authors": ["James Macpherson"], "date_download": "2020-05-04 21:06:06", "date_modify": "2020-05-04 21:06:06", "date_publish": "2020-04-20 16:24:55", "description": "BISMARCK, N.D. (AP) — North Dakota’s largest manufacturer, Doosan Bobcat, resumed operations Monday after a two-week shutdown amid the coronavirus pandemic, putting some 2,300 people back to work....", "filename": "_15723edf05481a8f1505ec2bedb2c95f_1588626366.html", "image_url": "https://storage.googleapis.com/afs-prod/media/5a32123ab1a24dc590fa50e24e35ce9f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_15723edf05481a8f1505ec2bedb2c95f_1588626366.html", "title": "Doosan Bobcat restarts plants, putting 2,300 back to work", "title_page": "Doosan Bobcat restarts plants, putting 2,300 back to work", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Protesters gather on the Capitol steps and grounds on Monday, April 20, 2020 in Bismarck, N.D. The group was protesting to show their opposition to Gov. Doug Burgum's order to keep most businesses closed until at least the end of the month in an effort to contain the spread of the coronavirus.(AP Photo/James MacPherson)\nProtesters gather on the Capitol steps and grounds on Monday, April 20, 2020 in Bismarck, N.D. The group was protesting to show their opposition to Gov. Doug Burgum's order to keep most businesses closed until at least the end of the month in an effort to contain the spread of the coronavirus.(AP Photo/James MacPherson)\nBISMARCK, N.D. (AP) — North Dakota’s largest manufacturer, Doosan Bobcat, resumed operations Monday after a two-week shutdown amid the coronavirus pandemic, putting some 2,300 people back to work.\nThe company’s restart came as the state is wrestling with an outbreak in Grand Forks that has shut down LM Power, a wind turbine blade manufacturing plant, that as of Monday had grown to 128 employees or associated people.\nGov. Doug Burgum said Monday that the state-owned Mill and Elevator in Grand Forks had temporarily shut down after an employee, who lived with a worker at LM Power, tested positive for COVID-19 on Saturday. But mill president and CEO Vance Taylor told The Associated Press that the mill, which is the largest wheat-grinding facility in the U.S., was already scheduled for a shutdown over the weekend.\nVance said the facility was cleaned and disinfected, and it reopened Monday morning. The mill buys most of its wheat from North Dakota farmers.\nDoosan Bobcat restarted operations at plants in Gwinner, Bismarck and Wahpeton, as well as in Litchfield, Minnesota, after making several changes. The company said it was not aware of any workers who have tested positive for the virus. The equipment manufacturer says it increased cleaning and disinfecting, implemented social distancing and limited visitors while encouraging people to work remotely when possible.\n“The No. 1 goal is the safety of our employees,” company spokeswoman Stacey Breuer said.\nWilliam Wilkinson, president of the United Steelworkers Local 560, said the union still wants the company to employ “better temperature checking and better social distancing on assembly lines.”\n“The union has worked hard pressing for these safeguards and we’re not all the way there but a lot has changed for the better,” said Wilkinson, who works as a welder at the Gwinner factory, which employs about 1,350 people.\nBreuer said the reopening came after two weeks spent putting in safety measures for employees and consulting closely with North Dakota health officials. She said the company needed to reopen as quickly as possible.\n“We have a very large, strong network of dealerships across North America that need us to be open, need us to supply parts, need us to send equipment to our customers out there working projects right now,” Breuer said. “It’s important to provide the support they need.”\nThe state has 627 people who have tested positive for the virus, up 42 from the previous day. Three additional deaths were announced Monday, for a total of 13 deaths overall.\nMore than 100 people demonstrated on the Capitol steps and grounds to show their opposition to Burgum’s order to keep most businesses closed until at least the end of the month to reduce the virus’ spread. The protest follows similar rallies elsewhere in the U.S.\nBurgum, a Republican, has ordered all bars, restaurants, barber shops, beauty salons, health clubs, movie theaters and other large-scale venues to close to patrons at least until April 30, while still allowing offsite food and beverage service. He is also keeping K-12 schools closed until further notice.\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nDoosan Bobcat, known for its skid-steer loaders, idled the facilities on April 6 and furloughed most production employees. The company did not pay workers during the shutdown.\nThe company is providing employees with protective equipment including face masks, gloves and in some cases face shields. It was also adding floor markings to help with social distancing, propping doors open, limiting entry to break room areas and taking some workers’ temperatures, among other measures.\nBreuer said the company has a plan for a work stoppage should someone contract the virus. The company is based in South Korea, and its North American headquarters is in West Fargo.\nThe North Dakota Department of Health on Sunday reported 34 new cases in Grand Forks County, where the LM Wind Power facility is based. Only four additional cases in the county were reported on Monday.\nAn uptick in cases at the LM Wind Power facility in Grand Forks led to the drive-thru screening Thursday of 424 people, which included close contacts of infected workers, other household members and employees who have not shown symptoms.", "url": "https://apnews.com/15723edf05481a8f1505ec2bedb2c95f"}