{"authors": ["Mark Pratt"], "date_download": "2020-05-04 20:26:46", "date_modify": "2020-05-04 20:26:46", "date_publish": "2020-04-20 14:13:09", "description": "PROVIDENCE, R.I. (AP) — A disproportionate number of people of color in the state have tested positive for the coronavirus, Rhode Island’s top health official said Monday. Even though 15% of...", "filename": "_58c52a0452e4560456852d7f368e4cfe_1588624006.html", "image_url": "https://storage.googleapis.com/afs-prod/media/297ed671c50e4d86a22c2d4c113f7262/2730.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_58c52a0452e4560456852d7f368e4cfe_1588624006.html", "title": "Rhode Island studies virus impact on people of color", "title_page": "Rhode Island studies virus impact on people of color", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Drew Grande, 40, of Cranston, R.I., wears a protective mask over of concerns about the coronavirus outside his home, Wednesday, April 15, 2020, in Cranston. Grande began a log for contact tracing on his smartphone at the beginning of April, after he heard Rhode Island Gov. Gina Raimondo urge residents to start out of concern about the spread of the coronavirus. “If I’m going out to the store, I’ll put the date, what store I went to, and then the time I was there,” he said (AP Photo/Steven Senne)\nDrew Grande, 40, of Cranston, R.I., wears a protective mask over of concerns about the coronavirus outside his home, Wednesday, April 15, 2020, in Cranston. Grande began a log for contact tracing on his smartphone at the beginning of April, after he heard Rhode Island Gov. Gina Raimondo urge residents to start out of concern about the spread of the coronavirus. “If I’m going out to the store, I’ll put the date, what store I went to, and then the time I was there,” he said (AP Photo/Steven Senne)\nPROVIDENCE, R.I. (AP) — A disproportionate number of people of color in the state have tested positive for the coronavirus, Rhode Island’s top health official said Monday.\nEven though 15% of the state’s population identifies as Latino, more than 40% of those who have tested positive, and for whom the data is available, are Latino, state Health Director Nicole Alexander-Scott said.\nIn addition, 12% of the positive cases are African American, while 6% of the state’s population identifies as such, she said.\n“We are trying to better understand this,” she said at a news conference.\nThe state, she said, is taking measures to address the disparities, including engaging established and trusted community organizations to target minority populations with safety information and overcoming language barriers.\nThere are an additional 339 positive cases of the disease in Rhode Island, bringing the total to nearly 5,100 cases, according to state figures released Monday.\nThe department also reported five additional deaths, bringing the total number of fatalities from COVID-19, the disease caused by the virus, to 155. Three of those five new deaths were people in their 90s, Alexander-Scott said.\n___\nECONOMIC RESTART\nGov. Gina Raimondo on Monday unveiled six conditions she says must be met before reopening the state’s economy.\nThey are consistent declines in the rate of infection; the capacity to quickly identify and control new outbreaks through contact tracing; proper support for the elderly and other vulnerable populations; a health care system that can handle future surges in the number of cases; proper social distancing plans at businesses, schools and other places where people gather; and the will to reclose certain sectors of the economy if necessary.\nThe Democratic governor also said she largely agrees with Republican President Donald Trump’s recommendations to bring the economy back in phases.\nBut she also stressed that there are no plans to proceed with an economic restart before the state’s current stay-at-home order ends on May 8.\nRaimondo disagreed with Vice President Mike Pence’s suggestion Sunday that Rhode Island was past its peak. She said she hadn’t heard his comment, but said “That’s clearly not true,” because the state had more new cases Monday than on Sunday. “We’re still on an upward trajectory.”\nReopening the economy depends largely on increased testing, she told reporters on a conference call after her briefing. The state is currently testing about 2,000 people per day.\n“We’re in conversation with a lot of large employers. Many of them want all their employees tested before they go back to work. We’re trying to find out, how do we do that? Can we do that? Is it necessary to do that? If so, how many tests a day is that?” she said.\n____\nPENCE-GOVERNORS CALL\nRaimondo spent about 90 minutes Monday with other governors on a call with Pence that she said focused mostly on testing for the coronavirus, crucial in controlling the disease.\nFederal officials on the call acknowledged “we’re not where we need to be” with getting supplies for antibody testing machines, she said.\nThe state needs additional guidance from the federal government on what an adequate surveillance testing system looks like, she told reporters on a conference call.\nShe also said she wants Congress to replenish the payroll protection program and to give additional support for hospitals. She called on Congress to quickly pass a wage subsidy or hazard pay for low-wage health care workers.\n____\nCHARITABLE DONATIONS\nThe Rhode Island COVID-19 Response Fund has distributed another $2.1 million to nonprofits across the state to help people struggling to pay for groceries, rent, utilities or health care during the coronavirus pandemic.\nThe fund, established last month by the Rhode Island Foundation and United Way of Rhode Island, has now distributed about $6.7 million.\nChildren’s Friend, the Jonnycake Center of Peace Dale, the Dr. Martin Luther King Jr. Community Center, Progreso Latino and Thundermist Health Center are among the organizations that received grants ranging from $10,000 to $75,000 in the latest round of funding announced Monday.\nThe need continues to grow, foundation President Neil Steinberg said.\nThe fund has drawn about $7 million donations but there is a backlog of applications and will need several million dollars more, he said.\nAbout 160,000 Rhode Islanders have filed for unemployment benefits since the pandemic began.", "url": "https://apnews.com/58c52a0452e4560456852d7f368e4cfe"}