{"authors": ["Sandee Lamotte"], "date_download": "2020-05-04 16:09:50", "date_modify": "2020-05-04 16:09:50", "date_publish": "2020-04-02 17:27:57", "description": "Yes cats (and ferrets) can catch coronavirus and maybe carry it, but they are dead ends when it comes to transmitting to people, experts say.", "filename": "2020_04_02_health_cats-dogs-ferrets-coronavirus-wellness_index_1588608590.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402125428-kitten-asleep-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_cats-dogs-ferrets-coronavirus-wellness_index_1588608590.html", "title": "Cats, dogs, ferrets and coronavirus: What's to worry about?", "title_page": "Cats, dogs, ferrets and coronavirus: What's to worry about? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A newly-hatched study out of China, so raw that it's not yet been peer-reviewed, has some disturbing news for cat lovers.\nOur furry feline friends appear to be susceptible to catching Covid-19, the disease caused by the coronavirus called SARS-CoV-2. Even worse, the cats in the study were able to infect each other, although they showed no signs of illness.\nFerrets were also able to \"catch\" the virus, although it didn't appear to harm them. Dogs, on the other hand, were not susceptible, according to the study. The virus showed up in the feces of five dogs, but no infectious virus was found. Pigs, chickens and ducks were also not very hospitable places for the virus.\nBut there's no need for cat or ferret lovers to panic, experts say. There's no evidence their pets could get very sick or die from the novel coronavirus.\n\"Yes, people should embrace their pets. These researchers squirted the virus down the cats nose in high concentration, which is pretty artificial,\" said Dr. John Williams, chief of the division of pediatric infectious diseases at the University of Pittsburgh Medical Center Children's Hospital of Pittsburgh.\nNo realistic exposure\nThe lab experiment used a scenario that is completely unrealistic, experts say. First, researchers forced extremely high doses of virus up the nostrils of five 8-month-old domesticated cats.\nCats in our homes or even in the wild would never be exposed to that level of virus.\n\"That's a whole lot more than an average human would get,\" said infectious disease expert Dr. William Schaffner, a professor of preventative medicine and infectious disease at Vanderbilt University School of Medicine in Nashville.\n\"So this is an artificial circumstance and we don't know that it happens in nature at all,\" Schaffner added.\nTwo of the five cats were euthanized six days later. Researchers found virus particles in their upper respiratory systems.\nThe remaining three infected cats were put into a cage adjacent to three non-infected cats. One of those three cats later tested positive for the virus, while the other two did not. Still, the researchers felt that showed the virus could be transmitted via respiratory drops.\nOr did it? None of the infected cats exhibited signs of illness. And even if they did pass the virus to each other, that doesn't mean they would be able to pass it on to humans.\nThat's what happened nearly two decades ago with a sister coronavirus called SARS-CoV, which causes the deadly pneumonia-like respiratory disease called SARS.\nJust like now, science found cats could be infected with SARS-CoV and infect other cats. But the virus didn't transmit widely among house cats during the 2002 to 2004 pandemic, nor were there any known cases of transmission to humans.\nFerrets affected too\nThe study found ferrets were also \"efficient\" replicators of the virus -- meaning that the virus can easily grow and reproduce in their long, slinky bodies.\n\"SARS-CoV-2 can replicate in the upper respiratory tract of ferrets for up to eight days, without causing severe disease or death,\" the study said. The study did not look at a longer time frame.\nThat's good news for researchers looking for a way to test any future vaccines for SARS-CoV-2, also called the novel coronavirus.\n\"It's necessary to have an animal model to do initial tests of vaccines and understand how viruses cause disease. So, this will be useful to the field,\" Williams said.\nIt's actually not surprising that ferrets appear to respond to the novel coronavirus. A ferret's lung and airways are strikingly similar to a human's. In fact, biologically and physiologically ferrets are more similar to humans than they are to a mouse or rat.\n\"Ferrets are classical animals in which to study influenza -- it's been done for decades,\" Schaffner said. \"If scientists were looking for an animal model, they would reach for the ferrets first.\"\nWhat this means\nWill your cat or ferret come down with coronavirus? Highly unlikely, experts say, pointing to the fact that we would certainly have heard of many cases in pets by now, considering the significant spread of the virus in the US and Europe.\nHong Kong has been quarantining animals belonging to people diagnosed with Covid-19 and have found only two cases of positive results in dogs. The dogs showed no signs of illness during the quarantine.\nRare as it may be, it appears one cat in Belgium may have gotten the virus in March from her owner, who was ill with Covid-19 after returning from a visit to Italy. But even though the cat had respiratory problems and high levels of the virus in vomit and feces, researchers aren't yet sure if the cat was sick from Covid-19 or another illness.\n\"While 2 dogs (Hong Kong) and 1 cat (Belgium) have been reported to have been infected with SARS-CoV-2, infectious disease experts and multiple international and domestic human and animal health organizations agree there is no evidence at this point to indicate that pets spread COVID-19 to other animals, including people,\" the American Veterinary Medical Association says on its website.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nThe AVMA and the U.S. Centers for Disease Control and Prevention recommend taking normal precautions when cleaning litter boxes and feeding animals.\n\"Out of an abundance of caution,\" the AVMA suggests anyone ill with COVID-19 symptoms limit contact at this time, \"until more information is known about the virus.\"\n\"Have another member of your household take care of walking, feeding, and playing with your pet,\" the AVMA states. \"If you have a service animal or you must care for your pet, then wear a facemask; don't share food, kiss, or hug them; and wash your hands before and after any contact with them.\"", "url": "https://www.cnn.com/2020/04/02/health/cats-dogs-ferrets-coronavirus-wellness/index.html"}