{"authors": ["Ariane De Vogue", "Caroline Kelly"], "date_download": "2020-05-04 16:34:04", "date_modify": "2020-05-04 16:34:04", "date_publish": "2020-04-07 20:49:35", "description": "A federal appeals court Tuesday ruled in favor of Texas and allowed an executive order that restricts abortion access during the coronavirus pandemic to remain in effect.", "filename": "2020_04_07_politics_abortion-coronavirus-appeals-texas_index_1588610044.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190515124501-02-abortion-protests-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_abortion-coronavirus-appeals-texas_index_1588610044.html", "title": "Appeals court upholds Texas abortion restrictions during coronavirus pandemic", "title_page": "Appeals court upholds Texas abortion restrictions during coronavirus pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A 2-1 panel of the 5th US Circuit Court of Appeals wiped away a lower court opinion that had blocked the order and said it was taking the \"drastic and extraordinary\" step because the lower court ignored state emergency health regulations.\n\"An emergency measure that postpones certain non-essential abortions during an epidemic— does not 'beyond question' violate the constitutional right to abortion,\" the court wrote.\nThe case could ultimately be headed to the Supreme Court. Planned Parenthood, a plaintiff in the case, told the appeals court Tuesday that if it didn't rule on the abortion issue related to the pandemic by close of business, the group would go directly to the Supreme Court Wednesday morning to seek relief.\nSuch an appeal could pull the justices into a clash between abortion rights supporters, who have been decrying what they see as politicians exploiting a health care crisis for political points, and a slew of conservative state officials, who have argued that bans on elective abortions and other medical procedures are necessary to help preserve medical supplies while hospitals battle Covid-19.\nTexas Republican Gov. Greg Abbott last month barred \"all surgeries and procedures that are not immediately necessary,\" effective immediately.\nTexas Attorney General Ken Paxton later specified that \"any type of abortion that is not medically necessary to preserve the life or health of the mother\" was included in the order, prompting a challenge from state abortion providers and national abortion rights groups last month.\nIn its ruling Tuesday written by Judge Kyle Duncan, who was nominated by President Donald Trump, the appeals court said Texas is allowed to implement its emergency measures.\n\"The bottom line is this: when faced with a society-threatening epidemic, a state may implement emergency measures that curtail constitutional rights so long as the measures have at least some 'real or substantial relation' to the public health crisis and are not 'beyond all question, a plain, palpable invasion of rights secured by the fundamental law,'\" the majority held.\nAnd nodding to the state's battle against coronavirus, the court said, \"time is of the essence when it comes to preventing the spread of COVID-19 and conserving medical resources critically needed to care for patients.\"\nJudge James Dennis, who was nominated by former President Bill Clinton, wrote a bitter dissent, noting that the court had taken the unusual step of granting a rare form of relief called \"mandamus\" by holding that the District Court made a clear error. He wrote that the majority had ruled in favor of Texas despite \"almost 50 years of Supreme Court\" precedent.\nHe pointed to similar efforts in other states and said \"none of those attempts has been successful in the face of a constitutional challenge.\"\n\"In a time where panic and fear already consume our daily lives,\" he wrote, \"the majority's opinion inflicts further panic and fear on women in Texas by depriving them, without justification, constitutional rights, exposing them to the risks of continuing an unwanted pregnancy, as well as the risks of travelling to other states in search of time-sensitive medical care.\"\nAbortion rights advocates lamented the ruling, with Planned Parenthood Acting President and CEO Alexis McGill Johnson calling it \"unconscionable.\"\n\"Patients are already being forced to put their lives in harm's way during a pandemic, and now will be forced to continue doing so to get the health care they need,\" she said, vowing that her group will \"use every tool at our disposal to fight this harmful order and protect our patients' health care.\"\nCNN has reached out to Paxton's and Abbott's offices for comment.\nIn court documents filed last week, lawyers for the abortion rights supporters and providers accused Texas officials of exploiting the Covid-19 pandemic to \"achieve their longtime goal of banning abortion,\" adding that they have been \"forced to turn away hundreds of Texans seeking abortion care, including people seeking only medication abortion which involves ingestion of pills.\"\nMedication abortion -- which typically involves abortion-seekers taking two pills -- requires no protective equipment such as masks or gloves, and a surgical abortion requires very little, \"if any,\" the lawyers asserted -- a potential attempt to highlight an exemption in Abbott's order for procedures that \"would not deplete the hospital capacity or the personal protective equipment needed to cope with the COVID -19 disaster.\"\nIn Tuesday's opinion, the appeals court said it was \"unclear how long the crisis will last\" but that its own review of the record, at a preliminary stage, \"reveals considerable evidence that surgical abortions consume PPE.\" The court said the record is still unclear on how \"PPE is consumed in medication abortion.\"", "url": "https://www.cnn.com/2020/04/07/politics/abortion-coronavirus-appeals-texas/index.html"}