{"authors": ["Holly Yan"], "date_download": "2020-05-04 16:09:05", "date_modify": "2020-05-04 16:09:05", "date_publish": "2020-04-02 15:22:32", "description": "Nicole Buchanan wasn't even allowed to say goodbye to her husband. \"I would hate for anybody ... to have to go through what we've gone through,\" she said. \"Our hospital systems aren't ready. Just stay home.\"", "filename": "2020_04_02_health_dj-conrad-buchanan-coronavirus-death_index_1588608545.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402065859-nicole-and-skye-buchanan-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_health_dj-conrad-buchanan-coronavirus-death_index_1588608545.html", "title": "A healthy 39-year-old DJ died of coronavirus. What his young widow and daughter want you to know", "title_page": "A healthy 39-year-old DJ died of coronavirus. What his young widow and daughter want you to know - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Nicole Buchanan wasn't even allowed to say goodbye to her husband.\nThree weeks ago, Conrad Buchanan was a healthy, vivacious Florida DJ who loved dancing with his daughter.\nBut on March 14, the 39-year-old started feeling sick. His wife Nicole tried to get him tested for coronavirus , but was denied.\n\"We couldn't get him tested. I fought and fought and fought,\" she said.\nWhat you need to know about coronavirus\n\"They didn't want to test him due to his age and (because) he had no underlying health issues.\"\nBy March 22, Conrad's condition had deteriorated so badly that Nicole drove him to the hospital. The young father was intubated immediately after he was dropped off.\nNicole went to park the car. She never saw her husband again.\n\"I walked up to the doors. The hospital's on lockdown. They wouldn't let anybody in after that,\" she said. \"I never got to say, 'I love you.'\"\nConrad Buchanan had no underlying health conditions, his wife said. She has coronavirus as well.\nConrad Buchanan's death illustrates the harsh reality of Covid-19: No one is immune from this disease, and even young, healthy people can die from it.\n\"I need everybody to know that this is serious. People think that it's just going to affect people with underlying health issues, old people. But it doesn't,\" his widow said, weeping.\n\"And seeing what my husband had to go through was horrible. And now our life has turned into this horrible nightmare.\"\nNicole, too, has tested positive for coronavirus. She said her symptoms are not severe, but she has lost her senses of taste and smell\nThe couple's daughter, Skye, is waiting for her test results. She said the loss of her dad is catastrophic.\n\"We just overall shared everything,\" Skye said. \"He brought me to school, he brought me to ballet. He was my everything.\"\nNicole and Skye Buchanan were not allowed to visit their husband and father during his final days.\nSkye said she misses her dad's valiant attempts at dancing. Conrad performed with Skye during a father-daughter day at Skye's ballet school, though he dropped her during a lift.\n\"It was funny because he could perform in front of like millions of people when he DJ'd, but (when) he danced ... it wasn't the best,\" Skye said with a laugh.\nNow, Skye is left with just memories of her dad -- and an important lesson he taught her:\n\"Find your rhythm in life. Listen to the beat. Dance and express yourself in order to connect with people from all walks of life,\" she said.\nGoFundMe account has been established to help the family.\nNicole Buchanan said she wants everyone to stay home and take precautions so no one else has to suffer what her family has endured.\n\"You guys have to take this seriously,\" she said. \"I would hate for anybody -- anyone else's family or children -- to have to go through what we've gone through. Our hospital systems aren't ready. Just stay home.\"", "url": "https://www.cnn.com/2020/04/02/health/dj-conrad-buchanan-coronavirus-death/index.html"}