{"authors": ["Lauren Lee"], "date_download": "2020-05-04 16:26:52", "date_modify": "2020-05-04 16:26:52", "date_publish": "2020-03-13 21:16:43", "description": "As the fight against the coronavirus pandemic intensifies, so too does the strain across society. Impact Your World has gathered some ways you can help ease the pressure.", "filename": "2020_03_13_us_how-to-help-coronavirus-pandemic-iyw-trnd_index_1588609612.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200213175742-05-coronavirus-0213-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_13_us_how-to-help-coronavirus-pandemic-iyw-trnd_index_1588609612.html", "title": "How to feed the hungry, protect health professionals, aid refugees and support service workers during the pandemic", "title_page": "How to feed the hungry, protect health professionals, aid refugees and support service workers during the pandemic  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As the fight against the coronavirus pandemic intensifies, so does the strain felt across society. Impact Your World has gathered some ways in which you can help ease the pressure.\nIf you would like to donate to a specific nonprofit, you can click on the name of the charity in the article below. If you would like to support any or all of the organizations making a difference, click on the take action button below.\nFeeding the hungry\nAs schools shut down and shift to online learning, some kids in low-income households are losing access to free meals at school. The USDA is working to extend some free meal services, and several nonprofits are helping fill the gap. You can find out how to help them here\nInteractive: A guide to helping and getting help during the coronavirus crisis\nMeanwhile, food banks across the US are gearing up for increased need. Feeding America has set up a COVID-19 Response Fund to support its network of 200 food banks nationwide. The group is also setting up more mobile \"drive-through\" distribution points and taking care to ensure that vulnerable populations like those experiencing homelessness have access to food and hygiene.\nOperation BBQ Relief is providing at least 10,000 hot meals daily to the homeless and veteran population in Kansas City. The organization is equipped and ready to help more areas in the country. Kansas City will provide a template for feeding more communities.\nOlder adults are among the most vulnerable during this pandemic. Meals on Wheels provides home delivery of food to seniors. The organization faces an increased need for volunteers and donations right now. Many regular Meals on Wheels volunteers are more than 60 years old.\nProtecting healthcare workers\nFrontline healthcare workers are particularly at risk, and a shortage of protective equipment is impacting their response and safety.\nThe World Health Organization, UN Foundation and the Swiss Philanthropy Foundation jointly have created the COVID-19 Solidarity Response Fund . Donations to this fund will go toward financing diagnostic tests, supplies for health workers and support for research and development.\nInternational Medical Corps is working with the World Health Organization, ministries of health and global and local organizations to provide training, supplies and emergency medical response planning in high-risk locations.\nThe CDC Foundation has set up a fund to support deploying emergency staffing to US public health agencies, supplying medical equipment and increasing lab capacity. UNICEF USA is delivering medical supplies to health workers around the world. In addition, the charity is providing hygiene and medical kits to schools and health clinics.\nDoctors Without Borders is actively replenishing supplies and other specialized protective equipment to Wuhan Jinyintan hospital in the capital city of China's Hubei province. The group has a health education project in Hong Kong to provide information to vulnerable communities and service workers about how to identify symptoms and protect themselves from the disease.\nDirect Relief is providing protective equipment to health authorities, nonprofits and businesses in the US and China in response to the pandemic.\nGlobal Empowerment Mission is ordering masks and gowns to be sent to US hospitals and assembling hygiene kits for medical professionals and the public. MedShare is also delivering essential medical supplies to hospitals, clinics and healthcare professionals battling against the coronavirus.\nAiding refugees\nThe coronavirus can thrive among groups of people fleeing conflicts or political unrest in places like Yemen, Syria and Venezuela. Displaced families are often confined to overcrowded camps which can be hotbeds for disease.\nThe International Rescue Committee is scaling up its response in these areas: providing additional protective gear, increasing funding to minimize supply chain disruptions and bringing in more medical staff across affected areas. Oxfam is increasing the delivery of soap, clean water and other sanitation services.\nMercy Corps , in countries like the Democratic Republic of Congo, Lebanon and Yemen, is helping with clean water and other essential support for sanitation and hygiene. They are also continuing their efforts to provide basic needs to Syrians fleeing conflict.\nSupporting service workers\nService sectors, including travel and hospitality, are suddenly choked by financial hardship. The Salvation Army is expecting increased emergency financial aid requests from low-wage workers or laid-off employees struggling to make ends meet.\nThe United Way has established the COVID-19 Community Response and Recovery Fund to support communities affected by the virus. The fund is set to help keep families in their homes who are currently in a financial crisis and to stock food banks with essential staples to help feed children who rely on schools for meals.\nThe James Beard Foundation started a fund to provide micro-grants to independent food and beverage businesses in need. And the the Giving Kitchen is supporting food service workers in the state of Georgia. The nonprofit helps those in crisis due to an unexpected illness, injury, death or disaster.\nIf you would like to donate to a specific nonsprofit, you can click on the name of the charity in the article above. If you would like to support any or all of the organizations making a difference, click on the button below.", "url": "https://www.cnn.com/2020/03/13/us/how-to-help-coronavirus-pandemic-iyw-trnd/index.html"}