{"authors": ["Cathy Bussewitz"], "date_download": "2020-05-04 20:28:11", "date_modify": "2020-05-04 20:28:11", "date_publish": "2020-04-21 01:19:40", "description": "NEW YORK (AP) — A barrel of oil now costs less than a cheap bottle of wine. U.S. benchmark crude was trading as low as $6.50 a barrel Tuesday, more than 80% lower than the start of the...", "filename": "_3f322ec91ad35b51312156d80c3902ed_1588624091.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ea876d94eea5479f8828af6d6d4d8ccf/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3f322ec91ad35b51312156d80c3902ed_1588624091.html", "title": "Q&A: Oil prices hit new lows as economic pain deepens", "title_page": "Q&A: Oil prices hit new lows as economic pain deepens", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Petroleum storage tanks at the BP Indiana Tank Field are seen behind a security gate Tuesday, April 21, 2020, in Whiting, Ind. The world is awash in oil, there's little demand for it and we're running out of places to put it. That in a nutshell explains this week's strange and unprecedented action in the market for crude oil futures contracts, where traders essentially offered to pay someone else to deal with the oil they were due to have delivered next month.(AP Photo/Charles Rex Arbogast)\nPetroleum storage tanks at the BP Indiana Tank Field are seen behind a security gate Tuesday, April 21, 2020, in Whiting, Ind. The world is awash in oil, there's little demand for it and we're running out of places to put it. That in a nutshell explains this week's strange and unprecedented action in the market for crude oil futures contracts, where traders essentially offered to pay someone else to deal with the oil they were due to have delivered next month.(AP Photo/Charles Rex Arbogast)\nNEW YORK (AP) — A barrel of oil now costs less than a cheap bottle of wine.\nU.S. benchmark crude was trading as low as $6.50 a barrel Tuesday, more than 80% lower than the start of the year. The dizzying drop reflected stark suffering in the global economy that has left vastly diminished demand for oil.\nThere’s little mystery around the sharp drop-off: Efforts to limit the spread of the coronavirus have major cities around the world on lockdown, air travel has been seriously curtailed and millions of people are working from home, leading to far fewer commuters on the roads.\nBut pumps are still running, extracting oil from the ground, and all that oil has to go somewhere. Some brokers were betting that storage would be more valuable than oil next month, leading some on Monday to pay potential buyers to take oil off their hands .\nMany analysts saw Monday’s prices as limited to the peculiar nature of some contracts, but Tuesday’s drop signaled the industry is in for a prolonged, widespread challenge.\nHere are some questions and answers about the latest developments in the oil patch:\nWILL OPEC’S SUPPLY CUTS MAKE A DIFFERENCE?\nEarlier this month OPEC and its allies — with political pressure from the U.S. government — agreed to rein in oil production. Saudi Arabia said Tuesday that the cuts will total nearly 12.5 million barrels per day, and it is prepared to take further measures jointly with OPEC and other producers.\nBut that likely won’t be enough to curb massive oversupply. Global demand was expected to plummet by 29 million barrels a day this month, according to the International Energy Agency.\nIn Texas, which produces about 40% of U.S. oil, regulators are mulling a 20% output cut — about 1 million barrels per day — starting June 1 and exempting smaller producers, on the condition that other states and countries agree to an additional 4 million barrels a day of cuts.\n“It would not balance markets by itself, but proponents argue it could motivate deeper OPEC-plus cuts,” said Kevin Book, managing director at Clearview Energy Partners.\nHOW BAD WILL THIS BE FOR THE ECONOMY?\nNo one is making money at today’s prices. Companies are laying off thousands of employees and dramatically scaling back drilling. In some cases, they’re shutting down existing wells, which can permanently damage oil fields. U.S. shale producers were already struggling financially before the pandemic hit, and many more are expected to file for bankruptcy if rock-bottom prices persist.\n“If the oil industry drops and the tens, maybe hundreds of thousands are laid off, eventually those jobs will come back, but they may never come back into Texas and the United States,” said Ryan Sitton, commissioner at the Railroad Commission of Texas, which regulates the state’s oil industry.\nWHEN WILL THE INDUSTRY RECOVER?\nMajor oil producing nations are cutting output in the hopes of boosting oil prices, but that doesn’t solve the problem of weak demand. For that, there would need to be a return to business as usual, which in many parts of the world seems a long way off. Even with social distancing restrictions gradually easing, it may take time for consumers to feel comfortable spending and traveling as they did before.\nHOW WILL THIS AFFECT THE PRICE OF GASOLINE?\nCheap oil leads to cheaper prices at the pump, which are often viewed as a boon for consumers. The average price in the U.S. for a gallon of regular gasoline fell to about $1.49 or less, more than $1 less than a year ago, according to AAA. But this time around, it’s not good for anybody, said Jim Burkhard, vice president at IHS Markit.\n“Typically when oil prices fall, gasoline prices fall and that benefits consumers,” Burkhard said. “But prices are falling today because hardly anyone driving, they’re driving a lot, lot less. So it’s difficult for anyone to take advantage of these lower gasoline prices if they’re not driving. So there’s no winner in this situation today.”\nWHY DID THE PRICE OF OIL GO NEGATIVE ON MONDAY?\nThe price of U.S. benchmark crude that would be delivered in May fell as low as -$40 per barrel on Monday. It was the first time that the price on a futures contract for oil has gone negative, analysts say.\n“It’s the worst oil price in history, which shouldn’t surprise us, because it’s the inevitable result of the biggest supply and demand disparity in history,” Sitton said.\nWHAT’S GOING ON WITH OIL STORAGE?\nWith far less gasoline and jet fuel being consumed, oil tanks are starting to fill up. Experts have been warning that global storage could fill up in late April or early May.\nThat’s led some producers to decide to move oil now, because the space may become more valuable than the oil.\n“Eventually you go to a point where literally there’s so much of a valuable commodity in the world that the commodity no longer has value,” Sitton said. “And that’s what we’re seeing.”\nARE COMPANIES PAYING PEOPLE TO TAKE THEIR OIL?\nWhile some companies may be paying others to take away their crude oil, that does not appear to be widespread.\nMany analysts described Monday’s drop of crude oil prices into negative territory as technical, related to the way futures contracts are written. Most buyers are currently purchasing oil that would be delivered in June, not May.\n“We could see isolated incidents where oil companies pay people to take their oil away as storage and pipeline capacity become scarce but that is unlikely on a sustained basis,” said Ryan Fitzmaurice, energy strategist at Rabobank.\nWHERE WILL THE OIL GO?\nWith many oil tanks filling up, the federal government is negotiating with companies to store crude oil in the Strategic Petroleum Reserve. But if all the storage tanks are full, oil companies will begin shutting in wells. Many tankers are full of oil and floating at sea.\n___\nAP Video Journalist Terry Chea in Alameda, Calif., and AP Business Writers Alex Veiga in Los Angeles and Aya Batrawy in Dubai contributed to this report.", "url": "https://apnews.com/3f322ec91ad35b51312156d80c3902ed"}