{"authors": ["Emma Reynolds"], "date_download": "2020-05-04 16:57:55", "date_modify": "2020-05-04 16:57:55", "date_publish": "2020-04-09 12:29:57", "description": "Coronavirus lockdowns across the globe should not be completely lifted until a vaccine for the disease is found, according to a study based on China's outbreak published in medical journal The Lancet.", "filename": "2020_04_09_world_lockdown-l_8db7113b13da9494fa59a634143652df_index_1588611475.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409100448-03-lockdown-lifted-0408-wuhan-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_world_lockdown-l_8db7113b13da9494fa59a634143652df_index_1588611475.html", "title": "Lockdowns shouldn't be fully lifted until coronavirus vaccine found, new study warns", "title_page": "Lockdowns shouldn't be fully lifted until coronavirus vaccine found, new study warns - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Coronavirus lockdowns across the globe should not be completely lifted until a vaccine for the disease is found, according to a study based on China's outbreak published in medical journal The Lancet.\nChina's draconian restrictions on daily life appear to have halted the first wave of Covid-19 across much of the country, but the researchers used mathematical modeling to show that premature lifting of measures could result in a sweeping second wave of infection.\nAuthorities ended the 76-day lockdown of Wuhan in Hubei province on Wednesday, as the city at the original epicenter of the coronavirus crisis emerges from the deadly outbreak that is now raging across the globe. Some restrictions will remain in place, however, with officials conscious of the risk as trains and tourist sites were packed across the country.\n\"While these control measures appear to have reduced the number of infections to very low levels, without herd immunity against Covid-19, cases could easily resurge as businesses, factory operations, and schools gradually resume and increase social mixing, particularly given the increasing risk of imported cases from overseas as Covid-19 continues to spread globally,\" said Professor Joseph T Wu from the University of Hong Kong, who co-led the research, in a Wednesday news release.\nHe cautioned that the speed of infection would rise unless governments ensured restrictions were lifted slowly and transmission was closely monitored.\n\"Although control policies such as physical distancing and behavioral change are likely to be maintained for some time, proactively striking a balance between resuming economic activities and keeping the reproductive number below one is likely to be the best strategy until effective vaccines become widely available.\"\nThe research could be critical as countries across the world -- some which have only had lockdowns in place for a few weeks -- consider how best to ease restrictions to get their economies moving again. Getting it wrong could lead to further outbreaks and new restrictions, the study found, and could be catastrophic for health services and economies.\nAustria on Monday said it would gradually begin to reopen shops after Easter, one of several European countries preparing to loosen restrictions. In Germany, a group of economists, lawyers and medical experts are recommending a gradual revival of Europe's biggest economy that would allow specific industries and workers to resume their activities while steps are taken to prevent a resurgence of coronavirus.\nA dozen academics wrote in that report , which was published last week by the Ifo Institute for Economic Research, that they do not expect a vaccine or effective treatment for the coronavirus to be available before 2021.\nThe UK government is reviewing its lockdown almost three weeks after it started, but London Mayor Sadiq Khan said yesterday that it was \" nowhere near \" easing restrictions with the expected peak more than a week away.\nPassengers alight from the first train out of Wuhan in Nanning city, in China's Guangxi region, on Wednesday.\nBritish economics researchers have suggested that the 4.2 million young people aged 20-30 who do not live with their parents should be allowed to return to work first.\nAndrew J. Oswald and Nattavudh Powdthavee, from Warwick University, said in a briefing paper that the idea would help ease the \"severe damage\" that is being done to the country's economy.\n\"Unless a vaccine is discovered quickly, it is unlikely that there will be any riskless or painless course of action,\" the paper states.\n\"Epidemiological and economic trade-offs will instead have to be faced. The choices at that juncture are likely to be difficult ones for politicians and citizens.\nThey said the idea \"would help to restart prosperity before an extraordinary recession takes hold; it would lead to other societal benefits; it would also create a reasonably small, but unfortunately not negligible, extra risk to health in the country.\"\nThe effects of lifting a lockdown too early could hit some areas harder than others. Further analysis in the Lancet report showed that the risk of death for those who tested positive for Covid-19 varied substantially in different parts of China, based on economic development and availability of health care resources.\nThe death rate in Hubei was 5.91%, almost six times higher than outside the province, where it was 0.98%, the study found.\n\"Even in the most prosperous and well-resourced megacities like Beijing and Shanghai, health care resources are finite, and services will struggle with a sudden increase in demand,\" senior author Professor Gabriel M Leung from the University of Hong Kong, said in the release accompanying the Lancet report. \"Our findings highlight the importance of ensuring that local health-care systems have adequate staffing and resources to minimize Covid-related deaths.\"\nStrict restrictions on the movement of people and goods were introduced across China on January 23 after the novel coronavirus emerged in Wuhan in December, drastically affecting the economy as well as personal freedoms. These have since been progressively relaxed in some Chinese provinces, with factories and offices gradually reopening.\nThe analysis of four cities and 10 provinces outside Hubei states that measures should be lifted gradually or the number of cases will progressively rise over the relaxation period.\nThe estimates also suggest that once the burden of rising cases is elevated, simply tightening interventions again would not reduce the burden back to its original level. This would require extra effort, likely resulting in bigger health and economic effects.\n\"We are acutely aware that as economic activity increases across China in the coming weeks, local or imported infection could lead to a resurgence of transmission,\" co-lead author Dr. Kathy Leung from the University of Hong Kong, added in the release. \"Real-time monitoring of the effect of increased mobility and social mixing on Covid-19 transmissibility could allow policymakers to fine tune control measures to interrupt transmission and minimize the impact of a possible second wave of infections.\"", "url": "https://www.cnn.com/2020/04/09/world/lockdown-lift-vaccine-coronavirus-lancet-intl/index.html"}