{"authors": ["Clare Duffy", "Sherisse Pham", "Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:13:19", "date_modify": "2020-05-04 16:13:19", "date_publish": "2020-04-02 22:48:33", "description": "Global markets showed renewed signs of weakness on Friday as the economic fallout from the coronavirus pandemic continues to weigh on investors. But oil rose again after a wild spike Thursday on talk of production cuts.", "filename": "2020_04_02_investing_global-stocks_index_1588608799.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402174940-wall-street-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_investing_global-stocks_index_1588608799.html", "title": "Global stocks show renewed weakness but oil keeps rising on talk of supply cut", "title_page": "Global stocks show renewed weakness but oil keeps rising on talk of supply cut - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York/Hong Kong/London (CNN Business) Global markets showed renewed signs of weakness on Friday as the economic fallout from the coronavirus pandemic continues to weigh on investors. But oil rose again after a wild spike Thursday on talk of production cuts.\n\"As uncertainties arise from the global economic fallout of COVID-19, global growth may worsen before improving and market volatility and risk aversion will persist,\" Tai Hui, chief market strategist for Asia at JP Morgan, said in a note on Friday.\nUS stock futures pointed lower, following an upbeat day on Wall Street.futures fell 255 points, or 1.2%.futures were down about 1.18% andfutures fell about 1.2%.\nAfter markets in Asia closed, the People's Bank of China announced that it will reduce the amount of cash that banks have to keep in reserve, freeing up 400 billion yuan ($56.3 billion) to \"revive the economy.\" The reserve requirement ratio was also cut in March, injecting around 550 billion yuan ($77.5 billion) into the economy.\nChina is struggling to recover from the sudden economic shock caused by the pandemic. The World Bank warned earlier this week that its $14 trillion economy may not grow at all in 2020.\nOil rebound boosts stocks\nand Saudi Arabia said it was calling an urgent meeting of OPEC and other producers. Stocks closed Thursday higher, driven by energy companies, which shot up after oil prices soared by a record 25% . President Donald Trump suggested that massive production cuts could be on the way,and Saudi Arabia said it was calling an urgent meeting of OPEC and other producers.\nOil prices continued their advance overnight, with Brent crude futures, the world's benchmark, rising more than 4% to $31.14 a barrel. US oil rose about 0.9% to $25.42.\ndemand amid the coronavirus crisis, with thousands of planes grounded and motorists staying home. At the same time, Saudi Arabia and Russia have been locked in a price war, flooding the market with additional supply. The oil market has suffered from collapsingdemand amid the coronavirus crisis, with thousands of planes grounded and motorists staying home. At the same time, Saudi Arabia and Russia have been locked in a price war, flooding the market with additional supply.\nAnd the spread of the coronavirus outbreak is not letting up. There are now more than 1 million cases of the virus globally, with more than 238,000 in the United States.\nThe US jobs report for March will be out Friday, although it is expected to be outdated given that the survey was done in the week ending March 12, before the tsunami of layoffs.\n\"The data will be bad, in short, but not reflective of the true awfulness that is unfolding,\" Kit Juckes, chief strategist at Societe Generale, said in a note.", "url": "https://www.cnn.com/2020/04/02/investing/global-stocks/index.html"}