{"authors": ["Melinda Deslatte"], "date_download": "2020-05-04 20:08:50", "date_modify": "2020-05-04 20:08:50", "date_publish": "2020-04-08 17:48:31", "description": "BATON ROUGE, La. (AP) — As Louisiana sees encouraging signs in fighting the coronavirus, Gov. John Bel Edwards worries the news could embolden people to lessen their physical distancing from...", "filename": "_ae88bbd896b9bfa650da4ab565799b35_1588622930.html", "image_url": "https://storage.googleapis.com/afs-prod/media/29be6a16e26a421598ddedfc2e40cc43/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ae88bbd896b9bfa650da4ab565799b35_1588622930.html", "title": "As curve appears to flatten, Edwards says keep staying home", "title_page": "As curve appears to flatten, Edwards says keep staying home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Parishioners pray from their car as Fr. Steve Buno, Pastor of St. Rita of Cascia Catholic Church in Harahan, La., performs drive-thru Benediction of the Blessed Sacrament, as a form of social distancing due to the new coronavirus, during Holy Week, Tuesday, April 7, 2020. (AP Photo/Gerald Herbert)\nParishioners pray from their car as Fr. Steve Buno, Pastor of St. Rita of Cascia Catholic Church in Harahan, La., performs drive-thru Benediction of the Blessed Sacrament, as a form of social distancing due to the new coronavirus, during Holy Week, Tuesday, April 7, 2020. (AP Photo/Gerald Herbert)\nBATON ROUGE, La. (AP) — As Louisiana sees encouraging signs in fighting the coronavirus , Gov. John Bel Edwards worries the news could embolden people to lessen their physical distancing from others in an Easter holiday week traditionally packed with religious gatherings and crawfish boils.\nThe rate of new hospitalizations has slowed, and the number of COVID-19 patients on ventilators has decreased. The governor cautiously described those benchmarks as early signs “the curve is starting to flatten” and the rate of new infections could be shrinking. In a hopeful sign, Louisiana dropped the number of ventilators it’s trying to obtain, from 14,000 on order to 1,000.\nWhile he’s heartened by the latest data, Edwards said Louisianans shouldn’t return to normal life.\n“There was no Easter exemption from the stay-at-home order. There was no Easter exemption from the 10-person limit (on gatherings). Because that virus isn’t going to honor that,” the Democratic governor said. “The virus is very much in control.”\nMore than 17,000 people in Louisiana have confirmed infections of the COVID-19 disease caused by the coronavirus , about 12% of whom are hospitalized, according to health department data. The number of virus patients statewide who needed ventilators fell again Wednesday. Of the nearly 2,000 virus patients in hospitals, 490 were on ventilators, down from 519 a day earlier.\nAmid spiraling unemployment caused by massive shutdowns, Louisiana will start handing out new federally financed benefits Monday. Unemployed workers will receive an extra $600 per week on top of a state unemployment benefit that maxes out at $247, and gig workers and contract employees will be newly eligible, under the aid package passed by Congress. The increased unemployment check will be available through July 31.\nIn Louisiana, 277,000 people have filed unemployment claims since March 1, the governor said, compared to 103,000 for all of 2019.\nFor most people, the coronavirus causes symptoms such as high fever and a dry cough that resolve in several weeks. But some, especially older adults and people with existing health problems, can suffer severe symptoms and require respirators to survive.\nLast month, Edwards ordered schools closed, limited restaurants to takeout and delivery and shuttered businesses deemed nonessential, such as gyms, hair salons and bars. Those restrictions remain in place through April.\nThe governor credits those efforts — and residents’ compliance — with Louisiana’s improving trend line. State modeling no longer suggests the New Orleans region is on an imminent path to run out of ventilators and hospital beds. In fact, no such shortages are forecast for the next two weeks.\nBeyond people sheltering at home, Edwards and public health leaders say doctors are adjusting their use of ventilators to lessen the amount of time patients spend on them.\n“What we’ve learned ... is that COVID patients don’t do as well if we push them on the ventilator early, so the idea is to use things like noninvasive methods,” said Dr. Alex Billioux, head of the state Office of Public Health.\n“Then once somebody does need that level of care and is on a ventilator, using the best evidence to understand how we can limit the time that person spends on a ventilator,” Billioux said.\nWhile the data is starting to look less grim, Louisiana’s virus outbreak continues to take a heavy toll. The number of deaths from the virus climbed higher Wednesday to 652 people, with 70 new deaths attributed to COVID-19.\nTightly packed facilities have been vulnerable to the virus, and infection numbers at nursing homes continue to jump. Ninety-three nursing homes have residents with COVID-19, with 130 deaths reported by the facilities, according to the health department, which started refusing last week to name individual locations with confirmed virus cases.\nThe head of a group that protects the rights of 4,000 disabled people in about 500 private group homes and larger facilities said those people may not be getting adequate protection from and care for COVID-19, and they’re seeking more information about facility testing rates and results from the health department.\n“We know there are diagnoses for COVID-19 among residents who by the nature of group homes cannot be isolated,” said Christopher J. Rodriguez, executive director of Disability Rights Louisiana. “We know that staff who tested positive have continued to work.”\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/ae88bbd896b9bfa650da4ab565799b35"}