{"authors": ["James Ellingworth"], "date_download": "2020-05-04 20:17:43", "date_modify": "2020-05-04 20:17:43", "date_publish": "2020-04-07 13:01:34", "description": "DÜSSELDORF, Germany (AP) — Sam Grewe could end up missing the start of medical school to go to the Paralympics, and that will be fine with him. With the games postponed until 2021, the Notre...", "filename": "_3d1dd08d22fe79ce00e2d1d916595709_1588623463.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e7a6c49886234237b095f4a24abc102a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3d1dd08d22fe79ce00e2d1d916595709_1588623463.html", "title": "Paralympians adapt to new challenges as virus spreads", "title_page": "Paralympians adapt to new challenges as virus spreads", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Sunday, Sept. 18, 2016 file photo, performers dance next to a sign that reads: \"See you in Tokyo\" during the closing ceremony of the Rio 2016 Paralympic Games at the Maracana Stadium in Rio de Janeiro, Brazil. Along with the Olympics, the Paralympics have been pushed back to 2021 because of the coronavirus pandemic. The new dates are Aug. 24-Sept. 5. For many Paralympians, a delay seemed like the only option. Paralympic athletes often have specific medical and training needs which can’t always be met at a time when people are staying home and doctors are helping out overloaded ERs. (AP Photo/Leo Correa, File)\nFILE - In this Sunday, Sept. 18, 2016 file photo, performers dance next to a sign that reads: \"See you in Tokyo\" during the closing ceremony of the Rio 2016 Paralympic Games at the Maracana Stadium in Rio de Janeiro, Brazil. Along with the Olympics, the Paralympics have been pushed back to 2021 because of the coronavirus pandemic. The new dates are Aug. 24-Sept. 5. For many Paralympians, a delay seemed like the only option. Paralympic athletes often have specific medical and training needs which can’t always be met at a time when people are staying home and doctors are helping out overloaded ERs. (AP Photo/Leo Correa, File)\nDÜSSELDORF, Germany (AP) — Sam Grewe could end up missing the start of medical school to go to the Paralympics, and that will be fine with him.\nWith the games postponed until 2021, the Notre Dame student and Paralympic silver medalist in the high jump will face a packed senior year and graduation.\n“I would expect an extra element to the sense of urgency for the training next year,” the American said. “I might miss my first two weeks of medical school to be in Tokyo, which is so far from ideal ... but I wouldn’t miss Tokyo for anything.”\nAlong with the Olympics, the Paralympics have been pushed back to 2021 because of the coronavirus pandemic. The new dates are Aug. 24-Sept. 5.\nFor many Paralympians, a delay seemed like the only option amid lockdowns around the world. Paralympic athletes often have specific medical and training needs which can’t always be met at a time when people are staying home and doctors are helping out overloaded ERs.\n“Sports are important but I think health is more important, frankly, and I think that this postponement has really, I would hope, enabled athletes to pause from those immediate concerns to train and really to prioritize their own health,” said Dr. Cheri Blauwet, who won a Paralympic gold medal in wheelchair racing for the United States in 2004.\nSpecialized facilities are closed, leaving athletes training at home off video guidance from coaches. Different athletes are affected in different ways.\nVisually impaired runners train and compete with a guide, and can’t necessarily meet up with them while complying with social distancing rules. Sprinters’ carbon-fiber “blade” prosthetics work great on a track, but aren’t suited for asphalt or grass. Wheelchair rims can transmit the virus onto the user’s hands if not disinfected regularly.\n“Many of us operate with equipment and that equipment is essential,” Blauwet said. “I think everyone is taking extra precautions to ensure we’re doing everything we can to maintain sterility of our day-to-day equipment.”\nWhile Paralympians are in general much fitter than most people, some have conditions which make them vulnerable to the virus, said Dr. Feranmi Okanlami, the director of adaptive sports at the University of Michigan.\nAthletes with a spinal cord injury may have reduced lung capacity, making it harder to cough, and they may also be susceptible to bed sores while being treated, said Okanlami, who was himself left paralyzed by a spinal injury and uses a wheelchair.\nAs the virus outbreak spreads in the United States, Okanlami has been seeing patients virtually and working on a coronavirus hotline.\n“There are going to be even more patients treated as outpatients than there will be in the hospital and these patients need to have someone to talk to as well,” he said in a text message.\nTraining conditions vary sharply across the world for Paralympians at the best of times. Specialized training facilities, coaching and equipment are often expensive.\nBetter-resourced national Paralympic bodies have set up online coaching resources for athletes, but many organizations in poorer countries don’t even have a website.\nIn New Zealand, athletes training at home have support from strength and conditioning coaches and nutrition advice, as well as regular group calls with a sports psychologist.\n“As a small nation with approximately 53 Para athletes targeting Tokyo we are able to provide very personal and individualized support,” Paralympics New Zealand spokeswoman Melissa Dawson said in an e-mail.\nThe head of the International Paralympic Committee, Andrew Parsons, said he is only leaving his home in Brazil to buy food.\n“This momentaneous and extremely tough new reality would be easier if we knew how long it would last but, the truth is, nobody knows. The uncertainty is hard to process,” Parsons said in a letter to athletes dated Thursday.\n“It is OK to not be OK and at a time when we are encouraged to be apart, we must unite like never before. We must look out for and support each other and prioritize health and well-being above everything else.”\n___\nJames Ellingworth on Twitter: https://twitter.com/jellingworth\n___\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports", "url": "https://apnews.com/3d1dd08d22fe79ce00e2d1d916595709"}