{"authors": ["Chandelis Duster", "Caroline Kelly"], "date_download": "2020-05-04 16:21:34", "date_modify": "2020-05-04 16:21:34", "date_publish": "2020-04-05 14:38:26", "description": "Louisiana Democratic Gov. John Bel Edwards on Sunday said his state could run out of ventilators by the end of the week if the number of confirmed coronavirus cases there continues to surge.", "filename": "2020_04_05_politics_john-bel-edwards-ventilators-cnntv_index_1588609294.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170402170239-john-bel-edwards-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_john-bel-edwards-ventilators-cnntv_index_1588609294.html", "title": "Louisiana governor says state could run out of ventilators by end of the week if coronavirus cases continue to rise", "title_page": "Louisiana governor says state could run out of ventilators by end of the week if coronavirus cases continue to rise - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Louisiana Democratic Gov. John Bel Edwards on Sunday said his state could run out of ventilators by the end of the week if the number of confirmed coronavirus cases there continues to surge.\n\"Every day we get new information that informs our modeling. We now think it's probably around the 9th of April before we exceed our ventilator capacity based on the current number on hand and that we're a couple of days behind that on ICU bed capacity being exceeded,\" he told CNN's Jake Tapper on \"State of the Union.\"\n\"As we achieve success in slowing the rate of spread, we also push out that date. And critically important is the number of people who will present to the hospital and not be able to get a (ventilator) or a bed, it's a smaller number.\"\nLouisiana has emerged as one of several coronavirus hot spots across the United States with a surge in the number of confirmed coronavirus cases and deaths. The state has more than 12,000 cases and more than 400 deaths, according to Johns Hopkins University's tally of cases . Early Sunday, the nationwide death toll had gone up to at least 8,503 people, with at least 312,245 infected, according to the data compiled by Johns Hopkins.\nEdwards continued, \"So we're encouraging everyone in Louisiana to take social distancing, the stay-at-home order, very seriously because that's how we're going to save people's lives at the end of the day.\"\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/john-bel-edwards-ventilators-cnntv/index.html"}