{"authors": ["Sandra Gonzalez"], "date_download": "2020-05-04 16:18:56", "date_modify": "2020-05-04 16:18:56", "date_publish": "2020-04-03 20:40:22", "description": "On March 12, Debbie Allen had what would turn out to be one of the last meetings with the staff of the Debbie Allen Dance Academy she would have for a while.", "filename": "2020_04_03_entertainment_debbie-allen-dance_index_1588609136.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402203234-debbie-allen-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_entertainment_debbie-allen-dance_index_1588609136.html", "title": "Debbie Allen wants to dance with you and other ways celebs are keeping us active", "title_page": "Debbie Allen wants to dance with you and other ways celebs are keeping us active - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) On March 12, Debbie Allen had what would turn out to be one of the last meetings with the staff of the Debbie Allen Dance Academy she would have for a while.\nThat day, they had closed the studio amid concerns over the spread of coronavirus. It was the same day production was suspended on Los Angeles-based \"Grey's Anatomy,\" a show on which she fills multiple roles, including actor and executive producer.\nIt was in that meeting that she decided to fill a little bit of the void that was felt by her dance community by doing a class over Instagram live, which she'd never used before.\n\"They said, 'Yes, Ms. Allen. That's the spirit,\" Allen recalled her staff saying.\nTo date, her first class has been viewed more than 115,000 times. Another, targeted toward children and children and taught by her daughter, Vivan Nixon, has more than 354,000 views.\nThis week, she also announced the Debbie Allen Dance Academy Virtual Dance World, a series of classes available via Zoom for a $3 donation.\nWith more than 90% of the US population under stay at home or shelter in place orders, according to a CNN count , Allen's classes are proving popular at home and elsewhere.\n\"A lot of people needed it, and it was a healing experience and a releasing experience and a motivational experience for so many people,\" Allen told CNN. \"And I was just grateful to share what I do and that it could be essential. I know dance is not listed on the list of what's essential right now, but you know, this kind of artistic spirit, it really is.\"\nAllen said she's heard from viewers all across the world, from Brazil to India. And while some classes are aimed toward younger students, she tries to make them accessible to all experiences levels, ages and physical skills.\n\"Videos have been sent to me from little babies dancing, people who are serious dancers, people who just want to move, and, you know, guys who have bodies that looked like they are the next Thor or Black Panther,\" she said, laughing.\nFor Allen, the classes aren't just about physical benefits -- and there are many -- but about the spiritual benefits.\n\"We are all trying to heal, whether we have this virus right now or not. We are connected -- every last one of us,\" Allen said. \"Everyone knows somebody that has it. Everyone is in a community that is threatened by it. There's not place on this planet that is free of it. So this dance is an expression of joy and freedom and self-will. You are willing yourself to be powerful and you are willing yourself to breathe and be free and to face any challenge.\"\nAllen has plans to continue hosting classes on her Instagram live for \"a long time.\" And other celebrities have followed suit with their own self-distancing solutions to health and wellness.\nHere are some others:\nWorking out with Chris Hemsworth\nThor himself is sharing some of his workout secrets on Instagram and an app called Centr.\nIf you sign up by Sunday, they are offering six weeks of access for free. On April 6, they will relaunch a program designed to be done at home with minimal equipment.\nMeditating with Lizzo\nIn addition to sending meals to healthcare workers, Lizzo is doing her part for those stuck at home too.\nHer roughly half-hour meditating sessions, which feature some of her moving flute playing, are meant to \"promote healing during this global crisis,\" she wrote on Instagram.\nShe's posted two so far that can be viewed on Instagram.\nTrain like a champ with Coach Monica from 'Cheer'\nIn what looks to be a one-time video, Monica Aldama, the coach known for taking her cheer team to victory on Netflix's \"Cheer,\" shared a workout routine on Instagram.\n\"Exercising is important for maintaining good physical and mental health because it allows endorphins to be released which create a natural mood booster,\" she wrote.\nBonus: Be your own Jerry and give yourself mat talk while you do it.\nImprovise with Arnold\nIn another one-time video, Arnold Schwarzenegger showed that while he may not be a fitness competitor anymore, he still likes to keep active.\nHis video had one prevailing message: Improvise.\n\"Just as long as you do something every day,\" he said.\nHe added: \"Stay at home, stay fit. We cannot control the virus but we can control our fitness.\"", "url": "https://www.cnn.com/2020/04/03/entertainment/debbie-allen-dance/index.html"}