{"authors": ["Fernando Alfonso Iii"], "date_download": "2020-05-04 16:27:31", "date_modify": "2020-05-04 16:27:31", "date_publish": "2020-04-07 11:24:57", "description": "The CDC's mask guidance is an example of heterogeneous effects, one scholar says: \"Clearly, there are additional costs that blacks must consider when choosing what protective gear they will wear.\"", "filename": "2020_04_07_us_face-masks-ethnicity-coronavirus-cdc-trnd_index_1588609651.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406145311-coronavirus-mask-new-york-0322-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_us_face-masks-ethnicity-coronavirus-cdc-trnd_index_1588609651.html", "title": "Why some people of color say they won't wear homemade masks", "title_page": "Why some people of color say they won't wear homemade masks - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Centers for Disease Control and Prevention is now recommending that all Americans wear homemade face coverings in public to help stem the spread of coronavirus.\nBut Trevon Logan, an economics professor at Ohio State University, will not be following this guidance.\n\"We have a lot of examples of the presumed criminality of black men in general,\" Logan, who is black, told CNN. \"And then we have the advice to go out in public in something that ... can certainly be read as being criminal or nefarious, particularly when applied to black men.\"\nLogan is not alone in his concerns. On social media and in interviews with CNN, a number of people of color — activists, academics and ordinary Americans — expressed fears that homemade masks could exacerbate racial profiling and place blacks and Latinos in danger.\n\"I don't feel safe wearing a handkerchief or something else that isn't CLEARLY a protective mask covering my face to the store because I am a Black man living in this world,\" tweeted Aaron Thomas , an educator in Columbus, Ohio. \"I want to stay alive but I also want to stay alive.\"\nHis tweet has more than 121,000 likes.\nThe CDC's recommendation on do-it-yourself face masks comes as the skyrocketing number of coronavirus cases and shortages of medical supplies have made professional-grade surgical masks all but unavailable to most Americans.\nIn an interview with CNN, Logan acknowledged that during a pandemic it makes sense to ask people to protect their faces in any way possible.\nProtective masks for sale are displayed in a store in Brooklyn on April 2, 2020 in New York City.\nBut it also makes sense not to wear them if you're a person of color, he added.\n\"This (wearing a homemade mask) seems like a reasonable response unless you just sort of take American society out of it. When you can't do that, you're basically telling people to look dangerous given racial stereotypes that are out there,\" Logan said.\n\"This is in the larger context of black men fitting the description of a suspect who has a hood on, who has a face covering on,\" he added. \"It looks like almost every criminal sketch of any garden-variety black suspect.\"\nWhat bandanas and other attire can mean for people of color in America\nIn the US, criminal justice and fashion have sometimes made for a deadly combination.\nBandanas, particularly in certain colors, are often associated with gang affiliation and violence, said Cyntoria Johnson, an assistant professor in the Department of Criminal Justice and Criminology at Georgia State University.\nThe Bloods and Crips street gangs of California have used colorful bandanas or rags as a system of identification, according to the Los Angeles Police Department . The LAPD also describes the \"uniform of Hispanic gangs\" as including \"a bandana tied around the forehead similar to a sweatband.\"\n\"People of color have to make conscious decisions every day about the way they show up in the world and are perceived by others, especially the police,\" Johnson said.\nRacial profiling by law enforcement in the US has been documented by studies like the Stanford Open Policing Project, which examined 100 million traffic and pedestrian stops from 2011 to 2017 and found that officers generally stopped blacks at higher rates than whites. In recent years high-profile police shootings of black men have also raised fears of law enforcement among African Americans.\nA man wears gloves and a bandanna across his face while riding a scooter on March 18, 2020 in Beverly Hills, California.\nBut this nuance was absent on Friday when the CDC instructed people to wear \"cloth face coverings in public settings where other social distancing measures are difficult to maintain.\"\nThe federal guidance also included a video of US Surgeon General Dr. Jerome Adams showing how to turn a bandana, scarf or old T-shirt into a mask.\n\"Health equity, and the complex interactions between race and health, have always been an area of emphasis for my office,\" Adams said in a statement sent to CNN. \"I understand the concerns communities of color would have about being racially profiled, and am working with the NAACP, the NMA, and other organizations representing people of color to ensure no one is unduly harmed by COVID-19, or our response to it.\"\nThe CDC's mask guidance is an example of heterogeneous effects, said Robynn Cox, an assistant professor in the University of Southern California's Department of Social Change and Innovation.\n\"Just because something may work or be true for the mainstream (average), doesn't mean that it will also be true, or that it will work the same way, for different groups,\" Cox told CNN over email. \"Clearly, there are additional costs that blacks must consider when choosing what protective gear they will wear.\"\nWhen choosing whether to wear a mask is a 'lose-lose situation'\nOne organization all too familiar with America's troubled history with race is the American Civil Liberties Union.\nAndrea Young, executive director of the ACLU of Georgia, characterized the CDC's mask guidance as \"one more instance of racial insensitivity that pervades the response to this pandemic.\"\n\"To date, neither federal nor Georgia state officials are addressing the racial disparities in access to healthcare, access to the internet and the ability to work from home. Black Americans are suffering disproportionately from this pandemic,\" Young said.\nThe CDC has not responded to multiple requests for comment. Georgia Gov. Brian Kemp's office also did not respond to a request for comment.\nThese fears about wearing homemade masks come as government data shows the outbreak is more concentrated in major US metropolitan areas like New York City and in the Southeast, where greater percentages of African Americans and Latinos live.\nMedical masks like these have been in short supply for weeks, forcing many Americans to make their own versions at home.\nBlack and Latino workers also are \"much less likely\" to be able to work from home, according to a report from Economic Policy Institute\nThe federal mask guidelines failed to capture this reality, said ReNika Moore, director of the ACLU's Racial Justice Program.\n\"For many black people, deciding whether or not to wear a bandana in public to protect themselves and others from contracting coronavirus is a lose-lose situation that can result in life-threatening consequences either way,\" Moore said.\nJUST WATCHED Confused on whether you need a mask? Dr. Sanjay Gupta has the answer Replay More Videos ... MUST WATCH Confused on whether you need a mask? Dr. Sanjay Gupta has the answer 02:07\n\"Not wearing a protective bandana goes against CDC recommendations and increases the risk of contracting Covid-19, but wearing one could mean putting their lives at risk of getting shot or killed because of racially-biased targeting.\"\nEven so, Che Johnson-Long, a black woman who works for the Racial Justice Action Center in Atlanta, says she plans to wear a mask in public.\n\"I will be wearing a mask because it can protect other people from what I may potentially have,\" she told CNN. \"But what I will also do while wearing a mask is all the things that I'm already doing as a black person in Atlanta. I will text people before I leave the house so that someone knows where I am. I'll make sure to travel with someone that I know or to let someone know when I get back home.\n\"If I take walks, I'll make sure that I say hi to people so that they can recognize that I live in the neighborhood,\" Johnson-Long added. \"I'll do all the things I would do if I was afraid of being stopped by the police anyways.\"", "url": "https://www.cnn.com/2020/04/07/us/face-masks-ethnicity-coronavirus-cdc-trnd/index.html"}