{"authors": ["Jeff Amy", "Ben Nadler"], "date_download": "2020-05-04 20:26:26", "date_modify": "2020-05-04 20:26:26", "date_publish": "2020-04-15 22:18:01", "description": "ATLANTA (AP) — Newly appointed U.S. Sen Kelly Loeffler is living up to her promise to self-fund her campaign, while the Republican's challengers raise millions in advance of a November special...", "filename": "_f106649dc84cff0425978c4609c30a1b_1588623986.html", "image_url": "https://storage.googleapis.com/afs-prod/media/0e327561f0774f4a81b201ff32a16573/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f106649dc84cff0425978c4609c30a1b_1588623986.html", "title": "Loeffler's self-funding buoys her money total in Senate race", "title_page": "Loeffler's self-funding buoys her money total in Senate race", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "ATLANTA (AP) — Newly appointed U.S. Sen Kelly Loeffler is living up to her promise to self-fund her campaign, while the Republican’s challengers raise millions in advance of a November special election.\nMeanwhile, first-term GOP incumbent David Perdue continues to amass a mountain of cash as Democrats scramble for their party’s nomination to oppose him in a primary now set for June 9.\nThose are the results of campaign finance reports for the first three months of the year. Filed Monday, the reports include a period in late March when candidates rapidly shifted to online events as the spread of COVID-19 made in-person events perilous.\nLoeffler has promised to spend $20 million to win the last two years of a Senate term after Johnny Isakson stepped down, part of the reason that Gov. Brian Kemp appointed her. She put $5 million into her campaign in the first quarter, bringing the total she’s loaned her campaign so far to $10 million. Combined with $1.1 million that she raised from others, she reports more than $6 million on hand for the long slog to November, as she runs against 20 other candidates in an election that could go to a January runoff.\nLoeffler’s top Republican challenger, U.S. Rep Doug Collins, said he has raised more than $840,000 since announcing his bid to unseat Loeffler in late January. Collins rolled more than $1.6 million over from his House campaign account, giving him $2.2 million in the bank. Collins spokesman Dan McLagan argued that Collins’ success in raising money from outside donors, as opposed to Loeffler’s self-funding, means Collins “tied her in fundraising, and he did it with $20 donations from farmers and blue-collar workers from Perry to Paulding County.”\nDemocrat Raphael Warnock, pastor of the Atlanta church where the Rev. Martin Luther King Jr. preached, raised $1.5 million since entering the race. His campaign reports having nearly $1.2 million in cash. Democrat Matt Lieberman said he raised $267,000 and has $309,000 on hand. Democrat Ed Tarver didn’t respond to emails seeking his fundraising totals.\nPerdue’s campaign said Wednesday that his campaign and associated entities now have more than $9 million on hand after his campaign raised $1.65 million in the quarter and other groups raised about $800,000. Perdue faces no GOP opposition in the primary.\nDemocrat Jon Ossoff, who raised a record $23 million in a failed 2017 special election bid in suburban Atlanta’s 6th Congressional District, continues to lead the money race among Democrats challenging Perdue. Ossoff raised $1 million in the first quarter and has $1.8 million on hand as he competes for the party’s nomination. Ossoff touted his reliance on small donations under $200, saying he got more than 25,000 of them in the three-month period.\nFormer Columbus Mayor Teresa Tomlinson raised more than $600,000 during the quarter and has more than $450,000 on hand. Tomlinson expressed confidence that her fundraising was catching up to Ossoff.\n“Jon Ossoff’s campaign is sort of plateauing and ours is on the ascent,” she said in a phone interview Wednesday. Tomlinson said she was forced to make a quick transition to online fundraising on March 12, when she told donors hours before a scheduled in-person event that it would instead be held virtually. She said she’s tried to pick up the pace of online fundraisers and meet-and-greets since then.\n“I’ve got a hell of a handshake and I hope I can use it again some day,” she said.\nSarah Riggs Amico, the third prominent Democrat seeking to challenge Perdue, raised $163,000 and has $279,000 on hand. She is touting additional labor union endorsements and said she plans to put more of her own money into her campaign. ___\nFollow Jeff Amy on Twitter at http://twitter.com/jeffamy", "url": "https://apnews.com/f106649dc84cff0425978c4609c30a1b"}