{"authors": [], "date_download": "2020-05-04 20:06:31", "date_modify": "2020-05-04 20:06:31", "date_publish": "2020-04-09 21:14:03", "description": "INDIANAPOLIS (AP) — State officials have closed trails at some of Indiana's most popular state parks and campgrounds in response to large crowds gathering outdoors disregarding social distancing...", "filename": "_b9c56e5e4f0d148a84fb565a866146ce_1588622791.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_b9c56e5e4f0d148a84fb565a866146ce_1588622791.html", "title": "Officials close Indiana state parks, trails to contain virus", "title_page": "Officials close Indiana state parks, trails to contain virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "INDIANAPOLIS (AP) — State officials have closed trails at some of Indiana’s most popular state parks and campgrounds in response to large crowds gathering outdoors disregarding social distancing during the coronavirus pandemic.\nAs warmer weather draws more residents outside, the state’s Department of Natural Resources issued new restrictions on camping and some trail uses, closing all campgrounds through April 20.\nBiking and horseback riding on all unpaved DNR properties are temporarily suspended as well, according to The Indianapolis Star .\n“This is not a vacation,” said Commissioner Dana Biddle in a video posted to the Brown County emergency Facebook page.\nOfficials closed all but two trails at Turkey Run and nearby Shades State Park, noting on their Facebook page that the “closed trails are either too narrow to allow social distancing or are closed for your safety at this time.”\nIn recent weeks, county commissioners issued an orange-level travel restriction for the area, meaning all and any travel must be only for essential reasons and emergency situations.\nCarmel Mayor Jim Brainerd has also ordered a portion of the popular Monon Trail to be closed due to overcrowding and congregation of large groups.\nOfficials in Brown County, a popular recreation and tourist spot south of Indianapolis, say the restrictions may slow the number of visitors to state parks but more action is needed.", "url": "https://apnews.com/b9c56e5e4f0d148a84fb565a866146ce"}