{"authors": ["Katelyn Polantz"], "date_download": "2020-05-04 17:02:43", "date_modify": "2020-05-04 17:02:43", "date_publish": "2020-04-10 14:50:27", "description": "3M is suing a company thate offered to sell N95 masks at a 500% markup.", "filename": "2020_04_10_politics_3m-sues-new-york-city-n95-masks_index_1588611763.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323190928-03-3m-n95-face-mask-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_3m-sues-new-york-city-n95-masks_index_1588611763.html", "title": "3M sues over marked-up offer to New York City of N95 masks", "title_page": "3M sues over marked-up offer to New York City of N95 masks - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) 3M, the largest maker of N95 face masks in the country, has sued another company for offering to sell New York City overpriced N95 masks for $45 million.\n3M claims the company, New Jersey-based Performance Supply, wasn't authorized to distribute the masks, and had attempted to inflate the price of the masks at a more than 500% markup for New York.\nPerformance Supply had offered them to the city on March 30 -- when the number of coronavirus cases had skyrocketed and hospitals struggled to give their workers protective equipment. The price: more than $6 a mask, according to the lawsuit. 3M sells the masks at a list price of just over $1.\n3M called Performance Supply's offer to New York \"extreme price-gouging,\" according to the lawsuit filed in federal court in Manhattan on Friday.\nThough the case reads like a fairly standard trademark and false advertising case, it highlights widespread alleged price gouging that's popped up throughout the country since the national emergency began. The company's legal action dovetails with pushes from federal authorities and state governments to crack down on price gouging and other alleged fraud during the coronavirus pandemic\nRead More", "url": "https://www.cnn.com/2020/04/10/politics/3m-sues-new-york-city-n95-masks/index.html"}