{"authors": ["Ben Nadler", "Russ Bynum"], "date_download": "2020-05-04 20:12:01", "date_modify": "2020-05-04 20:12:01", "date_publish": "2020-04-07 16:49:53", "description": "ATLANTA (AP) — An Atlanta hospital on Tuesday announced the early opening of part of an expansion to provide more intensive care beds during the coronavirus pandemic as the state's death toll...", "filename": "_7dbbc47655d8ed25b2db0430d4f2938e_1588623121.html", "image_url": "https://storage.googleapis.com/afs-prod/media/ee7e77b350a043e091c65fdfd96ad3fe/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7dbbc47655d8ed25b2db0430d4f2938e_1588623121.html", "title": "Atlanta hospital to open space early; 348 virus deaths in GA", "title_page": "Atlanta hospital to open space early; 348 virus deaths in GA", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A person wearing a mask walks near the StateFarm Arena where the men's Final Four NCAA college basketball championship game was to be played on Monday, April 6, 2020, in Atlanta. The entire NCAA tournament was canceled due to the COVID-19 virus. (AP Photo/Brynn Anderson)\nA person wearing a mask walks near the StateFarm Arena where the men's Final Four NCAA college basketball championship game was to be played on Monday, April 6, 2020, in Atlanta. The entire NCAA tournament was canceled due to the COVID-19 virus. (AP Photo/Brynn Anderson)\nATLANTA (AP) — An Atlanta hospital on Tuesday announced the early opening of part of an expansion to provide more intensive care beds during the coronavirus pandemic as the state’s death toll neared 350.\nThree floors of the new Marcus Tower at Piedmont Atlanta Hospital will now open on April 13 instead of Aug. 1, Piedmont Healthcare said in a statement. The new space will provide 132 additional beds, including 64 ICU beds, the statement said.\n“By opening this part of the tower early, we are increasing capacity at a critical time when our community needs it the most,” CEO Dr. Patrick Battey said in the statement.\nNews outlets report that state officials are also exploring the possibility of using other locations, including the Georgia World Congress Center — a sprawling convention center in downtown Atlanta — to house patients.\nNearly 1,900 people in the state have been hospitalized and at least 348 have died because of the virus, according to the latest data Tuesday from the Georgia Department of Public Health. The state reported more than 9,100 confirmed cases, though testing has been limited.\nThe department said in a statement that the increasing numbers “tell us that COVID-19 is widespread throughout Georgia.”\nFor most people, the new coronavirus causes mild or moderate symptoms. For some, especially older adults and people with existing health problems, it can cause severe illness, including pneumonia and death.\nThe expansion effort comes as Georgia adjusts to a statewide stay-at-home order from Republican Gov. Brian Kemp that overrode any local measures stricter than his, such as beach closures, and left open houses of worship as long as congregants stay 6 feet (1.83 meters) apart.\nThe Georgia State Patrol said its troopers cited a pastor and four others for misdemeanor violations Sunday after worshippers at a Statesboro church were twice found ignoring social distancing requirements.\nThe State Patrol said troopers showed up at the Church of God the Bibleway in Statesboro after receiving a complaint and found more than 30 people inside the small building. Troopers gave the pastor a warning and urged him to hold future services outside.\nTroopers returned Sunday evening to find the pastor holding another indoor service. Pastor Eli Porter was cited on a misdemeanor charge of reckless conduct, as were four other men, the State Patrol report said.\nClayton Cowart, president of the Statesboro church’s parent corporation, said Tuesday that any order requiring congregants to keep distant from each other violates their First Amendment right to freedom of religion.\n“We feel our obligations as spiritual leaders are just as important as cashiers working at Walmart,” Cowart said. He said the church plans to move forward with a normal, indoor service this Sunday on Easter.\nAt least two officials on the Georgia coast say Gov. Brian Kemp has increased the risk of the coronavirus spreading with his latest emergency order because it rolls back local measures put in place to slow the spread of the virus.\nGlynn County Commission Chairman Michael Browning, a Republican, sent a letter to Kemp urging him to reverse course and allow cities and counties to impose tougher restrictions. The county had closed the beaches at St. Simons Island and Sea Island last month, only to see them reopened when Kemp’s order took effect Friday.\nBrowning wrote in his letter Monday that “this is the time to be tightening restrictions that combat the spread of this disease, not loosening them.” On Saturday, Tybee Island Mayor Shirley Sessions publicly blasted Kemp for reopening Georgia beaches.\nKemp has dispatched state troopers and Department of Natural Resources officers to patrol beaches, where people are being allowed to exercise but not to gather in groups or bring beach gear.\nLocal officials say Kemp’s order also nullified local measures temporarily halting vacation rentals.\n___\nBynum reported from Savannah, Georgia.\n___\nFollow AP news coverage of the coronavirus pandemic at http://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak", "url": "https://apnews.com/7dbbc47655d8ed25b2db0430d4f2938e"}