{"authors": ["Kaitlan Collins", "Sarah Westwood"], "date_download": "2020-05-04 16:09:30", "date_modify": "2020-05-04 16:09:30", "date_publish": "2020-04-02 18:12:41", "description": "President Donald Trump's campaign has sent a letter to Jeff Sessions demanding the former attorney general stop using Trump's name in his campaign materials for his US Senate bid.", "filename": "2020_04_02_politics_donald-trump-jeff-sessions-letter_index_1588608570.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/171215110109-trump-and-sessions-2-december-15-2017-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_donald-trump-jeff-sessions-letter_index_1588608570.html", "title": "Trump campaign sends letter to Sessions demanding he stop invoking Trump", "title_page": "Trump campaign sends letter to Jeff Sessions demanding he stop invoking Trump - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump's campaign has sent a letter to Jeff Sessions demanding the former attorney general stop using Trump's name in his campaign materials for his US Senate bid.\n\"We only assume your campaign is doing this to confuse President Trump's loyal supporters in Alabama into believing the President supports your candidacy in the upcoming primary run-off election. Nothing could be further from the truth,\" wrote Michael Glassner, chief operating officer of the Trump campaign, to Sessions in the letter obtained by CNN and first reported by The New York Times.\nTrump has long held a grudge against his former attorney general, whose recusal from the Russia investigation in early 2017 led to the appointment of special counsel Robert Mueller.\nLast month, Trump endorsed Tommy Tuberville , Sessions' rival in the GOP primary runoff for Alabama's US Senate seat. Tuberville and Sessions are both vying to take on Democratic Sen. Doug Jones in the fall, and Republicans view the race as one of their most promising pickup opportunities in the Senate. That runoff had been scheduled for Tuesday but was postponed until July due to the coronavirus outbreak\nA person familiar with the matter said Trump didn't direct the campaign to send the aforementioned letter, but aides who are aware of his dislike for his former attorney general knew he wouldn't approve of Sessions touting his ties to Trump.\nRead More", "url": "https://www.cnn.com/2020/04/02/politics/donald-trump-jeff-sessions-letter/index.html"}