{"authors": ["Brian Stelter", "Cnn Business"], "date_download": "2020-05-04 15:58:47", "date_modify": "2020-05-04 15:58:47", "date_publish": "2020-04-01 03:18:43", "description": "April 2020 will be the cruelest month. President Trump tried to prepare Americans on Tuesday by saying \"hard days\" lie ahead.", "filename": "2020_03_31_media_donald-tru_630d7eece4dfa1309f20afe368e0a29c_index_1588607927.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331230558-01-trump-coronavirus-briefing-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_media_donald-tru_630d7eece4dfa1309f20afe368e0a29c_index_1588607927.html", "title": "Journalists challenge Trump's 'revisionist history' regarding coronavirus response", "title_page": "Journalists challenge Trump's 'revisionist history' regarding coronavirus response  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) A version of this article first appeared in the \"Reliable Sources\" newsletter. You can sign up for free right here.\nOn the afternoon of 9/11, Rudy Giuliani told a shell-shocked country that \"the number of casualties will be more than any of us can bear, ultimately.\"\nRather than dwelling on what the death toll would be, Rudy said \"the effort now has to be to save as many people as possible.\"\nThose words are still ingrained in my mind, nearly twenty years later. And they apply equally well to this slow-motion attack from an invisible terror.\nApril 2020 will be the cruelest month. President Trump tried to prepare Americans on Tuesday by saying \"hard days\" lie ahead. \"We're going to go through a very tough two weeks,\" he said during a 131-minute WH briefing, the longest of his presidency.\n\"In the seven years I have covered the White House, that is the most stunning briefing I have ever sat through,\" CNN's Jim Acosta said afterward. \"To have public health officials come in and try to explain to the American people that they need to come to grips with the fact -- or the very strong likelihood -- that we're going to see 100,000 to 200,000 Americans die over the next couple months from the coronavirus.\"\nWe have to hold hands as a country even though we can't touch. We have to lift up our health care heroes. And we have to hold our leaders accountable for all that they've done and all that they haven't done.\nThe new narrative\nBefore the briefing, HuffPost's S.V. Date wrote that Trump is pushing \"the biggest lie of his adult life ― a revisionist history in which he did everything correctly, that nobody could have anticipated such an outbreak, and his leadership alone is saving millions of lives.\"\nThis push continued on Tuesday evening. Mother Jones editor Clara Jeffrey tweeted : \"White House is now setting the goal posts at 100-200K dead as a good job. That is 2-4 times the US casualty rate in the Vietnam War.\"\nThe staggering projections are not new. They've been known for weeks. They've been reported for weeks. They just haven't been publicly accepted and shared by the White House until now. That's why Tuesday's briefing was vital — but it was heart-wrenching to think about all the time that was wasted by POTUS.\nI'm sure that reporters will keep pointing out the federal government's early failures and problems... But will the news coverage resonate? Or will partisanship win out, even during a pandemic?\nTop tweets\n-- Daniel Dale's recap : \"This briefing has featured a dishonest overall narrative -- a Trump effort to cast himself as the leader who stood strong against the faction that downplayed the severity of the virus...\"\n-- David Roberts' chilling prediction about the GOP and the pro-Trump media: \"They will frame this catastrophe as a success and their base will buy it, even as they are filling up local morgues...\"\n-- Jay Rosen: \"Anyone who says he now soberly accepts the reality of the pandemic. No. He switched claims. From we're doing a fantastic job, the virus is like 15 people to we're doing a fantastic job, if we did nothing it would be millions dead. Those calling him sober are the marks...\"\n-- Bill Grueskin: Sean Hannity \"is in Reality Mode tonight. Warning that new cases will sharply rise, young people can get sick, quoting Fauci that 100k+ deaths is entirely possible. Something really did change today...\"\n\"The U.S. needs to know what went wrong\"\nThere's more and more talk about the need for a 9/11-style bipartisan commission, and more and more concern that the country is too fractured to support one.\nDavid Ignatius is out with a new WaPo column about this idea. \"The coronavirus pandemic has some eerie similarities to 9/11,\" he wrote. \"Trump certainly didn't cause the virus, any more than President George W. Bush plotted Osama bin Laden's attacks on Sept. 11, 2001. And Trump's NSC laudably tried to ring the alarm. But did the White House 'connect the dots' and take action that could have reduced the coronavirus damage?\"\nIgnatius said \"the last thing America needs right now is more partisan squabbling. But when we're back on our feet, the country needs to know what went wrong. The challenge, now as in 2001, is to prevent the next attack.\"\nChris Cuomo's new fight\nOn Tuesday morning CNN anchor Chris Cuomo found out that he tested positive for the virus. He announced the diagnosis just as his brother Gov. Andrew Cuomo began New York state's daily briefing.\nChris is feeling fine and working from home while quarantining in his basement. He said on Tuesday night's \"Cuomo Prime Time\" that his biggest concern is for his family. He fears that he might have infected his wife and children. \"That is hurting me way more than anything the virus can do,\" he said.", "url": "https://www.cnn.com/2020/03/31/media/donald-trump-coronavirus-response-reliable-sources/index.html"}