{"authors": ["Meg Kinnard"], "date_download": "2020-05-04 20:07:32", "date_modify": "2020-05-04 20:07:32", "date_publish": "2020-04-16 17:48:51", "description": "COLUMBIA, S.C. (AP) — For the fourth straight week, the number of people who live or work in South Carolina saying they lost their jobs because of the coronavirus outbreak has gone up, with the...", "filename": "_c0c0b6a8b9d111eb4d96f7faa48ef1a4_1588622852.html", "image_url": "https://storage.googleapis.com/afs-prod/media/7c7d345fde394087851b5ec4b936f570/2880.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c0c0b6a8b9d111eb4d96f7faa48ef1a4_1588622852.html", "title": "More than 10% of SC labor force jobless during outbreak", "title_page": "More than 10% of SC labor force jobless during outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Workers at Paradigm Convergence Technologies load a truck with disinfectant to ship to hospitals across the country, in Little River, S.C., Wednesday, April 15, 2020. (Jason Lee/The Sun News via AP)\nWorkers at Paradigm Convergence Technologies load a truck with disinfectant to ship to hospitals across the country, in Little River, S.C., Wednesday, April 15, 2020. (Jason Lee/The Sun News via AP)\nCOLUMBIA, S.C. (AP) — For the fourth straight week, the number of people who live or work in South Carolina saying they lost their jobs because of the coronavirus outbreak has gone up, with the number of claimants since the pandemic began now representing more than 10% of the state’s total labor force.\nNearly 88,000 people in the state filed for unemployment for the week ending April 11, the South Carolina Department of Employment and Workforce said in a statement Thursday. In the first few days of this week alone, the agency said it had paid out $114 million in benefits.\nIn the four weeks since the pandemic began, the agency said it has processed more than 268,000 claims, or about 11% of the labor force of nearly 2.4 million - the total number of people with jobs, plus those looking for work - as measured by state officials in February. That month, state unemployment was 2.5%.\nThe new claim number, a 3.14% increase from the week before, represents a 4,293% increase from the week ending March 14, according to the Workforce agency.\nBusinesses including restaurants, bars, manufacturers, dentist offices and a number of others have closed for a variety of reasons, including mandatory orders from Gov. Henry McMaster issued in an effort to stem the outbreak.\nAccording to the federal government, the ranks of Americans thrown out of work by the coronavirus ballooned Thursday to at least 22 million in an unprecedented collapse that has fueled widening protests and propelled President Donald Trump’s push to relax the nation’s social distancing guidelines. Officials said that 5.2 million more people applied for unemployment benefits last week, bringing the four-week total to about 22 million out of a U.S. work force of roughly 159 million — easily the worst stretch of U.S. job losses on record. The losses amount to about 1 in 7 workers.\nSouth Carolina’s unemployment benefits agency has said it has had to hire six times the number of call center workers needed to process claims, hoping to bring its current number of 292 representatives to more than 500 next week.\nWorkers who are furloughed but still get some kind of payment or benefit from their employer will be eligible for unemployment benefits, according to one of McMaster’s executive orders.\nDuring a briefing Thursday, McMaster gave a few details about “Accelerate South Carolina,” the program he has previously said would be used to begin reactivating the state’s economy. McMaster said the collaborative effort would include representatives from manufacturing and tourism industries, as well as state agencies and lawmakers.\nFollowing a video conference with fellow governors and Trump, who briefed officials on a phased approach to restoring normal commerce and services, McMaster said that the process in South Carolina would be as swift as deemed safe to do so.\n“To do so too quickly would be reckless,” McMaster said, of resuming normal activity levels, noting several times he felt sure the economy would be “humming” by the end of June. “We are going to find the best ways to do it quickly and safely.”\nMcMaster did gradually loosen restrictions on recreation, announcing a new executive order re-opening public boat ramps that have been closed for several weeks and encouraging anyone on the state’s waterways to socially distance.\nOn Thursday’s call, Trump told governors they would be responsible for deciding when it is safe to lift restrictions in their states.\n“You’re going to call your own shots,” Trump told governors, according to an audio recording obtained by The Associated Press. “We’re going to be standing along side of you.”\nMcMaster also said he did not anticipate making any changes to the state’s primary election, currently scheduled for June 9.\nThe coronavirus continues to spread in South Carolina. The state reported more than 3,900 cases and 109 deaths as of Thursday afternoon, according to the state Department of Health and Environmental Control. For most people, the new coronavirus causes mild or moderate symptoms. For some, it can cause severe illness such as pneumonia, or even death.\n___\nMeg Kinnard can be reached at http://twitter.com/MegKinnardAP.\n___\nFollow AP coverage of the pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/c0c0b6a8b9d111eb4d96f7faa48ef1a4"}