{"authors": ["David Fischer"], "date_download": "2020-05-04 20:21:17", "date_modify": "2020-05-04 20:21:17", "date_publish": "2020-04-15 23:17:46", "description": "MIAMI (AP) — Florida Gov. Ron DeSantis assigned a troubleshooter Wednesday to take over the state’s flat-footed response to the explosion in unemployment claims that followed mandatory business...", "filename": "_621557c1114f0f4877b0a919acdbcbfa_1588623677.html", "image_url": "https://storage.googleapis.com/afs-prod/media/e1ed671d96f44327b6c9a979414045d2/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_621557c1114f0f4877b0a919acdbcbfa_1588623677.html", "title": "DeSantis moves department head to handle unemployment claims", "title_page": "DeSantis moves department head to handle unemployment claims", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "A woman carries food to her vehicle as food is distributed to the community at the Agape Youth Ministry Center, during the new coronavirus pandemic, Wednesday, April 15, 2020, in Miami. The ministry has partnered with Feeding South Florida and Farm Share to distribute food to those in need. (AP Photo/Lynne Sladky)\nA woman carries food to her vehicle as food is distributed to the community at the Agape Youth Ministry Center, during the new coronavirus pandemic, Wednesday, April 15, 2020, in Miami. The ministry has partnered with Feeding South Florida and Farm Share to distribute food to those in need. (AP Photo/Lynne Sladky)\nMIAMI (AP) — Florida Gov. Ron DeSantis assigned a troubleshooter Wednesday to take over the state’s flat-footed response to the explosion in unemployment claims that followed mandatory business closings brought on by he coronavirus pandemic.\nDeSantis announced at a news conference Wednesday in Tallahassee that he was tapping Management Services Secretary Jonathan Satter to take over the Department of Economic Opportunity’s response to the COVID-19 pandemic.\n“His mission is very simple: Get assistance out as quickly as you can,” DeSantis said.\nDeSantis said he was disappointed by the state’s website and phone system for receiving claims after an initial spike last month. Hundreds of thousands of Floridians who sought jobless aid encountered an online portal that crashed and phone systems that kept them on hold for hours.\nDesi Marinov, a 42-year-old flight attendant in Fort Lauderdale, said she has been subsisting on instant noodle cups and popcorn. She can’t afford her medication since being furloughed indefinitely from Norwegian Airlines and has asked her landlord to defer her rent.\n“It is hopeless at the moment,” said Marinov. “The hardest part is that the state officials that are supposed to reassure us and calm our fears are not answering these questions. Any penny counts especially when getting back my job is uncertain. It’s a frightening time, and there are not many bills I can cut in order to save money.”\nDeSantis said the state has added a hundred servers to handle the web traffic and about 1,000 operators to handle phone calls. But even with improvements to the system for filing claims, DeSantis said the normal three-week processing time is too long.\n“I am seeking ways to be able to process this as expeditiously as possible,” DeSantis said. “It’s not a time to get bogged down in bureaucracy or red tape.”\nDepartment of Economic Opportunity Executive Director Ken Lawson will continue to manage the department’s non-coronavirus responsibilities, such as seeking out business opportunities and handling hurricane relief. But DeSantis said he was becoming particularly frustrated with not having accurate, updated numbers on how many unemployment claims had been processed.\n“I asked for the numbers every morning, and it was one of the reasons why we want Jon in there,” DeSantis said. “I think that we need to know exactly how many claims are paid, not just on a daily basis, but really on an hourly basis.”\nDeSantis also announced Wednesday that he wanted to form a task force to look at ways to restart the state’s economy. He said he plans to announce members by the end of the week.\n“What I want to do is tap into people in elected office, people in business, people involved in education, all kinds of things, and get the best ideas about what’s the most prudent way to move forward,” DeSantis said.\nFlorida has more than 22,500 confirmed coronavirus infections and at least 613 deaths with more than 3,200 hospitalized.", "url": "https://apnews.com/621557c1114f0f4877b0a919acdbcbfa"}