{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:19:41", "date_modify": "2020-05-04 20:19:41", "date_publish": "2020-04-08 21:22:53", "description": "___ Jobless claims report Thursday could hit 7 million or higher WASHINGTON (AP) — The government is set to report another shocking level of unemployment claims Thursday even after...", "filename": "_0f4ece8c921818c6de9e66d3cc7908a8_1588623581.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0f4ece8c921818c6de9e66d3cc7908a8_1588623581.html", "title": "Business Highlights", "title_page": "Business Highlights", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "___\nJobless claims report Thursday could hit 7 million or higher\nWASHINGTON (AP) — The government is set to report another shocking level of unemployment claims Thursday even after nearly 10 million people applied for benefits in the previous two weeks because of business shutdowns from the coronavirus. The number will likely keep increasing, in part because many states are still clearing out backlogs of applications for unemployment aid. And with more companies running through their cash cushions as the virus-related shutdowns persist, they are resorting to layoffs to save money. As job cuts mount, here are five aspects of the bleakest U.S. job market in memory.\n___\nVirus outbreak delivers tech darlings a harsh reality check\nSAN FRANCISCO (AP) — Just as the coronavirus outbreak has boxed in society, it’s also squeezed high-flying tech companies reliant on people’s freedom to move around and get together. Airbnb, which just weeks ago was planning for a bombshell initial public offering, is reportedly shedding millions of dollars and facing harsh blowback from hosts who relied on its platform for income. Uber has tried to reassure investors that it has enough cash to weather the fallout from the global pandemic. Uber and rival Lyft are turning to deliveries to make up for lost income after ride-hailing screeched to a halt.\n___\nFeds eye loosening rules to allow some to return to work\nWASHINGTON (AP) — In a first small step toward reopening the country, the government is considering easing guidelines to stop the spread of the new coronavirus to make it easier for people to return to work after they are exposed if they have no symptoms. The Centers for Disease Control and Prevention and the White House are considering an announcement as soon as Wednesday. Under the proposed guidance, people who are exposed to someone infected would be allowed back on the job if they show no symptoms of the coronavirus, take their temperature twice a day and wear a face mask. That’s according to person familiar with the proposal who spoke on the condition of anonymity because the draft had not been finalized.\n___\nFed eases limit on Wells Fargo to make more small biz loans\nNEW YORK (AP) — The Federal Reserve is lifting its lending restrictions on Wells Fargo after some of the bank’s thousands of small business customers were shut out of a program that’s supposed to throw them a financial lifeline. The Fed’s action will allow Wells to make more loans under the $349 billion Paycheck Protection Program that launched last week as well as the Fed’s own upcoming small business lending program. Wells, one of the largest small business lenders in the country, quickly hit its Fed-imposed $10 billion threshold on PPP loans, leaving customers to scramble to find another bank that would lend to them under the program.\n___\nWall Street jumps 3.4%, actually holds on this time\nNEW YORK (AP) — Stocks shot to a 3.4% gain on Wall Street Wednesday as investors chose to focus on the optimistic side of data about the coronavirus outbreak’s trajectory. The market had been on pace for a similar gain the day before, only for all of it to vanish in the afternoon. Stocks have been mostly climbing in recent weeks amid signs that deaths and infections may be nearing a peak or plateau in some of the world’s hardest-hit areas. Many analysts say they’re skeptical of the rally, though, given the continued rise in the financial and human toll of the pandemic.\n___\nAt emergency March meetings Fed pledged to use full arsenal\nWASHINGTON (AP) — Federal Reserve officials pledged at two emergency meetings last month to use their full arsenal to bolster the U.S. economy being brought to its knees by the coronavirus outbreak. Minutes of the two meetings released Wednesday show that Fed officials were alarmed at the impact the virus was already having on U.S. economic activity. They also noted the potential for further harm to businesses and households resulting from the stringent guidelines being put in place across the country to try to limit the virus’ spread. Private economists noted that even in the first two weeks of March, Fed officials appeared aware that the economy was about to be hit by a severe shock.\n___\nMnuchin says direct deposits out next week for virus aid\nWASHINGTON (AP) — Treasury Secretary Steven Mnuchin is telling House Democrats that direct deposits to Americans will begin next week under the coronavirus aid package. Mnuchin is also telling the lawmakers that $98 billion has been approved for small business retention under a program in the $2.2 trillion coronavirus aid package. His comments came during a conference call with the coronavirus task force, according to a person unauthorized to discuss the private call and granted anonymity. Congress is debating the next potential coronavirus aid package as President Donald Trump seeks $250 billion for small businesses and Democrats propose adding another $250 billion for small communities, protective gear and food stamps. A test vote is expected Thursday.\n___\nThe S&P 500 climbed 90.57 points, or 3.4%, to 2,749.98. The Dow Jones Industrial Average rose 779.71 points, or 3.4%, to 23,433.57 and the Nasdaq gained 203.64, or 2.6%, to 8,090.90. The Russell 2000 index of smaller-company stocks added 52.49 points, or 4.6%, to close at 1,191.66.", "url": "https://apnews.com/0f4ece8c921818c6de9e66d3cc7908a8"}