{"authors": ["Catherine E. Shoichet"], "date_download": "2020-05-04 16:18:21", "date_modify": "2020-05-04 16:18:21", "date_publish": "2020-04-04 06:55:17", "description": "It's a topic of speculation every time a disaster hits -- will we see a \"baby boom\" nine months later? But as the novel coronavirus spreads, demographers say in fact, births could decrease. And other demographic shifts are likely as well.", "filename": "2020_04_04_us_baby-boom-coronavirus-demographics_index_1588609101.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191119050310-newborn-baby-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_us_baby-boom-coronavirus-demographics_index_1588609101.html", "title": "Why these experts don't think we'll see a coronavirus baby boom", "title_page": "A baby boom during the coronavirus pandemic isn't likely, experts say - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Will we see a \"baby boom\" nine months later, since so many couples are cooped up inside with nowhere to go?\nSure, this kind of trend has been reported before . But demographers think it's unlikely to occur this time around.\nIn fact, they say the United States will probably see the number of births decrease. And other notable population shifts are likely as well.\n\"There's no way that the number of births is going to go up,\" says Kenneth Johnson, a professor of sociology and demographer at the University of New Hampshire. \"This is not the kind of environment in which people say, 'Let's bring a child into the world now.'\"\nEven before the pandemic hit, demographers say a combination of factors -- fewer births, more deaths and less immigration -- were already creating a \"perfect storm\" slowing the nation's population growth.\nAdd to that the changes coronavirus is expected to bring on all these fronts, and that storm is only going to intensify.\nOne major reason a baby boom isn't likely: the economy\nFinancial uncertainty often makes people postpone -- or even forgo -- decisions to have children.\nCase in point: the aftermath of the Great Recession, the economic downturn that begin in late 2007.\n\"Fertility dropped substantially. That's not unusual. That often happens during difficult economic times,\" Johnson says.\nBut what is surprising, Johnson says, is that since then, the birth rate hasn't bounced back. It's been declining ever since.\nAnd demographers say the uncertainty fueled by the novel coronavirus pandemic isn't going to make matters any better.\nThis disaster isn't the same as a blackout or hurricane, says Rogelio Sáenz, a professor in the Department of Demography at the University of Texas at San Antonio.\n\"Those are short-term kinds of things that take place. This is going to be a drastically long kind of event, and also with the economic impacts. ... Economic uncertainty really impacts fertility,\" he said. \"This is likely to lead to even further drops in fertility and births as well.\"\nLast year there were 3.79 million births in the United States, the lowest number since 1986.\nLast year more people than ever died in the US\nWhile births are decreasing, the number of people dying in the United States is on the rise. Last year the number of deaths hit a record high of 2.83 million.\n\"That's primarily because the population is getting older,\" Johnson says. \"The mortality rate of older people is getting higher.\"\nWilliam Samuels delivers caskets to the Gerard Neufeld Funeral Home in the Queens borough of New York City on Friday, March 27, 2020.\nHere's why these numbers are important to keep an eye on:\nWhen there are more births than deaths, the difference between those two numbers is known as the \"natural increase\" of the population. When there are more deaths than births, it's know as \"natural decrease.\" Overall the US population is still experiencing \"natural increase,\" but barely.\nIf the number of deaths start to outpace the number of births, societal strain can follow. Imagine a growing number of people retiring, but fewer young people in the workforce, or a growing number of elderly without enough people to care for them.\nAnd already, the US is closer than ever to that happening.\nRecently released government data shows the country's population growth rate is the lowest it's been in more than a century. It was just .48% last year, the lowest it's been since 1919, the last time a pandemic hit. Approximately 675,000 people in the United States died as a result of the influenza pandemic.\nNurses care for victims of the influenza pandemic outdoors in 1918 in Lawrence, Massachusetts.\nAs Johnson pointed out in a recent analysis of Census data, first reported by the New York Times , in nearly half of the country's counties more people died than were born last year. And nationwide the gap between the number of people who died and the number of people who were born was smaller than it's been in decades.\nNow factor in coronavirus.\nWhite House officials shared a dire message this week , telling Americans they should be prepared for 100,000-240,000 people to die nationwide as a result of the pandemic.\nSome experts -- including CNN Chief Medical Correspondent Dr. Sanjay Gupta -- have warned the death toll could end up being higher, given that social distancing orders aren't yet in place everywhere in the US.\nWhat will this mean for the US population growth rate? Demographers say it's too soon to say.\n\"It could certainly be the lowest growth rate in US history,\" Johnson says.\nIf the death toll does end up being higher than the White House model predicts, the United States could experience something that's never happened before: a year-to-year decline in its population.\nJUST WATCHED Dr. Sanjay Gupta: 200,000 deaths from virus is optimistic Replay More Videos ... MUST WATCH Dr. Sanjay Gupta: 200,000 deaths from virus is optimistic 01:52\n\"There's potential for population loss over the coming year,\" Sáenz says.\nWilliam Frey, a senior fellow at the Brookings Institution, says the past decade is already on pace to be the slowest for population growth in US history. But he doesn't think the coronavirus will move the needle as much when it comes to overall population numbers.\n\"I wouldn't go so far as to say that this Covid-19 is going to make us become a declining population. I think that's a shorter-term thing and things will sort of bounce back,\" he says. \"We'll have the normal death rates going forward. There will be some shorter-term shifts in the population.\"\nImmigration had already plummeted. Then borders closed around the world\nWhen the population's natural growth rate slows, immigration historically has made up the difference. But that, too, is declining.\nFrom July 2018 to July 2019, immigration in the United States fell to a net gain of around 595,000 people, Frey says. Compare that to a few years ago, when it was close to a million.\n\"This is by far the lowest year we've seen for immigration since at least the '90s,\" he says.\nUS Customs officers stand beside a sign at the US-Canada border in Lansdowne, Ontario, on March 22, 2020.\nFrey says he expects immigration to climb again, though it's not clear when.\n\"Really, immigration is kind of our only hope to keep things sort of stable. ... Immigration can make a difference and it has made a difference,\" he says. \"Immigrants and their children are younger than the rest of the population. Latinos and other minorities make up more than half of the births in the United States.\"\nSo amid all this uncertainty, what happens next with births in the US is important -- even though a coronavirus baby boom isn't likely.", "url": "https://www.cnn.com/2020/04/04/us/baby-boom-coronavirus-demographics/index.html"}