{"authors": [], "date_download": "2020-05-04 16:04:05", "date_modify": "2020-05-04 16:04:05", "date_publish": "2020-04-01 13:59:11", "description": "An expert breaks down all the tools and ingredients you need to make your own delicious, comforting bread at home.", "filename": "2020_04_01_cnn-underscored_how-to-make-homemade-bread_index_1588608245.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200327103937-new-baking-lead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_cnn-underscored_how-to-make-homemade-bread_index_1588608245.html", "title": "How to make your own delicious bread at home", "title_page": "How to make homemade bread: Bread makers, bowls and more  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored has interviewed experts and found the best options to help you cope during this uncertain time. Find all of our coronavirus-related coverage here and let us know your thoughts here.\nSince we've been self-isolating at home, like much of the rest of the country, we've been seeing a lot of mouthwatering homemade bread in posts from friends — and beautiful bakers not yet known to us — on Instagram.\nAnd we get it. We're absolutely practitioners of anxiety baking, now more than ever. Bread baking specifically appeals in a time like this: Carb cravings. Comfort. Warmth. Security. Just what we need.\n\"There's nothing like making things with your own hands,\" says Erin Slonaker, a baker known as @brooklynsourdough on Instagram who has literally broken bread on TV with Martha Stewart. \"You get a sense of accomplishment and control in a world out of control. And it gives you some comfort that if all else fails, you can make sustenance. Plus, bread is delicious, and if you play with how you score the loaves, it can be beautiful, too.\"\nSlonaker had us at accomplishment and control. And also delicious and beautiful. Keep scrolling for the home baker's primer on how to make bread from scratch. We focus on sourdough, since that's more challenging than a lot of bread recipes, but the equipment we've found works for any kind of bread-baking, and other kitchen uses, too.\nThe dry ingredients\n\"Just four ingredients go into a loaf of sourdough bread: flour, water, salt and yeast,\" explains Slonaker. \"And the yeast from a sourdough starter is made of only flour and water. So to make a loaf of bread, all you need is flour, water and salt.\"\nThe Brooklyn Sourdough blogger uses a mix of whole-wheat and bread flour for her sourdough, but she knows that some grocers have been low on flour. So if you prefer all-purpose flour, or that's all you can find, that's fine too. Though groceries are running low throughout the country, you can continue checking Target, Amazon and Instacart for all your flour and yeast needs. And be sure to store the flour airtight after you've opened it.\nProgressive 5 lb. Flour Prokeeper in White/Gray ($17.99; bedbathandbeyond.com)\nProgressive 5 lb. Flour Prokeeper in White/Grey\nThis handy airtight container holds 5 pounds and has a nifty hinged lid and leveling spoon.\nWhat is a 'starter'?\nTo make sourdough bread, you need a starter, or \"a liquid yeast that you maintain regularly to be able to use,\" Slonaker explains. Starters \"are made up of wild yeasts, mostly from the flour itself,\" she says.\nConventional yeast that you might buy at the store is a different strain that has been cultivated, and provides far more consistent results — and it's called for in many bread recipes, so it's an ingredient you also want to have on hand. Sourdough starter, though, is the opposite of consistent, and it's a project that takes a few days, maybe even a week or two, depending on your elements.\n\"Sourdough is basically alive, and it can be finicky and subject to mood changes!\" Slonaker warns. \"You can start your own with just whole wheat flour and water, but the initial stages of creating a sourdough starter use up a lot of flour, so don't jump in unless you have a decent supply in your pantry.\"\nIf you're ready to jump, check out Slonaker's tutorial. It essentially just involves precisely measuring your ingredients and mixing away.\nTools for the starter\nOzeri Pro Digital Kitchen Scale ($14.99; bedbathandbeyond.com)\nOzeri Pro Digital Kitchen Scale\n\"A crucial specialty item is a digital scale, for measuring ingredients,\" Slonaker says. \"You need to feed a starter equal weights of water and flour, and it's incredibly hard to estimate that without a scale.\"\n______________________________________________________________________________\nSencor Pink Digital Kitchen Scale ($17.97, originally $29.99; nordstromrack.com)\nSencor Pink Digital Kitchen Scale\nWho doesn't need more pink accessories?\n______________________________________________________________________________\nFood Network Infographic Kitchen Scale ($19.99; kohls.com)\nFood Network Infographic Kitchen Scale\nEasy visual cooking conversions make all your kitchen tasks easier.\n______________________________________________________________________________\nPyrex 3-Piece Glass Measuring Cup Set ($20.99; wayfair.com)\nPyrex 3-Piece Glass Measuring Cup Set\n\"I love using these Pyrex measuring cups — they come in a variety of sizes. I like to use a 4-cup for building starter for a loaf, and a 2-cup when just feeding my starter for maintenance,\" the baker says.\n______________________________________________________________________________\nSilicone Spatula 3-Piece Set ($7.99; bedbathandbeyond.com)\nSilicone Spatula 3-Piece Set\nYou can mix your starter with pretty much any mixing tool — Slonaker likes using a spatula. This set of classic spatulas will be useful way beyond bread-baking.\n______________________________________________________________________________\nWalnut Spatula ($9.07, originally $12.95; cb2.com)\nWalnut Spatula\nA rustic-elegant square option.\n______________________________________________________________________________\nFido 1-Liter Clamp Jar - Bormioli Rocco ($6.99; target.com)\nFido 1-Liter Clamp Jar - Bormioli Rocco\nSlonaker sometimes uses a large Mason jar to mix up her starter. This Italian glass jar with a clamp works well, and can be used for dry-goods storage once you're done with your bread project.\n______________________________________________________________________________\nEden Green Prep Bowls, Set of 2 ($16.97, originally $24.95; crateandbarrel.com)\nEden Green Prep Bowls, Set of 2\nYou can also batch up your starter in a glass or ceramic mixing bowl, like one of these. It's always nice to bring some fresh greens into the kitchen.\n______________________________________________________________________________\nMason Cash Cane Mixing Bowl ($34.99; bedbathandbeyond.com)\nMason Cash Cane Mixing Bowl\nNatural clay and oven-safe to 500 degrees, this is a versatile, solid and, yes, handsome piece you'll use forever.\nDirections for starters include separating out some of the starter and \"feeding\" it — or mixing it anew with fresh flour and water — and discarding the remainder. In these times of supply shortage, you could also save yours and share it with a friend. \"Just do the exchange carefully, keeping your social distance intact! Starter also can be dried, crumbled up and easily mailed,\" Slonaker says.\nOnce you're done mixing up your starter, you could transfer it to a Mason jar or a pretty, airtight container.\nLe Creuset Metallics Kitchen Canister ($25.95, originally $26.99; wayfair.com)\nLe Creuset Metallics Kitchen Canister\nLike all Le Creuset products, this canister feels luxe in your hands, and the \"Caribbean\" color calls to mind a calming ombré ocean scene.\n______________________________________________________________________________\n1-Gallon Stoneware Pickling Crock with Cover - Gardener's Supply Company ($59.95; target.com)\n1-Gallon Stoneware Pickling Crock with Cover - Gardener's Supply Company\nDecorative and functional, with sort of a nostalgic Americana feel.\nKneading it out\nOnce your starter is complete, you're ready to get a batch of dough going! One of Slonaker's favorite recipes is this beauty — note that it does take one day for dough prep, and another for baking. Patience is a virtue.\n3-piece Stainless Steel Non-Slip Mixing Bowls - Made By Design ($20, originally $20.49; target.com)\n3-piece Stainless Steel Non-Slip Mixing Bowls - Made By Design\nSlonaker mixes up and kneads her dough in a stainless steel bowl. This set is good for all the anxiety-mixing needs you'll take on in the coming weeks.\nContainers to let dough rise\nOnce you've made your dough using your fabulous starter (or your own personal favorite bread recipe), you're ready to let it rise, and of course there are special receptacles for just this purpose.\nFrieling 8-Inch Round Brotform Bread-Rising Basket ($29; food52.com)\nFrieling 8-Inch Round Brotform Bread-Rising Basket\nSlonaker likes using a basket that helps a dough loaf keep its shape for \"proofing,\" or letting the dough rest and rise before baking. Her preferred basket is 8 inches in diameter, like this one, but it depends on the size and shape of her loaf; there are lots of options out there.\n______________________________________________________________________________\nFrieling 15-Inch Rectangle Brotform Bread-Rising Basket ($59.99; wayfair.com)\nFrieling 15-Inch Rectangle Brotform Bread-Rising Basket\nA larger option designed for a big rectangular loaf. There's even a baguette option, too.\n______________________________________________________________________________\nCambro 6-Quart Polypropylene Food Storage Container ($11.99; staples.com)\nCambro 6-Quart Polypropylene Food Storage Container\nYou can also use a mixing bowl or other large-ish container, lined with a dish towel, that will give the dough space and time to proof.\nTea towels to cover your bread\nWhile your dough is rising and in its proofing period, you'll want to cover it — with a cute tea towel, naturally. You can also use these to line your proofing basket if you don't buy a lined one.\nBaker Stripe Dish Towels, Set of 4 ($20; anthropologie.com)\nBaker Stripe Dish Towels, Set of 4\nStripes make everything more fun.\n______________________________________________________________________________\nLillian Dish Towels, Set of 3 ($24; anthropologie.com)\nLillian Dish Towels, Set of 3\nIt's hard to go wrong with a set of perfectly pretty pastel kitchen towels, complete with fringe.\n______________________________________________________________________________\nKate Spade New York Expletive Towel ($9.99; bedbathandbeyond.com)\nKate Spade New York Expletive Towel\nCurrent mood.\nScore!\nOnce your dough is risen and ready to bake, you'll want to make it pretty. That's where the \"scoring\" comes in: Serious bakers use a \"lame,\" a tool like a razor blade, to draw a pattern into the dough. Slonaker is Insta-famous for her artistic scoring; here's a video she's shared to show you how to begin. Lames, she points out, come with various price points.\nBaker of Seville Bread Lame ($15.92; amazon.com)\nBaker of Seville Bread Lame\nThis professional scorer helps you draw precise lines and swirls onto your gorgeous loaf of bread. Comes with its own case and two extra blades.\n______________________________________________________________________________\nChicago Metallic Dough Cutter and Scraper ($5.99; bedbathandbeyond.com)\nChicago Metallic Dough Cutter and Scraper\nWith an ergonomically designed handle for more comfortable use, because we all need comfort right now.\nBake on\nLodge 3-Quart Non-Stick Cast Iron Round Dutch Oven ($54.90, originally $115; wayfair.com)\nLodge 3-Quart Non-Stick Cast Iron Round Dutch Oven\n\"A 3-quart round Dutch oven should be sufficient for most loaves,\" Slonaker says. She uses a Lodge Combo Cooker like this one for her round loaves.\n______________________________________________________________________________\nLe Creuset Heritage 4-Quart Oval Covered Casserole ($79.99, originally $109.99; bedbathandbeyond.com)\nLe Creuset Heritage 4-quart Oval Covered Casserole\nShe uses a Le Creuset oval casserole for her batards — the long loaves.\n______________________________________________________________________________\nFood Network 3.5-Quart Enameled Cast-Iron Dutch Oven ($59.99; kohls.com)\nFood Network 3.5-Quart Enameled Cast-Iron Dutch Oven\nAnother good option, plus it doubles for stews and soups during this stay-at-home time.\nBread makers\nAnd if this whole process has you feeling overwhelmed, there are devices that can do most of the work for you.\nOster Expressbake Bread Maker ($99.99; bedbathandbeyond.com)\nOster Expressbake Bread Maker\nYou can have up to a 2-pound loaf of bread in just one hour with this device, which comes with 13 different speed settings to create a wide variety of different breads, including gluten-free.\n______________________________________________________________________________\nWest Bend Hi-Rise 2-Pound Bread Maker ($79.99; bedbathandbeyond.com)\nWest Bend Hi-Rise 2-Pound Bread Maker\nWith 12 different settings and the ability to choose the color of your crust — light, medium or dark — consider this the perfect beginner's bread maker.\nCool down\nOxo 11.5\"x18.5\" Steel Non-Stick Pro Cooling & Baking Rack ($14.99; target.com)\nOxo 11.5\"x18.5\" Steel Non-Stick Pro Cooling & Baking Rack\nYou'll need at least one cooling rack for your beautiful hot loaves.\nServe away\nWine and Cheese Slate Cheese Board ($49.99; bedbathandbeyond.com)\nWine and Cheese Slate Cheese Board\nYour new artistry deserves a beautiful setting, doesn't it?\n______________________________________________________________________________\nGodinger Silver Art Co Wood Cutting Board ($39.99; wayfair.com)\nGodinger Silver Art Co Wood Cutting Board\nAnd for the round loaves, too.\n______________________________________________________________________________\nWüsthof Gourmet 8-Inch Bread Knife ($59.99; bedbathandbeyond.com)\nWüsthof Gourmet 8-Inch Bread Knife\nIf you don't already have a standard 8-inch serrated-edge bread knife, now is the time.\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/01/cnn-underscored/how-to-make-homemade-bread/index.html"}