{"authors": ["Tami Luhby", "Sonia Moghe", "Natasha Chen", "Jasmine Wright"], "date_download": "2020-05-04 16:51:09", "date_modify": "2020-05-04 16:51:09", "date_publish": "2020-04-08 10:07:45", "description": "Many emergency room doctors around the country are seeing their hours, pay and benefits cut, even as the coronavirus overwhelms hospitals in New York City and other hotspots.", "filename": "2020_04_08_politics_emergen_820be5b799718e94d60d024d002ece4a_index_1588611069.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406175203-an-attending-physician-listens-to-the-breathing-of-a-patient-who-is-recovering-after-admission-to-an-intensive-care-unit-icu-in-the-coronavirus-covid-19-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_emergen_820be5b799718e94d60d024d002ece4a_index_1588611069.html", "title": "Some ER doctors are losing pay and hours even as coronavirus rages", "title_page": "Hospitals: Some ER doctors are losing pay and hours even as Covid-19 rages - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Many emergency room doctors around the country are seeing their hours, pay and benefits cut, even as the coronavirus overwhelms hospitals in New York City and other hotspots.\nThough many hospitals are seeing more very sick coronavirus victims , they have had to sharply curtail their more lucrative elective surgeries and have temporarily lost many other patients as Americans stay home and skip all but the most urgent care.\nAs a result, hospitals as well as other medical facilities and physician staffing companies nationwide are furloughing thousands of workers or taking other steps to conserve cash as the pandemic wreaks havoc on their finances.\nThe recent $2.2 trillion congressional stimulus bill created a $100 billion fund to reimburse hospitals and other health providers to compensate them for additional expenses and lost revenue due to the coronavirus. Hospitals expect to get about $65 billion, but it's still unclear how all the money will be allocated.\nThe White House said last week some of the fund will reimburse hospitals for treating uninsured coronavirus patients , which did not sit well with the main hospital lobbying group.\nMeanwhile, some front-line medical workers are risking their lives while also making financial sacrifices.\nER doctors getting hit\nOne ER doctor at a Virginia hospital told CNN that hours are being cut and pay will go down because fewer patients are coming through the door -- though many who are arriving are extremely ill with the virus and many have to be intubated. Part of doctors' earnings at the hospital depend on how many patients they see.\n\"I'm putting my life on the line. I'm risking my family's health by going to work. I don't love the idea that I'm getting paid less to do that,\" said the doctor, who works for Envision Healthcare, a medical staffing company, but did not want to be identified for fear of reprisal at work. \"But I'd rather get paid a little less and have people stay home.\"\nEnvision, which is owned by the private equity firm KKR and employs 27,000 providers nationwide, said in a statement that it is \"surging clinicians in high patient volume areas and adjusting accordingly in lower patient volume areas.\" It noted that the postponement of elective procedures and social distancing measures have resulted in lower volumes for many of its clinicians.\nAnother ER physician who works in Washington, DC, learned on National Doctor's Day last week that the doctor's employer, Alteon Health, planned to cut its 401(k) retirement plan match and health savings account contribution, as well as take away paid time off.\nLast week, the doctor saw just five to 10 patients during one shift, as opposed to 25 to 30 people prior to the outbreak, though the numbers picked up this week.\n\"I felt like it was a slap in the face to frontline workers,\" said the doctor, who asked not to be identified. \"People are saying we should be getting hazard pay. Then on Doctor's Day, they take away contributions that would help us pay for health care and plan for retirement and take vacation from this all.\"\nAlteon, which is owned by two investment firms, later walked back some of the changes after ProPublica reported the plans. It promised to fully catch up on the 401(k) match once the pandemic passes, and clinicians will continue to earn paid time off, though it must be approved on a case-by-case basis.\nThe company, which employs 1,800 clinicians at 150 hospitals, also won't cut the compensation of facility medical directors and regional medical directors by 20%, though executives will reduce their pay by a quarter.\nHowever, it will transition some providers from salaried to hourly. \"The best thing for their health and safety is to have them home resting with their families and preparing for surges,\" Dr. Steve Holtzclaw, Alteon's CEO, wrote to employees Sunday.\nTo direct resources to areas with high coronavirus caseloads, \"we have to have some level of staffing flexibility given the material decline in patient volumes across our locations,\" Holtzclaw wrote.\nMeanwhile, another medical staffing firm, TeamHealth, last week emailed anesthesiologists and nurse anesthetists, asking them to volunteer for furloughs for up to 90 days.\nThe anesthesiologist who shared the email with CNN was shocked that these cuts are coming at a time when more and more coronavirus patients are arriving at hospitals in need of critical care treatment.\n\"We're the doctors who are doing the riskiest frontline work by intubating,\" said the anesthesiologist, who also requested anonymity. \"We're inches away from them and then putting them on ventilators.\"\nA TeamHealth spokesman told CNN anesthesia services are down by 65%, after authorities mandated the cancellation of elective procedures.\nTeamHealth, which was acquired by Blackstone in 2016, is also cutting hours of ER physicians in areas where fewer patients are going to the hospital, a spokesman confirmed. More than 100 members of senior TeamHealth leaders agreed to pay cuts.\nHospitals furloughing workers\nHospitals around the country are furloughing staff to try to save money.\nBoston Medical Center Health System last week furloughed about 700 employees, roughly 10% of its workforce. The positions are mostly in administration. The move was first reported in The Boston Globe\nThe hospital system has lost about $5 million in weekly revenue because elective surgeries and non-urgent visits have been postponed, a spokeswoman said. It typically has 4,000 outpatient visits daily.\nIn Florida, Sarasota Memorial Health Care System said Friday that temporary furloughs and reduced hours for employees would start the following week. A drastic drop in non-emergency procedures and hospital inpatients caused a $16 million reduction in March revenue, with an even greater expected financial hit in April and May, the hospital said in a statement online.\nThe hospital system is not cutting back nursing care or staff who are needed to support patient care or essential services, a hospital spokeswoman said. But senior executives will see their pay reduced.\nSarasota Memorial is taking these cost-cutting steps because it has had to \"redirect funds, resources and equipment to respond to the pandemic, planning for surge needs, purchasing additional supplies, and preparing and staffing an increasing number of isolation rooms throughout the hospital,\" the statement said.\nMeanwhile, Trinity Health announced last week it will furlough at least 2,500 employees at eight hospitals in Michigan in the coming weeks, a spokeswoman said.\nThe Catholic health system, which has 92 hospitals in nearly two dozen states, has not completed its staffing plans nationwide so the total number of furloughs will increase, a spokeswoman said. Executives are also taking pay cuts.\n\"This pandemic has created a serious disruption to Trinity Health's operations, colleagues, and the people we serve,\" Michael Slubowski, the system's CEO, said in a statement. \"Outpatient and home care services represent a large portion of health system's revenues and they are decreasing significantly. This is understandable because of orders by state and federal governments to stop elective surgeries -- and because many healthy patients are unable to visit the doctor at this time.\"", "url": "https://www.cnn.com/2020/04/08/politics/emergency-doctors-hospitals-losing-pay-covid/index.html"}