{"authors": ["Marianne Garvey"], "date_download": "2020-05-04 15:56:34", "date_modify": "2020-05-04 15:56:34", "date_publish": "2020-04-15 14:44:25", "description": "Like most parents suddenly trying to homeschool, Drew Barrymore is experiencing the ups and downs of being quarantined with young kids during the coronavirus pandemic.", "filename": "2020_04_15_entertainment_drew-barrymore-quarantine_index_1588607794.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/181004095709-drew-barrymore-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_15_entertainment_drew-barrymore-quarantine_index_1588607794.html", "title": "Drew Barrymore has shed tears trying to homeschool her kids, too", "title_page": "Drew Barrymore has shed tears trying to homeschool her kids, too - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Like most parents suddenly trying to homeschool, Drew Barrymore is experiencing the ups and downs of being quarantined with young kids during the coronavirus pandemic.\nBarrymore called into the \"Today\" show Tuesday to chat with Savannah Guthrie and said that trying to run her businesses while also homeschooling her young daughters, Olive and Frankie, has been challenging.\n\" allowfullscreen>\n\"I don't know if there are good days and bad days. I think there are good hours and bad hours. I cried every day, all day long,\" she told Guthrie of the adjustment. \"It was like every church and state. It was the messiest plate I've ever held in my life to be the teacher, the parent, the disciplinarian, the caretaker.\"\nBarrymore says she's trying to choose happiness \"in every moment,\" and has learned to appreciate teachers even more than she did before.\n\"I didn't think I needed to respect and appreciate teachers any more than I did,\" she said. \"Then you start to get some systems and you see people on social media making lists and you're like, aaarghh. You find your way. You're resilient.\"", "url": "https://www.cnn.com/2020/04/15/entertainment/drew-barrymore-quarantine/index.html"}