{"authors": ["Analysis Stephen Collinson"], "date_download": "2020-05-04 16:25:53", "date_modify": "2020-05-04 16:25:53", "date_publish": "2020-04-07 02:15:23", "description": "President Donald Trump's contempt for science and disdain for experts who question his political narratives are driving his increasingly defensive and brittle management of the coronavirus pandemic.", "filename": "2020_04_06_politics_donald-trump-coronavirus-angry-defensive_index_1588609553.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405192138-03-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_donald-trump-coronavirus-angry-defensive_index_1588609553.html", "title": "Trump turns angry and defensive as evidence contradicts his coronavirus narrative", "title_page": "Trump turns angry and defensive as evidence contradicts his coronavirus narrative - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump's contempt for science and disdain for experts who question his political narratives are driving his increasingly defensive and brittle management of the coronavirus pandemic .\nTrump was short-tempered and rude during much of his daily briefing on Monday as he refused to even listen to questions about shortcomings in the federal government effort. On Sunday, Trump muzzled the country's top infectious disease expert Dr. Anthony Fauci before he could contradict his own gushing assessment of an unproven Covid-19 therapy. On Monday, the President also blasted a report by an experienced Health and Human Services Department watchdog official that found critical supply shortages at hospitals all over the country, claiming it was politically motivated.\nTensions between science and politics that lie at the core of the battle to eradicate the pandemic while still saving the economy will become even more acute as pressure grows inside the administration to reopen normal life.\nOver the weekend, one of Trump's economic advisers -- Peter Navarro -- clashed with Fauci over the effectiveness of hydroxychloroquine, the drug the President insists could save Covid-19 patients, according to people familiar with the disagreement.\nNavarro told CNN's \"New Day\" on Monday that despite his lack of a medical education, he was competent to weigh in on the issue.\n\"My qualifications in terms of looking at the science is that I'm a social scientist,\" Navarro said. In remarks that epitomized the administration's lax respect for expertise. \"I have a Ph.D. And I understand how to read statistical studies, whether it's in medicine, the law, economics or whatever.\"\nWhen reporters tried to ask Fauci, who has previously expressed caution about the drug, about its uses at a briefing on Sunday, the President would not allow him to answer, saying he had tackled the question himself many times.\nIn one vital area of the pandemic response, Trump is still listening to the experts. He is sticking to advice given by Fauci and another top coronavirus task force member Dr. Deborah Birx to extend social distancing guidelines until April 30. The doctors last week presented dire warnings of several million deaths if he did not act.\nBut his feuds with reporters on other issues Monday underscored his wider reluctance to allow inconvenient evidence to mar his cultivated picture of hugely successful leadership amid the worst domestic crisis since World War II.\n\"We are the federal government. We are not supposed to stand on street corners during testing,\" he said, when confronted with questions about deficiencies in coronavirus testing.\nOn the day when the US death toll passed 10,000 there was something surreal in watching the President's outbursts, a familiar tactic that often pleases his political base and serves to portray himself as a victim of what he claims is a biased media.\nTrump disrupts science\nThe willingness of a President -- who once predicted a \"miracle\" would sweep the virus away -- to disregard expert advice has colored his entire administration, from climate change to foreign policy and the current crisis. The political model that made him so attractive to Americans dismayed with the elite expert establishment is based on disruption -- and when the facts get in the way they become superfluous.\nSuspicion of science and government expertise run deep in the core of the Trump team's DNA. Hundreds of bureaucrats have left the government as Trump has blasted a \"deep state\" of public officials. One of his ex-senior advisers, Steve Bannon, once described Trump's mission as the \"deconstruction of the administrative state.\"\nThe President also installed loyalists in positions for which they appear unqualified but advance his priorities. A widely panned briefing last week by his son-in-law Jared Kushner, now dabbling in the pandemic response, was a case-in-point.\nBut the pandemic has shown that a \"deep state\" of scientists is vital to the public good during a public health threat. One reason why Trump appeared to be flailing in recent news conferences may be that his political approach -- based on denying robust fact-based evidence -- is being badly exposed.\nTrump offers therapy to sick British PM\nIn one of the strangest moments of Monday's appearance in the White House Briefing Room, Trump seemed to suggest he had rushed an unspecified mystery therapy to British Prime Minister Boris Johnson, who is battling Covid-19 in intensive care.\nAfter meeting the heads of pharmaceutical companies, Trump said: \"I've asked them to contact London immediately.\"\n\"They speak a language that most people don't even understand, but I understand something, that they've really advanced therapeutics and therapeutically, and they have arrived in London already,\" Trump said. \"We've contacted all of Boris' doctors, and we'll see what is going to take place, but they are ready to go.\"\nIt was not clear which therapy Trump was referencing. And his offer would apparently involve the British Prime Minister's doctors handing over treatment decisions to American pharmaceutical companies. But in recent days he's been aggressively touting the anti-malarial drug hydroxychloroquine and dispensing medical advice that it should be given to coronavirus victims.\nUS government medical experts say the therapy may have some promise but say there is little solid scientific evidence that the treatment, a favorite of conservative media commentators who have Trump's ear, is effective in treating the disease.\n\"There are some very strong, powerful signs\" that the drug is effective in dispelling the virus from patients bodies, Trump said Sunday.\nPhysicians however warn that hydroxychloroquine can cause serious side-effects and should not be prescribed without robust testing regimens.\nAddressing Trump's question \"What do you have to lose?\" Dr. Craig Spencer, an emergency medicine specialist in New York, told CNN, \"maybe your vision, maybe the normal electrical activity of your heart, maybe your life.\"\nSpencer said everyone hoped that hydroxychloroquine could be a \"miracle drug\" but warned against peddling \"magic bullet\" treatments. Trump's desperation to find a cure that could save lives and reopen an economy that has shed millions of jobs does him credit, and it is important for a President to use his power to push the envelope to spark breakthroughs.\nBut his willingness to bypass science to fulfill his preferred reality would turn the principles of modern medicine on their head. It also implies a misunderstanding of the basic moral creed ingrained in the medical profession. It's not yet clear whether hydroxychloroquine has the potential to make people better significantly outweighs the risk of doing them harm.\nTrump's keenness to start prescribing the drug in large quantities to Covid-19 patients mirrors his attitude to science in other areas. For instance, the science of climate change is inconvenient to his plans to boost the carbon economy and to shield Americans from the economic consequences of cutting emissions that harm the planet.\nSometimes, the President offers an ironic glimpse of clarity when he's discussing such matters.\n\"What do I know, I'm not a doctor,\" he said on Sunday.\nTrump attacks author of critical report\nJUST WATCHED See the question Trump wouldn't let Dr. Fauci answer Replay More Videos ... MUST WATCH See the question Trump wouldn't let Dr. Fauci answer 02:29\nThe President also took unkindly to a Department of Health and Human Services inspector general's report published Monday that found \"severe\" and \"widespread\" shortages of medical supplies, hampering the ability to test suspected coronavirus patients and to respond to the pandemic adequately and protect medical staff.\nThe assessment, the first internal government look at the response, was based on interviews from March 23-27 with administrators from more than 300 hospitals across 46 states, Washington, D.C., and Puerto Rico.\nIt challenges Trump's claim that the federal government's response to the pandemic has been perfect, and reinforces complaints by medical staff and state governors and city mayors who warn of a dire front line situation.\nThe report was written by the principal deputy inspector general for the department, Christi Grimm. According to her official biography, Grimm, who has worked for multiple administrations, is an award-winning public servant with \"two decades of leadership and expertise in health and human services programs.\"\nBut Trump immediately denigrated her professional and personal credentials and suggested she was motivated by a partisan desire to harm his administration.\n\"Give me the name of the inspector general. Could politics be entered into that?\" Trump said, indulging another troubling trait, the singling out of public officials that he deems insufficiently loyal to him personally.\nTrump's fury erupted just three days after he fired another inspector general -- Michael Atkinson, who serves the intelligence community -- who was responsible for informing Congress of the whistleblower report that led to his impeachment by the House of Representatives.", "url": "https://www.cnn.com/2020/04/06/politics/donald-trump-coronavirus-angry-defensive/index.html"}