{"authors": ["Edward Carver", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Paul Heideman", "Hadas Thier", "Carl Beijer"], "date_download": "2020-05-04 19:49:23", "date_modify": "2020-05-04 19:49:23", "date_publish": "2020-03-04 00:00:00", "description": null, "filename": "2020_05_low-income-voters-ideology-2020-election_1588621763.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/04120850/GettyImages-1205002594.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_05_low-income-voters-ideology-2020-election_1588621763.html", "title": "The Majority of Americans Aren’t Scared Off by Policies Like Medicare for All", "title_page": "The Majority of Americans Aren’t Scared Off by Policies Like Medicare for All", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "After Bernie Sanders’s commanding win in Nevada on February 22, establishment Democrats rushed to cast him as a divisive figure, a left-wing ideologue. “Senator Sanders believes in an inflexible, ideological revolution that leaves out most Democrats, not to mention most Americans,” Pete Buttigieg, a leading rival at the time, said in a speech that night. “We cannot out-divide the divider in chief,” insisted Amy Klobuchar — implying that Bernie’s approach was the same as Trump’s. This absurd logic equated Bernie’s attacks on a small but powerful set of corporate interests with Trump’s attacks on large segments of society — including immigrants and people of color, whose interests Bernie was doing his damnedest to represent. Now that Bernie has lost, the establishment has concluded that his left-wing base was simply outnumbered. Will Marshall of the liberal Progressive Policy Institute wrote that Bernie’s base was “far too narrow and too sectarian,” while Neera Tanden of the Center for American Progress told Politico that leftists were wrong in thinking that “their views represented a strong majority.” The “Ideas” section of the Atlantic proclaimed Bernie “wrong about America.” Yet polling suggests Bernie lost not because of his “ideological” positions but because the Democratic establishment convinced voters that he couldn’t gather enough support to beat Donald Trump. In fact, even many Biden voters back policies that the Democratic nominee does not himself endorse. In Virginia exit polls, about half of Democrats said they supported a “complete overhaul” of the economic system and replacing private health insurance with a single government plan, yet few voted accordingly. In Mississippi, Bernie lost by 65 percentage points, yet more than half of voters supported the single government health plan. This wasn’t a personality issue: Democratic voters gave Bernie high favorability ratings throughout the race. In the end, though, electability trumped all. Voters, acting like pundits, regarded Biden as the safe choice to beat Trump. As the coronavirus outbreak worsened in the United States, the rush for a safe choice gathered force, and anxious primary voters moved toward Biden as the establishment candidate. Yet was Biden the safe choice? As Jacobin readers know, there’s good reason to question the conventional wisdom on electability. In a general election, a candidate such as Bernie could have brought out the Democratic base, drawn in independents and mobilized the marginalized. There’s evidence that Democrats should focus on winning back the people who voted for Obama in 2012 but did not vote at all in 2016. They are disproportionately young and black and low-income — groups that Bernie had the best chance to reenergize. Yet this argument did not penetrate, and the reason is clear. Bernie supporters lost the battle to frame the Democratic race. Most pundits cast it as an ideological struggle between the Left and the center. By this logic, a “centrist” candidate whose views are closer to that of the median voter on some supposed single axis is the safest candidate to run against Trump. Many well-to-do establishment Democrats told me, “I’m liberal and even I don’t support Bernie, so what chance would he have in a general election?” This narrative is class-blind. Indeed, the words “class” and “income” are absent from long New York Times articles on what went wrong for Bernie; they suggest that a “Never Bernie” movement emerged and that he could not extend his appeal “beyond the left.” This analysis assumes that most voters have an ideology — an organized structure of political ideas — that runs counter to Bernie’s socialism. In this telling, the “centrists” or “moderates” in the Democratic Party won. In fact, the struggle within the party is not between the center and the Left but between high-income older voters, who are more active in the primaries, and low-income young voters. In fixating on ideology, the media has obscured class disparities and refused to acknowledge the electoral strength of the systematically disadvantaged — including, in an era haunted by climate change, the young.\nFixated on Ideology The first problem with the establishment’s fixation on ideology is that most voters are not “ideological.” During the 2016 Republican primaries, pundits were confident that Donald Trump could not win. He had demonstrated no long-standing attachment to conservative values and went against Republican orthodoxy by opposing free trade agreements and promising to protect social welfare programs. Yet Republican voters preferred him to Ted Cruz and others who had clearer ideological stances The point is not that Trump won on any “moderate” platform but that most voters don’t have entrenched positions on the Left, Right, or center. Unlike elites and political insiders, most people don’t have views consistent with recognized belief systems. Philip Converse showed this in his seminal 1964 essay “The Nature of Mass Belief Systems,” and much recent research supports his findings. Voter choices, driven partly by emotions, reflect a mishmash of identity, class, and group loyalty dynamics (which make people a fair bit more attached to party than to ideology). Ideological polarization is overstated; it only applies to the most well-informed voters, according to Donald Kinder and Nathan Kalmoe’s 2017 book, Neither Liberal Nor Conservative: Ideological Innocence in the American Public. The irony is that Democratic leaders, in assessing political races, see only ideological lanes, yet they love to proclaim themselves free from ideology. The message is: “everyone else has an ideology, but I’m just a pragmatist that gets things done.” Bill Clinton’s pragmatism led him to decry big government, cut welfare benefits, deregulate Wall Street, and hail personal responsibility. Obama, taking the same approach, described himself as “not particularly ideological.” The American Prospect called Michael Bloomberg, the consummate managerial technocrat, an “anti-ideologue.” Joe Biden cast himself as nonideological in his willingness to discuss cuts to Social Security and Medicare — “absolutely, you have to” be willing to make such cuts, he said in 2007, as if no sensible person could disagree. And so the Democratic establishment has successfully hidden its own ideology. In the last four decades, it has put its faith in technocracy and marketplace values, a mix of “trust the experts, don’t get too involved” and “a rising tide lifts all boats.” Despite the vociferating on cable news programs, most debates occupy a relatively narrow ideological space, with a number of assumptions shared by Democrats and Republicans, especially on economic issues: good governance is a technical and managerial undertaking; free enterprise drives wealth and job creation; governments’ main economic goal should be growth, measured by the exchange of goods and services, regardless of what is being bought or sold; the market should determine health care and fossil fuel prices; former (and future) Wall Street executives should lead economic policy, etc. The powerful have successfully cast this belief system as nonideological — the only sensible way to run our society. Many are of course frustrated by the rising populist tide. Venture capitalists and other Silicon Valley leaders, turned off by the likes of Bernie Sanders, whom their employees supported, helped form a Common Sense Party in California. Yet how many people have common interests with rich tech engineers? As Vox’s Ezra Klein, not a hard leftist, has written, “the idea of the moderate middle is bullshit;” the establishment uses the concept to “set limits on the range of acceptable debate,” he says. Indeed, in twenty-first-century America, getting a ticket to the centrist pavilion seems to require a willingness to bow down to corporate power and wealth concentration.\nBernie’s Supporters: Not Left so Much as Left Behind The main problem with pundits’ fixation on ideology is that it obscures issues of identity, class, and systemic disadvantage. To be sure, these issues are themselves related to ideology, but not in a way that affects voter choices, which is what matters when assessing electability. That is, a black person might oppose racist policies, and a low-income worker might support a stronger welfare system, and, yes, these opinions could push either of them toward a broader left or liberal ideology. But the causality wouldn’t run the other way: being a leftist won’t make you disadvantaged. Identity and class come first and are more influential in voter choices. The establishment has an especially limited grasp of class issues. Most of this year’s exit polls, which are designed with input from corporate media outlets such as CNN, didn’t even include questions about wealth or income. It’s like establishment Democrats don’t want to know — lest they have to acknowledge that they voted against the economically disadvantaged. However, the media did include income questions in three states, and the results are revealing. Sanders dominated at the lowest income bracket in New Hampshire but finished a distant third with wealthier voters. Biden won handily in Michigan, but still lost to Sanders by 9 percentage points among voters with a total family income under $50,000. Above that threshold, Biden won by 18 points. In Missouri, Sanders tied Biden among voters earning less than $30,000, but got slaughtered in higher income brackets. Not surprisingly, campaign donations told the same story. The average donation to Sanders’s campaign was $18 in the last quarter of 2019; the most common occupation was teacher, and the most common employers were Amazon, Starbucks, Walmart, and the US Postal Service. Meanwhile, dozens of billionaires have supported Biden’s campaign, and Wall Street executives have opened their wallets even more to him since Super Tuesday. Yet the establishment mostly avoided looking under the hood of the campaigns. Reframing the split in the Democratic Party isn’t just about illuminating the moral stakes or reminding establishment Democrats about the importance of solidarity with the marginalized. It’s about debunking the myth that a candidate with a platform of structural change can’t win a general election. Low-income voters vastly outnumber the rich, and recent general elections show that they remain, in spite of four decades of Democratic neoliberalism, the party’s base. Hillary Clinton won more high-income voters in 2016 than Obama had in 2012 — in fact, she nearly erased the long-standing gap in voter choice between Republicans and Democrats earning above $100,000 — but lost a huge number of Obama’s low-income voters. 2012 general election: Obama (blue) v. Romney (red) exit poll data 2016 general election: Clinton (blue) v. Trump (red) exit poll data When the debate is framed as ideological, the centrists have a natural advantage. They can say, “Bernie can’t even win our primaries, how on Earth would he win a general election?” In fact, Sanders would have had a better chance in November. In a general election, voters have no reason to act like pundits and are younger and poorer. Democratic primary voters skew old and wealthy. In the 2016 general election, only 18 percent of all voters had family incomes above $100,000. Yet well-to-do voters are overrepresented in the primaries, as exit polls show for the three states for which income data was collected. Of Democratic primary voters in New Hampshire, 40 percent were above the $100,000 threshold; in Michigan, 35 percent; in Missouri, 27 percent. The skewed turnout would likely be even clearer in richer states, as Michigan and Missouri have per capita incomes below the national average. Not surprisingly, there’s also an age-based turnout disparity. Exit polls from every Democratic primary except one (Minnesota, which had lots of young voters) show a lower percentage of voters aged eighteen to forty-four than in the 2016 general election as a whole. So regardless of whether Sanders could have increased the proportion of young and low-income voters in the general election in November — an oft-debated question — the point is that even if their turnout figures remained the same as in 2016, they would be higher than they were in the Democratic primaries. Now, to be sure, class can’t be deduced from income level alone. Some political scientists prefer to use education as a class indicator: an Ivy League student might have no income but lots of privilege. In this vein, in 2016, two experienced political scientists said that they had run the numbers and determined that Bernie’s following was more young than working class, though they did not release their research publicly and did not respond to requests for comment for this article. In any case, that sort of analysis assumes too narrow a definition of working class. In understanding Bernie’s support base, it’s more revealing to look at a broad spectrum of people who are relatively disadvantaged, including the young. As the coronavirus recession hits, millennials have only half as much wealth per person as Generation X had going into the Great Recession and are less likely to own a home than people in previous generations at the same age. During this pandemic, people under forty-five have lost their job or working hours at twice the rate of older people. While one of the political scientists told Vox that it “just happens that young people are poorer,” it doesn’t just happen: it’s the result of a system that offers little affordable education and work training, and keeps wealth in the hands of those who already have it. And it’s no longer safe to assume that people will grow wealthier as they get older. Unless there are structural changes to our political and economic systems in the near future, that won’t happen, and young voters sense it. It’s not right to point the finger at older people as individuals, of course, but older generations, particularly the Baby Boomers, have stolen the future’s resources. This isn’t so much because of the consumption patterns of the privileged as because of the general willingness to elect leaders who advanced the agendas of fossil fuel companies, energy-intensive industries, and, crucially, the Wall Street firms that financed them. While politicians lay prostrate, a small set of companies extracted much of the world’s easily accessible reserves of fossil energy. Much of what’s left is in shale, seabed, or tar sand — places where extracting it is far more dangerous, expensive, and environmentally damaging. The material abundance that many older Americans enjoyed, brought about largely through cheap, debt-fueled extraction of the planet’s resources, is over. Young people missed the binge and are left with the hangover: climate change. In 1988, climate scientist James Hansen, then at NASA, testified before a Senate panel about climate change; the New York Times ran a front-page story. Since then, the Democrats have been in power about half the time, and have made little difference, their tepid technocratic reforms being easily rolled back by Republicans. In that time, more greenhouse gases have been emitted than in all of known history. The latest research is frightening. It looks possible that we are on the “worst case scenario” track in climate models, with ice melt and other effects — which, because of feedback loops, are also causes — increasing faster than expected. Radical action is the only sensible way forward. The coronavirus crisis should be teaching us about the need to plan for low probability, high impact events, which are about to become far more frequent. To keep warming at or below 1.5 degree Celsius above preindustrial levels, governments need to cut greenhouse gas emissions in half in the next decade, according to the Intergovernmental Panel on Climate Change. “1.5C gives young people and the next generation a fighting chance of getting back to the Holocene or close to it,” Hansen told the Guardian after the last IPCC report came out. “That is probably necessary if we want to keep shorelines where they are and preserve our coastal cities.” The point is that young people are systemically disadvantaged. In this sense, age is a form of class. To be sure, just as not all millennials suffer equally from the current economic system — university-educated young people are doing far better than those without a degree — not everyone will suffer equally from the consequences of climate change. The poor will bear the brunt, especially in areas where flooding, heat waves, and other extreme weather events will be most common. However, even privileged young people today face a dark and uncertain future. Unless drastic action is taken, most of today’s young could be locked into low incomes and some form of nature- or government-enforced austerity for much of their lives. No wonder they supported Bernie.", "url": "https://jacobinmag.com/2020/05/low-income-voters-ideology-2020-election"}