{"authors": ["Harmeet Kaur"], "date_download": "2020-05-04 16:59:23", "date_modify": "2020-05-04 16:59:23", "date_publish": "2020-04-08 19:08:48", "description": "As the spread of the coronavirus is proving difficult to contain, so too is the misinformation surrounding it.", "filename": "2020_04_08_tech_5g-coronavirus-conspiracy-theory-trnd_index_1588611563.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408134809-5g-network-coronavirus-0325-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_tech_5g-coronavirus-conspiracy-theory-trnd_index_1588611563.html", "title": "The conspiracy linking 5G to coronavirus just will not die", "title_page": "The conspiracy linking 5G to coronavirus just will not die - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As the spread of the coronavirus is proving difficult to contain, so too is the misinformation surrounding it.\nOne of the most recent, baseless conspiracy theories surrounding the virus is that 5G networks -- the next generation of wireless technology that's steadily being rolled out around the world -- are fueling the global coronavirus pandemic . They are not.\nOfficials in the United Kingdom have expressed concerns that recent attacks on cell phone towers were motivated by false conspiracy theories. Meanwhile, actor Woody Harrelson and singer M.I.A. are among celebrities and influencers spreading such claims to their millions of followers.\nThere's no evidence to support the theory that 5G networks cause Covid-19 or contribute to its spread. But still, it refuses to die.\nHere's what to know about 5G networks, how these false theories came about and why they don't hold up.\nHow 5G works\nThere are several theories linking 5G and Covid-19. One simply suggests that 5G networks cause Covid-19, or symptoms of the infection. Another more insidious one is that 5G networks emit radiation that weakens the immune system, making people more susceptible to infection.\nTo break it down, it helps to understand what exactly 5G is.\n5G is a next-generation wireless network that is expected to enable a wave of technologies that will change the way that people live and work -- the potential applications include self-driving cars remote surgeries and automated factories , though it will be a while before we see those kinds of changes.\nThe big differences between 4G and 5G are faster speeds, higher bandwidth and lower lag time in communications between devices and servers.\n5G signals run over new radio frequencies, which requires updating radios and other equipment on cell towers. Carriers building superfast 5G networks have to install tons of small cell sites to light poles, walls or towers, often in close proximity to each other. So far, the networks have mostly been deployed city by city.\nWhy people are linking 5G and Covid-19\n5G networks began rolling out in cities and countries in 2018, but were more widely adopted in 2019 -- the same year that Wuhan, China, saw the world's first coronavirus outbreak.\nConspiracy theorists were quick to link the two, ignoring the ever-relevant adage: Correlation does not imply causation.\nPeople on the internet shared two maps of the United States suggesting areas that had been hit hardest by Covid-19 were also places where 5G networks had been installed.\nAnother thing those areas have in common? They're metropolitan areas: large population centers that are more vulnerable to the spread of the coronavirus and are more likely to adopt 5G networks earlier.\nThere are other reasons those suggestions don't hold up. Although Iran has not rolled out 5G, it's one of the countries hardest hit by the pandemic.\nMany of the 5G/Covid-19 conspiracy theories are linked to groups that have long claimed that wireless airwaves cause cancer, though there is no credible evidence to support this.\nResearch shows that radiofrequency (RF) waves given off by cell phones do not have enough energy to damage DNA directly or heat body tissues -- their energy levels are lower even than technologies such as microwave ovens and televisions. What's more, 5G signals are actually worse at penetrating objects than 4G signals, which is why 5G networks require many more, smaller cell sites built close together.\nThe International Commission on Non-Ionizing Radiation Protection (ICNIRP) is a body of independent scientific experts that considers how exposure to electromagnetic fields used by cell phones and other devices affects people's health. The organization maintains that there is no link between 5G and the coronavirus.\n\"The theory that 5G might compromise the immune system and thus enable people to get sick from corona is based on nothing,\" Eric van Rongen, chairman of ICNIRP, wrote in an email to CNN.\n\"There are no indications from scientific studies that 5G (or any other G) affects the immune system. If that would be the case, we would have seen effects on the scale and severity of infectious diseases already decades ago. And we don't.\"\nIn its most recent guidelines , INCIRP looked at all the possible adverse health effects that could occur from exposure to RF electromagnetic fields, van Rongen wrote. The only proven effect is heating of parts of the body, but the exposure from mobile devices is so low that this wouldn't happen through cell phone use.\nWhat's being done to limit the spread\nSocial media and internet platforms have started taking steps to limit the spread of coronavirus misinformation, though some have been slow to act.\nYouTube videos that drew connections between 5G networks and the coronavirus have racked up hundreds of thousands of views. But the company initially said such videos were not in direct violation of its policies before moving to ban them Tuesday\nTwitter said it was increasing its use of machine learning and automation to help take down false information. A quick search for \"5G coronavirus\" Wednesday mostly showed tweets from people casting doubt on conspiracy theories and links from news organizations in the \"Top\" results, despite turning up several false theories days earlier\n\"We will continue to take action on accounts that violate our rules, including content in relation to unverifiable claims which incite social unrest, widespread panic or large-scale disorder,\" a spokesperson for the company said. \"If people see anything suspicious on our service, please report it to us.\"\nSimilarly, a Facebook search for \"5G coronavirus\" yielded mostly reliable information from news organizations, hospitals and health organizations, though false theories can still be found through the platform.\nA spokesperson for Facebook said the company is taking \"aggressive\" measures to combat misinformation surrounding the virus, and is \"starting to remove false claims which link Covid-19 to 5G technology\" and which encourage attacks on cellular towers.", "url": "https://www.cnn.com/2020/04/08/tech/5g-coronavirus-conspiracy-theory-trnd/index.html"}