{"authors": ["Matt Egan", "Cnn Business"], "date_download": "2020-05-04 16:19:24", "date_modify": "2020-05-04 16:19:24", "date_publish": "2020-04-03 23:41:08", "description": "America's leading oil CEOs urged President Donald Trump on Friday to grant the embattled industry access to government programs aimed at helping companies harmed by the coronavirus pandemic.", "filename": "2020_04_03_business_oil-ceos-trump-meeting_index_1588609164.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403183305-01-trump-oil-executives-meeting-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_oil-ceos-trump-meeting_index_1588609164.html", "title": "Here's what America's oil CEOs discussed with Trump", "title_page": "Here's what America's oil CEOs discussed with Trump  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) America's leading oil CEOs urged President Donald Trump on Friday to grant the embattled industry access to government programs aimed at helping companies harmed by the coronavirus pandemic.\nTrump was \"very receptive\" to that request and did not discuss government-mandated oil production cuts during the meeting at the White House, American Petroleum Institute CEO Mike Sommers, who was in the meeting, told CNN Business.\n\"We are operating in a market economy, not one with state-owned oil companies,\" Sommers said in an interview following the meeting with Trump and the CEOs ofand other major oil companies.\nThe nosedive to 18-year lows in oil prices threatens to set off a wave of bankruptcies in the United States.\n\"We had very positive conversations about ensuring this industry has the liquidity it needs to continue to survive,\" Sommers said.\nAlthough oil executives didn't ask for \"special treatment,\" Sommers said smaller oil companies should get access to Small Business Administration loans and larger ones should be able to tap programs set up as part of the $2 trillion stimulus package enacted last week.\n\"We want to make sure oil and gas companies that were solvent going into the pandemic would be able to access the same types of programs as other companies,\" Sommers said. \"The president was clear that would be the case.\"\nThe White House declined to comment.\nMarket forces will cause US output to drop\nTrump told the oil executives during the meeting that he's optimistic that Saudi Arabia and Russia will reach a deal to end their price war that erupted early last month.\n\"I think President Putin and the Crown Prince want something to happen badly,\" Trump said, according to a White House readout of the meeting. He added that he's spoken to both the Russian leader and Saudi Crown Prince Mohammed bin Salman.\nOPEC+ and other countries are scheduled to meet next week via video conference to discuss how to proceed. The meeting, along with Trump's talk of major production cuts by Russia and Saudi Arabia, caused US oil prices to spike by a record 32% this week.\nAlthough there has been speculation about potential output cuts by the United States, that apparently was not on the table Friday.\n\"There were no discussions of production cuts in the meeting -- outside of market mechanisms,\" Sommers said. \"We have thousands of producers in the United States. We don't have authorities within our government structure to shut in that kind of production.\"\nUS oil output, however, will sharply decline because of the plunge to $20 a barrel -- a level far too low for many American oil companies to survive.\nOccidental Petroleum OXY Leading companies including Chevron andhave already announced sharp cuts to spending and lowered their production targets.\n\"There are already production cuts happening in the United States,\" said Sommers. \"And they are going to be significant, but based entirely on the price of oil, not from a government mandate.\"", "url": "https://www.cnn.com/2020/04/03/business/oil-ceos-trump-meeting/index.html"}