{"authors": ["Julia Horowitz", "Cnn Business"], "date_download": "2020-05-04 16:51:25", "date_modify": "2020-05-04 16:51:25", "date_publish": "2020-04-08 12:02:43", "description": "First came the initial shock as countries, states and cities went on lockdown, grinding economic activity to a halt. Then came the relief rallies as governments and central banks unleashed trillions of dollars to help affected companies and workers and to steady markets.", "filename": "2020_04_08_investing_premarket-stocks-trading_index_1588611085.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331124303-04-nyse-0324-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_investing_premarket-stocks-trading_index_1588611085.html", "title": "Why stock markets are stuck in limbo", "title_page": "Premarket: Why stocks are stuck in limbo - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nLondon (CNN Business) First came the initial shock as countries, states and cities went on lockdown, grinding economic activity to a halt. Then came the relief rallies as governments and central banks unleashed trillions of dollars to help affected companies and workers and to steady markets.\nNow, global markets are in wait-and-see mode as the trajectory of the coronavirus pandemic remains uncertain\nWhat's happening: Stocks shot up at the beginning of the week on news that the efforts to contain the coronavirus pandemic could be starting to pay off in Spain, Italy and New York.\nSince then, massive volatility has returned. In the last hour of trading on Tuesday, the S&P 500 gained 1%, then saw a 1.2% decline, then a 1.3% rally, then another 1.5% drop. The index finished 0.2% lower.\nDriving the swings is a lack of clarity about whether the coronavirus is being effectively contained, and how soon people can get back to work. Fatalities and infections appear to be slowing in Italy, Spain and France, which are among the hardest-hit countries in Europe. The United States, meanwhile, logged a record number of deaths on Tuesday.\n\"We've now reached a point where it's all about the great unknown, and that's how long these lockdowns are going to last and how successful we'll be at exiting them,\" Nicholas Hyett, equity analyst at Hargreaves Lansdown, told me. In the meantime, he said, investors are in \"limbo.\"\nThere's also a dearth of concrete data from companies showing the impact of the virus on earnings and detailing how much cash they have on hand, Hyett said.\n\"The stock market rallies of the past two days are despite the fact that neither economic nor earnings data have really begun to unveil the enormity of the economic crisis that the world has been plunging into in the past few weeks,\" Rabobank's Michael Every and Jane Foley told clients on Wednesday.\nWithout this information, it's hard to predict whether markets are off their lows for good, Hyett said.\n\"It's very difficult to see if we've had a real bottom in the market and people are prepared to hold at this level, or if what we're seeing is a pause for breath,\" he said.\nNo European stimulus deal despite all-night talks\nAfter 16 hours of talks held by video conference, eurozone officials are struggling to reach an agreement on measures that would provide additional support to workers and businesses devastated by the novel coronavirus.\nThe latest: Finance ministers representing the 19 countries that use the euro currency suspended negotiations on a new rescue package on Wednesday, saying they would reconvene on Thursday.\nPortugal's Mário Centeno, who is president of the Eurogroup, said the finance ministers \"came close to a deal but we are not there yet.\"\nThe plan is likely to include a new line of credit for governments that use the euro, as well as hundreds of billions of dollars in loan guarantees for businesses and support for workers. Yet longstanding divisions between countries have complicated efforts to put forward a collective fiscal response.\nItaly is reportedly still pushing for a deal that includes joint debt issuance, or so-called \"corona bonds,\" to raise long-term financing for member states to fight the aftershocks of the crisis. Germany's finance minister tweeted that member states should allow for a good compromise.\nJust in: The economic backdrop is rapidly deteriorating as discussions continue. France's central bank said Wednesday that the country's economy shrank by around 6% in the first three months of the year, the worst contraction since 1968.\nOil markets are rocky ahead of OPEC's big meeting\nOil prices remain volatile as investors look ahead to a big meeting Thursday between OPEC and other energy producers including Russia.\nBrent crude, the global benchmark, rose 0.7% to $32.10 per barrel on Wednesday after falling 3.6% on Tuesday.\nThe backdrop: Traders desperately want Saudi Arabia and Russia to strike a deal to limit output, helping boost prices that have crashed more than 50% from their highs in early January.\n\"In the oil market, it seems quiet before the storm,\" Bjornar Tonhaugen, head of oil markets at the consultancy Rystad Energy, told clients Wednesday. \"At the moment, prices are so volatile that any news or leaks about the direction of the negotiations could move them either way.\"\nPresident Donald Trump is also jockeying for an agreement. He's threatened to slap tariffs on foreign oil if Russian President Vladimir Putin and Saudi Crown Prince Mohammed bin Salman can't come to terms.\nBut that strategy may not work, considering that the United States imports little crude from Saudi Arabia and Russia these days, per my CNN Business colleague Matt Egan. That limits Trump's influence.\nUp next\nThe US Federal Reserve releases the minutes at 2 p.m. ET from its meeting on March 15. That's when the central bank decided to slash its key interest rate close to zero.\nComing tomorrow: OPEC and other major producers are scheduled to meet virtually as investors hope that Saudi Arabia and Russia can hammer out a deal to limit production and boost prices.", "url": "https://www.cnn.com/2020/04/08/investing/premarket-stocks-trading/index.html"}