{"authors": ["Natalie Gallón"], "date_download": "2020-05-04 16:17:43", "date_modify": "2020-05-04 16:17:43", "date_publish": "2020-04-03 17:46:18", "description": "The streets of Ecuador's western city of Guayaquil are deserted, with few residents in sight -- and a few dead, as bodies are being left in the streets of this overwhelmed place.", "filename": "2020_04_03_americas_guayaqu_052e57f81e36e839e29642d595eac1c8_index_1588609063.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403111850-01-guayaquil-ecuador-coronavirus-0402-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_americas_guayaqu_052e57f81e36e839e29642d595eac1c8_index_1588609063.html", "title": "Bodies are being left in the streets in an overwhelmed Ecuadorian city", "title_page": "Ecuador coronavirus: Bodies are being left in the streets in an overwhelmed city - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The streets of Ecuador's western city of Guayaquil are deserted, with few residents in sight -- and a few dead, as bodies are being left in the streets of this overwhelmed place.\nThe coronavirus pandemic is overloading the public services in the country's most populous city to a point of collapse. Hospitals have no beds left to accept sick patients, and morgues, cemeteries and funeral homes are straining. With no place left to put them, some residents say they have no choice but placing them outside.\nIt's unclear how many of the deceased are dying because of Covid-19. Many families say their loved ones had symptoms of the virus, while others only know the ill were unable to be treated at Guayaquil's overwhelmed hospitals.\n\"We have been waiting for five days,\" Fernando Espana said in a video obtained by Reuters on March 30, as he complained about the struggles to have authorities come pick up his family member.\n\"We are tired of calling 911 and the only thing they tell us is to wait, they are working to solve this,\" he continues as he moves the camera through a window to show a black plastic-wrapped shape inside the home, with two fans blowing on it.\nRead More", "url": "https://www.cnn.com/2020/04/03/americas/guayaquil-ecuador-overwhelmed-coronavirus-intl/index.html"}