{"authors": [], "date_download": "2020-05-04 20:31:55", "date_modify": "2020-05-04 20:31:55", "date_publish": "2020-04-07 19:37:49", "description": "NEW YORK (AP) — The Pulitzer Prize Board will postpone the announcement of this year's winners because some board members have been busy covering the global coronavirus outbreak, the organization...", "filename": "_6284f482ba5c2e10b84cbd8b9c914d72_1588624315.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6284f482ba5c2e10b84cbd8b9c914d72_1588624315.html", "title": "Pulitzer Prize announcement to be postponed due to pandemic", "title_page": "Pulitzer Prize announcement to be postponed due to pandemic", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NEW YORK (AP) — The Pulitzer Prize Board will postpone the announcement of this year’s winners because some board members have been busy covering the global coronavirus outbreak, the organization announced Tuesday.\nThe announcement of Pulitzer winners in journalism and the arts will be postponed from April 20 to May 4, the board said.\nPulitzer Prize administrator Dana Canedy said the board includes many journalists who are on the front lines of reporting on the coronavirus pandemic. “As they focus on this critical mission, this postponement will provide additional time to thoroughly evaluate the 2020 Pulitzer finalists,” Canedy said.\nShe added, “More than ever, this moment highlights journalism’s mission to provide a vital public service. It also demonstrates literature and the arts’ ability to transport and uplift the human spirit during trying times. The Pulitzer Prizes will continue its more than century-long mandate to celebrate such excellence.”\nThe annual awards luncheon, traditionally held at Columbia University in May, will be postponed as well. Details of a fall reception for winners will be announced at a later date.\nThe Pulitzer Prizes in journalism were first awarded in 1917 and are considered the field’s most prestigious honor in the U.S.", "url": "https://apnews.com/6284f482ba5c2e10b84cbd8b9c914d72"}