{"authors": ["Eric Bradner", "Kate Sullivan"], "date_download": "2020-05-04 16:17:58", "date_modify": "2020-05-04 16:17:58", "date_publish": "2020-04-03 17:54:32", "description": "Wisconsin Gov. Tony Evers on Friday signed an executive order calling the state Legislature to meet for a special session on Saturday in a last-minute bid to delay the state's primary election.", "filename": "2020_04_03_politics_wisconsin-delays-election-results_index_1588609078.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200310101437-10-biden-sanders-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_wisconsin-delays-election-results_index_1588609078.html", "title": "Wisconsin governor asks Legislature to delay primary election", "title_page": "Wisconsin governor asks Legislature to delay primary election - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Wisconsin Gov. Tony Evers on Friday signed an executive order calling the state Legislature to meet for a special session on Saturday in a last-minute bid to delay the state's primary election .\nEvers, a Democrat, is ordering the Legislature to meet at 4 p.m. Central time to take up changes to the election in order to avoid voters having to go to the polls, according to a news release by the governor's office. Evers previously had resisted delaying the primary.\nRepublican leadership in the Wisconsin State Legislature issued a statement Friday criticizing Evers for reversing his position and said that \"the election should continue as planned on Tuesday.\"\nEvers said in the news release and a video posted to Facebook that he is asking the Legislature to allow an all-mail election, to send a ballot to every registered voter who has not already requested one by May 19 and to extend the time that ballots can be received to May 26.\n\"Folks, I can't move this election or change the rules on my own. My hands are tied,\" Evers said in the Facebook video. \"And that's why I spoke to legislative leaders about this weeks ago. I even publicly called upon them to act. They have made it clear they are unwilling to make changes.\"\nEvers said, \"The bottom line is that I can't ignore that municipal leaders from Green Bay to Milwaukee to Waukesha, that they have now significantly condensed the number of polling locations available, creating a dangerous situation where voters, staff and volunteers will not be able to avoid large groups or practice social distancing when they go out to vote.\"\n\"This is a significant concern and a very unnecessary public health risk,\" Evers said.\nThe Wisconsin Democratic Party, many of the state's Democratic officials and Sen. Bernie Sanders of Vermont have all called for the primary to be postponed. But Evers had refused to delay it, and Republicans who control the Legislature had rejected his request to mail every voter in the state an absentee ballot. Former Vice President Joe Biden, the Democratic presidential front-runner, also said this week he believed the primary could go forward as planned.\nPresident Donald Trump on Friday seemed to suggest Evers wanted to delay the election not because of the coronavirus outbreak, but because the President had endorsed a candidate in a judicial race in the state.\n\"In Wisconsin, what happened is I, through social media, put out a very strong endorsement of a Republican conservative judge who's an excellent, brilliant judge, he's a justice. And I hear what happened is his poll numbers went through the roof and because of that, I think, they delayed the election,\" Trump said at a White House briefing.\n\"I don't know. Why didn't he do it before?\" Trump said of Evers, when asked whether he was concerned about people voting in person. \"He's doing it right before the election. ... Why didn't he do this two weeks ago?\"\nAssembly Speaker Robin Vos and Senate Majority Leader Scott Fitzgerald, both Republicans, said in their statement, \"If the governor had legitimate concerns, we could have come to a bipartisan solution weeks ago. This discussion would have happened long before today. The only bipartisan discussion we've had was to ensure the election would continue safely and to maximize the opportunity to vote absentee.\"\nThey added, \"Our Republic must continue to function, and the many local government positions on the ballot must be filled so that municipalities can swiftly respond to the crisis at hand. We continue to support what Governor Evers has supported for weeks: the election should continue as planned on Tuesday.\"\nWisconsin is the only one of 11 states with April primaries that hasn't delayed it or made major changes such as shifting to an entirely by-mail contest.\nDeadline to return absentee ballots extended\nA federal appeals court kept Wisconsin's absentee ballot deadline extension in place in a Friday night ruling, which gives voters an extra six days to submit their ballots.\nEarlier on Friday, a federal judge had extended the deadline for absentee ballots to be returned, ensuring that Wisconsin's primary results are not to be released until at least April 13 -- six days after the state's election is held.\nUS District Judge William Conley on Friday morning clarified an earlier order at the Wisconsin Elections Commission's request, saying that results should not be released until 4 p.m. on April 13 or \"as soon thereafter as votes can be tabulated.\"\nThe rulings come the day after Conley's ruling that in-person voting would go ahead as planned next Tuesday. Conley extended the deadline to request absentee ballots by a day, and pushed the deadline to return them back from 8 p.m. on election day to April 13.\nThe appellate order is a loss for state and national Republicans who had asked a panel of judges of the 7th US Circuit Court of Appeals to reinstate the original deadline.\nThe Republicans did receive a partial ruling in their favor, however, as the appeals court blocked a separate portion of the lower court's decision that allowed absentee voters to provide written affirmation that they had been unable to obtain witness certifications for their ballots.\nThe appeals court said the district court did not give \"adequate consideration\" to the potential for fraud when the waiver was originally granted.\nThis story has been updated with an appeals court keeping the extension of the deadline to return absentee ballots in place.", "url": "https://www.cnn.com/2020/04/03/politics/wisconsin-delays-election-results/index.html"}