{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:20:04", "date_modify": "2020-05-04 20:20:04", "date_publish": "2020-04-09 21:29:22", "description": "___ US gig workers and self-employed face delays in jobless aid WASHINGTON (AP) — Even as nearly 17 million Americans have sought unemployment benefits in the past three weeks — a...", "filename": "_8443a92ad8eb1983bf6bd11ced9e2574_1588623604.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8443a92ad8eb1983bf6bd11ced9e2574_1588623604.html", "title": "Business Highlights", "title_page": "Business Highlights", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "___\nUS gig workers and self-employed face delays in jobless aid\nWASHINGTON (AP) — Even as nearly 17 million Americans have sought unemployment benefits in the past three weeks — a record high, by far — millions of people appear to be falling through the cracks. They can’t get through jammed phone systems or finish their applications on overloaded websites. Or they’re confused about whether or how to apply. And now there is a whole new category of people — gig workers, independent contractors and self-employed people like Cruse. The federal government’s $2.2 trillion economic relief package for the first time extended unemployment aid to cover those workers when they lose their jobs. Yet most states have yet to update their systems to process those applications.\n___\nRecord 16.8 million have sought US jobless aid since virus\nWASHINGTON (AP) — With a startling 6.6 million people seeking jobless benefits last week, the United States has reached a grim landmark: Roughly one in 10 workers have lost their jobs in just the past three weeks. The figures collectively constitute the largest and fastest string of job losses in records dating to 1948. They paint a picture of a job market that is quickly unraveling as businesses have shut down across the country because of the coronavirus outbreak. More than 20 million Americans may lose jobs this month.\n___\nWall Street caps best week since 1974 on latest Fed stunner\nNEW YORK (AP) — Wall Street closed out its best week in 45 years on Thursday after the Federal Reserve launched its latest titanic effort to support the economy through the coronavirus outbreak. The central bank announced programs to provide up to $2.3 trillion in loans to households, local governments and businesses as the country tips into what economists say may be the worst recession in decades. The Fed’s actions completely overshadowed a government report that another 6.6 million people applied for unemployment benefits last week. Stock investors expected such dismal numbers, and some are looking ahead to a possible reopening of the economy.\n___\nA new $2.3 trillion Fed plan to aid localities and companies\nWASHINGTON (AP) — The Federal Reserve said Thursday it would pump up to an additional $2.3 trillion into critical segments of the U.S. economy, seeking to support small- and mid-sized businesses as well as state and local governments. The extraordinary rescue package comes on top of efforts the Fed has already made to bolster the economy including cutting its benchmark interest rate to near zero and supplying more than $1 trillion to purchase Treasury and mortgage-backed securities to help keep credit flowing.\n___\nWiped out of toilet paper? Here’s why\nNEW YORK (AP) — Finding toilet paper in a global pandemic is a struggle. That’s because it’s part of a very tight supply chain. Toilet paper is so bulky and cheap that stores don’t keep big inventories on hand. So as more households buy a little extra, that causes a lot of disruption. Also, household demand is up 40% as offices and schools close, but toilet paper companies can’t easily switch to make more household paper because commercial paper is very different. There is some good news. Analysts say the panic buying from mid-March has eased somewhat, and toilet paper companies say they’re making fewer varieties in an effort to speed product to stores.\n___\nOil-producing nations seek global deal to stabilize market\nMOSCOW (AP) — Oil-producing countries including those of the OPEC cartel and Russia are trying to strike a global deal to pump less crude. They are trying to limit a crash in prices that, while welcome for consumers, has been straining government budgets and pushed energy companies toward bankruptcy. Thursday’s videoconference is part of a series of talks to boost energy prices, which have more than halved since the start of the year amid a pricing war between Saudi Arabia and Russia.\n___\nPandemic has set the number of air travelers back decades\nDALLAS (AP) — The steep drop in air travel is passing a milestone. Fewer than 100,000 people went through airport checkpoints on both Tuesday and Wednesday, the lowest numbers since the Transportation Security Administration started keeping track. That’s down 96% from a year ago, and could be the smallest number since the 1950s.\n___\nIMF head sees worst economic downturn since Great Depression\nWASHINGTON (AP) — The head of the International Monetary Fund says the coronavirus pandemic will push the global economy into the deepest recession since the Great Depression. IMF Managing Director Kristalina Georgieva said Thursday that the world’s poorest countries will be hardest hit. Her remarks came as she previewed next week’s virtual meetings of the 189-nation IMF and its sister lending organization, the World Bank. She said that the IMF will release an updated world economic forecast on Tuesday that will show just how quickly the coronavirus outbreak has turned what had been expected to be a solid year of growth into a deep downturn.\n___\nThe S&P 500 index rose 39.84 points, or 1,5%, to 2,789.82. The Dow Jones Industrial Average added 285.80, or 1.2%, to 23,719.37, and the Nasdaq climbed 62.67, or 0.8%, to 8,153.58. The Russell 2000 index of smaller company stocks gained 55.06 points, or 4.6%, to end at 1,246.73.", "url": "https://apnews.com/8443a92ad8eb1983bf6bd11ced9e2574"}