{"authors": ["Por Michael Warren"], "date_download": "2020-05-04 20:10:57", "date_modify": "2020-05-04 20:10:57", "date_publish": "2020-04-08 14:09:24", "description": "John Prine, el ingenioso cantautor que exploró los desamores, humillaciones y absurdos de la vida diaria en “Angel from Montgomery”, “Sam Stone”, “Hello in There” y muchas otras canciones, murió...", "filename": "_f693b0594f2b4ee69c3cfc92cdad8cb4_1588623057.html", "image_url": "https://storage.googleapis.com/afs-prod/media/67e6a863726c422dbf939d7619efc591/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_f693b0594f2b4ee69c3cfc92cdad8cb4_1588623057.html", "title": "Celebrado cantautor John Prine muere de coronavirus a los 73", "title_page": "Celebrado cantautor John Prine muere de coronavirus a los 73", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "John Prine, el ingenioso cantautor que exploró los desamores, humillaciones y absurdos de la vida diaria en “Angel from Montgomery”, “Sam Stone”, “Hello in There” y muchas otras canciones, murió de complicaciones del coronavirus. Tenía 73 años.\nPrine falleció el martes en el Centro Médico de la Universidad de Vanderbilt en Nashville, Tennessee, informó su familia.\nSu esposa Fiona dijo que el mes pasado ella había dado positivo a la prueba del COVID-19 y desde entonces se recuperó, pero que su esposo fue hospitalizado el 26 de marzo con síntomas del virus. Le colocaron un respirador y permaneció varios días en la unidad de cuidados intensivos.\nLaureado a principios de este año con un Grammy a la trayectoria, Prine fue un virtuoso del alma. Interpretaba sus letras conversacionales con una voz endurecida por una vida difícil, particularmente tras un cáncer de garganta que lo dejó con la mandíbula desfigurada.\nDecía en chiste que tocaba a tientas la guitarra tan a menudo, que la gente pensaba que estaba inventando un nuevo estilo. Pero su empatía, su ojo para el detalle y su agudo sentido del humor le merecieron la mayor admiración de la crítica y de colegas como Bob Dylan y Kris Kristofferson, además de jóvenes talentos como Jason Isbell y Kacey Musgraves, que incluso nombraron una canción en su honor.\nEn 2017, Rolling Stone lo proclamó el “Mark Twain de la composición estadounidense”.\nPrine comenzó a tocar como un joven veterano del ejército que inventaba canciones para combatir el aburrimiento mientras repartía el correo en Maywood, Illinois. Él y su amigo, el cantante de folk Steve Goodman, aún estaban puliendo sus habilidades en la Escuela de Música Folk Old Town cuando Kristofferson, entonces un artista emergente, los escuchó cantando una noche en Chicago y los invitó a compartir el escenario con él en Nueva York. El difunto crítico de cine Roger Ebert, que entonces trabajaba para el Chicago Sun-Times, también vio uno de sus espectáculos y lo declaró un “nuevo compositor extraordinario”.\nNotado de pronto por los cantantes más populares del folk, el rock y la música country, Prine firmó contrato con Atlantic Records y lanzó su primer álbum en 1971.\n“Realmente me gustaba escribir sobre personajes, darles nombres”, dijo al rememorar su extensa trayectoria en una entrevista televisada en enero de 2016 que fue publicada en su sitio web.\n“Sólo tienes que sentarte y mirar a tu alrededor, no tienes que inventar nada. Si tratas sencillamente de tomar nota y describir en términos básicos lo que está pasando, y no tratas de sobredescribir algo, eso le deja espacio al lector o escucha para llenarlo con su propia experiencia y se vuelven parte de eso”.\nPrine fue uno de muchos músicos promovidos como un “Nuevo Dylan” y uno de los pocos en sobrevivirlo y encontrar su propio camino. Pocos compositores podían igualar su juego de palabras, su empatía o su imaginación.\n“Escribe canciones hermosas”, dijo Dylan una vez al productor de MTV Bill Flanagan. “Recuerdo cuando Kris Kristofferson recién lo trajo a la escena. Todas esas cosas sobre Sam Stone el soldado-drogadicto-papá, y Donald y Lydia, donde la gente hace el amor a diez millas de distancia -- nadie más que Prine podría escribir eso”.\nLa picardía de Prine brilló en canciones como “Illegal Smile”, que juró que no era sobre marihuana; “Spanish Pipedream”, sobre una mesera topless con “algo bajo la manga”; y “Dear Abby”, en la que imagina a la columnista de consejos hartándose de los quejicas e hipocondríacos.\nNunca tuvo gran éxito comercial, pero se mantuvo en el ruedo por más de cuatro décadas, a menudo vendiendo sus discos durante presentaciones en clubes donde guiaba a músicos emergentes de country y bluegrass.\nMuchos otros adoptaron sus canciones. Bonnie Raitt hizo una versión de “Angel from Montgomery”, sobre los sueños reprimidos de un ama de casa solitaria, y la interpretó en la ceremonia de los Grammy del 2020. Bette Midler grabó “Hello in There”, la emotiva canción de Prine sobre la vejez. Y Prine escribió “Unwed Fathers” para Tammy Wynette, y “Love Is on a Roll” para Don Williams.\nEl músico se casó tres veces y apreciaba una relación duradera. En 1999, interpretó con Iris DeMent el clásico homónimo de su álbum “In Spite of Ourselves”, un homenaje procaz a un viejo matrimonio.\nLe sobreviven su esposa Fiona, sus hijos Jack y Tommy, su hijastro Jody y tres nietos.\n___\nLa periodista de AP Kristin M. Hall contribuyó a este despacho desde Nashville, Tennessee.", "url": "https://apnews.com/f693b0594f2b4ee69c3cfc92cdad8cb4"}