{"authors": [], "date_download": "2020-05-04 20:23:56", "date_modify": "2020-05-04 20:23:56", "date_publish": "2020-04-04 21:15:59", "description": "RALEIGH, N.C. (AP) — Three residents of a central North Carolina nursing home have tested positive for COVID-19, public health officials announced on Saturday as overall cases statewide exceeded...", "filename": "_3e4c47e277fc4270dda5c8da156a1f01_1588623836.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3e4c47e277fc4270dda5c8da156a1f01_1588623836.html", "title": "Virus outbreak reported at central N. Carolina nursing home", "title_page": "Virus outbreak reported at central N. Carolina nursing home", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RALEIGH, N.C. (AP) — Three residents of a central North Carolina nursing home have tested positive for COVID-19, public health officials announced on Saturday as overall cases statewide exceeded 2,400.\nThe three cases occurred witin the population of the Springbrook Rehabilitation and Nursing Center in Clayton, the Johnston County Health Department said in a news release.\nInformation released Saturday morning from the state Department of Health and Human Services showed six COVID-19 outbreaks at nursing homes or skilled nursing facilities statewide. It wasn’t immediately clear if the six included the Clayton cases. An outbreak is defined as two or more laboratory confirmed cases.\nNearly 30 cases have been linked to an adult care home in Northampton County, the county health department said. One resident at the adult care home who tested positive died in a Virginia hospital late last month, his daughter said.\nThe Clayton center has received guidance on infection prevention precautions and ways to limit the spread of the virus, the Johnston news release.\nNorth Carolina had just over 2,400 positive COVID-19 cases and 24 deaths as of Saturday morning, according to information provided by state DHHS. There were about 2,100 cases and 19 deaths on Friday. More than 270 people are hospitalized.\nA statewide stay-at-home order took effect March 30, nearly two weeks after restaurants and bars were prohibited from offering dine-in services to patrons. While barbershops, movie theaters and entertainment locales have been ordered shuttered, other businesses can continue to remain open if considered essential or if they can practice social distancing.\nGov. Roy Cooper, who has issued these and other executive orders, said at a Friday news briefing that his administration would be reviewing modeling data to calculate how much movement is happening.\n“These interventions that we put in place can be tightened even more if necessary,” Cooper said, if it’s determined that the current restrictions aren’t effective enough.\n___\nFollow AP news coverage of the coronavirus pandemic at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/3e4c47e277fc4270dda5c8da156a1f01"}