{"authors": ["Matt Egan", "Chris Isidore", "Cnn Business"], "date_download": "2020-05-04 16:20:14", "date_modify": "2020-05-04 16:20:14", "date_publish": "2020-04-05 12:40:50", "description": "OPEC has portrayed itself as a source of stability in a chaotic world.", "filename": "2020_04_05_investing_stocks-week-ahead_index_1588609214.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191204140259-02-opec-oil-prices-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_investing_stocks-week-ahead_index_1588609214.html", "title": "Oil for less than $10 a barrel is on the horizon. Will OPEC blink first?", "title_page": "Stocks week ahead: Oil for less than $10 a barrel is on the horizon. Will OPEC blink first? - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here .\nNew York (CNN Business) OPEC has portrayed itself as a source of stability in a chaotic world.\nBut the cartel undercut that argument last month by adding to the considerable market mayhem. OPEC leader Saudi Arabia and oil ally Russia duked it out in a price war that eventually helped send crude crashing to 18-year lows.\nNow OPEC has an opportunity to restore calm to oil markets experiencing historic levels of volatility. But it won't be easy.\nOPEC+ plans to hold a meeting via video conference Thursday where the group could finally make the production cuts that were badly needed weeks ago to make up for the collapse in demand caused by the coronavirus pandemic.\nPresident Donald Trump dramatically raised expectations for significant output cuts. Trump said last Thursday he hopes and expects Saudi Arabia and Russia will slash production by 10 million to 15 million barrels per day.\nEven though no deal has been announced -- and analysts immediately cast doubt on Trump's claim -- oil prices spiked Wednesday by the most on record. For the week, US crude surged 32% -- the best week since oil futures began trading on NYMEX in 1983.\n\"Given that the oil market is now expecting a large reduction in output, anything less could send prices into freefall,\" Caroline Bain, chief commodities economist at Capital Economics.\nOil producers are racing against time. The supply glut is so massive that the world will soon run out of space to store all those barrels . And that could send prices crashing into single-digits, exacerbating what will likely be a wave of bankruptcies in the US oil industry.\nBut no one wants to be the first to blink in this battle.\nSaudi Crown Prince Mohammed bin Salman, tired of being the one taking the brunt of production cuts, wants other countries to join in. And there are reports that the United States, Canada and Mexico could be invited to this week's meeting.\nOutput will naturally drop in the United States as high-cost drillers respond to the crash. And regulators in Texas are being urged to consider production limits -- something that hasn't happened in more than 40 years. But it's unclear how such oil output could be limited at the national level.\nRussia may finally agree to production cuts, with Vladimir Putin reportedly proposing Friday that global production get cut by 10 million barrels per day.\nHowever, in exchange Moscow may insist on sanctions relief from Washington.\n\"There is a price for getting Russia back to the table. And it's unclear Washington is willing to pay that price,\" said Helima Croft, global head of commodity strategy at RBC Capital Markets.\nIn the end, even if all the pieces fall into place and a grand bargain is reached, it's possible it will be too little, too late.\nDemand is collapsing at an unprecedented rate and there's little Putin, MBS and Trump can do about that.\nDelta's financial report could show airlines' troubled fate\nIt's been a terrible past few weeks for airlines . Wednesday investors will start to see just how bad.\nDelta Air Lines DAL is scheduled to be the first major airline to report first-quarter results. It is expected to report a loss for the first time in years.\nThe loss will be narrower than some might expect: Travel was little affected in January and still strong domestically in February. But March, traffic ground to a near halt.\nOn Friday CEO Ed Bastian told airline employees that it expects revenue to be down 90% in the second quarter and that the industry has yet to see a bottom of the crisis.\nUp next\nMonday: German industrial orders report\nTuesday: Levi Strauss LEVI earnings\nWednesday: Delta Air Lines earnings\nThursday: US initial unemployment claims and University of Michigan consumer sentiment report for April\nFriday: US Consumer Price Index inflation report", "url": "https://www.cnn.com/2020/04/05/investing/stocks-week-ahead/index.html"}