{"authors": ["Josh Campbell"], "date_download": "2020-05-04 16:12:01", "date_modify": "2020-05-04 16:12:01", "date_publish": "2020-04-03 04:02:07", "description": "First responders hit with malicious software. Ransomware deployed against medical facilities. Average citizens duped by stimulus check scams. Children facing electronic eavesdropping.", "filename": "2020_04_03_politics_cyber-criminals-pandemic_index_1588608721.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/170616101636-2-tech-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_cyber-criminals-pandemic_index_1588608721.html", "title": "Cyber criminals are trying to wreak havoc during global pandemic", "title_page": "Cyber criminals are trying to wreak havoc during global pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) First responders hit with malicious software. Ransomware deployed against medical facilities. Average citizens duped by stimulus check scams. Children facing electronic eavesdropping.\nAs government leaders and first responders battle the Covid-19 virus causing sickness and death across much of the globe, US federal law enforcement officers are also working to fend off malicious cyber actors taking advantage of the pandemic to cause harm.\nIn a series of public bulletins issued in the past month by the Federal Bureau of Investigation, Department of Homeland Security, and Secret Service, federal officials have urged citizens to remain vigilant against a growing list of threats emanating from cyberspace.\nOn Wednesday, the FBI's Internet Crime Complaint Center released a public notice warning that cyber criminals were taking advantage of the coronavirus outbreak to exploit the use of virtual environments adopted by government agencies, businesses, students, and private citizens seeking to maintain communication following an unprecedented call by governments and leaders for people to remain at home.\n\"The COVID-19 pandemic has led to a spike in businesses teleworking to communicate and share information over the internet,\" the FBI said in its warning. \"With this knowledge, malicious cyber actors are looking for ways to exploit telework software vulnerabilities in order to obtain sensitive information, eavesdrop on conference calls or virtual meetings, or conduct other malicious activities.\"\nRead More", "url": "https://www.cnn.com/2020/04/03/politics/cyber-criminals-pandemic/index.html"}