{"authors": ["Paris Marx", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "David Harvey", "Nicole Aschoff", "Marc Kagan"], "date_download": "2020-05-04 19:59:40", "date_modify": "2020-05-04 19:59:40", "date_publish": "2020-03-29 00:00:00", "description": null, "filename": "2020_03_nationalize-amazon-coronavirus-delivery-usps_1588622380.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/29121432/19595813310_34098c8009_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_nationalize-amazon-coronavirus-delivery-usps_1588622380.html", "title": "Nationalize Amazon", "title_page": "Nationalize Amazon", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "With every passing day, it becomes increasingly clear that COVID-19 won’t allow things to go back to normal anytime soon — regardless of how intently Trump and his Republican death cult are prepared to risk millions of lives in service of the stock market. The lengthy disruption will force governments to consider novel ways to get necessary supplies to people without requiring everyone to go to the store themselves — especially those most vulnerable to the virus, and the growing numbers of poor and unemployed who simply won’t have the money.\nSo, where to turn? The United States Postal Service (USPS) boasts an effective logistics infrastructure but lacks the supply chain to quickly start delivering those essential goods. Yet we already have a monopolistic entity with a strong supply chain that could be repurposed to serve social goals instead of private profit: Amazon.\nThe e-commerce giant has already seen demand surge as stores have shut down around the country, and as a result the company is hiring a hundred thousand new workers to staff its US fulfillment centers. However, this isn’t simply benevolence on the part of Amazon. The company is making a concerted push to increase its market share to dominate even more of the economy when things go back to normal, and is cutting out third-party merchants that likely won’t survive without access to its platform in the process.\nThe stories of Amazon’s mistreatment of its warehouse workers are nothing new — from peeing in bottles and being denied air conditioning to having every second of their shifts closely tracked with penalties if they don’t hit their targets. But now the virus has made things worse.\nAs orders have flooded in, workers are expected to clock overtime, even as they say the company isn’t doing enough to keep them safe from COVID-19. So far cases have been identified in at least ten US fulfillment centers and three in Europe. But workers say they haven’t been given the proper protective equipment, often aren’t informed when a coworker tests positive until they confront management, and are being told to keep three feet from each other, even though the Centers for Disease Control and Prevention recommends six feet. Not all of the warehouses where cases have been identified were even closed for cleaning.\nThe government needs to act not just to protect those frontline workers, but to ensure it has an infrastructure to respond to the needs of people across the country as the pandemic situation deteriorates. The response should be to nationalize Amazon and integrate it with the USPS.\nThe key task of a publicly owned Amazon in this moment of crisis would be to maintain the supply chain so it can continue delivering the necessities that people rely on, with priority given to those items. However, it should also begin preparing for the large-scale delivery of packages containing food staples and essential items to every home in the country, making use of the combined labor power of USPS and Amazon delivery workers, but also the infrastructure that only the USPS has: post offices all across the country, even in small rural communities that aren’t economical for private-package delivery companies to service.\nNationalizing the company would also allow Amazon workers to get covered by the same union as postal workers, finally giving workers a voice at the table to negotiate for improved working conditions, proper cleaning and protective equipment, and the wages and benefits they deserve for doing such essential work.\nSuch a move wouldn’t just benefit the United States. Amazon has online platforms in seventeen different countries. While the US infrastructure would be integrated into the USPS, the infrastructure in those other countries could be worked into their respective postal services, and the international coordination between them could be handled by the same body that has regulated international postage since 1874, the Universal Postal Union (UPU) — which Trump almost pulled the United States out of last year. Each of those national postage systems could rebrand and rework the digital aspect of the Amazon platforms they take over. And, along with the UPU, they could also provide support for other countries to create their own digital infrastructure and establish supply chains to access necessary goods.\nBut Amazon isn’t just an online e-commerce marketplace. The company has also built and bought many other services over the years that could be useful during this time of crisis. Amazon Web Services (AWS) is a cloud computing platform that hosts the digital footprints of many major companies and institutions, including Netflix and several US federal government departments and agencies. Nick Srnicek, the author of Platform Capitalism , has written that the cloud should be placed under public ownership. Taking control of AWS would allow the government to ensure that key digital infrastructures don’t go down during the crisis. It would also allow the government to ensure the cloud platform is serving the public good, and not trying to help oil and gas companies extract more fossil fuels.\nAmazon also bought supermarket behemoth Whole Foods in 2017. Placing the chain under public ownership would help ensure access to food for hungry Americans, as well as provide access to spaces for food preparation to scale up social programs like Meals on Wheels. With 3.3 million people having filed for unemployment last week, and the unemployment rate expected to rise as high as 30 percent, the demand for such services could increase very quickly — and people will not be allowed to stand in food kitchens or bread lines due to the virus.\nOne of the other valuable services that would be obtained from a nationalized Amazon is PillPack, an online pharmacy the company bought in 2018. There are many elderly and vulnerable people who will still need access to their medications while having to stay indoors, and nationalizing the service could allow the United States to start serving those people, shipping their prescriptions in individual dose packages to reduce any confusion that people might have about what to take and when. Additionally, by taking the profit motive out of the equation, those drugs could be provided free of charge.\nTaking Amazon into public ownership would quickly enhance the government’s ability to respond to the COVID-19 and economic crises, while allowing it to rectify the negative aspects of the juggernaut: its abuse of its workers, fueling of climate change, and attempts to further monopolize the economy under the control of CEO Jeff Bezos. Combining Amazon with the existing postal infrastructure provides further opportunities to create a public institution that responds to people’s needs with services that make their lives better. A reimagined post office could also be expanded to include postal banking in service of those who have less access to traditional banking services. It could also serve as the distribution point for other necessities such as SIM cards relying on a public telecommunications infrastructure and inexpensive eyeglasses, for example.\nIn the face of this expanding crisis, getting such infrastructure in place sooner rather than later is essential. Instead of letting Amazon continue as a private monopolist or trying to build a public alternative from scratch in record time, the company should be nationalized and reoriented to serve the public good instead of predatory capitalism, while enhancing the infrastructure of the post office. We have a rare opportunity to fundamentally alter the economy to serve the needs of people instead of private profit, and it’s time to seize it.", "url": "https://www.jacobinmag.com/2020/03/nationalize-amazon-coronavirus-delivery-usps"}