{"authors": ["Hollie Silverman"], "date_download": "2020-05-04 15:57:07", "date_modify": "2020-05-04 15:57:07", "date_publish": "2020-04-12 07:16:04", "description": "The Navajo Nation enacted a 57-hour curfew over the holiday weekend in an effort to combat the spread of coronavirus among its more than 250,000 members.", "filename": "2020_04_12_us_navajo-nation-coronavirus_index_1588607827.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200412013739-02-navajo-nation-police-curfew-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_12_us_navajo-nation-coronavirus_index_1588607827.html", "title": "The Navajo Nation is under a weekend curfew to help combat the spread of coronavirus", "title_page": "The Navajo Nation is under a weekend curfew to help combat the spread of coronavirus  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The Navajo Nation enacted a 57-hour curfew over the holiday weekend in an effort to combat the spread of coronavirus among its more than 250,000 members.\nAs of Saturday, there were 698 confirmed cases of coronavirus, including 24 deaths, among members of the Navajo Nation living in New Mexico, Arizona and Utah, Navajo Nation President Jonathan Nez and Vice President Myron Lizer said in a news release.\nBoth Nez and Lizer are in self-quarantine, Nez announced Thursday, after coming in contact with a first responder who later tested positive for the virus.\n\"You may be young and in good health, but this virus can infect anyone,\" Nez said. \"This is not to be taken lightly.\"\nCurfew in place\nA public health order banning members of the Navajo Nation from leaving their homes except for emergencies or to go to work as essential employees went into effect at 8 p.m. on Friday and will continue until 5 a.m. Monday.\nThe weekend order is in addition to a curfew that already mandates that members stay in their homes from 8 p.m. until 5 a.m. daily.\nThose who need to go to work must have official identification or a letter on company letterhead with employer contact information for verification in order to travel, a public health order issued by the Navajo Nation said.\nLaw enforcement officials will issue citations and fines -- $1000 and/or 30 days in jail -- to anyone who violates the stay at home order or curfew, even if they are not members of the nation, Navajo Police Chief Phillip B. Francisco said earlier this month according to a news release.\nNo visitors\nTourists and visitors have been banned from entering Navajo Nation territory unless they are delivering necessary supplies.\nOn April 3, Nez and Lizer signed a law extending travel restrictions issued in a public health order on March 20 preventing people who aren't members from coming onto the land.\nA Navajo Nation police officer gives a trucker information about the Nation's curfew.\n\"No offense to tourists and visitors, we are doing this for the health and protection of everyone,\" Lizer said in a release.\n\"To be very clear, the restrictions do not apply to truck drivers and essential businesses that deliver essential products to the Navajo Nation,\" Lizer said.\nA need for supplies\nThe Navajo Nation has been receiving essential deliveries from the Arizona National Guard to treat those already infected and to continue to test its population.\nArizona Gov. Doug Ducey said in a tweet that he was in contact with the tribe about its needs.\n\"Our tribal communities remain top of mind: I've been in touch with Navajo President Nez & Vice President Lizer about the need for supplies, personnel and ventilators,\" Ducey said in a tweet. \"Arizona is committed to assisting ALL our tribes as they fight.\"\nA much needed supply of PPE was dropped by #AZNG in Shiprock in the Navajo Nation this afternoon as a gap-filling measure until more supplies arrive. We are #InThisTogether with ⁦@NMNationalGuard⁩ as we continue to surge healthcare capacity to the Diné people. pic.twitter.com/YSzvbBwOoo — ArizonaNationalGuard (@AZNationalGuard) April 12, 2020\nOn Saturday, Nez and Lizer said in a news release that a coronavirus test that can provide results in less than 15 minutes will soon be available at Navajo area Indian Health Service facilities and tribal operated health care centers.\nTests currently take two to four days to process, Nez and Lizer said in the news release.\n\"Quicker test results will likely result in even higher numbers of positive cases, but it will help to identify those who have the virus and begin to mitigate the cases much quicker,\" Nez said. \"We must do better.\"\nOther tribes are dealing with the pandemic\nThe Navajo Nation is not the only tribe in the United States dealing with coronavirus.\nOn Thursday, Cherokee Nation Health Services announced that 28 members had tested positive.\nAll business operations of the tribe have been suspended until May 1, including all 10 gaming and hospitality destinations, cultural museums and retail operations.\n\"We are working closely with local, state and federal officials, alongside tribal health experts and business leaders, to make the best decisions we can during these uncertain times,\" Cherokee Nation Principal Chief Chuck Hoskin Jr. said in a news release . \"Our top priority is the health, safety and well-being of our employees, and so far no employee has had to use sick or vacation time during this closure.\"\nThe nation declared a state of emergency on March 16 and suspended operations at all tribally owned casinos, hotels, and museums.\nThe Choctaw Nation has reported one coronavirus death and identified two positive cases among its members. Kristina Humensky, a spokeswoman for the tribe, told CNN by phone Friday that 114 people have tested negative and 30 more tests are pending.\nWhile no curfews or stay at home orders are in place, all hotels and casinos were closed indefinitely on March 16.\nThe tribe continues to work with its supply chains in order to ensure the flow of personal protective equipment for healthcare workers and its pharmacy has begun making its own hand sanitizer to try to meet demand, Humensky said.", "url": "https://www.cnn.com/2020/04/12/us/navajo-nation-coronavirus/index.html"}