{"authors": [], "date_download": "2020-05-04 20:04:08", "date_modify": "2020-05-04 20:04:08", "date_publish": "2020-04-07 16:24:58", "description": "SEATTLE (AP) — A look at coronavirus-related developments in Washington: NEARLY 400 DEATHS Health authorities in Washington on Tuesday announced more than 20 new coronavirus deaths in...", "filename": "_c65115604a23cd01bd0fe761bda6c4dd_1588622648.html", "image_url": "https://storage.googleapis.com/afs-prod/media/65a6d902307b4d61a789922a67a21094/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_c65115604a23cd01bd0fe761bda6c4dd_1588622648.html", "title": "Nearly 400 virus deaths in Washington state", "title_page": "Nearly 400 virus deaths in Washington state", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Airplanes and a handful of vehicles are parked, Monday, April 6, 2020, at Boeing Co.'s airplane assembly facility in Renton, Wash. Boeing said Sunday it will continue its shutdown of production indefinitely at its Seattle area facilities due to the spread of the coronavirus. The company said the decision is based on the health and safety of its employees, assessment of the coronavirus spread, supply chain concerns and recommendations from government health officials. (AP Photo/Ted S. Warren)\nAirplanes and a handful of vehicles are parked, Monday, April 6, 2020, at Boeing Co.'s airplane assembly facility in Renton, Wash. Boeing said Sunday it will continue its shutdown of production indefinitely at its Seattle area facilities due to the spread of the coronavirus. The company said the decision is based on the health and safety of its employees, assessment of the coronavirus spread, supply chain concerns and recommendations from government health officials. (AP Photo/Ted S. Warren)\nSEATTLE (AP) — A look at coronavirus-related developments in Washington:\nNEARLY 400 DEATHS\nHealth authorities in Washington on Tuesday announced more than 20 new coronavirus deaths in the state, bringing the total to at least 394.\nAccording to figures from the Department of Health, there are more than 8,600 confirmed cases in Washington. The bulk of the cases and deaths are in King and Snohomish counties.\nFor most people, COVID-19 displays mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can be more severe, causing pneumonia or death.\nWASHINGTON LEGISLATURE MIGHT BE CALLED BACK BEFORE JANUARY\nWashington Gov. Jay Inslee says the Legislature may need to be called back for a special session because of the coronavirus outbreak. The Legislature isn’t schedule to return until next January, but Inslee said it was probable they may need to return, “given the extent of the economic damage that we have suffered.” He said the timing of that is uncertain, but he said that he was ready to call the Legislature back early if more aggressive steps for spending was needed before the end of the year. He noted that the state had already dispersed $120 million from $200 million the Legislature allocated to COVID-19 response before they adjourned last month.\nSMALL BUSINESS EMERGENCY GRANTS\nInslee announced the state is opening up an application process for grants that will provide up to $10,000 for businesses with up to 10 employees. Businesses can use the money to pay rent, utility bills, supplies and other operating expenses. The $5 million in funding for the grants comes from the governor’s strategic reserve fund and will be administered by the state Department of Commerce. Businesses can apply at coronavirus.wa.gov.\nBUSINESS RESILIENCY PROGRAM:\nThe Department of Commerce is providing a business resiliency assistance program that is partnering with various organizations to ensure that businesses have access to help that is available. Help is also available for small businesses who might be eligible for forgivable small loans through the Small Business Administration.\nFOOD BANKS STRUGGLING\nInslee also on Tuesday announced an effort to resupply Washington’s food banks, which are running low due to the coronavirus outbreak.\nInslee says because of increasing demand supplies at the state’s food banks have dropped to dangerously low levels, with an estimated 1.6 million people — double the usual number — in expected to seek food aid.\nThe relief effort called WA Food Fund, is being managed by Philanthropy Northwest, a network of philanthropic organizations. The effort will combine business and philanthropic dollars with individual fundraising to have the most effect.\nPERSONAL PROTECTION EQUIPMENT\nTo date, the state has ordered more than 90 million items including face shields, surgical and respirator masks, gowns and gloves. About 6 million items have arrived since the middle of last month and the remainder are on the way, officials said Tuesday. More than 82 million of those items have been ordered by the Department of Enterprise Services through suppliers. More than 1.5 million of the items already received come from the federal stockpile, and more than 591,000 items have been donated.\nNUCLEAR RESERVATION\nThe majority of the 11,000 employees at the Hanford Nuclear Reservation, the largest single employer in eastern Washington, are working from home because of the coronavirus pandemic.\nThe U.S. Department of Energy said about 10% to 15% of Hanford’s workforce is working on the sprawling site that contains the nation’s largest quantity of radioactive waste left over from the production of nuclear weapons. Another 60% are working from home or otherwise telecommuting at the site near Richland in southeastern Washington state, the agency said. The rest are off work, but continue to be paid, the agency said. The site went to this ”essential mission-critical operations posture″ in late March and it continues this week, the agency said.\nHanford was established during the Manhattan Project in World War II. The site made the plutonium for the atomic bomb dropped on Nagasaki, Japan.\n___\nThis story has been updated to correct the number of deaths to at least 394, instead of 294.\n___\nAP writer Rachel La Corte contributed from Olympia, Wash.", "url": "https://apnews.com/c65115604a23cd01bd0fe761bda6c4dd"}