{"authors": ["Entertainment Writer"], "date_download": "2020-05-04 20:21:11", "date_modify": "2020-05-04 20:21:11", "date_publish": "2020-04-29 16:38:02", "description": "The \"Red Table Talk\" host opened up about a breakthrough she experienced with husband Will Smith during the coronavirus pandemic.", "filename": "entry_jada-pinkett-says-she-had-huge-revelation-about-her-marriage-during-lockdown_n_5ea99391c5b6123a17658fa5_1588623671.html", "image_url": "https://img.huffingtonpost.com/asset/5ea995ba220000060d827dcf.jpeg?cache=egmg0jraxg&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_jada-pinkett-says-she-had-huge-revelation-about-her-marriage-during-lockdown_n_5ea99391c5b6123a17658fa5_1588623671.html", "title": "Jada Pinkett Smith Says She Had Huge Revelation About Her Marriage During Lockdown", "title_page": "Jada Pinkett Smith Says She Had Huge Revelation About Her Marriage During Lockdown | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Couples cooped up together during the coronavirus pandemic are learning new things about each other.\nBut for Jada Pinkett Smith, self-isolating with Will Smith made her realize that she doesn’t know her husband “at all” after 23 years of marriage.\nThe “Girls Trip” star got candid about how the current global health crisis is putting a strain on her relationship during the most recent episode of her Facebook Watch show, “Red Table Talk,” alongside daughter Willow Smith and mother Adrienne Banfield Norris.\n“One of the things I realize is that I don’t know Will at all,” Pinkett Smith said in a clip from this week’s episode, calling the current moment very “challenging.”\n“You’re forced to look at things differently,” she continued.\nThe actress added that when the two encounter a bump in the road, her instinct goes “straight to fight,” which doesn’t exactly breed intimacy.\nAxelle/Bauer-Griffin via Getty Images Will Smith and Jada Pinkett Smith attend premiere of \"Gemini Man\" in October 2019.\nBut instead of letting a disconnect divide them, the two are getting back to basics.\n“The thing that Will and I are learning to do is be friends,” Pinkett Smith said. “You get into all these ideas of what intimate relationships are supposed to look like, what marriages are supposed to be.”\n“Will and I are in the process of him taking the time to learn to love himself, me taking the time to learn to love myself and us building a friendship along the way,” she continued.\nHolding a mirror up to their relationship also allowed Pinkett Smith to reexamine some long-held misconceptions about how the two see each other.\n“Let me tell you, that’s been something to be married to somebody 20-some-odd years and realize I don’t know you and you don’t know me and also realizing there’s an aspect of yourself you don’t know either,” she said.\nThe couple have been one of the most forthcoming in Hollywood about their marital issues, diving into everything from jealousy over past relationships, differing parenting philosophies and “betrayals of the heart” on the popular talk show.\nWhile the “Bad Boys” star wasn’t present to weigh in on this discussion, he did pop up on last month’s coronavirus-themed episode, where he cleared up some misconceptions about the respiratory disease.\n“I wanted to do this because in 2008 I made ‘I Am Legend,’ so I feel responsible for a lot of the misinformation,” he said, encouraging people not to dismiss advice from the medical community and practice social distancing.\n“My character was a virologist, so I had an opportunity in my preparation for the role to go to the CDC,” he explained. “There was a basic foundational comprehension of viruses and viral pathogens that I developed and it really changed my life and how I looked at the world. There’s basic concepts that people do not understand.”", "url": "https://www.huffpost.com/entry/jada-pinkett-says-she-had-huge-revelation-about-her-marriage-during-lockdown_n_5ea99391c5b6123a17658fa5"}