{"authors": ["Analysis Harry Enten"], "date_download": "2020-05-04 16:25:55", "date_modify": "2020-05-04 16:25:55", "date_publish": "2020-04-07 12:01:51", "description": "President Donald Trump has dominated the airwaves during the coronavirus pandemic. Meanwhile, former Vice President Joe Biden, the frontrunner in the Democratic primary, has struggled to break through, which some see as a problem for his campaign. But I disagree. As Trump campaign manager Brad Parscale notes, they don't want to let \"Biden hide in the shadows\".", "filename": "2020_04_07_politics_trump-2020-analysis_index_1588609555.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405192138-03-coronavirus-briefing-0405-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_trump-2020-analysis_index_1588609555.html", "title": "2020 is shaping up to be all about Trump", "title_page": "2020 is shaping up to be all about Trump - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump has dominated the airwaves during the coronavirus pandemic. Meanwhile, former Vice President Joe Biden, the frontrunner in the Democratic primary, has struggled to break through , which some see as a problem for his campaign. But I disagree. As Trump campaign manager Brad Parscale notes , they don't want to let \"Biden hide in the shadows\".\nA look at the data suggests that Trump is losing to Biden right now because voters see this election as a referendum on an unpopular Trump. Trump likely stands a better chance if this election is a choice between Trump and Biden.\nTrump's net favorability (favorable-unfavorable) rating remains fairly low. A recent poll by Selzer and Company puts his net favorability at -7 points. An average of polls over the last few weeks puts his net favorability at -6 points.\nBiden's lead in national polls over the last two weeks have Biden ahead by 6 points on average. The fact that Trump's net favorability is the same as the margin in the horserace makes a lot of sense when you examine the individual poll data.\nTake a look at the most recent Monmouth University and CNN/SSRS polls . The two have different overall results (Biden +3 points and Biden +10 points), but how they get to their results are pretty much identical.\nIn the Monmouth poll, Trump wins 90% of those who hold a favorable of him, while Biden wins 89% of those who hold an unfavorable of Trump.\nCNN's poll demonstrates the same thing. Trump is down 10 points to Biden and has a -10 point net favorable rating. Trump wins 92% of those who have a favorable view of him, while Biden wins 92% of those who have an unfavorable view of Trump.\nThe reason Trump won four years ago is that he was able to make it a choice between Hillary Clinton and him. Clinton only won 77% of those who held an unfavorable view of Trump, which is significantly less than Biden is taking right now.\nClinton underperformed among this group because Trump scored a 17-point win among the 18% of the electorate who disliked Clinton and Trump.\nRight now, Biden is cleaning up among those who like neither Trump nor he. In the Monmouth poll, Biden's up 58% to 16% among this group. Our last CNN poll put Biden ahead 74% to 15% with them.\nIn other words, 2020 is shaping up to be more about the incumbent and less of a choice than 2016 was.\nTrump needs to shift that dynamic. He wants voters to be choosing between two options. Trump wants to recreate 2016. That may be difficult to do given voters will have had four years to judge Trump's record. Still, Trump's campaign obviously must try.\nBiden, meanwhile, should welcome that this election will likely be about Trump. The more Biden's name is in the press, the better the chance the election is a choice, and the better the chance Trump has of winning.\nWhen you look back at the three incumbents who were defeated in the polling era, you can see in each instance that more voters held an opinion of the incumbent than the challenger. That's what you'd expect, given the incumbent has the bully pulpit of the presidency.\nOf course, it's not like Biden is some unknown figure. He's the former vice president. Most voters know who he is. Even after being starved for much press over the last few weeks, 87% of voters were able to form an opinion of him in the Monmouth poll. That's a high figure for a non-incumbent this far away from the election, especially in a poll that specifically provides voters with the option to say they have no opinion of a candidate.\nIf Trump does become popular, then it's difficult to imagine Biden winning a choice election anyway. Why would the country switch horses when they already like the horse they are on? The only instance of that happening in the last 100 years of presidential elections was in 1976, when the decently popular Gerald Ford, who inherited his term for the very unpopular Richard Nixon, lost to Jimmy Carter.\nThe bottom line is that Trump's likely going to swim or sink on his own.", "url": "https://www.cnn.com/2020/04/07/politics/trump-2020-analysis/index.html"}