{"authors": ["Nathaniel Meyersohn", "Cnn Business"], "date_download": "2020-05-04 15:59:45", "date_modify": "2020-05-04 15:59:45", "date_publish": "2020-04-01 11:33:55", "description": "Major Bobby Reed of the Bourbon County, Kansas, sheriff's department had an idea when he saw that some stores were offering special hours just for elderly customers during the coronavirus crisis: He would start making grocery and prescription deliveries for at-risk residents himself.", "filename": "2020_04_01_business_grocery_6e2e112de1d0b24c9f9a00b7fb821287_index_1588607985.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331163025-01-major-bobby-reed-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_grocery_6e2e112de1d0b24c9f9a00b7fb821287_index_1588607985.html", "title": "In rural America, cops are delivering groceries to vulnerable residents", "title_page": "In rural America, cops are delivering groceries to vulnerable residents - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) Major Bobby Reed of the Bourbon County, Kansas, sheriff's department had an idea when he saw that some stores were offering special hours just for elderly customers during the coronavirus crisis: He would start making grocery and prescription deliveries for at-risk residents himself.\n\"These people don't need to get out. They're in a vulnerable age group,\" the 10-year veteran of the department thought. So he posted on Facebook that he'd volunteer to deliver to elderly residents, shoppers with disabilities and veterans. His rural county, located five miles east of the Missouri border, has about 14,000 residents.\nThe calls to Reed quickly came in quickly from residents who had to stay inside because of the coronavirus concerns or because they couldn't find an open slot for pickup at. The Walmart in the Fort Scott, Kansas, area doesn't deliver. Neither does the local grocery store.\n\"There's nobody else here local to do it. We're a rural community and we don't have Uber, Lyft,\" he said.\nMajor Bobby Reed of the Bourbon County Sheriff's Department in Kansas has been delivering groceries to vulnerable residents during the coronavirus pandemic.\nIn the first week, he made almost 40 deliveries. Other deputies at the department are also helping out. \"It's really taken off,\" he said. \"It's very rewarding. It's very humbling.\"\nFor residents in the area like Cheryl O'Brien, 56, who has heart and lung illnesses and had a pacemaker put in last year, Reed is her \"lifeline.\"\n\"I was a little perplexed on how I was going to get everything I needed,\" she said. \"I thought I was going to have to put a mask on and risk catching something until I was told about this service.\"\nO'Brien has been using Reed to pick up her medication.\n\"I felt bad because he has gone so many times,\" she said. \"Somehow, someway, I'm going to try to repay him when this is all over. It's something that I'm never going to forget. I just pray to God they stay safe.\"\nThe Bourbon County Sheriff's Office in Kansas is not the only rural law enforcement agency that has taken on the unlikely role of grocery delivery service during this pandemic. Reed got two calls from other sheriffs departments in Kansas that wanted to start similar services for elderly residents in their communities.\nTennessee, Louisiana, Michigan, Missouri, Ohio, It's also happening in Nebraska New Jersey and other states. In Appomattox County, Virginia, school resource officers are delivering groceries to elderly residents.\nMany small and family-owned grocery stores in rural areas have closed in recent years, making access to fresh food difficult. In rural Kansas, more than 100 grocery stores have closed since 2008, and in 50% of those communities a new store has not re-opened, according to the Center for Engagement and Community Development at Kansas State University.\n\"It's very rewarding. It's very humbling,\" Reed said.\nSmall, rural grocery stores do not always offer delivery, said Rial Carver, project manager with the program. Delivery is labor intensive and \"some of these rural grocery stores operate with a very limited staff.\"\nSo during the coronavirus crisis, cops are stepping up to fill the void. Some have more time on their hands right now to make deliveries.\n\"With schools closing down, with courts closing down, our guys were going to have a lot of free time. So we wanted to do something that would help,\" Matthew Henderson, a spokesperson for the Lincoln Parish Sheriff's Office in Louisiana, told a local television station.\nIn Sarpy County, Nebraska, sheriff's deputies took on the role because scammers had been offering to pick up groceries and supplies for residents and taking their money.\n\"The idea behind it was to help defeat the scammers who had already started, and to allow those who should be quarantined to stay that way,\" Sgt. Kris Yount told NPR's Nebraska station.", "url": "https://www.cnn.com/2020/04/01/business/grocery-delivery-coronavirus-police-sheriffs-office/index.html"}