{"authors": [], "date_download": "2020-05-04 20:23:20", "date_modify": "2020-05-04 20:23:20", "date_publish": "2020-04-30 02:50:25", "description": "The overwhelmed funeral home resorted to putting dozens of bodies in the rented vehicles.", "filename": "entry_funeral-home-bodies-trucks_n_5eaa39fcc5b62eaf043ecd2e_1588623800.html", "image_url": "https://img.huffingtonpost.com/asset/5eaa3bdf2500008211eb097a.jpeg?cache=zcdjxdfsgw&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_funeral-home-bodies-trucks_n_5eaa39fcc5b62eaf043ecd2e_1588623800.html", "title": "Police Called After NYC Funeral Home Fails To Contain Odor Of Bodies On Ice In Trucks", "title_page": "Police Called After NYC Funeral Home Fails To Contain Odor Of Bodies On Ice In Trucks | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "NEW YORK (AP) — Police were called to a Brooklyn neighborhood Wednesday after a funeral home overwhelmed by the coronavirus resorted to storing dozens of bodies on ice in rented trucks, and a passerby complained about the smell, officials said.\nInvestigators who responded to a 911 call found that the home had rented four trucks to hold about 50 corpses, according to a law enforcement official. No criminal charges were brought and the official, who was not authorized to speak publicly about the investigation, spoke to The Associated Press on condition of anonymity.\nThe Andrew T. Cleckley Funeral Home was cited for failing to control the odors. The home was able to obtain a larger, refrigerated truck later in the day, the official said.\nWorkers suited up in protective gear could be seen in the afternoon transferring bodies into the refrigerated truck.\nASSOCIATED PRESS Workers move bodies to a refrigerated truck from the Andrew T. Cleckley Funeral Home in the Brooklyn borough of New York, Wednesday, April 29, 2020.\nA person who answered the phone at the funeral home hung up without speaking. Subsequent calls went to voicemail, which was full.\nNew York City funeral homes have struggled as at least 18,000 people have died in the city since late March.\nThe city set up temporary morgues. Hospitals used refrigerated tractor trailers to cart away multiple bodies at a time, sometimes loading them in public view on the sidewalk. Crematoriums have been backed up. Funeral directors across the city have pleaded for help as they have run out of space.\nThe NYPD notified the state Department of Health, which oversees funeral homes, about the situation at the Andrew T. Cleckley Funeral Home. It did not respond to an email seeking comment.\nBrooklyn Borough President Eric Adams went to the scene on Wednesday evening. He told the Daily News, “While this situation is under investigation, we should not have what we have right now, with trucks lining the streets filled with bodies.”\nHe said “it was people who walked by who saw some leakage and detected an odor coming from a truck.”", "url": "https://www.huffpost.com/entry/funeral-home-bodies-trucks_n_5eaa39fcc5b62eaf043ecd2e"}