{"authors": [], "date_download": "2020-05-04 20:17:43", "date_modify": "2020-05-04 20:17:43", "date_publish": "2020-04-06 15:42:06", "description": "SIOUX FALLS, S.D. (AP) — The Latest on the coronavirus outbreak in South Dakota (all times local): 4:50 p.m. The South Dakota High School Activities Association said Monday that all...", "filename": "_68a862064af9737bc03f49be3702f529_1588623463.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_68a862064af9737bc03f49be3702f529_1588623463.html", "title": "The Latest: Spring South Dakota high school sports canceled", "title_page": "The Latest:  Spring South Dakota high school sports canceled", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SIOUX FALLS, S.D. (AP) — The Latest on the coronavirus outbreak in South Dakota (all times local):\n4:50 p.m.\nThe South Dakota High School Activities Association said Monday that all spring sports and postponed winter activities are canceled.\nThe association made the announcement after Gov. Kristi Noem announced in-person teaching will remain shut down for the rest of the school year.\nThe association calls it “an unprecedented time across our state and country,” and says it does not make the decision lightly.\nThe cancellation will be formalized at the April 21 meeting of the SDHSAA Board of Directors. The association says it looks forward to resuming high school activities during the 2020-21 school year.\n___\n4:10 p.m.\nThe University of South Dakota will continue to deliver classes remotely through the summer term because of concerns about the COVID-19 pandemic.\nThe South Dakota Board of Regents made the announcement Monday. All South Dakota public universities already had gone to online instruction last month for the rest of the spring semester. Monday’s announcement extends remote delivery through the universities’ summer term.\n“Our priority is ensuring continued instruction for the spring and summer terms for our students,” USD Provost Kurt Hackemer said in a statement.\nUSD expects to return to a normal fall schedule.\nDakota State University also will offer summer courses online, but said the university traditionally holds very few on-campus courses during the summer.\n___\n12:30 p.m.\nSouth Dakota health officials on Monday reported the highest day-to-day jump in confirmed coronavirus cases as 48 more people tested positive for the disease.\nState epidemiologist Josh Clayton said that 288 people have tested positive in total, while confirming that two more people in the state have died. Clayton said he could not release details on those who died, but their county locations match deaths announced last week: the family of state Rep. Bob Glanzer said he died on Friday night, and Avera Health announced on Friday that a resident at the Prince of Peace Retirement Community died. Four people in total have died from the coronavirus in the state.\nClayton cautioned against reading too much into the uptick in confirmed infections, saying that the state would have to see several days of similar increases to count it as statistically important. He also said there has been an increase in testing at both the state lab and commercial labs.\nThe total number of people who have tested positive has doubled since Wednesday. Health officials reported 91 people who have tested positive have recovered so far, while 23 have required hospitalization.\n___\n11:20 a.m.\nSioux Falls Mayor Paul TenHaken said on Monday he is issuing a “safer-at-home” proclamation as the number of coronavirus infections continues to rise in the city.\nThe mayor made it clear the proclamation is not legally enforceable, but hoped the recommendations would cut unnecessary group gatherings. His proclamation asks people to limit grocery shopping to once a week and to have only one person per household do the shopping. He is also urging large stores to limit the number of people they allow into the store at a time.\nSioux Falls, the largest city in the state, has emerged as a hotbed of infections. Minnehaha and Lincoln counties, both which contain parts of Sioux Falls, account for over half the number of confirmed cases of coronavirus in South Dakota.\nThe city council would have to enact an ordinance with fines for unnecessary group gatherings, TenHaken has said.\nTenHaken raised the concern that people who temporarily migrate from warmer parts of the country may be returning this spring. He asked them to quarantine for 14 days after they return.\n___\n10:40 a.m.\nMore than 160 city and county officials from across South Dakota on Monday urged Gov. Kristi Noem to have the Department of Health declare a public health emergency in response to the coronavirus.\nThe South Dakota Municipal League sent a letter signed by officials from 164 municipalities to the Republican governor, saying that without the declaration of a public health emergency, they don’t have the power to take actions necessary for dealing with the pandemic. Noem has said she wants to leave it up to cities and counties to enforce restrictions on businesses.\nThe letter says that the authority of municipalities is “untested in this type of crisis” and argues that a public health emergency would allow them to take action and have possible access to federal funds for the disaster.\nSecretary of Health Kim Malsam-Rysdon has said that a public health emergency could be used to quarantine individuals, but that it is not designed for sweeping action.", "url": "https://apnews.com/68a862064af9737bc03f49be3702f529"}