{"authors": [], "date_download": "2020-05-04 21:08:55", "date_modify": "2020-05-04 21:08:55", "date_publish": "2020-04-15 13:31:59", "description": "PORTLAND, Maine (AP) — The new dean of the University of Maine School of Law has been formally introduced — via Youtube. There was no traditional gathering Wednesday because of the...", "filename": "_7a4849dd00e39a21412f7ecce2f33f99_1588626535.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7a4849dd00e39a21412f7ecce2f33f99_1588626535.html", "title": "Former chief justice formally introduced as law school dean", "title_page": "Former chief justice formally introduced as law school dean", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PORTLAND, Maine (AP) — The new dean of the University of Maine School of Law has been formally introduced — via Youtube.\nThere was no traditional gathering Wednesday because of the coronavirus pandemic, so Dean Leigh Saufley was introduced to the community through a live-streamed event.\nSaufley, the state’s former chief justice, told the law students that attorneys are vital to the nation’s success. “It is in these times of challenge that we truly understand just how important excellent and innovative lawyers are to a thriving democracy,” she said.\nThe event featured University of Maine System Chancellor Dannel Malloy, Board of Trustees Chairman James Erwin and interim law school dean and constitutional scholar Dmitry Bam.\nBam praised Saufley as the right person to lead the law school and paraphrased fictional rock band Spinal Tap in saying Saufley will take the university’s strengths “and crank them to 11.”\n“I expect that Maine Law will continue to be a beacon for what a small closely knit, truly integrated law school can be,” he said.\nDemocratic Gov. Janet Mills hopes to nominate a new chief justice in the months to come, but it’s unclear when the Maine Senate confirmation hearing could happen because of the coronavirus outbreak.", "url": "https://apnews.com/7a4849dd00e39a21412f7ecce2f33f99"}