{"authors": ["Rob Frehse", "Anna Sturla", "Jenn Silva"], "date_download": "2020-05-04 16:56:01", "date_modify": "2020-05-04 16:56:01", "date_publish": "2020-04-09 07:55:04", "description": "Members of the New Jersey National Guard were deployed to two New Jersey nursing homes this week after both facilities reported deaths of residents due to coronavirus.", "filename": "2020_04_09_us_coronavirus-n_86db6272ccc07d6a8d4ac2342afdd26e_index_1588611361.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409032613-new-jersey-veterans-home-0408-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_coronavirus-n_86db6272ccc07d6a8d4ac2342afdd26e_index_1588611361.html", "title": "Nursing homes in New Jersey, California reporting clusters of coronavirus cases", "title_page": "Nursing homes in New Jersey, California reporting clusters of coronavirus cases - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Members of the New Jersey National Guard were deployed to two New Jersey nursing homes this week after both facilities reported deaths of residents due to coronavirus.\nAbout 40 members were dispatched to the New Jersey Veterans Home in Paramus, which houses 285 residents and has reported 10 deaths from the virus. At least 23 residents have tested positive and are isolated and another 47 are awaiting test results, New Jersey Department of Military and Veteran's Affairs spokesman Kryn Westhoven told CNN.\nSeventeen staff members in the nursing homes have also tested positive and 20 more are waiting for their results, Westhoven said. The state's National Guard members will help level staffing numbers, he added, following the positive diagnoses of workers in the facility. Every staff member is now getting temperature checks prior to their shift to ensure if they are showing signs of the coronavirus, they self-quarantine immediately, Westhoven said.\n\"Our primary concern is our residents at our home, our veterans, they are a national treasure,\" he said. \"Most of them have served our country and state and they deserve the best treatment possible.\"\nRead More", "url": "https://www.cnn.com/2020/04/09/us/coronavirus-new-jersey-california-nursing-homes/index.html"}