{"authors": ["Regina Garcia Cano"], "date_download": "2020-05-04 20:20:16", "date_modify": "2020-05-04 20:20:16", "date_publish": "2020-04-08 20:25:59", "description": "Former Baltimore Mayor Catherine Pugh asked a federal judge Wednesday for a second delay in the start of her prison sentence stemming from the fraudulent sales of her self-published children’s...", "filename": "_bceaf85f68f9103664e7bd9792c2247b_1588623616.html", "image_url": "https://storage.googleapis.com/afs-prod/media/1117372432524cec937a31af4f5c3652/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bceaf85f68f9103664e7bd9792c2247b_1588623616.html", "title": "Ex-Baltimore mayor seeks 2nd delay of start of prison term", "title_page": "Ex-Baltimore mayor seeks 2nd delay of start of prison term", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Feb. 27, 2020, file photo, former Baltimore mayor Catherine Pugh, second from left, and her attorney Steven Silverman, left, leave a sentencing hearing at U.S. District Court in Baltimore. Pugh's attorney asked a federal judge Wednesday, April 8, 2020, to delay for a second time the start of her prison sentence. (AP Photo/Steve Ruark, File)\nFILE - In this Feb. 27, 2020, file photo, former Baltimore mayor Catherine Pugh, second from left, and her attorney Steven Silverman, left, leave a sentencing hearing at U.S. District Court in Baltimore. Pugh's attorney asked a federal judge Wednesday, April 8, 2020, to delay for a second time the start of her prison sentence. (AP Photo/Steve Ruark, File)\nFormer Baltimore Mayor Catherine Pugh asked a federal judge Wednesday for a second delay in the start of her prison sentence stemming from the fraudulent sales of her self-published children’s books.\nAn attorney for the disgraced politician argued in a motion that his client should not begin her three-year sentence April 27 because of court delays prompted by the coronavirus pandemic and the location of the federal prison to which she has been assigned. Pugh, who was originally ordered to surrender on April 13, requested an extension to June 1.\nPugh was sentenced Feb. 27 after she pleaded guilty to federal conspiracy and tax evasion charges in November. Federal authorities accused her of carrying out a fraudulent scheme for several years selling her Healthy Holly paperbacks to nonprofit organizations to promote her political career.\nThe federal Bureau of Prisons ordered Pugh to report to a correctional facility in Aliceville, Alabama, which is more than 850 miles (1,350 kilometers) from Baltimore, according to the motion.\nDefense attorney Andrew White wrote in the court filing that he has begun the process to ask the bureau to reconsider and assign Pugh to a prison in Alderson, West Virginia. He said sending Pugh to the facility in Alabama goes against the Trump administration’s sweeping criminal justice reform known as the First Step Act, which requires the bureau to place prisoners in facilities as close as possible to their primary residences.\nWhite also wrote that the closure of most activities at state courts in Maryland because of the pandemic has caused Pugh’s pending perjury case to be rescheduled to May 14. He said that case was supposed to be resolved in one court hearing before the start of her federal prison sentence but instead has been postponed multiple times.\n“To require the Defendant to surrender to BOP custody in Alabama, only to then have to be immediately returned to Maryland for the final adjudication of her state law charges, serves no legitimate purpose, unduly burdens the United States Marshals Service in having to unnecessarily transport the Defendant back to Maryland, could cause undue delays in the state court proceedings, and frustrates the Defendant’s access to BOP programs that she can benefit from while serving her sentence in a designated facility,” White wrote.", "url": "https://apnews.com/bceaf85f68f9103664e7bd9792c2247b"}