{"authors": [], "date_download": "2020-05-04 16:09:38", "date_modify": "2020-05-04 16:09:38", "date_publish": "2020-01-20 16:00:31", "description": "With so many options, how do you choose the best credit card? Our complete guide takes you through the pros and cons of all the top credit cards in 2020.", "filename": "2020_01_20_cnn-underscored_best-credit-cards_index_1588608578.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200113171214-underscored-best-credit-cards-citi-double-cash-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_01_20_cnn-underscored_best-credit-cards_index_1588608578.html", "title": "The 9 best credit cards of April 2020", "title_page": "Best credit cards of 2020: Offers & Rewards - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nIt's likely your world has changed drastically in the last month. The coronavirus crisis may have cost you a job, or reduced your hours, or forced you to work entirely from home, and the way you're making ends meet right now is likely very different than it was just a short while ago.\nWhile it may seem counterintuitive to think about credit cards at a time like this, a new credit card could help you through the crisis, perhaps by letting you finance the things you need to buy at 0% interest for several months, or consolidating debt at a lower interest rate. Or maybe you just want to make sure you're earning the most in rewards when you're ordering online instead of at a physical store.\nOur comprehensive methodology compares every aspect of each credit card to our \"benchmark credit card\" to determine which cards can potentially help you the most. So give yourself a few minutes to take a look at our list of the best credit cards in 2020 and see if one might be useful to you right now.\nThe best credit cards of 2020\nCiti® Double Cash Card: Best for flat-rate cash back\nCapital One® SavorOne® Cash Rewards Credit Card: Best for food delivery\nBlue Cash Everyday® Card from American Express: Best for U.S. supermarkets\nU.S. Bank Visa® Platinum Card: Best introductory rate on purchases\nCiti Simplicity® Card: Best for balance transfers\nCapital One® Venture® Rewards Credit Card: Best for easy travel redemptions\nChase Sapphire Preferred Card: Best for flexible rewards\nThe Blue Business® Plus Credit Card from American Express: Best for small businesses\nCapital One® Spark® Miles for Business: Best for larger businesses\nWhy did we select these cards as our best credit cards for 2020? Dive into the details of each card with us, and see how they stack up.\nBest for flat-rate cash back: Citi Double Cash Card\nWhy it's great in one sentence: The Citi Double Cash Card is both simple and lucrative, offering a market-leading 2% cash back on every purchase — 1% when you buy, 1% when you pay your statement — for no annual fee.\nThis card is right for: People who want a card that will work for them but don't have the time, patience or interest to chase bonus categories or figure out complicated travel loyalty programs.\nHighlights:\nEarn 2% cash back on all purchases with no limit.\n0% interest for 18 months on balance transfers made in the first four months after you open the card (13.99%-23.99% variable afterward).\nCash back can be converted to Citi ThankYou travel points at a ratio of 1 cent per point when combined with the Citi Prestige® Card or Citi Premier℠ Card.\nNo annual fee.\nSign-up bonus: None.\nWhat we like about the Citi Double Cash: Life is complicated enough right now — not everyone wants to make their credit cards complicated as well. If you don't want to deal with bonus categories, transfer partners or spending caps, you can't get much simpler than the Citi Double Cash.\nBut \"simple\" doesn't have to mean \"weak.\" In fact, you'll get 2% cash back on practically everything you buy with this card, which is the best ongoing flat-rate return you'll find on any no-annual-fee credit card out there.\nYes, if you want to put in extra effort to maximize bonus categories or if you're willing to pay an annual fee, you can absolutely get more in overall rewards or perks. But if you don't want to make your credit card another thing in your life to worry about, you can put the Citi Double Cash in your purse or wallet, and set it and forget it.\nThe Citi Double Cash is both simple and rewarding — a good choice when there's more important things to think about than credit cards.\nWhat could be better: The Citi Double Cash is a no-frills credit card, so you won't find any fancy travel or dining perks on it, nor are there any significant travel or purchase protections. You also won't want to use this card for overseas purchases, as the 3% foreign transaction fee will offset the rewards you earn.\nHaving the option to convert the card's cash back to Citi ThankYou points when you have certain other Citi cards is an impressive recent addition, but the ThankYou program's airline transfer partners can be challenging to leverage.\nThe balance transfer offer does come with a 3% fee, though that's comparable to other credit cards with similar balance transfer features. And the Citi Double Cash doesn't offer a sign-up bonus, which means other cards might be more rewarding right out of the gate, though the Double Cash will catch up with long-term use.\nWhy it's our \"benchmark\" credit card: The ease of use and straightforward top-of-market cash-back earning rate of the Citi Double Cash are why CNN Underscored currently considers the Double Cash as our \"benchmark\" credit card. We use it as our benchmark card to compare the features of other credit cards and determine if they're better or worse overall.\nYou can read more about our benchmark credit card concept in our credit card methodology guide, or dig into our complete review of the Citi Double Cash.\nLearn more about the Citi Double Cash Card.\n______________________________________________________________________________\nBest for food delivery: Capital One SavorOne Cash Rewards\nWhy it's great in one sentence: The no-annual-fee Capital One SavorOne card offers an excellent 3% cash back on entertainment and dining — which includes most food delivery services — and features an introductory interest rate on both purchases and balance transfers for 15 months.\nThis card is right for: People who are currently spending a large portion of their budget on food delivery services but don't want to pay an annual fee.\nHighlights:\nEarn 3% cash back on entertainment and dining (including most food delivery services).\nEarn 2% cash back at grocery stores.\n0% interest on all purchases for the first 15 months (15.49% to 25.49% variable afterward).\n0% introductory APR for 15 months on balance transfers (15.49% to 25.49% variable afterward).\nExtended warranty protection.\nNo foreign transaction fee.\nNo annual fee.\nSign-up bonus: Earn $150 cash bonus after you spend $500 on purchases within the first three months from account opening.\nWhat we like most about the Capital One SavorOne: Given the current worldwide situation, having a card that earns 3% back on most food delivery services is incredibly valuable. The Capital One SavorOne codes services like GrubHub and Seamless as \"dining,\" meaning in most cases, you should get the same 3% cash back that you would if you were physically dining at the restaurant.\nIn addition, the Capital One SavorOne has a 0% introductory interest rate on all purchases for the first 15 months, though it jumps to a variable 15.49% to 25.49% after those 15 months are over. Still, that's a significant amount of time you could use to carry a balance if you're trying to make ends meet.\nIf you're using food delivery services, you'll earn 3% cash back on many of them with the Capital One SavorOne card.\nWhat could be better: There's no cell phone insurance on the Capital One SavorOne card, which is becoming a common feature even on some no-annual-fee credit cards. You can also find cards with somewhat longer introductory periods if you need extra time to carry debt.\nYou may also want to consider the SavorOne's bigger brother, the Capital One® Savor® Cash Rewards Credit Card, which offers an even more impressive 4% cash back on dining and entertainment purchases, and the same 2% at grocery stores. But unlike the SavorOne card, the Savor card carries a $95 annual fee, though it's waived for the first year.\nWhere it beats our benchmark card: Sign-up bonus, introductory rate on purchases for 15 months, no foreign transaction fee.\nWhere our benchmark card is better: The Citi Double Cash has a longer introductory interest rate period of 18 months on balance transfers.\nLearn more about the Capital One SavorOne Cash Rewards Credit Card.\n______________________________________________________________________________\nBest for U.S. supermarkets: Blue Cash Everyday Card from American Express\nWhy it's great in one sentence: The Blue Cash Everyday card earns 3% cash back at U.S. supermarkets (up to $6,000 annually, then 1%) and 2% back at U.S. gas stations, while also offering a generous introductory interest rate on purchases and balance transfers for 15 months, all with no annual fee.\nThis card is right for: People who are spending a significant amount of money at U.S. supermarkets but don't want to pay an annual fee for a credit card.\nHighlights:\nEarn 3% cash back at U.S. supermarkets on up to $6,000 per year in purchases (then 1%).\nEarn 2% cash back at U.S. gas stations and select U.S. department stores.\nEarn 1% cash back on everything else.\n0% interest on all purchases for the first 15 months (12.99% to 23.99% variable afterward).\n0% interest for 15 months on balance transfers made in the first 60 days after you open the card (12.99% to 23.99% variable afterward).\nCar rental loss and damage insurance included.\nNo annual fee.\nTerms apply.\nWelcome bonus: Earn $150 back as a statement credit after you spend $1,000 in purchases on your new card in your first three months.\nWhat we like most about the Blue Cash Everyday: For many Americans, a significant portion of the monthly family budget is currently going to supermarket expenses. The Blue Cash Everyday card dials up the bonus cash back on that category, along with gas stations as well, creating a go-to in your wallet for two routine purchases.\nThe card also pairs its bonus categories with an introductory 0% interest rate on purchases for the first 15 months, making it a solid choice. But you'll want to make sure your debt is paid off by the end of the intro period, as the interest rate jumps to a variable 12.99% to 23.99% afterward.\nYou'll also find a similar introductory offer for balance transfers on the Blue Cash Everyday, and a welcome bonus of $150 cash back after you spend $1,000 in purchases in the first three months, which tops off a fairly complete package.\nEarn 3% at US supermarkets (up to $6,000 a year, then 1%) with the Blue Cash Everyday card.\nWhat could be better: Bonus cash back isn't earned on purchases outside of the U.S. with the Blue Cash Everyday, and there's a 3% foreign transaction fee on top of that. Plus, there's no way to convert your cash back to American Express Membership Rewards points, which are potentially more useful for those who may want maximum flexibility in redeeming credit card rewards for travel down the line.\nYou can also find cards that earn even more cash back at supermarkets if you're willing to pay an annual fee. In fact, the more expensive version of the Blue Cash Everyday is the Blue Cash Preferred® Card from American Express, and it earns 6% cash back at U.S. supermarkets — double the Blue Cash Everyday — up to $6,000 in purchases each year (1% thereafter).\nThere's also 6% cash back on select U.S. streaming subscriptions on the Blue Cash Preferred, as well as 3% cash back at U.S. gas stations and on transit. But in exchange for those higher bonus rates, you'll pay a $95 annual fee each year, so the Blue Cash Everyday with no annual fee could be a better choice overall.\nWhere it beats our benchmark card: Welcome bonus, an introductory interest rate on purchases, a longer period of 15 months on introductory balance transfers, car rental damage coverage.\nWhere our benchmark card is better: The Citi Double Cash has a longer four-month period to complete any introductory balance transfers, and its cash back can be converted to Citi ThankYou travel points when combined with the Citi Prestige® Card or Citi Premier℠ Card.\nLearn more about the Blue Cash Everyday Card from American Express.\n______________________________________________________________________________\nBest introductory rate on purchases: U.S. Bank Visa Platinum Card\nWhy it's great in one sentence: For those who'd rather pay no interest on purchases for as long as possible instead of earning cash back or travel rewards, the U.S. Bank Visa Platinum Card offers 0% interest on all purchases for the first 20 billing cycles you have the card (the interest rate rises to a variable 13.99% to 23.99% after the introductory period ends).\nThis card is right for: People who want the longest introductory interest rate period on purchases when they first get a credit card.\nHighlights:\n0% interest on all purchases for the first 20 billing cycles (13.99% to 23.99% variable afterward).\n0% interest for 20 billing cycles on balance transfers made in the first 60 days after you open the card (13.99% to 23.99% variable afterward).\nCell phone protection.\nNo annual fee.\nSign-up bonus: None.\nWhat we like about the U.S. Bank Visa Platinum Card: Credit cards are generally known for having sky-high interest rates, making them terrible for financing large purchases. But the U.S. Bank Visa Platinum Card is an exception, at least for the first 20 months after you get the card.\nDuring that time, you can charge purchases to the card and pay them off slowly without incurring any interest at all. That's a longer intro period than almost any credit card on the market, so it's a good way to finance a large emergency purchase or even just daily expenses if you're in a pinch.\nBut be careful! Once the introductory 0% interest period ends, any balance remaining on the card jumps to a variable interest rate of 13.99% to 23.99%, depending on your creditworthiness. If you haven't paid off all those purchases in full by then, you'll be on the hook for some giant interest payments. Still, if you need to just make ends meet for now, this is a card that can be a useful tool in your toolbox.\nThere's also an added perk on this card: ongoing cell phone protection. When you pay your cell phone bill with the U.S. Bank Visa Platinum, you'll be covered for damage or theft to your cell phone up to $600, with a $25 deductible, for up to two claims per 12-month period.\nWhen you pay your cell phone bill with the U.S. Bank Visa Platinum, your phone is covered for theft or damage.\nWhat could be better: Beyond the introductory rate on purchases as well as a similar introductory interest rate on balance transfers (which comes with a 3% fee), this isn't a card that's going to do a lot for you. It doesn't earn any rewards at all, doesn't come with a sign-up bonus and doesn't have any other significant perks.\nThe U.S. Bank Visa Platinum has no annual fee, but it charges a 3% foreign transaction fee, so you definitely won't want to use it overseas. In fact, aside from using it to finance purchases at 0% interest during the introductory period, it's not a card that we'd recommend for long-term usage.\nAnd if you're willing to trade a slightly shorter introductory period in exchange for earning rewards, you might consider the Chase Freedom Unlimited, which offers an introductory interest rate on purchases and balance transfers for the first 15 months you have the card, but also offers 1.5% cash back on all purchases (though balance transfers don't earn cash back).\nWhere it beats our benchmark card: An introductory interest rate on purchases for the first 20 billing cycles, cell phone insurance.\nWhere our benchmark card is better: The Citi Double Cash earns rewards on all purchases.\nThe information for the U.S. Bank Visa Platinum Card has been collected independently by CNN Underscored. The card details on this page have not been reviewed or provided by the card issuer.\n______________________________________________________________________________\nBest for balance transfers: Citi Simplicity Card\nWhy it's great in one sentence: If you need to consolidate your debt to reduce your interest expenses right now, the Citi Simplicity credit card offers an introductory interest rate on balance transfers for a whopping 21 months for transfers completed in the first four months after you open the card.\nThis card is right for: People who want to consolidate their existing debt at a low interest rate for the longest possible period of time.\nHighlights:\n0% interest for 21 months on balance transfers made in the first four months after you open the card (14.74%-24.74% variable afterward).\n0% interest on all purchases for the first 12 months (14.74%-24.74% variable afterward).\nNo late fees and no penalty interest rates for late payments.\nNo annual fee.\nSign-up bonus: None\nWhat we like about the Citi Simplicity: The first step to getting out of credit card debt is to stop the bleeding by putting a halt to the exorbitant interest you're paying on your accumulated debt. A credit card with a long introductory balance transfer offer is exactly what the doctor ordered.\nThe Citi Simplicity comes with a lengthy 21-month introductory period, during which you'll pay 0% interest on any balance transfers made during the first four months you have the card. But you'll want to make sure you pay off your entire balance transfer during those 21 months, because when that introductory period ends, the rate will jump to between 14.74% and 24.74%, depending on your creditworthiness.\nThe Citi Simplicity also features a pair of consumer-friendly features in that it has no late fees and no penalty interest rates, meaning you won't get hit with an extra fee for being a few days late. But be forewarned that \"no late fees\" doesn't mean \"no interest\" — you'll still pay interest if you're late with a payment. And if you're utilizing the introductory balance transfer feature and miss a payment, you'll lose your introductory interest rate, so you need to be extra careful in that case.\nYou can use the Citi Simplicity card to consolidate your existing credit card debt at a lower interest rate.\nWhat could be better: Aside from the balance transfer option and lack of late fees or penalty interest rates, there's not a ton of exciting features with the Citi Simplicity. There are no rewards on the card and no important other perks. There's an introductory interest rate on purchases, but it isn't as impressive as the balance transfer offer since it only lasts for 12 months.\nEven the balance transfer offer has a downside — you'll be charged a 5% fee for any transfers you make, which is at least 2% more than many other credit cards with low-interest balance transfer offers.\nIf you can give up a few months at 0% interest, consider our benchmark Citi Double Cash card, which will give you 0% interest on balance transfers for only the first 18 months you have the card (then a variable APR of 13.99% to 23.99% applies), but with just a 3% fee, and it also offers 2% cash back on all purchases (though balance transfers don't earn cash back).\nStill, if you need to pay no interest on your debt for the maximum amount of time possible, the Citi Simplicity is potentially worth the extra cost to buy yourself time to get back on track and firm up your financial picture.\nWhere it beats our benchmark card: A longer period of 21 months on introductory balance transfers, no late fees, no penalty rates.\nWhere our benchmark card is better: The Citi Double Cash earns rewards on all purchases and has a lower balance transfer fee.\nRead our complete Citi Simplicity credit card review.\nLearn more about the Citi Simplicity Card.\n______________________________________________________________________________\nBest for easy travel redemptions: Capital One Venture Rewards\nWhy it's great in one sentence: You'll earn 2 Capital One miles per dollar on every purchase with the Capital One Venture Credit Card, and you can redeem those miles for any travel purchase you make at 1 cent per mile, or transfer them to Capital One's airline partners for potentially even more valuable redemptions.\nThis card is right for: People who want to earn easily redeemable miles to use for travel in the future, but with the option to learn how to master transferable miles down the line for even greater value.\nHighlights:\nEarn 2 miles per dollar on all purchases with no limit.\nRedeem miles for any travel purchase at a rate of 1 cent per mile.\nMiles can also be transferred to any of 17 airline and hotel partners.\nUp to $100 credit when applying for Global Entry or TSA PreCheck.\nNo foreign transaction fees.\nNo annual fee for the first year, then $95 per year.\nSign-up bonus: 50,000 miles after spending $3,000 on purchases in the first three months after opening the account.\nWhat we like about the Capital One Venture: You almost certainly aren't thinking much about travel right now. But eventually airlines will return to the skies and hotels will reopen their doors, and in the interim, some people might want to earn travel rewards they can use to take a sorely needed vacation when the current worldwide crisis has ebbed.\nBut what kind of rewards should you earn? Easy-to-redeem fixed-value miles, or flexible miles that can be used for more complicated advanced redemptions that get more value?\nThe Capital One Venture card gives you the best of both worlds. For folks who don't want to deal with complex charts or award availability, you can use the Venture's \"Purchase Eraser\" feature to wipe away any travel purchases that you make with the card at a rate of 1 cent per mile, making the card's 50,000-mile sign-up bonus worth at least $500 in travel.\nFor others who want to put in the time and research to find first- or business-class flight redemptions, Capital One's 17 transfer partners provide another option. You can transfer miles to most of those partners at a 2-to-1.5 ratio (meaning for every 2 Venture miles you transfer, you'll get 1.5 airline miles on the other end), while Emirates, Singapore Airlines and Accor Hotels transfer at a 2-to-1 ratio.\nYou'll also get up to a $100 fee credit when applying for either Global Entry or TSA PreCheck, no foreign transaction fees, and a year with no annual fee to try out the card.\nIf you're dreaming of a sorely needed vacation when the current worldwide crisis is over, you might consider earning travel rewards instead of cash back.\nWhat could be better: There's only one bonus category on the Capital One Venture card — you'll earn 5 miles per dollar on hotels or car rentals, but only when you book them through Capital One Travel. Unfortunately, you likely won't get elite credit or have your elite benefits honored when booking a hotel through a travel portal instead of directly with the hotel.\nThere's also no balance transfer or introductory interest rate on purchases, so don't plan to carry a balance with the Venture card. And if you're only planning to redeem your miles using the \"Purchase Eraser,\" you could be better off with our benchmark Citi Double Cash card, since you'll be effectively earning 2 cents per dollar spent either way, but the Venture card has a $95 annual fee after the first year.\nCapital One's transfer partners also include only one U.S. airline option (JetBlue), though advanced cardholders will be able to leverage international airline alliances to score domestic redemptions. But if you think you'll mix in some airline transfers even down the line, the Venture card serves as a great beginner gateway to the world of transferable points.\nRelated: Looking for a travel credit card? Read CNN Underscored's guide to the best travel credit cards of 2020.\nWhere it beats our benchmark card: Sign-up bonus, purchase protections, travel protections.\nWhere our benchmark card is better: The Citi Double Cash has no annual fee and an introductory rate on balance transfers.\nRead our complete Capital One Venture credit card review.\nLearn more about the Capital One Venture Rewards Credit Card.\n______________________________________________________________________________\nBest for flexible rewards: Chase Sapphire Preferred\nWhy it's great in one sentence: The Chase Sapphire Preferred earns 2 Ultimate Rewards points for every dollar you spend on travel and dining purchases, plus 1 point per dollar on all other purchases; points can be redeemed for travel via Chase Ultimate Rewards at 1.25 cents per point, or transferred to the program's airline and hotel partners for potentially even more valuable redemptions.\nThis card is right for: People with larger than average travel and/or dining expenses who want to use a basic transferable points program to redeem their credit card rewards for travel.\nHighlights:\nEarn 2 points for every dollar spent on travel and dining purchases.\nEarn 1 point per dollar on all other purchases.\nPoints can be redeemed for travel through the Chase Ultimate Rewards travel portal at a rate of 1.25 cents per point.\nPoints can also be transferred to any of Chase's 13 airline and hotel partners.\nNo foreign transaction fees.\n$95 annual fee.\nSign-up bonus: 60,000 bonus points after you spend $4,000 on purchases in the first three months from account opening.\nWhat we like about the Chase Sapphire Preferred: It may not seem like it, but at over 10 years old, the Chase Sapphire Preferred is practically the granddaddy of travel rewards credit cards.\nWIth classic travel and dining bonus categories, a recently added bonus category that earns 5 points per dollar on Lyft rides, and a 60,000-point sign-up bonus, you should be able to score plenty of points even if you can't fly anywhere at the moment, since Chase defines \"travel\" very broadly to include purchases like mass transit, tolls, parking and even rideshares.\nBut the real power of the CSP is in its redemptions. You'll get 1.25 cents per point when redeeming points through the Chase Ultimate Rewards travel portal, and can get potentially even more value when transferring points to one of Chase's 13 travel partners.\nIn fact, the Ultimate Rewards program still features some of the best transfer partners around, including United Airlines, Southwest Airlines and Hyatt Hotels, and all Chase partners transfer at a 1-to-1 ratio.\nTo top it off, when international flights resume, you can safely use the Sapphire Preferred overseas, since it has no foreign transaction fees on international purchases. It even provides primary car rental insurance, so you don't have to look to your own auto policy first if you have an accident with your rental car.\nThe Chase Sapphire Preferred has primary car rental insurance that covers you if you pay for the rental with the card and have an accident.\nWhat could be better: The Chase Sapphire Preferred is a classic, but in some ways it's starting to get long in the tooth. Other credit cards now offer bonus points or cash back in those same travel and dining categories, and in some cases at higher rates (though usually accompanied by higher annual fees).\nEven our benchmark Citi Double Cash card earns 2% cash back -— 1% when you make a purchase, and 1% when you pay it off — on everything you buy, not just travel and dining, though you can get more value when redeeming your Sapphire Preferred points than you can with simple cash back.\nYou also no longer get the first year's $95 annual fee waived with the CSP, so you're paying for the card right out of the gate. For many people, the Sapphire Preferred isn't as flashy as its big brother, the Chase Sapphire Reserve, which comes with travel perks, higher bonus rates and a $300 annual travel credit (but also a $550 annual fee). But if you don't need or won't use all those extra perks (especially in the next several months), you may be better off with this significantly less expensive version.\nRelated: Learn if the Chase Sapphire Reserve is worth the increased annual fee.\nWhere it beats our benchmark card: Travel and dining bonus categories, excellent travel protections, solid airline and hotel partners, sign-up bonus.\nWhere our benchmark card is better: The Citi Double Cash has no annual fee, an introductory rate on balance transfers and easy cash back.\nRead our complete Chase Sapphire Preferred credit card review.\nLearn more about the Chase Sapphire Preferred Card.\n______________________________________________________________________________\nBest for small businesses: The Blue Business Plus Card from American Express\nWhy it's great in one sentence: For businesses with less than $50,000 in annual expenses, the Blue Business Plus from American Express is a great and simple choice, since it earns a flat rate of 2 Membership Rewards points for every dollar you spend on all your business purchases up to $50,000 a year, then 1 point per dollar spent thereafter, and all with no annual fee.\nThis card is right for: Small businesses that want to stockpile transferable travel rewards to use for the future and a card with no annual fee.\nHighlights:\nEarn 2 points for every dollar you spend on all purchases up to $50,000 per year, then 1 point per dollar thereafter.\nPoints can be redeemed for travel through Amex Travel at a rate of up to 1 cent per point.\nPoints can also be transferred to any of Amex's 21 airline and hotel partners.\n0% interest for 12 months on balance transfers made in the first 60 days after you open the card (13.24%-19.24% variable afterward).\n0% interest on all purchases for the first 12 months (13.24%-19.24% variable afterward).\nNo annual fee.\nTerms apply.\nWelcome bonus: None.\nWhat we like about the Blue Business Plus: For small businesses looking for a business credit card comparable to the personal Citi Double Cash, our benchmark card, the Blue Business Plus is worthy of consideration.\nYou'll need to be thinking about future travel with this card, since it earns 2 Membership Rewards points for every dollar spent on all purchases up to $50,000 each calendar year, and the points can be redeemed directly for travel at a rate of up to 1 cent per point, or transferred to any of Amex's 21 airline and hotel partners for potentially even more value.\nYour business can also take advantage of the card's 0% introductory interest rate on both purchases and balance transfers for the first 12 months you have the card — just make sure it's paid off by the end of that time, or you'll find yourself facing an ongoing interest rate of 13.24%-19.24%, depending on your creditworthiness. Overall, it's a pretty sweet package for small businesses, and all for no annual fee.\nUse the introductory interest rate on purchases with the Blue Business Plus to cover business expenses for several months.\nWhat could be better: Membership Rewards points earned with the Blue Business Plus can be converted to cash back, but at a poor rate of 0.6 cents per point, so small businesses focused on earning cash back instead of travel rewards should instead choose the American Express® Blue Business Cash Card, which has all the same features as the Blue Business Plus but earns cash back instead of points.\nYou also won't want to use either card for international purchases, as both carry a 2.7% foreign transaction fee on overseas transactions. And larger businesses with more than $50,000 in credit card expenses each year will find the Blue Business cards limiting, as all charges beyond that amount in a calendar year earn only 1 point per dollar. (Businesses with bigger annual expenses should instead look to our option for larger businesses, below.)\nFinally, the Blue Business cards don't have any sort of welcome bonus, so your business will need to earn its points or cash back purely from spending, instead of counting on a quick haul of early bonus points.\nWhere it beats our benchmark card: Extensive airline and hotel partners, some travel and purchase protections, introductory rate on purchases.\nWhere our benchmark card is better: The Citi Double Cash has an introductory rate on balance transfers and easy cash back.\nRead our complete American Express Blue Business Plus credit card review.\nLearn more about the Blue Business Plus Card.\n______________________________________________________________________________\nBest for larger businesses: Capital One Spark Miles for Business\nWhy it's great in one sentence: The Capital One Spark Miles for Business card earns an unlimited 2 miles for every dollar you spend on the card — plus 3 additional miles for hotel and car rentals booked through Capital One Travel with the card — and those miles can be redeemed for any travel purchase you make at 1 cent per mile or transferred to Capital One's airline partners for potentially even more valuable redemptions.\nThis card is right for: Larger businesses that want easy-to-redeem travel rewards miles, with the option to learn how to master transferable miles down the line for greater value.\nHighlights:\nEarn 5 miles for every dollar you spend on your card on hotels and rental cars booked via Capital One travel.\nEarn 2 miles per dollar on all other purchases with no cap.\nRedeem miles for any travel purchase at a rate of 1 cent per mile.\nMiles can also be transferred to any of 17 airline and hotel partners.\nUp to $100 credit when applying for Global Entry or TSA PreCheck.\nNo foreign transaction fees.\nNo annual fee for the first year, then $95 per year.\nSign-up bonus: Earn 50,000 miles when you spend $4,500 in the first three months of your account opening.\nWhat we like about the Capital One Spark Miles: Businesses with large expenses that can be charged to a credit card will love the unlimited 2 miles per dollar of the Spark Miles for Business card, along with the extra 3x miles bump they'll get when booking hotels or car rentals through Capital One Travel with the card.\nCapital One miles are easy for businesses to redeem on any travel purchases made with the card at a rate of 1 cent per mile, or the miles can be transferred to any of Capital One's 17 airline and hotel partners for potentially higher value with some extra work.\nThe Spark Miles card also comes with a 50,000-mile sign-up bonus after you spend $4,500 in the first three months you have the card, which is a pretty low threshold for any business with significant monthly expenses.\nThe best part is the card's $95 annual fee is waived for the first year, so you can try it out for 12 months and see if it works for your business needs.\nThe Capital One Spark Miles credit card is a good choice for larger businesses.\nWhat could be better: Travel likely isn't top-of-mind for most businesses at the moment, so if you'd rather earn cash back instead of miles, you can look at the Capital One® Spark® Cash for Business card as an option. It earns 2% cash back on all purchases and its $95 annual fee is waived the first year, but it's missing a few perks such as 5x on car rentals and hotels at Capital One Travel and a Global Entry/TSA PreCheck credit.\nCapital One deserves credit for expanding its mileage program in 2018 to include transfer partners, but since it's a relatively new part of the program, the Spark Miles for Business airline partners aren't quite as lucrative as those from Chase and American Express, though with some effort you can still find terrific value.\nIt's also not ideal that you have to book through Capital One Travel to earn 5 miles per dollar on hotels and car rentals, especially since most hotels won't honor earned elite status or award elite nights or points for reservations booked through third-party sites.\nThe $95 annual fee you'll pay for the Spark Miles after the first year makes this a more expensive card than our benchmark Citi Double Cash, so businesses will want to make sure they're getting enough extra value from their miles to make the cost worth it.\nWhere it beats our benchmark card: Sign-up bonus, purchase protections, travel protections.\nWhere our benchmark card is better: The Citi Double Cash has no annual fee and an introductory rate on balance transfers.\nRead how to earn $500 or 50,000 bonus miles with Capital One Spark credit cards.\nLearn more about the Capital One Spark Miles for Business.\n______________________________________________________________________________\nNeed help getting rid of credit card debt? Find out which cards CNN Underscored chose as our best balance transfer credit cards of 2020.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/01/20/cnn-underscored/best-credit-cards/index.html"}