{"authors": [], "date_download": "2020-05-04 20:17:37", "date_modify": "2020-05-04 20:17:37", "date_publish": "2020-04-04 00:34:43", "description": "SEATTLE (AP) — Transit agencies in the Puget Sound region will get more than $500 million in federal help to deal with the coronavirus outbreak. The Seattle Times reports the Federal Transit...", "filename": "_9718e32096409b6fdc8d5b0f7e00cde2_1588623457.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_9718e32096409b6fdc8d5b0f7e00cde2_1588623457.html", "title": "Virus: Transit agencies gets federal money to help", "title_page": "Virus: Transit agencies gets federal money to help ", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SEATTLE (AP) — Transit agencies in the Puget Sound region will get more than $500 million in federal help to deal with the coronavirus outbreak.\nThe Seattle Times reports the Federal Transit Administration announced this week how it would distribute $25 billion included in the recently passed federal coronavirus relief package. The funding is meant to backfill lost funding for transit systems and help cover extra cleaning costs, as ridership plummets and tax revenues sink.\n“This wasn’t a stimulus, this was a relief package,” said Justin Leighton, executive director of the Washington State Transit Association. Transit systems across Washington could seek more help from the state Legislature or federal government, Leighton said.\nThe federal funding in the latest aid package can be used for backfilling losses, covering operating costs dating back to Jan. 20 and paying extra cleaning costs — a broader scope than federal funds typically aimed at construction. The money can cover costs such as driver pay, fuel and administrative leave for employees.\nThe Puget Sound region will get about $538 million, to be distributed to Metro, Sound Transit, Washington State Ferries and some smaller systems including Community Transit and Kitsap Transit.\nThat’s about triple what the region would get in federal transit funding in a typical year, according to the Puget Sound Regional Council, which will distribute the money. Other cities in Washington will get some help, too, with about $23 million going to Spokane and $9 million to Bellingham. The state will get about $44 million to distribute to transit in rural areas.", "url": "https://apnews.com/9718e32096409b6fdc8d5b0f7e00cde2"}