{"authors": ["Por Carlos Valdez"], "date_download": "2020-05-04 20:17:20", "date_modify": "2020-05-04 20:17:20", "date_publish": "2020-04-08 19:56:27", "description": "LA PAZ, Bolivia (AP) — La pandemia del coronavirus ha dejado en la incertidumbre el futuro político de Bolivia. Tras el aplazamiento de las elecciones y la posibilidad de una ampliación de...", "filename": "_1ecfb9f8c9af42969e20eaa3f89adeb2_1588623440.html", "image_url": "https://storage.googleapis.com/afs-prod/media/3c3febcd74154b9cbc3e4c602e8bbfb8/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1ecfb9f8c9af42969e20eaa3f89adeb2_1588623440.html", "title": "Coronavirus deja en incertidumbre elecciones en Bolivia", "title_page": "Coronavirus deja en incertidumbre elecciones en Bolivia", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Click to copy\nClick to copy\nLA PAZ, Bolivia (AP) — La pandemia del coronavirus ha dejado en la incertidumbre el futuro político de Bolivia.\nTras el aplazamiento de las elecciones y la posibilidad de una ampliación de la cuarentena, se forzó una tregua en la lucha política tras los violentos enfrentamientos del año pasado que derivaron en la renuncia del entonces presidente Evo Morales.\nLa Asamblea Legislativa postergó el debate de una ley que fije nueva fecha para los comicios después que el Tribunal Supremo Electoral planteara aplazar en cinco semanas los comicios fijados para el 3 de mayo. A su vez, el gobierno analiza una postergación de la cuarentena que debe finalizar el 14 de abril y cuya fecha llevó a ese tribunal a modificar el calendario.\n“No hay fecha para debatir la ley de elecciones. Ahora debemos ayudar a la gente y no abordaremos el tema mientras persista la emergencia”, dijo a The Associated Press el diputado Edgar Montaño del Movimiento al Socialismo (MAS), el partido de Morales que controla la mayoría en el legislativo.\nEl ministro de la Presidencia, Yerko Núñez, dijo que se evalúa el lapso de ampliación de la cuarentena, pero anticipó que es inevitable la prórroga ante la posibilidad de que la epidemia, que hasta el miércoles cobró la vida de 15 personas con 210 casos positivos, alcance su pico en dos semanas, según advirtieron las autoridades sanitarias.\n“La pandemia ha revuelto de tal manera las cosas, que mucho de lo que teníamos pensado para la transición democrática se ha vuelto dudoso” y cuando el debate regrese “la reforma económica y social obligará a replantear la política”, opinó el analista Henry Oporto.\nEl ministro de Salud, Aníbal Cruz, quien renunció al cargo el miércoles en medio de la crisis, dijo que la emergencia “no es sólo sanitaria, también es social y más adelante será económica”.\nLe reemplaza en el cargo Marcelo Navajas.\nBolivia mantuvo una estabilidad económica con tasas de crecimiento anual por encima del 5% en promedio en la última década, pero una caída en los ingresos y un creciente déficit comercial debilitaron su economía, advirtieron autoridades y empresarios.\nDesde que comenzó la emergencia los candidatos no aparecen en público a excepción de la presidenta interina Jeanine Áñez, cuya gestión de la crisis podría darle réditos, según analistas.\nUna encuesta de la empresa Ciesmori publicada por el diario El Deber la semana pasada dio una calificación de 7 sobre 10 a la mandataria por la gestión de la emergencia. El margen de error del estudio fue de +-3%.\n“Áñez tomó medidas a destiempo y la ayuda del gobierno no está llegando a los más necesitados y eso afectará su imagen”, replicó Montaño.\nAntes de la emergencia las encuestas daban un primer lugar, pero sin mayoría suficiente para ganar en primera vuelta al partido de Morales, que postula al exministro de Economía Luis Arce frente a una dispersa oposición en la que sobresalen el expresidente Carlos Mesa, del centrista Comunidad Ciudadana (CC), seguido de Añez de la derechista Juntos.\nA diferencia de los dos primeros las encuestas dicen que Áñez es la que más crece en la preferencia electoral.\nA pesar de la pausa electoral, el MAS y el gobierno de Áñez parecen estar enfrentados en medio de la emergencia sanitaria. Varios ministros de Áñez acusaron al partido de Morales de estar detrás de algunas protestas en contra de la cuarentena.\n“La tregua política no es acatada por el mismo gobierno que nos acusa sin pruebas”, dijo Montaño.\nTras casi 14 años en el poder, Morales renunció en noviembre pasado tras denuncias de fraude y violentas protestas que cobraron la vida de 35 personas. El mandatario alegó que fue víctima de un golpe de Estado. Áñez asumió interinamente para garantizar la transición hacia un nuevo gobierno elegido en las urnas.", "url": "https://apnews.com/1ecfb9f8c9af42969e20eaa3f89adeb2"}