{"authors": ["Swati Gupta", "Esha Mitra", "Vedika Sud"], "date_download": "2020-05-04 15:58:52", "date_modify": "2020-05-04 15:58:52", "date_publish": "2020-03-30 18:43:27", "description": "The Indian state of Uttar Pradesh has sparked controversy after migrant workers, returning home during a nationwide coronavirus lockdown, were doused in bleach disinfectant used to sanitize buses.", "filename": "2020_03_30_india_india-migrant-workers-sprayed-intl_index_1588607932.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330125029-01-indian-migrant-workers-disinfectant-spray-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_30_india_india-migrant-workers-sprayed-intl_index_1588607932.html", "title": "Migrant workers sprayed with disinfectant in one Indian state", "title_page": "India coronavirus: Migrant workers sprayed with disinfectant in Uttar Pradesh - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New Delhi (CNN) The Indian state of Uttar Pradesh has sparked controversy after migrant workers, returning home during a nationwide coronavirus lockdown, were doused in bleach disinfectant used to sanitize buses.\nVideo showed three people, dressed in protective gear, spraying the liquid directly on a group of Indian workers as they sat on the ground in the northern city of Bareilly.\nAshok Gautam, a senior officer in charge of Covid-19 operations in Uttar Pradesh, told CNN as many as 5,000 people have been \"publicly sprayed\" when they arrived before they were allowed to disperse.\n\"We sprayed them here as part of the disinfection drive, we don't want them to be carriers for the virus and it could be hanging on their clothes, now all borders have been sealed so this won't happen again,\" he said.\nHe said the disinfectant used was a solution made from bleaching powder, and was not harmful to the human body.\nRead More", "url": "https://www.cnn.com/2020/03/30/india/india-migrant-workers-sprayed-intl/index.html"}