{"authors": [], "date_download": "2020-05-04 20:03:46", "date_modify": "2020-05-04 20:03:46", "date_publish": "2020-04-07 21:57:03", "description": "MARSHALLTOWN, Iowa (AP) — A union leader alleged Tuesday that a large Iowa nursing home for veterans is forcing some employees to work after they were exposed to a colleague who tested positive...", "filename": "_ae5ee59701803118f855ee781d734476_1588622626.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ae5ee59701803118f855ee781d734476_1588622626.html", "title": "Union says Iowa Veterans Home workers at risk of infection", "title_page": "Union says Iowa Veterans Home workers at risk of infection", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MARSHALLTOWN, Iowa (AP) — A union leader alleged Tuesday that a large Iowa nursing home for veterans is forcing some employees to work after they were exposed to a colleague who tested positive for coronavirus.\nAFSCME Council 61 President Danny Homan said the situation at the Iowa Veterans Home in Marshalltown is potentially putting employees and its more than 500 residents at risk of infection.\nHoman said asymptomatic employees were told Tuesday that they had to continue working even if they worked closely with an individual who recently tested positive. He said one employee received direction from a doctor to self-quarantine but the home “refused to follow” that directive.\n“The state of Iowa must act immediately to ensure that veterans and the staff who care for them are not needlessly exposed,” Homan said.\nHome Commandant Timon Oujiri said late Tuesday that three employees have tested positive, including one last week, and four others await results. He said that 24 residents have been tested so far and all have been negative.\nOujiri said employees who were exposed to colleagues known to be infected have been warned and thus far none have reported having symptoms. The three staff who tested positive each worked in different buildings on the campus, he said.", "url": "https://apnews.com/ae5ee59701803118f855ee781d734476"}