{"authors": ["Alan Suderman", "Sarah Rankin"], "date_download": "2020-05-04 20:25:39", "date_modify": "2020-05-04 20:25:39", "date_publish": "2020-04-16 19:56:09", "description": "RICHMOND, Va. (AP) — More than 100,000 Virginians filed unemployment claims in the past week, new data released Thursday by the U.S. Department of Labor shows. It’s a significant drop from the...", "filename": "_bf6664f5fae1ef552a73ffc04a005728_1588623939.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9f8f14ea3aea46b6b5702fe46fd65265/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_bf6664f5fae1ef552a73ffc04a005728_1588623939.html", "title": "Weekly unemployment claims in Virginia top 100,000", "title_page": "Weekly unemployment claims in Virginia top 100,000", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Kelly Peter of Ashburn, left, and other protesters attend the ReOpen Virginia protest outside of the Capitol Square as they are not allowed to be inside of the ground in Richmond, Va. on Thursday, April 16, 2020. (Daniel Sangjib Min/Richmond Times-Dispatch via AP)\nKelly Peter of Ashburn, left, and other protesters attend the ReOpen Virginia protest outside of the Capitol Square as they are not allowed to be inside of the ground in Richmond, Va. on Thursday, April 16, 2020. (Daniel Sangjib Min/Richmond Times-Dispatch via AP)\nRICHMOND, Va. (AP) — More than 100,000 Virginians filed unemployment claims in the past week, new data released Thursday by the U.S. Department of Labor shows. It’s a significant drop from the nearly 150,000 from a week before but still a massive number compared to filings before the coronavirus outbreak.\nOverall there have been more than 415,000 claims filed in the last month, which is about 9% of the state’s workforce.\nThe new figures come amid growing unhappiness from Republican lawmakers and others with Democratic Gov. Ralph Northam’s plans to keep non-essential businesses closed through May 8.\nSome Republican leaders have urged Northam to release a schedule to allow businesses to reopen as soon as possible and a few dozen people gathered peacefully near the governor’s mansion in Richmond on Thursday afternoon to protest closures and social distancing measures.\n“Hundreds of thousands of Virginians are hurting right now. They’re scared, and they need something to hold on to ... They need to know that there’s a light at the end of the tunnel, that this nightmare is going to end,” House Republican Leader Todd Gilbert and other House Republicans said in a statement.\nOthers said many Virginia businesses will not survive an indefinite closure. Nicole Riley, the Virginia director of the National Federation of Independent Business, said her members understand the need for caution but also require advance notice on when they can start operating again.\n“We need a date and we need a date certain,” she said.\nOutside the Executive Mansion Thursday, some protesters sat quietly on chairs or picnic blankets while others held signs, and one pocket of demonstrators chanted, “End the lockdown. Northam must go.” Most were not wearing masks.\nTara Thessen said the number of deaths in Virginia, which had climbed to just over 200 on Thursday — did not justify the restrictions implemented on a state of about 8.5 million people.\n“I think we need to reopen. We need people to be working,” said Thessen, a 42-year-old from Rockville who brought her four young children.\nNortham’s spokeswoman, Alena Yarmosky, said in a statement that the governor, who is a doctor, will “continue to make decisions based in science, data, and public health.”\n“He is grateful to the millions of Virginians who are taking this seriously and working together to protect themselves, their families, and their communities,” she said.\nThe crowd, which organizers said in a press release was expected to be in the thousands, was roughly the same size as the police and press there to cover it on a sunny, warm spring day.\nFor most people, the new coronavirus causes mild or moderate symptoms that clear up within weeks. For some it can cause more severe illness, including pneumonia and death.\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak.", "url": "https://apnews.com/bf6664f5fae1ef552a73ffc04a005728"}