{"authors": ["Opinion Van Jones"], "date_download": "2020-05-04 16:54:55", "date_modify": "2020-05-04 16:54:55", "date_publish": "2020-04-08 20:59:22", "description": "Van Jones writes that in the age of the coronavirus, Sanders' ideas no longer seem like radical throwbacks to 1960s idealism. Today, they feel like hard-headed responses to the deadly challenges of the 21st century.", "filename": "2020_04_08_opinions_bernie-_bcf55b1a142908100a7b89938a9411f2_index_1588611295.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408112551-110-bernie-sanders-lead-image-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_bernie-_bcf55b1a142908100a7b89938a9411f2_index_1588611295.html", "title": "Sanders exits as pandemic redeems his core ideas", "title_page": "Sanders exits as pandemic redeems his core ideas (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN host Van Jones is a former Obama administration official, a bestselling author and the CEO of the REFORM Alliance, a criminal justice organization. The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) Even though he is 78 years old, history will someday remember Vermont Sen. Bernie Sanders as a leader who was ahead of his time.\nIn the age of the pandemic, Sanders' ideas no longer seem like radical throwbacks to 1960s idealism. Today, they feel like hard-headed responses to the deadly challenges of the 21st century.\nJust consider the following:\nHealth care for all: The case for the Sanders-championed Medicare for All is stronger than ever due to the pandemic. The populations hit hardest by Covid-19 also appear to be many of the ones who cannot afford basic health coverage. It is hard to see how our current health care system survives this crisis without radical change. Even the Trump administration announced Friday it will use federal funding to pay hospitals for the treatment of Covid-19 patients who have no insurance.\nHousing and homelessness: The mandate for most Americans right now is to shelter in place. But so many people don't have a place. Millions of homeless people are therefore vulnerable to the virus -- more susceptible to catching it and more capable of spreading it. Sanders' proposal to end the housing crisis by investing $2.5 trillion to build nearly 10 million permanently affordable housing units seems a lot more sensible now.\nClimate threat: This pandemic has shown us that \"we the people\" are fatally blind to threats we can't see with our own eyes. Even as we're learning about travesties taking place at our local hospitals, too many people don't believe the threat is real until it affects them personally. Yesterday's Hurricane Katrina or today's viral pandemic will be tomorrow's global climate catastrophe. Sanders has done everything in his power to get ahead of imminent disasters. Americans may now listen to people like Sanders who take science seriously and propose bold solutions like the Green New Deal.\nPaid family leave: Sanders has long championed the idea of \"family leave\" for workers. Having children, falling ill or taking care of a family member shouldn't cost you your job -- nor should quarantining due to a global pandemic.\nA lasting movement\nSanders' supporters may be disappointed, but they should not be disheartened. Though Sanders' base was not broad enough to get him the nomination, the people who stood behind him represent much of America's future.\nMany of today's young people revere Sanders , and they will play a growing role in our society. He had strong showings with Latino/Latina voters, who will make up an increasing share of the American electorate in the decade to come. And, if you look only at people under the age of 35, Sanders may have led the strongest, multiracial progressive movement in modern American history.\nSanders was the first progressive candidate since former President Barack Obama, who ran by inspiring and leading a true movement by the people and for the people. And that movement is not going away.\nWhy? Because Sanders has a youthful, charismatic and powerful set of successors to carry on the fight -- and many of them are younger women of color. Nina Turner, a former Ohio state senator and Sanders campaign surrogate, has become a fixture of American politics. And the so-called #Squad -- Reps. Alexandria Ocasio-Cortez of New York, Ilhan Omar of Minnesota, Ayanna Pressley of Massachusetts, and Rashida Tlaib of Michigan -- will be fighting for (and possibly implementing) Sanders-like ideas for decades to come.\nIn other words, he transformed the Democratic Party without winning its nomination or even joining it. Along the way, he made the impossible seem possible. That counts for something.\nSanders' fatal flaws\nThere is a reason, of course, that Sanders lost his final shot at the presidency. His condemnation of wealthy people was always too sweeping , in my view. After all, Oprah Winfrey and Jay-Z are both in the \"billionaire class.\" Does anyone blame them for America's woes? Categorically condemning all rich people, as he often seemed to do, turned potential allies into determined adversaries.\nJUST WATCHED Sanders: Path towards victory is virtually impossible Replay More Videos ... MUST WATCH Sanders: Path towards victory is virtually impossible 02:55\nSecondly, he showed too little passion even for Americans who run small businesses or who aspire to do so. At a minimum, he could have expanded his circle by enthusiastically embracing the growing cadre of business leaders -- like those in the Social Venture Circle Green America or GreenBiz -- who are socially and ecologically responsible. Unfortunately, he generally missed those opportunities.\nAnd, in the end, his insistence on defending the finer qualities of Cuban dictator Fidel Castro's literacy programs was probably fatal.\nBut I am a Gen X-er. America's youth read Sanders quite differently than do those of us who survived the Cold War.\nLessons for Democrats\nMy youngest colleague at the REFORM Alliance -- the criminal justice organization I lead -- summed him up this way: \"Bernie managed to be cool in a way that wasn't cheap. Radical in a way that felt real. Aggressive -- but passionate, not a bully,\" said Gus Alexander. \"One of the oldest candidates -- he managed to rise as the most relevant for young people. The one who got it. Understood. People are pointing to how he reshaped the conversation, the landscape, moved the needle in such a big way. That's my take on Bernie, too. And I'm grateful to him for it.\"\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nAs he exits the race for president, the times are tragically thrusting Sanders' core ideas to the forefront. On the issues of health care for all, worker empowerment and many others, presumptive Democratic nominee Joe Biden and the Democratic Party would be quite wise to catch up to the Vermont senator.", "url": "https://www.cnn.com/2020/04/08/opinions/bernie-sanders-exits-pandemic-redeems-ideas-jones/index.html"}