{"authors": ["Hema Ramaprasad", "For Cnn"], "date_download": "2020-05-04 16:22:07", "date_modify": "2020-05-04 16:22:07", "date_publish": "2020-04-06 02:03:10", "description": "Normally, Indian Railways runs more than 20,000 passenger trains a day, on long-distance and suburban routes, from 7,349 stations across India.", "filename": "2020_04_05_asia_indian-rail_9af3c51fc61734e2a9ad3dac65f56a18_index_1588609327.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405143755-01-indian-railways-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_asia_indian-rail_9af3c51fc61734e2a9ad3dac65f56a18_index_1588609327.html", "title": "India has closed its railways for the first time in 167 years. Now trains are being turned into hospitals", "title_page": "India coronavirus: Trains are being turned into hospitals as railways close for the first time in 167 years - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Bangalore, India (CNN) When Prime Minister Narendra Modi imposed a nationwide lockdown on March 25, Indian Railways took the unprecedented move of suspending passenger trains across the country until April 14.\nIt was the first time in 167 years that Asia's oldest rail network had been suspended.\nNow the railway network has decided to convert as many as 20,000 old train carriages into isolation wards for patients as the virus spreads.\nThis handout photograph from Indian Railways show how old trains will be used as Covid-19 isolation ward\nThe network, which is the world's fourth-largest rail operator and India's biggest employer, already operates 125 hospitals across the nation, so has the expertise to expand into mobile beds.\nOn April 1, India had recorded 4,288 cases of Covid-19 , including 117 deaths, according to Johns Hopkins University -- a relatively small number for a nation of 1.3 billion. While India's hospital system isn't overwhelmed yet, the repurposed trains could ease some of the pressure if the number of coronavirus patients begin to rise.\nPreparing to Combat Coronavirus: In a novel initiative, Railways has converted train coaches into isolation wards for COVID-19 patients 🛌\nNow, Railways will offer clean, sanitised & hygienic surroundings for the patients to comfortably recover. #IndiaFightsCorona pic.twitter.com/miYO3LOGfN — Piyush Goyal (@PiyushGoyal) March 28, 2020\n\"Now, the railways will offer clean, sanitized and hygienic surroundings for the patients to comfortably recover,\" Piyush Goyal, the Railways Minister said in a tweet.\nIndia's railway network\nNormally, Indian Railways runs more than 20,000 passenger trains a day, on long-distance and suburban routes, from 7,349 stations across India.\nThe lockdown has put nearly 67,368 kilometers of track out of use -- enough to circle the equator 1.5 times -- and left thousands of passenger trains sitting idle. Freight trains, or goods trains as they are called in India, remain operational.\nAn Indian railway employee works to convert a train coach into an isolation ward for the fight against the new coronavirus in Gauhati, India, Sunday, March 29, 2020.\nRailway bosses have instructed each of India's 16 railway zones to identify non-air conditioned carriages that are no longer in operation on passenger routes to turn into hospitals, and have them ready for use in case of an emergency.\nThe first 5,000 isolation wards will be ready within a fortnight, and if necessary, more carriages can be converted within 48 hours, said Rajesh Dutt Bajpai, executive director of information and publicity at the Railway Board.\nThis handout photograph from Indian Railways show how old trains will be used as Covid-19 isolation ward.\nEach sanitized carriage will be able to accommodate up to 16 patients, alongside a nurses' station, a doctor's cabin, and space for medical supplies and equipment.\nThe trains, once ready, will be sent to any location that might be facing a hospital bed crunch due to a potential spike in positive cases.\nLocal health authorities will assign government doctors, paramedics, nurses, and volunteers to the trains.\nThe Indian government has also instructed railway factories to assess the feasibility of manufacturing hospital beds, stretchers, medical trolleys, masks, sanitizers, aprons, and medical apparatus such as ventilators for use in railway hospitals and other government hospitals.\nIndian railway employees fix mosquito nets as they work to convert a train coach into an isolation ward for the fight against the new coronavirus in Gauhati, India, Sunday, March 29, 2020.\nBed shortage\nEven before the pandemic, India was suffering a shortage of hospital beds.\nAccording to OECD , India has 0.5 hospital beds available for every 1,000 people. Most of these are clustered in urban areas, and availability differs hugely between states.\nIn the eastern state of Bihar, for example, there are 0.11 beds per 1,000 people, while West Bengal has 2.5 beds per 1,000 people.\nChina has a national average of four hospital beds per 1,000 people -- and that was before it built a 1,000-bed hospital in 10 days in Hubei province, the epicenter of its outbreak.\n\"We have seen what China has gone through. It is imperative to increase this density, by whatever means in the shorter term, and more systematically in the longer term, once this outbreak is over,\" said Shahid Jameel, an Indian virologist and CEO of Wellcome Trust/DBT India Alliance, a public charity that funds research in health and biomedical sciences.\nLabourers work on train coaches that will be used as temporary isolation wards in preparation for coronavirus-infected patients during a government-imposed nationwide lockdown as a preventive measure against the Covid-19 coronavirus, at a workshop in Allahabad on April 4, 2020.\nWith the number of Covid-19 positive cases rising, experts say the lack of robust public healthcare remains India's biggest challenge.\n\"It (isolation wards in train carriages) is a good initiative. The Railways and the Government should be commended for it,\" said Jameel, the Indian virologist.\n\"But, this is only a short-term solution. When this is over (and it will be), let this be a wake-up call to invest more towards improving health infrastructure and research.\"\nHospital-on-wheels\nIndian Railways has experience in running hospitals on trains. Launched in 1991, the Lifeline Express provides on-the-spot diagnostic, medical and advanced surgical treatment for adults and children.\nIn its 29 years of service, the hospital-on-wheels has traveled across 19 Indian states and treated over 1 million people.\nStarted as a collaboration between the Impact India Foundation, Indian Railways, and the Indian Health Ministry, the train is funded by the Institute of International Finance (IIF), international charities, Indian corporations, and individuals.\nWorkers wearing facemasks carry on works on train coaches that will be used as temporary isolation wards in preparation for Covid-19 coronavirus patients, at a coach factory workshop in Chennai on March 30, 2020.\nThe hospital train is equipped to treat a variety of ailments, from cataracts, cleft lips, hearing problems, and epilepsy, to mobility issues, plastic surgeries, dental surgeries, cancer screening and more.\nThe Lifeline Express is equipped with an operation theater, treatment rooms, recovery wards, a pantry car, and accommodation for medical staff.\nThe new coronavirus trains are not designed to function as full-service hospitals, but local health officials will have the option of using them for Covid-19 positive patients who are not critically ill.", "url": "https://www.cnn.com/2020/04/05/asia/indian-railways-coronavirus-hospitals-intl-hnk/index.html"}