{"authors": ["Analysis Gloria Borger", "Cnn Chief Political Analyst"], "date_download": "2020-05-04 16:02:23", "date_modify": "2020-05-04 16:02:23", "date_publish": "2020-04-01 17:52:41", "description": "In an odd way, it's President Donald Trump who seems the most taken aback by recent developments in the coronavirus crisis.", "filename": "2020_04_01_politics_borger-trump-coronavirus_index_1588608143.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331230558-01-trump-coronavirus-briefing-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_politics_borger-trump-coronavirus_index_1588608143.html", "title": "Trump confronts reality: You can't spin a germ", "title_page": "Trump confronts reality: You can't spin a germ  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) In an odd way, it's President Donald Trump who seems the most taken aback by recent developments in the coronavirus crisis.\nHow confusing it must be for a spinmeister who has been able to say that everything from the Mueller and Ukraine investigations were a hoax to now confront a virus, an untamed germ that he couldn't or wouldn't see coming. He can't intimidate a virus, demean it with a dismissing epithet or bully it.\nSomehow his \"I alone can fix it\" refrain in his convention acceptance speech seems more hollow than ever. And sadly, his description of \"American carnage\" in his inaugural speech now takes on a grim new meaning.\nHistory shows that in a crisis, citizens generally rally around their president. So it was for Bush 43 after the September 11 attacks. And for Bush 41 during the Gulf War. And President Trump calls himself a wartime president as his approval ratings inch up.\nOf course, the President's new resolve is evident now for all to see. How could it be otherwise? April may be the cruelest month as scientists tell the American people to be ready for an awful spring of sickness rather than renewal. They see graphs charting death curves beyond anyone's previous imaginings. They are being told that wearing masks outside might be a good idea. And they're not working. Just worrying.\nRead More", "url": "https://www.cnn.com/2020/04/01/politics/borger-trump-coronavirus/index.html"}