{"authors": ["Eric Levenson"], "date_download": "2020-05-04 16:07:24", "date_modify": "2020-05-04 16:07:24", "date_publish": "2020-04-01 21:14:57", "description": "Using the language of war to talk about the efforts to stop coronavirus can help inform and motivate the public, but they can also mislead policy-makers.", "filename": "2020_04_01_us_war-on-coronavirus-attack_index_1588608444.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200318103646-05-coronavirus-travel-restrictions-0317-serbia-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_war-on-coronavirus-attack_index_1588608444.html", "title": "Officials keep calling the coronavirus pandemic a 'war.' Here's why", "title_page": "Officials keep calling the coronavirus pandemic a 'war.' Here's why - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Donald Trump has called himself a \" wartime president \" and said coronavirus is an \"invisible enemy.\" The former CDC director has warned of a \"long war ahead.\" New York Gov. Andrew Cuomo has called on the public to support our \"troops,\" otherwise known as health care workers.\nThe now-common metaphors comparing the efforts to stop coronavirus to a military war fit smoothly in many ways. Like in war, a pandemic has life-and-death decisions, an \"enemy\" who can strike at any time, \"battles\" on the \"front lines\" and calls for the \"home front\" to support the effort.\n\"People understand what a war means, what the consequences of a war mean in terms of pain and loss and death,\" said Dr. Leana Wen, a visiting professor of health policy and management at the George Washington University Milken School of Public Health. \"They understand the sacrifices that have to occur during wartime and they understand the massive mobilization of resources needed in a war.\"\nStill, the fight to stop coronavirus is of course not actually a war between countries -- it is a global public health emergency. War metaphors can help inform and motivate the public, but they can also mislead policymakers and the public.\n\"When in a war, you're killing people and you've got an enemy. I understand the need to make the virus into the enemy,\" said Dr. Larry Brilliant, an epidemiologist who helped to eradicate smallpox . \"There's a harm to it. When you are in a war, the only thing you do is the war. We have a lot of other things we do.\"\nThe power of war metaphors\nThe primary reason officials use war metaphors is to convey a sense of urgency and emergency. Like with the \"War on Poverty\" or the \"War on Drugs,\" the idea is to turn an issue into the issue.\n\"It has a focusing effect that saying 'this is a public health crisis' would not,\" said Juliette Kayyem, a CNN national security analyst and faculty chair of the Global Health and Security Project at the Harvard Kennedy School. \"This truly gets to our safety and security as a nation just as a war would, just as an enemy invading our shores would. It's helpful for people seeing it that way and mobilizing people in that fight.\"\nThe war metaphor also shows the need for everyone to mobilize and do their part on the home front. For many Americans, that means taking social distancing orders and hand washing recommendations seriously. For businesses, that means shifting resources toward stopping the outbreak, whether in terms of supplies or manpower.\n\"You're reaching for some way to think about the vast challenge we're facing and the need to mobilize for success,\" said Dr. Josh Sharfstein, the vice dean for public health practice and community engagement at Johns Hopkins Bloomberg School of Public Health. \"The need to mobilize is so great and impacts so much of our lives that I think it's only 'war' -- it's a way to try to capture that everybody has to do their part.\"\nFurther, the war metaphors can explain complicated ideas in understandable terms.\nKayyem, for example, said that the failure to provide health care workers with enough personal protective equipment , or PPE, is like going to war without ammunition. Some doctors have described hospitals overrun by coronavirus as \" war zones \" to explain the extent of the daily pain, despair and suffering.\nFinally, politicians have used the war analogy to try to cut through partisan disagreements and unite people against a common enemy.\n\"The president said this is a war,\" Cuomo said Monday. \"I agree with that. This is a war. Then let's act that way, and let's act that way now. And let's show a commonality and a mutuality and a unity that this country has not seen in decades, because the Lord knows we need it today more than ever before.\"\nThe flaws of war metaphors\nBut the war metaphors do have drawbacks. In particular, the patriotism that comes with war language often leads to country-specific decisions that are antithetical to solving a pandemic, which is by definition a global issue.\n\"Everyone in the world will get this virus unless protected by immunity, or (they already) got the disease, or by quarantine and social distancing,\" Brilliant said. \"Therefore, you and I are as much at risk by someone in a slum in Nairobi getting the disease as someone in New York City. Because ultimately it will ping-pong back to us.\"\n\"You have to look at problems in other countries as if they are our problem only different in time. Even if we cleared out every case in the United States right now by social distancing we would remain vulnerable as long as there's a case anywhere in the world. This is not a time to emotionally close our borders to the rest of the world.\"\n\"In general, evidence shows that restricting the movement of people and goods during public health emergencies is ineffective in most situations and may divert resources from other interventions,\" WHO said.\nDr. Wen noted that the need for global cooperation was one area in which the war comparison does not quite fit.\n\"One difference in this case is all of us on the planet are united against this virus. Each of our fates are tied to each other, but in a different way than in a war,\" she said. \"What's good for one person is good for everybody else.\"\nSeparately, the war language can displace blame. President Trump has portrayed coronavirus as a surprise attack, but public health experts have been warning about stockpiling supplies and coordinating strategies for a pandemic for years.\n\"For people in public health this is not out of the blue,\" said Cheryl Healton, the dean of the NYU School of Global Public Health. The war metaphor \"makes it seem like it was something you couldn't control. War is like a last resort. There were many other alternatives to this.\"\nJUST WATCHED Burns: Pandemic 'an opportunity' for authoritarian leaders Replay More Videos ... MUST WATCH Burns: Pandemic 'an opportunity' for authoritarian leaders 17:40\nHealton also said war-like language can lead to short-term solutions that ignore underlying issues.\n\"The problem with the word war is it's too acute and makes it sound like it just kind of happened and we can fix it quickly and move on, as opposed to what happened is from systemic problems that need to be reformed so they don't happen again,\" she said.\nShe said government funding has long focused on treatment rather than prevention -- the equivalent of preparing for war but ignoring diplomacy.\nThe war metaphors can create political opportunities for authoritarians, too. The idea of a nation under attack can be used by authoritarian leaders to seize more power, such as what already happened in Hungary or in the Philippines\nAs for America's actual military, its troops are as vulnerable to coronavirus as anyone else.\nFor example, at least 70 sailors aboard the USS Theodore Roosevelt, a US Navy aircraft carrier, have coronavirus, and the ship's commander has warned Navy leadership that decisive action is required to save the crew.\n\"We are not at war,\" Capt. Brett Crozier wrote in a memo to the Navy's Pacific Fleet, three US defense officials have confirmed to CNN. \"Sailors do not need to die.\"", "url": "https://www.cnn.com/2020/04/01/us/war-on-coronavirus-attack/index.html"}