{"authors": [], "date_download": "2020-05-04 16:59:27", "date_modify": "2020-05-04 16:59:27", "date_publish": "2020-04-09 22:15:34", "description": "With everything from cash back to monthly dining credits, these are the best credit cards to use when ordering from food delivery services.", "filename": "2020_04_09_cnn-underscored_best-food-delivery-credit-cards_index_1588611567.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409154616-underscored-food-delivery-service-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_cnn-underscored_best-food-delivery-credit-cards_index_1588611567.html", "title": "Best Food Delivery Credit Cards: Rewards & Credits", "title_page": "Best Food Delivery Credit Cards: Rewards & Credits - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN Underscored reviews financial products such as credit cards and bank accounts based on their overall value. We may receive a commission through The Points Guy affiliate network if you apply and are approved for a card, but our reporting is always independent and objective.\nThe novel coronavirus has resulted in many restaurants closing their dining rooms entirely for the time being. That's creating a surge in demand for food delivery services like DoorDash, Seamless, GrubHub and Uber Eats, which allow folks to still order from their favorite restaurants but have the food delivered to their door.\nBut which credit card should you use when you order from a food delivery service? We've rounded up the best credit cards for food delivery services, while paying close attention to cards that also include strong earnings for dine-in options, so that when things return to normal, you'll be able to have the best of both worlds.\nThe best credit cards for food delivery\nCapital One® SavorOne® Cash Rewards Credit Card: Best for 0% interest\nChase Sapphire Reserve: Best for DoorDash\nChase Sapphire Preferred Card: Best cheaper alternative for DoorDash\nUber Credit Card: Best for Uber Eats\nAmerican Express® Gold Card: Best for Seamless and GrubHub\nWells Fargo Propel American Express® card: Best no-annual-fee card\nCapital One® Savor® Cash Rewards Credit Card: Best for dining and groceries\nAmerican Express® Green Card: Best for flexible travel rewards\nWhy did we select these cards as our best credit cards for food delivery? Dive into the details of each card with us, and see how they stack up.\nBest for 0% interest: Capital One SavorOne Cash Rewards\nThe no-annual-fee Capital One SavorOne card earns 3% cash back on all dining and entertainment, as well as 2% cash back on groceries. Since many food delivery services code as \"dining\" on the SavorOne card, you'll earn 3% back when you order food for delivery as well.\nIf your income has recently dropped and you need help making ends meet, the SavorOne card also offers 0% interest on all purchases for the first 15 months you have the card (then a variable 15.49% to 25.49% afterward), as well as a 0% introductory APR for 15 months on balance transfers (then a variable 15.49% to 25.49% afterward).\nThese introductory interest offers enable you to make here-and-now purchases and pay them off over a longer period of time, saving big bucks on interest. Plus, you'll earn a one-time $150 cash bonus after you spend $500 on purchases within the first 3 months from account opening. Oh, and did we mention that there's no annual fee on the SavorOne card? (There isn't.)\nBest for DoorDash: Chase Sapphire Reserve\nThe Chase Sapphire Reserve isn't cheap, but it offers a pair of solid DoorDash perks.\nThe Chase Sapphire Reserve is an elite credit card for those who spend money primarily on dining and travel. It earns 3 points per dollar on all forms of dining globally, but the card recently also added up to $60 in annual DoorDash credits in both 2020 and 2021.\nThis credit is incredibly easy to use — just charge your DoorDash order to your Sapphire Reserve, and you'll get a statement credit offsetting the charge, up to $60 this year alone. You also don't have to use the entire $60 in one fell swoop -— you can use it across several separate orders over time.\nBut before you place that DoorDash order, make sure you also take advantage of another new Chase Sapphire Reserve perk — up to two years of free DashPass membership. DashPass is a program that offers free delivery from eligible DoorDash restaurants, and you can get it at no cost just by adding your Sapphire Reserve as the default payment method in the DoorDash app, and then activating your DashPass membership.\nThe Chase Sapphire Reserve is an expensive card, but it somewhat softens the blow of its $550 annual fee with a $300 annual travel credit that covers any travel at all — parking lots, garages, and ride-sharing included — charged to the card. However, if you're looking for a cheaper alternative that earns the same type of points, the Chase Sapphire Preferred card (below) is worth considering instead.\nRelated: Is the Chase Sapphire Reserve worth the annual fee?\nBest cheaper alternative for DoorDash: Chase Sapphire Preferred\nThe less-expensive version of the Chase Sapphire Reserve, the Chase Sapphire Preferred offers 2 points per dollar on all travel and dining purchases, 5 points per dollar on Lyft rides and a generous 60,000-point sign-up bonus after you spend $4,000 on purchases in the first three months after opening the account — all for a reasonable $95 annual fee.\nAnother key benefit? Discounts on DoorDash food delivery orders via a complimentary DashPass membership, valid through at least Dec. 31, 2021, and a comprehensive suite of purchase and travel protections. Plus most food delivery purchases code as \"dining\" on the Sapphire Preferred, so you'll earn double points when you have food delivered.\nThe points you earn with the Chase Sapphire Preferred can be redeemed for travel through Chase's Ultimate Rewards travel portal at a rate of 1.25 cents per point, so you're guaranteed at least $750 in travel right off the bat from the sign-up bonus, and potentially much more if you take some time and effort to maximize Chase's 13 airline and hotel partners.\nThe Chase Sapphire Preferred doesn't offer the same luxury travel perks — like airline lounge access and travel credits — as the Chase Sapphire Reserve. However, the $95 annual fee is significantly lower, and possibly a better choice right now given the current restrictions on travel.\nRelated: Read CNN Underscored's complete review of the Chase Sapphire Preferred.\nBest for Uber Eats: Uber Credit Card\nThe Uber credit card earns 5% back on Uber Eats deliveries.\nIf your preferred food delivery service is Uber Eats, the Uber Credit Card is the card for you. It earns 5% back on all Uber services in the form of Uber Cash, which includes Uber Eats, as well as Uber rides and JUMP bikes and scooters.\nBeyond that, the Uber credit card earns 3% back on hotels, airfare and restaurant purchases, and 1% on everything else. Plus, if you pay your wireless bill with your Uber credit card, you'll enjoy cell phone protection, up to $600 per eligible claim with a $25 deductible, and a maximum of two claims and $1,000 per 12-month period.\nWhile the cash back rates are solid here, keep in mind that all earnings are earned in the form of Uber Cash, not dollars. This keeps you locked in the Uber ecosystem, and makes the rewards somehwat inflexible. But since you can use Uber Cash on Uber Eats orders, you can turn around and put your rewards back into more food delivery if you prefer.\nFinally, you'll earn a bonus of $100 in Uber Cash after you spend $500 on the Uber Credit Card within the first 90 days after opening the account. That's not amazing, but it's certainly a plus for a card with no annual fee.\nBest for Seamless and GrubHub: American Express Gold\nYou'll get $10 each month in GrubHub and Seamless credits with the American Express Gold card.\nAmex redesigned its Amex Gold card last year to cater to both eating in and dining out, offering 4 points for every dollar you spend at supermarkets in the United States up to $25,000 per year (1x thereafter), and an unlimited 4 points per dollar at eateries worldwide. Most food delivery services will code as \"restaurants\" on the Amex Gold card, meaning you'll earn 4 points per dollar for those purchases.\nYou'll also enjoy up to $120 in annual dining credits — which are broken up into $10 statement credits each month — when you pay with the Amex Gold at food delivery services Grubhub and Seamless, along with purchases at The Cheesecake Factory, Ruth's Chris Steak House, Boxed and participating Shake Shack locations.\nThe Amex Gold's 35,000-point welcome bonus — available after you spend $4,000 on purchases in your first three months of card membership — isn't spectacular, but those Amex Membership Rewards points are worth at least $350 when you redeem them via Amex Travel for airfare, and you can potentially get even more value than that with Amex's transfer partners.\nRelated: Read CNN Underscored's complete review of the American Express Gold card.\nBest no-annual-fee card: Wells Fargo Propel American Express\nThe Wells Fargo Propel American Express card is loaded with perks and features, especially when you consider that it has no annual fee. You'll earn 3 points per dollar on dining out and ordering in, as well as on gas stations, rideshares and transit (which includes flights, hotels, homestays and car rentals) and on popular streaming services.\nThere's also a sign-up bonus on the Wells Fargo Propel card of 20,000 bonus points when you spend $1,000 in purchases in the first 3 months after opening the card. Points earned with the card are worth 1 cent per point, so the bonus is worth $200 right off the bat.\nIf you're also on the hunt for a card that'll buy you some time with here-and-now purchases, the Wells Fargo Propel serves double duty. You'll find a 0% introductory interest rate on both purchases and balance transfers, though be sure to clear your debt within the first 12 months, because after that the rate jumps to a variable 13.99%-25.99%, depending on your creditworthiness.\nWith the Wells Fargo Propel, you'll even be covered for up to $600 in the event your cell phone is stolen or damaged (subject to a $25 deductible), so long as you pay your cell phone bill with the card.\nBest for dining and groceries: Capital One Savor Rewards Card\nFood delivery services earn 4% on the Capital One Savor, and some grocery deliveries earn 2% as well.\nThe Capital One Savor Cash Rewards Card is a more expensive version of the Capital One SavorOne, as it costs $95 per year (though the annual fee is waived for the first year). However, it earns a higher 4% cash back on dining and entertainment. Given that food delivery services typically code as \"dining,\" that's an exceptional return.\nThere's also 2% cash back at grocery stores on the Capital One Savor and 1% on all other purchases. If you order groceries directly from the grocery store for delivery, you should earn the 2% cash back, though grocery delivery services themselves such as Amazon Fresh may code differently and not earn bonus cash back.\nYou'll also earn a one-time $300 cash bonus once you spend $3,000 on purchases within 3 months from account opening. There are no foreign transaction fees, and the card includes perks such as extended warranty protection, travel accident insurance, and complimentary concierge service.\nIf you're willing to pay an annual fee to earn a bit more in cash back on your food delivery purchases, the Capital One Savor card could make sense, especially with a sign-up bonus that's double the one offered on the SavorOne card.\nBest for flexible travel rewards: American Express Green Card\nThe biggest advantage of the Amex Green card is its terrific earning rate of 3 points for every dollar you spend on dining and travel. Travel includes not only the usual flights, hotels and car rentals, but also ride-sharing, taxis, subways, buses, tolls and even parking, while dining covers food delivery services like Uber Eats, GrubHub and others.\nThe Amex Green's 30,000-point welcome bonus — available after you spend $2,000 on purchases on your new card in your first three months of card membership — isn't fantastic for a card at this price point. But it's not terrible either, as those points are worth at least $300 when redeemed for airfare via Amex Travel, and potentially even more when transferred to Amex's airline and hotel partners.\nAmex's Membership Rewards points are very valuable if you know how to research airline and hotel award space, and can have a flexible travel strategy to maximize them. American Express has 21 airline and hotel transfer partners, which open up incredible redemption possibilities for those willing to put in the time and effort. It's one of the more lucrative point currencies for advanced points and miles experts.\nAt $150 a year, the Amex Green is more expensive than the average $95 mid-tier credit card. But if you can take advantage of its bonus categories and perks, it's not too hard to make up the difference in additional value.\nRelated: Read CNN Underscored's complete review of the American Express Green card.\nLearn more about the Capital One SavorOne Cash Rewards Credit Card.\nLearn more about the Chase Sapphire Reserve.\nLearn more about the Chase Sapphire Preferred Card.\nLearn more about the Uber Credit Card.\nLearn more about the American Express Gold Card.\nLearn more about the Wells Fargo Propel American Express card.\nLearn more about the Capital One Savor Cash Rewards Card.\nLearn more about the American Express Green Card.\nOrdering from Amazon? Find out which cards CNN Underscored chose as its best credit cards for Amazon purchases.\nEditorial Disclaimer: Opinions expressed here are the author's alone, not those of any bank, credit card issuer, airlines or hotel chain, and have not been reviewed, approved or otherwise endorsed by any of these entities.\nNote: While the offers mentioned above are accurate at the time of publication, they're subject to change at any time and may have changed, or may no longer be available.", "url": "https://www.cnn.com/2020/04/09/cnn-underscored/best-food-delivery-credit-cards/index.html"}