{"authors": ["Barbara Starr", "Priscilla Alvarez", "Donald Judd", "Leyla Santiago"], "date_download": "2020-05-04 16:11:22", "date_modify": "2020-05-04 16:11:22", "date_publish": "2020-04-02 15:07:37", "description": "As fatalities climb from the spread of coronavirus, the Department of Defense has moved to procure 100,000 body bags to accommodate increased demand from morgues across the country.", "filename": "2020_04_02_politics_defense_dcc25a7cd8a2fa2ec7740e17392ae86d_index_1588608682.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200213150327-pentagon-building-aerial-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_politics_defense_dcc25a7cd8a2fa2ec7740e17392ae86d_index_1588608682.html", "title": "DoD working to get 100,000 body bags in anticipation of increasing coronavirus deaths", "title_page": "DOD moves to procure 100,000 body bags to accommodate anticipated increase in Covid-related deaths - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As fatalities climb from the spread of coronavirus , the Department of Defense has moved to procure 100,000 body bags to accommodate increased demand from morgues across the country.\n\"The Department of Defense and the Defense Logistics Agency have a longstanding arrangement with FEMA to procure key commodities from DLA's industrial partners during crisis response operations,\" Defense Department spokesman Lt. Col Mike Andrews announced in a release Thursday. \"DLA is currently responding to FEMA's prudent planning efforts for 100,000 pouches to address mortuary contingencies on behalf of state health agencies.\"\nA defense official told CNN Thursday that the department already has roughly half the number of pouches on hand as part of its existing inventory and hopes to ship an initial 15,000 pouches in the coming days. The remaining 50,000 pouches will be acquired from existing suppliers, per the official.\nDuring a White House briefing on Tuesday, President Donald Trump spoke of a \"painful\" and \"tough\" two-week stretch as his task force warned of the potential for between 100,000 and 240,000 deaths even if federal guidelines are followed precisely.\nEarlier this week, the Federal Emergency Management Agency told CNN it had already moved to address a looming surge in fatalities related to coronavirus, including launching plans for a second disaster relief morgue in New York City and activating a Disaster Mortuary Operational Response Team to assist the New York Office of Chief Medical Examiner with fatality management and mortuary affairs.\nIn a statement, FEMA told CNN Tuesday, \"FEMA is aware of many states' planning efforts to account for mortuary contingencies and has increased its posture to support these requests once received from the states. Prudent planning for these future conditions is taken very seriously by FEMA, and we are working with Regional and State health and emergency managers to ramp up available assets to meet contingency needs for the most affected areas.\"\nLocally, officials and industry professionals prepare for rising death tolls\nOn the state and local level, medical examiners have also quietly begun preparing for a surge in fatalities.\nIn New York, where deaths so far have dwarfed those of any other state, officials with the New York City Office of the Chief Medical Examiner have deployed 45 refrigerated trucks outside hospitals city wide, which -- in concert with an additional 85 refrigerated trucks requested from FEMA -- will be used to store the deceased while awaiting transport to funeral homes and interment.\nNew Jersey has also deployed additional refrigeration units across the northern, central and southern parts of the state to prevent morgue overflow, while the District of Columbia's Office of the Chief Medical Examiner pointed to ongoing discussions with FEMA about expanded morgue facilities in the event of increased traffic.\nBut a dramatic surge in deaths would also put strain on the preparation and interment of bodies, as funeral directors, cemeteries and crematoriums scramble to keep pace with an exponentially rising death toll.\nIn most states, funeral directors are the only party licensed and authorized to oversee the transfer of human remains from a hospital morgue to the funeral home, and ultimately, the decedent's final resting place. That means limited storage and turnover at any given funeral home could cause a backlog of bodies at a hospital morgue.\n\"If you imagine just your business volume increasing by one-and-a-half to twice its daily normal output, there's obviously a strain there, just due to the volume itself and the strain really comes in terms of just ensuring that you are able to, to properly care for the decedent,\" Michael Lanotte, executive director and CEO of the New York Funeral Directors Association, told CNN on Monday.\nStill, Lanotte said, \"Funeral directors have reported to us that they have not had slowdowns in their ability to help families who have lost a loved one. There are still, you know, the normal procedures taking place.\"\nRisk of coronavirus transmission has drastically altered the mourning and burial process too, according to Jimmy Olson, who heads the National Chapter of the Funeral Directors Association. Olson told CNN that member funeral homes have had to limit services to nine attendees to maintain social distancing and have begun offering streamed funeral services for additional guests, while families with cremated remains are scheduling funerals as far off as September. \"How do you start a grieving process when you don't have a funeral?\" he said.\nAnd then there's the issue of interment. As New York's number of Covid-19-related deaths climbed into the thousands, Lanotte told CNN that ordinances restricting the hours of operation for crematoriums and cemeteries could form another bottleneck in moving remains out of the hospital system and into the ground.\nA couple crematoriums in the city, he said, have \"been provided temporary permits to operate additional hours to try to keep up with the additional volume.\"\n\"The process takes a certain amount of time,\" Lanotte said. \"And we know, like I said, the division of cemeteries, those cemeteries that work under them, they are working in shifts to maintain normal operation.\"\nStill the lag time between the surge in coronavirus cases and the subsequent rise in fatalities allowed morgues, funeral homes and cemeteries extra lead time to prepare, unlike hospital systems across the country, which were kneecapped early on by shortages in personal protective equipment and limited federal guidance on how to curb transmission.\nOlson told CNN last week that emergency management departments had already met with local funeral directors, allowing time to review inventory, increase purchases and take stock of storage capacities before being overwhelmed by a grim workload.\n\"These things are happening quietly,\" Olson said. \"People don't know about it. But we are preparing for it.\"\nThis story has been updated with additional reporting Thursday.", "url": "https://www.cnn.com/2020/04/02/politics/defense-department-body-bags-coronavirus-deaths/index.html"}