{"authors": ["On Assignment For Huffpost"], "date_download": "2020-05-04 21:10:50", "date_modify": "2020-05-04 21:10:50", "date_publish": "2020-04-30 22:57:53", "description": "In some states, nursing home residents account for more than half of COVID-19 deaths. It doesn't have to be that way.", "filename": "entry_nursing-homes-covid-19-coronavirus-seniors_n_5eab12e2c5b638e987bd625b_1588626650.html", "image_url": "https://img.huffingtonpost.com/asset/5eab205524000054028ea0ac.jpeg?cache=r8bg2afafi&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_nursing-homes-covid-19-coronavirus-seniors_n_5eab12e2c5b638e987bd625b_1588626650.html", "title": "As COVID-19 Ravages Nursing Homes, A New Push For Better Senior Housing", "title_page": "As COVID-19 Ravages Nursing Homes, A New Push For Better Senior Housing | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Beverly Sharp, 90, hopes to spend the rest of her life in her picturesque Douglas, Michigan, home, a block from Lake Michigan.\nSharp, a retired social worker, is still very mentally alert. She takes care of many of her basic needs, including bathing and fixing quick meals, though she is legally blind from macular degeneration and uses a long plastic oxygen tube to manage her chronic obstructive pulmonary disorder. Until the COVID-19 pandemic hit, she was still hosting two monthly book clubs in her home.\nWhat makes it all work is a network of committed friends who do her grocery and pharmacy runs and keep her company, and a county-funded program that brings her meals and provides housekeeping help twice a week.\n“She makes friends with everyone; even her hairdresser comes to her home,” said Gail Bagale, 74, one of the friends who regularly checks in on Sharp.\nThe county program, paid for with a type of property tax called a millage, is one of the more innovative solutions for helping elders stay in their homes ― an issue that has become more important amid a pandemic that has taken a particularly grim toll on nursing homes and other long-term care facilities.\nThere have been 10,000 deaths and 50,000 confirmed cases of COVID-19 among residents and staff at long-term care facilities as of last week, according to the Kaiser Family Foundation, a national public health organization. In some states, nursing home residents account for more than half of COVID-19 deaths. Those alarming numbers have intensified an important discussion the nation will wrestle with for years to come: How can the United States expand community-based alternatives for seniors and improve care in larger facilities?\nThough nursing homes are credited with improving some long-standing problems over the last three decades, such as eliminating restraints, medication errors and abuse, they continue to fail other quality measurements. An analysis earlier this year by Kaiser Health News found that nearly two-thirds of the 9,697 nursing homes surveyed were cited for at least one problem controlling infections, some dating back to 2016.\nViolations were most common in nursing homes with fewer nurses and aides. But even four of 10 facilities awarded a five-star rating from Medicare’s Nursing Home Compare program had at least one infection-control citation, the report found.\nWill Gervais Beverly Sharp inside her home where she lives by herself.\nThe conversation about how to house seniors will take on more immediacy as social distancing for the most vulnerable adults is likely to be extended for months. And that’s a growing number of people. By 2050, 88.5 million Americans will be 65 or older, up from 40.2 million in 2010, according to the Centers for Disease Control and Prevention. The number of people 85 and older is expected to triple by 2050, from 6.3 million to 17.9 million.\nThe graying of America comes with other new realities. Families are smaller than they were in past generations, and in more couples both parents are working, often far away from their family of origin ― shrinking the pool of potential caregivers.\nMore than half of the funding from Medicaid, the largest payer of long-term care, now goes to community-based services to keep people in their homes, according to Mary Ann Musumeci, associate director for the Program on Medicaid and the Uninsured at the Kaiser Family Foundation. Medicaid only reaches the poorest, oldest and frailest Americans and funding varies between states, as does what and who is covered.\nEven if people are eligible, waiting lists are common at many long-term care facilities, particularly the best ones, leaving many families to find resources on their own.\nThis was a problem pre-COVID-19, Musumeci said. But the pandemic is going to put more financial pressure on the Medicaid program, one “that states are going to be dealing with for years to come,” she said.\n‘We Have Tremendous Vulnerabilities As A Nation’\nGovernments, foundations, insurance plans, philanthropic organizations and advocacy groups are going to have to come up with more creative solutions for elder care, said Marianne Udow Phillips, director of the Center for Health & Research Transformation and an authority on Medicaid and private insurance funding. “We have tremendous vulnerabilities as a nation for our populations in nursing homes that will reverberate for years to come.”\nMany in the industry say paying staff more is essential, as nursing assistants currently average $12.52 an hour, according to Payscale.com, a compensation software and data firm. Many work at more than one facility to help pay their bills.\nSolutions also can include changing the models of care to what leaders call an elder-focused, not task-focused, model and building smaller facilities, because the spread of infection is greater in bigger ones. The average capacity of a nursing home is 107 beds, according to the CDC.\nDownsizing current facilities is not as realistic as building smaller new ones. This was one driving force for Steve McAlilly, chief executive office of Methodist Senior Services in Tupelo, Mississippi, who launched the first of what would become a national movement called The Green House Project in 2003.\nEach Green House has no more than 10-12 residents, who each have an apartment and bathroom but share a common dining area. There are two nursing assistants and a nurse for every 10 residents, allowing the staff to develop lasting relationships with residents. Over the last 17 years, it has expanded to a network of 300 homes in 23 states, and is helping open 30-40 more homes nationwide by next year.\nThe approach is an “elder-focused, not task-focused, model,’’ said Green House senior director Susan Ryan. Staff there are also paid as much as $10 an hour more than the national average.\nA survey last week of 266 Green Houses found only four COVID-19 cases and no deaths, Ryan said. Methodist’s 19 Mississippi homes had only one case of COVID-19 among staff and none among residents, McAlilly said.\nA pandemic “magnifies and highlights the strengths and weaknesses of the entire system,” McAlilly said. “I hope we wake up and understand we need to have a policy conversation in Washington about the fact that long-term care needs to be adequately funded to keep this from happening again.”\n“Hopefully we will seize this as the moment that caused us to have that conversation, because until now long-term care has gotten the crumbs on the healthcare plate,” he continued.\nMcAlilly and Ryan say the issue goes beyond money. More than half of Green House residents are on Medicaid ― testimony that the model can work within the larger facilities that take in less money than those that only accept seniors with enough savings to pay the bill themselves, they say.\nHopefully we will seize this as the moment that caused us to have that conversation, because until now long-term care has gotten the crumbs on the healthcare plate.\nThe organization has also developed strategies to apply its principles to larger senior facilities. “I believe there’s a lot we can do in traditional buildings with a more comprehensive approach,’’ Ryan said.\nMatt Yarnell, president of SEIU Healthcare of Pennsylvania, representing 45,000 workers in home and long-term care programs, said paying workers better, as well as giving them a voice in improvements, is essential to keeping and recruiting more people to the field.\nHe believes gender and racial bias contribute to the problem. Two reports released this year found that 86% of workers providing direct care to seniors and the disabled are women, of whom 59% were people of color, he said. “I yell from every balcony I can get on that ... people should be able to age with dignity, with a workforce that’s well respected, well paid and that has a voice.”\nA Push For More Community-Based Support\nOther help continuing to live at home may come from private insurance plans offering Medicare coverage, particularly through more comprehensive Medicare Advantage plans.\nCOVID-19 is “shining a light’’ on the need for more community-based support systems so seniors and disabled people can live at home, said Dr. Duane DiFranco, who oversees Medicare options for Blue Cross Blue Shield of Michigan. It covers 700,000 seniors, including 540,000 in Medicare Advantage plans.\n“COVID-19 is accelerating a lot of things that were in motion already,’’ he said, as well as pushing other areas of medicine, such as physical, occupational and behavioral therapies, to add more home-based options.\nPeople should be able to age with dignity, with a workforce that’s well respected, well paid and that has a voice. Matt Yarnell, president of SEIU Healthcare of Pennsylvania\nOne Michigan Blue Cross pilot project offers 24-hour telephone access to nurses and other health care staffers as a kind of virtual urgent care, DiFranco said. “If you call us, we’ll assess you over the phone’’ and arrange for medicines, “and if you have to get to an ER,’’ transportation can be arranged, he said.\nMore support for often weary caregivers is another approach the Ann Arbor Community Foundation is taking. Using money from foundations, bequests, the county, the city and others, the organization provides training for families with vulnerable or cognitively impaired adults and respite programs, said Neel Hajra, chief executive officer.\nStill, programs like these may have strict eligibility guidelines or waiting lists.\n“A lot of communities across the country see programs for seniors as an expense, not an investment,’’ said Christopher Lemon, senior community investment officer with the Ann Arbor group. “There’s a return on investment, as well as it’s the right thing to do. These are our volunteers, our caregivers, our donors. They enrich our community.’’\nSharing Space Across Generations\nPeter Lichtenberg, director of gerontology at Wayne State University and a member of the Michigan Commission on Services to the Aging, also sees hope in programs that allow seniors to share rooms in their own homes and with others, such as graduate students.\nSo-called “granny pods” ― separate tiny homes with a kitchen and bath ― and mother-in-law units are an option for those who can afford them, though they can run as much as $100,000 to build, and may require zoning approval.\nIn Scandinavia and Europe, there are entire towns, even Alzheimer’s villages, funded by countries or smaller governmental agencies, he said.\nStill, he said, “I don’t think we can ever get away from the tension of, is home always the right place? Seniors living alone, he said, may be “vulnerable to all forms of exploitation ― scams, thefts, abusive trust.’’\nAnother obstacle may be gentrification, as more neighborhoods lose housing units seniors could afford, said Mary Ellen Howard, 77.\nThe Washington Post via Getty Images The Indian Village neighborhood of Detroit.\nHer neighborhood, on the fringe of Detroit’s stately, more affluent Indian Village, has gentrified rapidly in recent years. Her one-bedroom apartment is one of the few affordable units left in the area. “I’m afraid the landlord is going to look at other places and say, ‘If they can charge $1,500 a month, why can’t we?’” she said. She preferred not to disclose her monthly rent, for fear it will bring unwanted attention to the bargain she found.\nFor some communities, voter-approved county tax millages may bring help, like the one paying for Beverly Sharp’s twice-a-week visits and other programs.\nAllegan County raises $2.3 million for senior and veteran services, a $40 property tax for those with a home valued between $50,000 and $100,000, said Sherry Owens, director of senior and veteran services. It’s been renewed three times since 2006, passing with bigger majorities each time, Owens said. The program serves 2,000 people who receive at least one service, she said. She admits to getting an occasional complaint about meals or the exodus of favorite staffers for better-paying jobs.\nSharp also doesn’t want to draw too rosy a picture of life living alone. “Whoever called these the golden years had rocks in his head,’’ she said. Still, it’s better than the alternatives.\n“I love my home, the location, the fact that I can entertain here, and walk out the door when I want,” she said. ”I want to live here as long as possible, until I die.”", "url": "https://www.huffpost.com/entry/nursing-homes-covid-19-coronavirus-seniors_n_5eab12e2c5b638e987bd625b"}