{"authors": ["Andrew Kaczynski", "Nathan Mcdermott"], "date_download": "2020-05-04 16:34:11", "date_modify": "2020-05-04 16:34:11", "date_publish": "2020-04-08 00:00:15", "description": "New White House press secretary Kayleigh McEnany repeatedly downplayed the threat of the coronavirus in comments made in February and March, a CNN KFile review has found.", "filename": "2020_04_07_politics_white-house-press-secretary-coronavirus_index_1588610051.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407173021-02-kayleigh-mcenany-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_white-house-press-secretary-coronavirus_index_1588610051.html", "title": "New White House press secretary downplayed pandemic threat and said Democrats were rooting for coronavirus", "title_page": "New White House press secretary downplayed pandemic threat and said Democrats were rooting for coronavirus  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) New White House press secretary Kayleigh McEnany repeatedly downplayed the threat of the coronavirus in comments made in February and March, a CNN KFile review has found.\nIn radio and television appearances, McEnany, in her role as spokeswoman for President Donald Trump's 2020 campaign, said the administration had the rapidly spreading coronavirus \"under control\" and said that because of travel restrictions enacted by the President, \"we will not see diseases like the coronavirus come here.\"\nShe also said Democrats were \"actively rooting against what's in the best interest of America,\" including rooting for coronavirus to take hold. She said coronavirus, like the Russia and Ukraine scandals, was being used to take down Trump.\nThe Trump administration is facing continued scrutiny over its preparations for the coronavirus pandemic, its slow response to provide states and cities assistance in testing kits and personal protective equipment, and comments from the President and top White House officials downplaying the virus.\nMcEnany did not respond to a request for comment. The White House declined to comment.\n\"We will not see diseases like the coronavirus come here\"\nSpeaking on Fox Business on February 25, McEnany said because of travel policies enacted by the President, coronavirus would not continue to come to the United States.\n\"This President will always put America first,\" she said. \"He will always protect American citizens. We will not see diseases like the coronavirus come here. We will not see terrorism come here. And isn't that refreshing when contrasting it with the awful presidency of President Obama?\"\nMcEnany defended her comments over the weekend in a series of tweets , saying, \"Context matters, I was asked about travel restrictions and stated the intent of those restrictions.\"\nSpeaking on Fox Business a day later on February 26, McEnany said the President had coronavirus under control.\n\"The President's taking control, making sure we're safe from the coronavirus,\" she said . \"And he's doing everything right.\"\nAttacks on Democrats\nMcEnany sharply criticized Democrats critical of the White House's response to coronavirus, saying they were rooting for coronavirus and the stock market to tank.\n\"What is so sick to me is that what is good for America, rather what is bad for America, is good for Democrats,\" McEnany told Fox News on February 28.\n\"It's incredible that they think this way,\" she said. \"They root against the stock market. They root for this to take hold. They have a demented dream of taking down President Trump. It doesn't matter how many Americans they destroy in order to get there.\"\nIn March, McEnany continued to defend the president as the outbreak spread. On local Michigan radio on March 10, she said it was incumbent on the public to take adequate political health measures but the situation was under control.\n\"This is something that is under control,\" she said on the Frank Beckmann Show . \"We have a President who has taken unprecedented action and mandatory quarantines and travel restrictions, and he's taken every measure that he possibly could to protect the American people. I'm confident we have a great leader at the top, but it's incumbent upon all of us just to take those precautions.\"\nOn March 11 on the Pat Miller Show , an Indiana local radio program, she accused Democrats and the media of rooting for a recession she said was not coming, adding the President kept the outbreak from being worse.\n\"They're trying to politicize it. At times it seems they're actively rooting against what's in the best interest of America,\" she said. \"We've seen them how many times root against the stock market doing well. You had the media saying, 'There's an inverted yield curve.' This was a few months ago, therefore a recession. Oh, RV sales are down, therefore a recession. Oh, coronavirus -- we're heading toward a recession. It's almost as if they're rooting for this outcome, which is sick and would obviously economically devastate the lives of the American people.\"\n\"They try to score cheap political points,\" she added. \"We've seen this all along. The coronavirus is just one example. They tried it with Russia, with Ukraine. It's whatever they can come up with to try to take this President down. Which isn't just about the President. It's about taking down the vote of the American people. That's ultimately what this is.\"\n\"This President's taken unprecedented action to protect this country from the coronavirus,\" she continued. \"He stopped it from being so much worse than it could have been, but leave it to the media and the left to score those cheap political points.\"\n\"The best authority on this\"\nMcEnany also defended the President from criticism he had come under for saying he'd continue to hold rallies, saying the President was the best authority on when to cancel events. Democratic presidential candidates Bernie Sanders and Joe Biden earlier had both announced the cancellation of planned rallies in Ohio. In one interview, McEnany said Biden was doing it just to get off the campaign trial.\n\"As he said before in this business, in politics you're expected to shake hands and we do,\" she said on the Chris Stigall Show. 'So I bring Purell around with me. I just take precautions and been lucky to be happy and healthy. And we have a president who's a commander in chief who's taken great, unprecedented action to keep this nation safe. It would be a whole lot worse had he not put in place those travel restrictions and mandatory quarantines.\"\nMcEnany added that rallies were \"proceeding as normal.\" Asked what she would say to critics who said that continuing to hold rallies was \"highly irresponsible\" McEnany said the president said it was safe.\n\"I'd say that the President says this is safe,\" she said.\n\"Dr. Fauci has said it depends on the location,\" she continued, referring to National Institute of Allergy and Infectious Diseases Director Anthony Fauci. \"As long as you're not having it in a hot spot where there's a big outbreak like outside of New York for instance and it's safe to proceed. So, you know, as long as the experts say it continues to be safe, then we follow that lead and we will proceed as normal. And you'll take precautions as I said, but not panic because we have a president leading on this.\"\nThe same day, in a contentious interview on Fox Business with Stuart Varney, McEnany was confronted by the news of Fauci saying on Capitol Hill there should be no large crowds\nVarney said \"Dr. Fauci, who is also testifying on Capitol Hill, he just said there should be no large crowds. He said it.\"\n\"Look, we have the commander-in-chief, we have the best health experts, we're taking this day by day, we're currently proceeding as normal and look,\" she said. \"Joe Biden, he's suspending his rallies. Well, he's been dying to get off the campaign trail. The man can only speak for seven minutes.\"\n\"Look, the President is the best authority on this issue,\" she added. \"He takes into consult the words of everyone around him. That would include (Health and Human Services Secretary) Alex Azar, that would include Dr. Fauci, that would include others. So I'll leave it to the president. Right now we're proceeding as normal.\"", "url": "https://www.cnn.com/2020/04/07/politics/white-house-press-secretary-coronavirus/index.html"}