{"authors": ["Ralph Ellis"], "date_download": "2020-05-04 17:01:48", "date_modify": "2020-05-04 17:01:48", "date_publish": "2020-04-09 18:09:06", "description": "When she was a child growing up in Ohio, Amy Acton says, people looked down on her and her brother because they were poor -- really poor. Now she is delivering the hard facts about coronavirus as director of the state Department of Health.", "filename": "2020_04_09_us_amy-acton-ohio-medical-director_index_1588611708.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409101700-01-amy-acton-0309-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_us_amy-acton-ohio-medical-director_index_1588611708.html", "title": "Dr. Amy Acton Ohio medical director", "title_page": "Dr. Amy Acton Ohio medical director - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When she was a child growing up in Ohio, Amy Acton says, people looked down on her and her brother because they were poor -- really poor.\n\"I remember walking the north side (of Youngstown) and people seeing us walk by — because everyone walked then — and giving us breakfast, my brother and I, because they knew we were hungry. Just random neighbors,\" she told CNN affiliate WKBN\n\"I also remember people looking the other way, not wanting their kids to play with me because we were dirty and smelly.\"\nPeople can't help but look at Acton now. She's showing up on television screens in Ohio all the time.\n'You're winning the war'\nAppearing alongside Gov. Mike DeWine during the daily televised news briefing on efforts to curb the coronavirus, Dr. Acton, the director of the state Department of Health, delivers the hard facts about social distancing and a climbing death toll in a direct but warm manner.\nOhio has recorded more than 5,500 cases and 200 deaths as of Thursday -- grim numbers but still below those of surrounding states Michigan, Pennsylvania and Illinois.\nActon encourages the populace, almost becoming a cheerleader at times.\n\"It's vitally, vitally important, Ohio, you've done this,\" she said during the Tuesday news briefing . \"You're winning the war. ... The second we let our foot off the gas, the second we are no longer that category 3 hurricane, it can pick up wind again and we can be a category 5.\"\nA surging popularity\nIn becoming the Buckeye state's version of the straight-talking Dr. Anthony Fauci, Acton has developed not just supporters, but fans.\nAt least two Acton fan pages have sprung up on Facebook and a T-shirt company invokes her name as it raises money for charities, saying on Twitter that she \"has emerged as a voice of reason and a beacon of light.\"\nOne creative soul even wrote a parody of the \"Laverne & Shirley\" theme song and paired it with an animated short called \"DeWine and Amy.\"\nThe video shows the business-suited DeWine and medical-coat-wearing Acton dance down the street together and throw rolls of toilet paper while encouraging everybody to social distance.\nShe worked at Western Sizzlin'\nActon's bootstrap personal story has contributed to her popularity.\nActon, 54, told the Toledo Blade newspaper she grew up in a broken family from Youngstown and moved around the country with her mother and younger brother, at one point sleeping in a tent.\nIn the interview with WKBN , Acton said she lived in 18 different places before she was 12.\nAround the seventh grade, she and her brother settled with their father in Youngstown, where life became more stable. After high school -- she became homecoming queen -- Acton worked her way through Youngstown State University and the Northeast Ohio Medical University.\n\"Don't laugh, but I worked at the Western Sizzlin' steakhouse on Belmont Avenue,\" she told WKBN, a Youngstown station.\nAs a licensed physician in preventive medicine with a master's degree in public health , she's worked with patients and bureaucracies, having treated patients, taught at the university level and worked for nonprofits, most recently the Columbus Foundation.\nActon says she's surprised at how she burst into the spotlight to become a state leader -- and something of a pop culture icon.", "url": "https://www.cnn.com/2020/04/09/us/amy-acton-ohio-medical-director/index.html"}