{"authors": ["Paul Leblanc"], "date_download": "2020-05-04 16:34:15", "date_modify": "2020-05-04 16:34:15", "date_publish": "2020-04-08 02:53:49", "description": "Former Vice President Joe Biden on Tuesday said he told President Donald Trump in their phone call that the federal response to the novel coronavirus pandemic is \"about taking responsibility.\"", "filename": "2020_04_07_politics_biden-trump-phone-call-coronavirus-cnntv_index_1588610055.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200209103731-joe-biden-new-hampshire-file-0208-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_politics_biden-trump-phone-call-coronavirus-cnntv_index_1588610055.html", "title": "Biden describes his phone call with Trump about coronavirus response", "title_page": "Biden describes his phone call with Trump about coronavirus response - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) Former Vice President Joe Biden on Tuesday said he told President Donald Trump in their phone call that the federal response to the novel coronavirus pandemic is \"about taking responsibility.\"\nThe call, which took place Monday , marked a rare moment of direct communication between the two political rivals. The President has harshly criticized Biden over a range of issues for months and the former vice president has repeatedly excoriated Trump's handling of the virus outbreak.\nBut while speaking with CNN's Chris Cuomo on \"Prime Time\" Tuesday, Biden said the two \"had a good conversation.\"\n\"I laid out what I thought he should be doing. I laid out four or five specific points that I thought were necessary. I indicated that it is about taking responsibility, and being the commander in chief, taking on the responsibility. He asked whether or not we would not discuss the detail of what we talked about, just saying that we had a good conversation,\" Biden said of the call.\n\"He was very gracious in his conversation. So it was -- the President -- I had an opportunity to tell him what I would have done, what I thought, the lessons we learned.\"\nRead More", "url": "https://www.cnn.com/2020/04/07/politics/biden-trump-phone-call-coronavirus-cnntv/index.html"}