{"authors": ["Michael Bociurkiw"], "date_download": "2020-05-04 16:53:47", "date_modify": "2020-05-04 16:53:47", "date_publish": "2020-04-08 17:44:25", "description": "Now is the wrong time to decapitate the WHO, the agency leading the global response the the coronavirus pandemic, writes Michael Bociurkiw.", "filename": "2020_04_08_opinions_coronav_90fe611517bb07f15d9caccfb9695d40_index_1588611227.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407032701-general-tedros-adhanom-ghebreyesus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_opinions_coronav_90fe611517bb07f15d9caccfb9695d40_index_1588611227.html", "title": "Trump has targeted the WHO when we need it most", "title_page": "Trump has targeted the WHO when we need it most (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Michael Bociurkiw is a global affairs analyst and a former spokesman for the Organization for Security and Cooperation in Europe. Follow him on Twitter @WorldAffairsPro . The opinions expressed in this commentary are his; view more opinions on CNN.\n(CNN) Tuesday was a lousy day for the agency leading the fight against the deadly Covid-19 pandemic, the World Health Organization (WHO).\nIt should be enough that the UN agency is in the midst of coordinating the ongoing global public health response to the pandemic (while trying to commemorate its 72nd birthday). But it was also the day President Donald Trump (after trashing the \" fake news \" media Monday) decided to set his sights on the WHO.\nStarting with a tweet around midday, Trump assailed the Geneva-based organization for being \"China centric,\" for, he said, blowing the Covid-19 response. He slammed the WHO for providing, he wrote, a \"faulty recommendation\" on keeping America's border with China open in January, when the Covid-19 virus began making its way around the globe.\n(The WHO has not responded to my request for comment Tuesday on the President's statements.)\nThe President continued his rant against the organization at Tuesday's daily White House Coronavirus Task Force media briefing, saying the United States will review its financial contributions to the body. Trump has already proposed cutting funding to $58 million for 2021 -- about half of the $122 million congress approved for the WHO this year.\nNow's not the time for Trump to throw red meat\nTrump's unexpected tirade against the WHO -- delivered on World Health Day , which honors frontline health workers -- may be written off by some as just another crass attempt by the President to throw his base red meat. If that is the case, doing so in the midst of an unprecedented global public health emergency is disgusting and dangerous.\nThe attack may further erode the moral authority of the WHO at a time when the world's leaders, many of whom have been caught woefully unprepared, require leadership and coordination.\nBut many will undoubtedly note with irony that as the world economy has ground to a halt, recording almost 1.5 million confirmed Covid-19 cases and more than 80,000 deaths , China lifted its 76-day lockdown Wednesday on Wuhan -- the city where the virus is believed to have originated.\nThat may have irked Trump and his circle, especially after the most recent US unemployment figures point to unprecedented dislocation for the US economy ahead of November, when Trump will seek reelection\nTrump singled out the WHO for siding with China. Even under heavy questions by journalists -- and I've sat in virtually on almost every WHO media briefing since the start of the outbreak -- WHO officials have strenuously avoided criticizing China, an influential member state and a permanent member of the UN Security Council. Now that Beijing appears to be attempting to shift the blame for the outbreak onto the United States, they may have forced Trump's hand to target the WHO's closeness to China.\nFor those of us who have worked on the inside of the United Nations, it comes as no surprise that the WHO panders to China. Indeed, having worked closely with the WHO in at least three of its regions, I've observed an almost incestuous relationship between the organization and the ministries of health of its respective member states -- including China.\nDifferences over masks complicate the White House's relationship with the WHO\nAnother reason for the White House's attack on the WHO could be that the agency has issued contrary guidance to the administration's Coronavirus Task Force about the use of scarves and face masks during the Covid-19 outbreak.\nThe WHO has continually said that masks should be prioritized for frontline health workers, that they give civilian wearers a false sense of security and that they actually promote touching one's face.\nThe WHO has also said that non-health workers should wear masks if they have the virus or alternatively, if they are caring for someone affected.\nWhat's more, the WHO has taken issue with Trump's obsessive push for the off-label use of untested prescription drugs, such as hydroxychloroquine, to treat Covid-19 patients.\n\"Using untested drugs without the right evidence could raise false hope and even do more harm than good and cause a shortage of essential drugs that are needed to treat other diseases,\" WHO Director-General Tedros Adhanom Ghebreyesus said.\nBut disagreements with the WHO should not lead the US to slam the group or withdraw support. While many governments ignored early WHO guidance and instituted trade and travel restrictions, the global community still needs an authoritative body that sets standards, collates and studies all of the pieces of the Covid-19 puzzle coming in from affected countries, and leads us closer to obtaining a life-saving vaccine.\nThe WHO also plays a big role in disseminating public health guidance, such as information on hand-washing, and advocates for the protection of frontline health workers.\nSuspicions the WHO is too close to China\nThe timing of Trump's remarks could also have been part of the strategy to push for a 50% reduction in America's annual WHO contributions -- something political leaders have had on their mind for many weeks now.\nEarlier Tuesday, Republican Idaho Senator Jim Risch, chairman of the Senate Foreign Relations Committee, issued a statement calling for an independent investigation into the WHO's handling of the Covid-19 response. He said the WHO director general has shown an \"apparent unwillingness to hold the Chinese Communist Party to even the minimum standard of global health and transparency\" and that it hindered the world's ability to slow the spread of the pandemic.\nBut at a time when Trump is facing considerable criticism for bungling Washington's response to the crisis shifting the blame onto others -- like governors -- has become part of the White House playbook. It was the WHO's turn to feel the heat from a disgruntled president who has brought the sport of pointing the finger at others to a whole new level.\nThe latest salvos coming from the White House certainly complicate even further the tenure of the beleaguered WHO chief. The first African to be elected as director general of the WHO, Tedros was hardly a few months into his post when he shocked the world by nominating the late Zimbabwean strongman, Robert Mugabe , as a goodwill ambassador.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nTedros also adopted a baffling response to the epidemic in the first weeks by delaying the declaration of \"a public health emergency of international concern\" and then delaying again in labeling the Covid-19 outbreak a global pandemic.\nOne has to admit the WHO, like the UN itself, is not perfect and is badly in need of reform. But at a time when humankind is literally fighting for its life, now is the wrong time to decapitate the agency leading the global response. If not the WHO, then who?", "url": "https://www.cnn.com/2020/04/08/opinions/coronavirus-who-criticism-opinion-bociurkiw/index.html"}