{"authors": ["Hadas Gold", "Cnn Business"], "date_download": "2020-05-04 16:23:10", "date_modify": "2020-05-04 16:23:10", "date_publish": "2020-04-06 16:17:31", "description": "YouTube and other social media platforms are taking steps to limit the spread of conspiracy theories falsely connecting 5G networks and the coronavirus pandemic after a string of attacks on cellphone towers.", "filename": "2020_04_06_tech_5g-coronavirus-conspiracy_index_1588609390.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406111135-us-5g-tower-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_tech_5g-coronavirus-conspiracy_index_1588609390.html", "title": "5G coronavirus conspiracy: YouTube restricts videos", "title_page": "5G coronavirus conspiracy: YouTube restricts videos - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) YouTube and other social media platforms are taking steps to limit the spread of conspiracy theories falsely connecting 5G networks and the coronavirus pandemic after a string of attacks on cellphone towers.\nMobile operators said Monday that there have been at least five instances of vandals setting fire to towers in the United Kingdom in the past few days.\nSome YouTube videos claiming a connection between the virus and the new super-fast wireless technology have racked up hundreds of thousands of views.\nBT Group's BTGOF Telefonica's TEF Vodafone VOD CK Hutchison Holdings CKHUY In a joint statement,EE,O2,and Three, owned by, said claims 5G is in any way connected to the coronavirus pandemic have no basis in fact, a statement echoed by experts and multiple government agencies around the world.\n\"Not only are these claims baseless, they are harmful for the people and businesses that rely on the continuity of our services. They have also led to the abuse of our engineers and, in some cases, prevented essential network maintenance taking place,\" the mobile network operators said in the statement.\nRead More", "url": "https://www.cnn.com/2020/04/06/tech/5g-coronavirus-conspiracy/index.html"}