{"authors": ["Opinion Avi Garbow"], "date_download": "2020-05-04 17:02:36", "date_modify": "2020-05-04 17:02:36", "date_publish": "2020-04-10 14:36:12", "description": "Avi Garbow writes that for no reason beyond greed, while our nation reels from the coronavirus pandemic, the Trump administration is accelerating rollbacks that dismantle critical health and environmental protections, and that deepen the climate crisis.", "filename": "2020_04_10_opinions_trump-r_e7a33268c0161742c0837c50d7457107_index_1588611756.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/180727112107-trump-hard-hat-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_opinions_trump-r_e7a33268c0161742c0837c50d7457107_index_1588611756.html", "title": "Trump administration is rushing to gut environmental protections", "title_page": "Trump administration is rushing to gut environmental protections  (Opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Avi Garbow was the longest serving general counsel at the Environmental Protection Agency and currently serves as the environmental advocate for Patagonia, where he helps the company fulfill its mission of being in business to save the home planet. The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) While our nation reels from the coronavirus pandemic, the Trump administration is accelerating a harmful agenda -- rollbacks that dismantle critical health and environmental protections, and that will surely deepen the climate crisis.\nJust days after the United States surpassed all other countries in the number of confirmed coronavirus cases, Trump officials finalized their rollback of the Obama administration's clean car standards , a mandate that forced automakers to make cars substantially more fuel efficient. By 2040, according to analysis by the Environmental Defense Fund (EDF) , this rollback of the clean car standards is expected to add 1.5 billion metric tons of climate pollution into the atmosphere, an amount equal to the total pollution from 68 coal-fired power plants operating for five years, and cost Americans more than $244 billion in excess fuel charges.\nAnother study by the BlueGreen Alliance estimates that nearly 90,000 jobs could be lost as a result of this rollback.\nThe EDF analysis found that the new Trump standards are estimated to lead to thousands of premature deaths, and hundreds of thousands of asthma attacks, among other respiratory ailments by 2050 . We're facing a pandemic of respiratory disease and unprecedented unemployment claims, and yet the President's team is reversing a program that creates jobs and protects lungs.\nOn January 9, the Trump administration announced its proposal to gut the National Environmental Policy Act, or NEPA . NEPA is the nation's first major environmental law, signed by President Richard Nixon in 1970, and requires that our government consider the environmental consequences of its major actions, including those that impact our climate.\nAnd while the gutting of NEPA and the clean car standards are the most sweeping rollbacks, there are many more. Here's a handful of additional examples of changes the administration is looking to get done or continuing to push while Americans are fighting the pandemic:\nOn January 30, the Department of Interior sought drastic changes to the Migratory Bird Treaty Act (MBTA) that would effectively allow the incidental \"take\" (killing) of millions of birds, marking a radical departure from decades of federal policy that protected more than 1,000 migratory species from falling prey to open oil waste pits and other industrial hazards. As with its proposed slashing of NEPA, the Trump administration refused to extend the time for public comment on its MBTA proposal.\nThe administration's assault on our public lands continues. Oil and gas lease auctions are ongoing, and the lists of sites nominated for oil and gas lease sales later this summer include over 150,000 acres of lands across southern Utah, which could push drilling within sight of our treasured Arches and Canyonlands National Parks, and Bears Ears National Monument. The administration is actively seeking to open oil and gas lease sales in the Arctic National Wildlife Refuge, to change the Forest Service's Roadless Area Conservation Act to allow logging in our country's largest and most pristine old growth forest, the Tongass, and to allow the massive proposed Pebble Mine to move forward with catastrophic effects on the world's largest fishery of wild sockeye salmon.\nUnder the guise of scientific transparency, the EPA is moving ahead with a rule that would limit the use of certain peer-reviewed epidemiological studies in setting public health standards -- a rule opposed by dozens of leading public health and medical associations whose members are currently on the front lines fighting for our lives.\nEvidently, there is little that the administration won't do to appease the oil and gas industry. Until recently, though, these efforts were piecemeal. That's changed, too, since the coronavirus outbreak.\nOn March 26, the EPA issued a blanket, and retroactive, enforcement discretion policy for violations of many of our most significant and impactful environmental laws. Under this new policy, the EPA states that it does not expect to seek penalties for a variety of violations, including compliance monitoring, integrity testing, sampling, and reporting obligations, if it agrees that the coronavirus was the cause of the particular non-compliance. What standard they are using to determine that, however, remains unclear.\nJUST WATCHED The changing climate ruined this family's livelihood Replay More Videos ... MUST WATCH The changing climate ruined this family's livelihood 03:25\nThe source of the new policy is no surprise: the American Petroleum Institute, which wrote a detailed letter to President Donald Trump days earlier asking for this waiver of compliance obligations.\nAt a time when public health is most threatened, the Trump administration is undermining public health protections and failing the communities whose homes and schools border the nation's most polluting facilities, and who rely on these monitoring and reporting obligations to protect themselves from excess pollution.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nWe cannot be silent in the face of these devastating rollbacks, nor allow this administration to destroy our future while we fight for our present.", "url": "https://www.cnn.com/2020/04/10/opinions/trump-rushing-to-rollback-environmental-protections-during-pandemic-garbow/index.html"}