{"authors": ["Todd Richmond"], "date_download": "2020-05-04 20:05:22", "date_modify": "2020-05-04 20:05:22", "date_publish": "2020-04-08 20:03:00", "description": "MADISON, Wis. (AP) — The Legislature's finance committee would have carte-blanche power to reduce state spending as part of a sweeping bill Wisconsin Republicans have proposed to deal with the...", "filename": "_91a7f481158389b77e12b9bbf75ac752_1588622722.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_91a7f481158389b77e12b9bbf75ac752_1588622722.html", "title": "Wisconsin GOP's coronavirus bill sets up political skirmish", "title_page": "Wisconsin GOP's coronavirus bill sets up political skirmish", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON, Wis. (AP) — The Legislature’s finance committee would have carte-blanche power to reduce state spending as part of a sweeping bill Wisconsin Republicans have proposed to deal with the economic fallout from the coronavirus pandemic.\nDemocratic Gov. Tony Evers signaled in an interview that he would veto the bill if Republicans don’t remove the language. That would delay other benefits in the bill, including eliminating the waiting period for unemployment checks and suspending interest on property taxes.\n“(The provision would allow) the Joint Finance Committee to unilaterally cut investments to health care, roads, schools, whatever they want to,” the governor said. “That to me is a political thing and doesn’t do anything to help our state. That’s something that I just cannot allow.”\nSenate Majority Leader Scott Fitzgerald said it’s irresponsible for Evers to suggest publicly that he’ll veto the bill while negotiations continue.\nKit Beyer, a spokeswoman for Assembly Speaker Robin Vos, had no immediate comment. Assembly Majority Leader Jim Steineke said in a tweet that the governor is hurting efforts to come up with a package both sides can support.\nThe bill would allow the finance committee to reduce spending, suspend any statutes that would decrease state general fund tax revenues and rescind a 2% across-the-board raise for state workers slated to begin in January if the state faces a deficit in the next fiscal year. The committee also would be allowed to transfer up to $25 million between accounts as long as the state of emergency Evers declared on March 12 continues and for 90 days after it expires.\nThe bill would eliminate the one-week waiting period for unemployment benefits and waive any interest, something Evers has been pushing for over the last few weeks as unemployment claims skyrocket.\nThe legislation also would eliminate late-payment fees on unpaid property taxes as long as the taxes are paid by Oct. 1.\nHealth care workers would not have to renew their credentials while the state of emergency continues, and nurses aides would need only 75 hours of training rather than 120. Evers earlier this year vetoed that same proposal. Assembly Republicans tried to override the veto in January but fell short of the two-thirds majority they needed.\nOther provisions in the coronavirus bill would:\n— Lift the minimum minimum number of instructional hours for voucher schools in the 2019-20 school year. Right now such schools must provide at least 1,050 hours of direct instruction to grades one through six and 1,137 hours to grades seven through 12.\n— Students would get another 60 days to enroll in a voucher school for the 2020-21 school year.\n— Increase borrowing authority for refinancing state debt from $6.8 billion to $7.5 billion.\n— Allow candidates for office to use public funds to pay for unlimited communications related to the coronavirus during the state of emergency. Under current law candidates can use public funds to pay for up to 50 identical communications during the campaign season.\n— Suspend monthly premiums for childless adults on Medicaid and suspend requirements they complete a health risk assessment as a condition of eligibility.\n— Prohibit health insurers from discriminating against COVID-19 patients.\nThe legislation is designed to supplement a federal stimulus package bringing about $2.3 billion to the state. Evers has put together two proposals in recent weeks that seek to spend more than $1 billion in response to the pandemic but Republicans rejected them. The packages include a handful proposals contained in the GOP bill, including the prohibition on insurers discriminating against COVID-19 patients and the property tax interest and late fee waivers.\nFollow Todd Richmond on Twitter at https://twitter.com/trichmond1", "url": "https://apnews.com/91a7f481158389b77e12b9bbf75ac752"}