{"authors": [], "date_download": "2020-05-04 20:18:59", "date_modify": "2020-05-04 20:18:59", "date_publish": "2020-04-16 14:18:51", "description": "PROVIDENCE, R.I. (AP) — Rhode Island Gov. Gina Raimondo urged residents to continue adhering to social distancing guidelines and stay-at-home recommendations Thursday to keep the number of...", "filename": "_64120156f5ceeadf200f4d536b51c6a3_1588623539.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_64120156f5ceeadf200f4d536b51c6a3_1588623539.html", "title": "Governor: Social distancing working to keep virus cases down", "title_page": "Governor: Social distancing working to keep virus cases down", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "PROVIDENCE, R.I. (AP) — Rhode Island Gov. Gina Raimondo urged residents to continue adhering to social distancing guidelines and stay-at-home recommendations Thursday to keep the number of coronavirus cases in the state at the lower end of her administration’s projections.\n“Social distancing is working, social distancing is saving lives, and if we continue to hang in there for another couple of weeks we’ll be in a much better place,” the Democrat said at her daily news briefing.\nRaimondo has been hesitant to share the state’s modeling projections publicly because they are so imprecise, but decided to discuss them Thursday because efforts to curtail the spread of the virus appear to be working.\nAccording the the best estimates, the number of coronavirus hospitalizations will peak around May 3 at 2,250 hospitalized cases and the state will likely have 2,000 deaths through October, she said.\nIf residents relax their compliance with social distancing guidelines, the hospitalizations are projected to peak around April 27, and the state will need 4,300 hospital beds, while the total number of deaths will double to about 4,000 through October, she said.\n___\nUNEMPLOYMENT\nAbout 160,000 Rhode Islanders have filed for unemployment benefits since the pandemic began, the governor said. Yet at the same time, some businesses can’t fill their open positions.\nTo help, the state hes established a website called employRI.org to connect job seekers with companies that are hiring, she said.\n___\nSTAYING CONNECTED\nA 19-year-old Rhode Island man has set up a program to help coronavirus patients who aren’t allowed to receive visitors while in the hospital stay connected to their loved ones.\nKaya Suner helped establish the covidconnectors.org website that collects donated iPads, tablets and other devices that are distributed to patients.\nSuner got the idea from his parents, both emergency physicians, who told him of the need for devices to help patients stay in touch with family.\n“My mom’s saying there are patients who are dying without the opportunity to say goodbye,” the Providence resident told WJAR-TV.\nAmazon has donated more than 500 tablets to the program.\nDr. Rory Merritt has seen the benefits.\nThe devices have been used for last rites, celebrating an anniversary, meeting a newborn grandchild, a goodbye to a family member and church services, Merritt told The Providence Journal.\n___\nRECOVERY CENTER\nRhode Island has its first officially designated “specialty center” for COVID-19 patients in recovery.\nThe Oak Hill Center for Rehabilitation and Nursing in Pawtucket is for patients who have been discharged from hospitals who are not fully recovered, yet no longer require acute-level hospital care.\nCurrent Oak Hill Center residents who do not have COVID-19 symptoms will be located in a separate unit of the facility, facility management said in a statement, and will have no contact with the COVID-19 patients.\n___\nCORONAVIRUS NUMBERS\nRhode Island’s Department of Health reported 18 additional COVID-19-related deaths on Thursday, bringing the state total to 105. All of the new deaths were people in their 70s or older who lived in nursing homes, state Department of Health Director Nicole Alexander-Scott said.\nMore than 300 new positive cases brought the state’s total to more than 3,800, the agency said.\nMore than 28,000 people in the state have been tested. Two hundred and forty-five people remain hospitalized, 61 of whom are currently in the ICU.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and the infirm, it can cause more severe illness, including pneumonia, or death.", "url": "https://apnews.com/64120156f5ceeadf200f4d536b51c6a3"}