{"authors": ["Matt Egan", "Cnn Business"], "date_download": "2020-05-04 16:05:22", "date_modify": "2020-05-04 16:05:22", "date_publish": "2020-04-01 11:30:20", "description": "The world's thirst for oil has evaporated.", "filename": "2020_04_01_business_oil-prices-crash-storage-space_index_1588608322.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331120011-oil-refinery-1214-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_business_oil-prices-crash-storage-space_index_1588608322.html", "title": "Oil prices could soon turn negative as the world runs out of space to store it", "title_page": "Oil prices could soon turn negative as the world runs out of space to store it - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Supply, on the other hand, remains largely resilient amid a price war between Saudi Arabia and Russia. US producers don't want to be the first to blink by turning off production.\nThat could mean a supply glut so epic that the world will soon run out of room to store all the unneeded barrels of oil.\n\"The market is starting to signal that not only is there no demand for this crude, eventually there could be nowhere for it to go,\" said Jeff Wyll, senior energy analyst at Neuberger Berman.\nIn other words, storage facilities, refineries, terminals, ships and pipelines eventually could reach capacity -- something that hasn't happened since 1998, according to Goldman Sachs.\nrisk that might occur soon. Distressed pricing in some corners of the oil market shows that investors are starting to price in therisk that might occur soon.\nAlthough headline oil prices such as West Texas Intermediate and Brent are trading north of $20 a barrel, some regional prices have recently plunged into single-digit territory. That is especially true for landlocked grades of crude where access to storage is even trickier.\n\"Demand is falling so fast relative to supply that very soon many producers' main issue is not going to be whether they can ensure operating profit but rather if they can find an outlet for their crude,\" analysts at JBC Energy wrote in a report Tuesday.\nOne storage option: loading all that extra crude onto ships. JBC said about 20% of the global fleet of very large crude carriers (VLCCs) could become floating storage. But even that would not absorb the surplus.\nIn April, some 6 million barrels per day of \"homeless crude\" might literally have nowhere to go, JBC said, a figure that would rise to 7 million barrels per day in May.\nNegative oil prices\nThis oil glut is creating a scenario where some obscure grades of oil already have actually dropped below zero. For instance, a Wyoming crude grade was recently bid at negative 19 cents a barrel, Bloomberg News reported last week.\nShrinking storage capacity means that oil producers in some cases have to pay someone just to take the barrels off their hands.\n\"The price is trying to go to a level to force companies to keep the oil in the ground. If it has to go negative to incentivize that behavior, then it will,\" said Neuberger's Wyll.\nBrent, the global benchmark, is likely protected from this because it's priced on an island in the North Sea where tank storage is accessible. But other grades of crude are located far from water.\nWTI, however, is 500 miles from water. That's why Goldman's Currie said WTI, especially WTI Midland, and Canada's Western Canadian Select \"can go negative.\"\nSubzero oil prices are certainly bizarre, but there is some limited precedence in the energy market.\nLast year, US natural gas prices in West Texas traded in negative territory for more than two weeks because there were not enough pipelines to carry the gas away, Reuters reported.\n'Mother of all market surpluses'\nBut even then, negative natural gas prices didn't really discourage production. That's because the West Texas natural gas was largely a byproduct of oil pumped from the Permian Basin. Oil companies were willing to take a loss on the natural gas to get what was then a valuable barrel of oil.\nWith the collapse in oil prices, oil has lost more than two-thirds of its value since the January peak.\nNow, US oil companies are starting to make the painful decision of \"shutting in\" production, albeit reluctantly.\nPhysical constraints have forced at least 900,000 barrels per day of announced \"shut-ins,\" according to Goldman Sachs, which noted the true number is likely higher and \"growing by the hour.\"\nRystad Energy said that the \"mother of all oil market surpluses\" will force large production shut-ins in April and May. Older, less productive oil wells will likely shut down first.\nChevron CVX Even the strongest US oil companies say they'll scale back spending and production., for instance, announced plans last week to slash spending by 30% and lowered its output targets in the Permian by 20%.\nEventually, the industry could lose as much as 5 million barrels per day of oil supply capacity, Goldman Sachs said.\nWill this set the stage for an oil shock?\nOf course, the weak demand caused by the coronavirus pandemic won't last forever.\nEventually, airlines will take to the air again and start buying jet fuel. American drivers will buy more gasoline as they get back to work.\nBut by that point the oil industry might not be producing as much oil as before because wells shut down. Today's oil glut may suddenly turn into tomorrow's oil scarcity, pushing prices \"far above\" $55 next year, Goldman Sachs commodities head Jeffrey Currie said.\n\"This will ultimately create an inflationary oil supply shock of historic proportions,\" Currie wrote.", "url": "https://www.cnn.com/2020/04/01/business/oil-prices-crash-storage-space/index.html"}