{"authors": ["Opinion Saket Soni"], "date_download": "2020-05-04 16:20:29", "date_modify": "2020-05-04 16:20:29", "date_publish": "2020-04-05 15:44:32", "description": "Saket Soni writes that Congress should act to provide support for a key group of US workers: an estimated 10.5 million undocumented immigrants.", "filename": "2020_04_05_opinions_stimulu_b42c2ce7b38b98e288a29e050f74d5c8_index_1588609229.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190123141225-01-immigration-rally-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_opinions_stimulu_b42c2ce7b38b98e288a29e050f74d5c8_index_1588609229.html", "title": "How Congress can protect a vital segment of our workforce", "title_page": "How Congress can protect a vital segment of our workforce - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Saket Soni is the director of Resilience Force, a national initiative to transform America's response to disasters by strengthening and securing workers who make sustainable recovery from disasters possible. The views expressed in this commentary belong to the author. View more opinion at CNN.\n(CNN) For weeks, America's workers waited for members of Congress to come together and pass a set of emergency interventions that would soften the financial shock of the coronavirus pandemic. All workers -- regardless of occupation, industry, ability or documentation -- need aid and support during this volatile time.\nBut the $2 trillion stimulus bill excludes an estimated 10.5 million undocumented immigrants from life-saving support. Because our government does not recognize them as Americans, regardless of how long they have lived in America, the amount of work they have contributed or the taxes they have paid, the stimulus bill fails to protect one of the most vital segments of the workforce\nDocumentation should not be a barrier for relief. Undocumented people generate revenue and growth, pay taxes, and make immense contributions to their communities. Like other Americans, they also face pressing health care and financial needs during the pandemic. Without assistance, millions will suffer unnecessarily during this time.\nNot only has Congress failed to extend financial help to undocumented immigrants, there have been mixed messages about whether these workers can safely seek and receive health care.\nNow is not the time for ambiguity. It's imperative that Congress do more.\nHere are five policies that will help immigrants survive and recover along with everyone else.\n1. Include everyone in stimulus programs\nCongress has effectively shut undocumented immigrants, and many documented immigrants, out of all public benefits and stimulus programs since the 1990s, despite the fact that they contribute to the solvency of the Social Security system.\nDocumented and undocumented immigrants must be included in all worker protection and stimulus programs. In addition to being ineligible for the $1,200 stimulus checks, undocumented immigrants are not eligible to apply for small business loans and the Pandemic Unemployment Compensation program, which provides an additional $600 per week to those receiving unemployment compensation.\n2. Require severance pay for all\nThe Worker Adjustment and Retraining Notification (WARN) Act of 1988 requires most employers with 100 or more employees to provide 60 days notice before a company executes a mass layoff. But the law provides a huge exception for unforeseen business circumstances, like pandemics. Congress should amend the WARN Act to require companies to pay all workers one week's severance pay for each year on the job.\nIt's imperative that our government prevent businesses from freely engaging in mass layoffs with no notice and no severance. For undocumented workers ineligible for unemployment compensation, this is even more essential. Such a policy also lifts some pressure from the unemployment system, which has become overwhelmed trying to process an unprecedented number of claims during the crisis.\n3. Relax restrictions on immigrant access to occupational licenses\nState governors should relax restrictions on critical occupations to help meet some of the demands during the pandemic. Maryland Governor Larry Hogan, for example, relaxed in-home child care regulations to help meet the rising need for child care for those who work in health care, emergency services, and law enforcement.\nRegulations could also be relaxed for other industries in need. For example, we face a shortage of long-haul truckers that could potentially choke our national supply chain and leave millions of people facing shortages of food and other goods. Yet most states do not allow undocumented immigrants to obtain driver's licenses, let alone commercial driver's licenses.\nGovernors and state legislatures can temporarily relax their rules, or Congress can require states to allow undocumented immigrants to qualify for these licenses to support the massive demand for delivery -- as well as other licenses related to quickly escalating demands for work.\n4. Fund immigrant endeavors to bolster affected businesses\nGovernors and mayors should establish state and local grant and loan funding for laid-off workers, including undocumented immigrants, to launch Covid-19-related startups for small businesses.\nThis could include loans to purchase or lease a car or truck to meet the increasing demand for deliveries, set up a home-based child care business to support health care workers working around the clock, getting certified nursing assistance or home health care training, and equipping those who can manufacture personal protective equipment.\n5. Support lending circles for unbanked immigrants\nCongress should support the immigrant lending circles system -- a traditional means of mutual aid among immigrants, both those with official immigration status and those without it. Lending circles are money-loaning systems where small groups of people contribute to a central fund on a regular basis, with the resulting pool of money loaned out to individuals within the circle, usually at low or no interest.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nFinancial services innovator and MacArthur fellow Jose Quinonez started the organization Mission Asset Fund , a consistently low-default lending system recognized by the credit rating agencies, which allows immigrants to build their credit score through loans they obtain outside the established banking system. Building on this pre-existing infrastructure will allow immigrants to maintain the basic means for weathering the recession while giving them the foundation to establish a more financially secure future.\nThese are just some of the measures that would serve to include undocumented immigrants in the relief and recovery that all workers need. This is no time to leave anybody out.", "url": "https://www.cnn.com/2020/04/05/opinions/stimulus-undocumented-immigrants-saket-soni-opinion/index.html"}