{"authors": ["John Defterios", "Hanna Ziady", "Cnn Business"], "date_download": "2020-05-04 16:14:49", "date_modify": "2020-05-04 16:14:49", "date_publish": "2020-04-03 10:09:37", "description": "OPEC will meet on Monday with Russia and other oil producers in the hope of agreeing supply cuts and ending a brutal price war.", "filename": "2020_04_03_business_oil-prices-opec-meeting_index_1588608889.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403102810-russia-oil-tanks-0323-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_business_oil-prices-opec-meeting_index_1588608889.html", "title": "Oil prices march higher as OPEC calls emergency meeting on Monday", "title_page": "Oil prices march higher as OPEC calls emergency meeting on Monday  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) OPEC will meet on Monday with Russia and other oil producers in the hope of agreeing supply cuts and ending a brutal price war .\nThe meeting, called by Saudi Arabia, will be held via video conference and will include oil producers from outside the OPEC+ alliance that includes Russia and a few other countries, two senior sources at the OPEC secretariat told CNN Business. The final list of invitees has not yet been set, they said.\nThe United States, United Kingdom, Canada and Mexico could be invited, according to reports.\nThe meeting comes after President Donald Trump suggested that massive production cuts could be on the way and Saudi Arabia called for an \"urgent\" effort to restore \"balance\" to the oil market.\nUS oil prices soared 25% — their biggest one-day gain on record — on Thursday after Trump tweeted that he hopes and expects Saudi Arabia and Russia will slash output by between 10 million and 15 million barrels per day.\nPrices continued to advance Friday, recovering some of the massive plunge seen over the past month. Brent crude futures, the world's benchmark, were trading more than 9% higher at $32.77 a barrel.\nSaudi Arabia and Russia have been locked in an epic price war since early March when the OPEC+ alliance cracked, flooding the oil market with cheap crude just as demand craters because of the coronavirus pandemic . Crude had crashed to 18-year lows, crushing American oil companies and energy stocks.\nRussia and Saudi Arabia started the feud when the coronavirus was thought to be a \"brief health scare,\" Stephen Innes, chief global markets strategist at AxiCorp said in a note. Now that it is morphing into one of the most severe hits to the economy since the Great Depression, \"there's going to be a change of heart,\" he added.\nWhile news of the meeting will support oil prices, likely averting a slide to single-digits and easing the huge pressure on storage facilities , \"whatever cuts are agreed will not be sufficient to address the near/medium term oversupply,\" Innes said.\nWill American producers cut?\nAnalysts have expressed skepticism that Saudi Arabia and Russia would suddenly reverse course and slash production by nearly as much as Trump suggested, particularly as big cuts by Russia would undermine its goal of drowning high-cost US shale producers in a sea of cheap oil.\nEven 10 million barrels, the low end of Trump's touted production cuts, amounts to virtually all of Saudi Arabia's output, according to Matt Smith, director of commodity research at ClipperData.\nSaudi Arabia is OPEC's biggest producer by far and has been doing much of the heavy lifting to curtail supply since the group began limiting production in 2017. Now it seems it wants others to help out.\nA source within the OPEC+ alliance told CNN Business that it is unfair for two or three producers to shoulder most of the responsibility. \"We need to see burden sharing,\" the person said.\nPrevious cuts by OPEC and its allies have given US shale producers room to capture market share. The United States recently surpassed Russia and Saudi Arabia as the world's largest oil producer.\nBut there are signs that American producers could now get on board with a global effort to rescue prices.\n\"While we normally compete, we agreed that #COVID19 requires unprecedented levels of int'l cooperation,\" Ryan Sitton, a commissioner at the Railroad Commission of Texas, which regulates the state's energy industry, tweeted Thursday.\nChevron CVX Exxon Mobil XOM President Trump is also expected to meet on Friday with the heads of some of the largest US oil companies, includingand, a person familiar with the matter confirmed to CNN Business. Russian President Vladimir Putin is set to meet with the heads of major Russian energy companies.\n— Matt Egan and Nathan Hodge contributed reporting", "url": "https://www.cnn.com/2020/04/03/business/oil-prices-opec-meeting/index.html"}