{"authors": ["Jake Tapper", "Anchor", "Chief Washington Correspondent"], "date_download": "2020-05-04 16:20:31", "date_modify": "2020-05-04 16:20:31", "date_publish": "2020-04-05 15:53:18", "description": "CNN's Jake Tapper said: If I can take a moment, I would like to speak directly to one person known to watch this show, or at least clips of this show, President Trump.", "filename": "2020_04_05_politics_jake-tapper-president-trump-cnntv_index_1588609231.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405101328-jake-tapper-trump-split-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_politics_jake-tapper-president-trump-cnntv_index_1588609231.html", "title": "CNN's Jake Tapper: 'Mr. President, what's the plan?'", "title_page": "CNN's Jake Tapper to Trump: 'Mr. President, what's the plan?'  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) To end Sunday's \"State of the Union\" on CNN, anchor Jake Tapper took a few moments to ask President Donald Trump directly what his plan was to deal with the coronavirus pandemic. Below is a full transcript of Tapper's remarks:\n\"If I can take a moment, I would like to speak directly to one person known to watch this show, or at least clips of this show, President Trump\nMr. President, I know you, like millions of Americans, are eager to have the nation go back to some semblance of normal. One of the questions the American people need answered for that to happen responsibly: What's the plan?\nIs there a plan for widespread testing of every American so as to isolate the virus -- the way other countries have done? When will there be enough tests for that to happen? How will they be administered? Who will pay for the tests and the results? Who will notify us as to whether we've tested positive or not and what to do then?\nIs there a plan to make sure doctors and nurses and health care professionals finally are able to get the personal protective equipment or PPE that they need? Those health care workers are quite literally dying while they try to protect our society and save lives and they're -- they are begging for PPE. They don't need to be told that their governors or their hospital directors are doing anything wrong by trying to get those supplies to protect their lives while they try to save our lives. They need to know that there's a plan to get them the supplies they need.\nRead More", "url": "https://www.cnn.com/2020/04/05/politics/jake-tapper-president-trump-cnntv/index.html"}