{"authors": ["Reporter"], "date_download": "2020-05-04 20:20:47", "date_modify": "2020-05-04 20:20:47", "date_publish": "2020-04-29 15:49:39", "description": "The actor told Al Roker the Netflix docuseries is \"amazing\" and that he has his \"fingers crossed\" for getting cast in a potential film.", "filename": "entry_kevin-bacon-tiger-king-joe-exotic_n_5ea98d51c5b6fb98a2b60d5e_1588623647.html", "image_url": "https://img.huffingtonpost.com/asset/5ea994c6220000960c827dcc.png?cache=l4suuzea9t&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_kevin-bacon-tiger-king-joe-exotic_n_5ea98d51c5b6fb98a2b60d5e_1588623647.html", "title": "Kevin Bacon Wants To Play Joe Exotic Of 'Tiger King,' Says He's 'My Type Of Guy'", "title_page": "Kevin Bacon Wants To Play Joe Exotic Of 'Tiger King,' Says He's 'My Type Of Guy' | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "In case any producers are looking to make a “Tiger King” movie, Kevin Bacon wants in.\nThe 61-year-old actor appeared on NBC’s “3rd Hour of Today” on Wednesday to discuss his involvement in relief efforts for those on the front lines of the coronavirus pandemic.\nAfter describing his organization Six Degrees to host Al Roker, Bacon was asked about his love of the popular Netflix docuseries.\n“I’d play Joe Exotic in a second,” the actor told Roker.\n“It’s funny because before that even came out, I said to my wife ― she said, ‘Why are you watching this show?’ I said, ‘This is an amazing show. The reason that I’m watching this show is these are the kind of characters I get asked to play.’ And to me, documentaries are way better. ... This is my type of guy, you know, so fingers crossed.”\nIf the Netflix hit #TigerKing goes to the big screen would @kevinbacon play Joe Exotic?\n\"Sure, I'd play Joe Exotic in a second...this is my type of guy,\" says Bacon. pic.twitter.com/YEOFenW6Zz — 3rd Hour of TODAY (@3rdHourTODAY) April 29, 2020\nHis would-be involvement with a “Tiger King” movie has had people talking online. Earlier this month, TMZ reported on a sports betting website where people are placing bets on what actor would be cast as Joe Exotic, and Bacon is currently No. 1. Other bets are on Ed Norton, Billy Bob Thornton and David Spade.\nMeanwhile, Rob Lowe posted a picture of himself as Joe Exotic on Instagram earlier this month, telling fans he and “American Horror Story” producer Ryan Murphy are developing their “own version of this insane story.”\nHuffPost last month put together a potential cast list for a future movie, and our suggestions also included Spade, plus Chris Elliott, Nicolas Cage and Danny McBride.\nWith no shortage of options for Joe, the only question now is: Who’s the perfect Carole Baskin?", "url": "https://www.huffpost.com/entry/kevin-bacon-tiger-king-joe-exotic_n_5ea98d51c5b6fb98a2b60d5e"}