{"authors": ["Hyung-Jin Kim"], "date_download": "2020-05-04 20:11:18", "date_modify": "2020-05-04 20:11:18", "date_publish": "2020-04-16 06:51:17", "description": "SEOUL, South Korea (AP) — A former senior North Korean diplomat won a constituency seat in South Korea’s parliamentary elections, the first such achievement among tens of thousands of North...", "filename": "_36d49219bf9a5a5ab323dd7b950a0a68_1588623078.html", "image_url": "https://storage.googleapis.com/afs-prod/media/894da39cc6544e15b205fe4b79f1cd1e/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_36d49219bf9a5a5ab323dd7b950a0a68_1588623078.html", "title": "High-level North Korean defector wins South parliament seat", "title_page": "High-level North Korean defector wins South parliament seat", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Thae Yong Ho, former North Korean diplomat, who defected to South Korea in 2016 and a candidate of the main opposition United Future Party, wipes his tear after he was certain to secure victory in the parliamentary elections in Seoul, South Korea, Thursday, April 16, 2020. Thae on Thursday won a constituency seat in South Korea’s parliamentary elections, the first such achievement among tens of thousands of North Koreans who have fled their authoritarian, impoverished homeland. (Shin Jun-hee/Yonhap via AP)\nThae Yong Ho, former North Korean diplomat, who defected to South Korea in 2016 and a candidate of the main opposition United Future Party, wipes his tear after he was certain to secure victory in the parliamentary elections in Seoul, South Korea, Thursday, April 16, 2020. Thae on Thursday won a constituency seat in South Korea’s parliamentary elections, the first such achievement among tens of thousands of North Koreans who have fled their authoritarian, impoverished homeland. (Shin Jun-hee/Yonhap via AP)\nSEOUL, South Korea (AP) — A former senior North Korean diplomat won a constituency seat in South Korea’s parliamentary elections, the first such achievement among tens of thousands of North Koreans who have fled their authoritarian, impoverished homeland.\nThae Yong Ho, a former minister at the North Korean Embassy in London who resettled in South Korea with his family in 2016, was elected as a lawmaker representing a district in Seoul’s most affluent Gangnam neighborhood, internationally known for rapper PSY’s 2012 hit song, “Gangnam Style.”\n“Republic of Korea (South Korea) is my motherland. Gangnam is my hometown,” an emotional Thae said at his campaigning office. “I thank you (Gangnam residents) for selecting me to become the first (defector) from North Korea to win a constituency ... I’ll only uphold your order and work hard.”\nThae later bowed deeply and waved his hands with his fingers making V signs. Tears stood in his eyes, when Thae started signing South Korea’s national anthem with his supporters.\nThae ran on the ticket of the main conservative opposition United Future Party, which has called for a harder line on North Korea’s nuclear ambition and its record of widespread human rights abuses.\nNorth Korea wasn’t a main election issue for Wednesday’s elections, which were overshadowed by the coronavirus pandemic. The ruling liberal Democratic Party, which espouses rapprochement with North Korea, won landslide victories as South Korea’s virus infections slow.\nBefore the elections, Thae said he decided to run for a parliamentary seat to help South Koreans understand the true nature of North Korea and map a better unification policy. He has said his election would also give hope to North Koreans suffering from the North’s harshness.\nAnother North Korean defector who became a South Korean lawmaker was a proportional representative of a party, rather than being elected from a district.\nIt’s unusual for a member of the North’s ruling elite to defect to South Korea. About 33,000 North Koreans have fled to South Korea in the past two decades, but most were rural residents escaping poverty.\nThae has said he decided to flee because he didn’t want his children to live “miserable” lives in North Korea and he fell into “despair” after watching North Korean leader Kim Jong Un execute officials and pursue development of nuclear weapons.\nNorth Korea has called him “human scum” and accused him of embezzling government money and committing other crimes.", "url": "https://apnews.com/36d49219bf9a5a5ab323dd7b950a0a68"}