{"authors": ["Arlette Saenz", "Kaitlan Collins", "Sarah Mucha"], "date_download": "2020-05-04 16:24:27", "date_modify": "2020-05-04 16:24:27", "date_publish": "2020-04-06 20:44:16", "description": "Former Vice President Joe Biden and President Donald Trump spoke by phone on Monday about the response to the coronavirus pandemic, two sources familiar with the call and a White House official tell CNN.", "filename": "2020_04_06_politics_biden-trump-call_index_1588609467.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/191205055729-joe-biden-donald-trump-split-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_biden-trump-call_index_1588609467.html", "title": "Biden and Trump speak by phone about coronavirus response", "title_page": "Biden and Trump speak by phone about coronavirus response  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Former Vice President Joe Biden and President Donald Trump spoke by phone on Monday about the response to the coronavirus pandemic, two sources familiar with the call and a White House official tell CNN.\nThe phone call is a rare moment of direct communication between the two political rivals. Trump has harshly criticized Biden for months, and his efforts to pressure Ukraine into opening an investigation into Biden and his son, Hunter Biden, was the catalyst for launching impeachment proceedings against the President.\nBiden has criticized Trump's handling of the coronavirus pandemic, saying the administration was too slow to address the crisis. He has also said that Trump should stop talking and listen to experts.\n\"Vice President Biden and President Trump had a good call. VP Biden shared several suggestions for actions the Administration can take now to address the ongoing coronavirus pandemic and expressed his appreciation for the spirit of the American people in meeting the challenges facing the nation,\" Biden deputy campaign manager Kate Bedingfield said in a statement.\nTrump said later that he had a \"wonderful, warm conversation\" with Biden.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/biden-trump-call/index.html"}