{"authors": ["Grace Sparks"], "date_download": "2020-05-04 17:02:48", "date_modify": "2020-05-04 17:02:48", "date_publish": "2020-04-10 16:01:14", "description": "A new CNN Poll of Polls out on Thursday finds President Donald Trump's approval rating and the public's approval of his handling of the coronavirus pandemic trending down in the last month.", "filename": "2020_04_10_politics_cnn-pol_c113c3861a3b67809ebf58bf69080ae5_index_1588611768.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407193623-04-coronavirus-briefing-0407-trump-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_politics_cnn-pol_c113c3861a3b67809ebf58bf69080ae5_index_1588611768.html", "title": "CNN Poll of Polls: Trump approval ticking down on coronavirus response", "title_page": "CNN Poll of Polls: Trump approval ticking down on coronavirus response - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) A new CNN Poll of Polls out on Thursday finds President Donald Trump's approval rating and the public's approval of his handling of the coronavirus pandemic trending down in the last month.\nTrump's averaged approval rating stands at 46% approve, 49% disapprove -- ticking down from 48% approval in late-March.\nAbout half -- 49% -- approve of how the President is handling coronavirus, and 48% disapprove. Even though that number is higher than his overall approval, it has also dipped slightly in recent weeks, from 51% approval and 44% disapproval.\nThe CNN Poll of Polls is an average of the five most recent non-partisan, live operator, national surveys on each topic.\nTrump has seen higher than average approval ratings in recent weeks considering that his approval has historically been notoriously stable. However, the plummeting economy and concerns over coronavirus could eventually spell bad news for Trump's approval ratings.", "url": "https://www.cnn.com/2020/04/10/politics/cnn-poll-of-polls-trump-approval-coronavirus-general-election-biden/index.html"}