{"authors": ["Madeline Holcombe"], "date_download": "2020-05-04 15:57:00", "date_modify": "2020-05-04 15:57:00", "date_publish": "2020-04-09 07:49:53", "description": "Passover is here, and Easter and Ramadan are approaching. Occasions that typically bring families together to pray, reflect and celebrate -- fellowship needed, perhaps, now more than ever -- will look different this year as the coronavirus pandemic continues.", "filename": "2020_04_09_health_coronavir_265387d0d5c2c485e7ce422042246255_index_1588607820.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405032635-coronavirus-isolation-mental-health-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_health_coronavir_265387d0d5c2c485e7ce422042246255_index_1588607820.html", "title": "Long-term social distancing may be traumatic. Here is what to expect and what to do", "title_page": "Mental health and coronavirus: Long-term social distancing may be traumatic. Here is what to expect and what to do  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Passover is here, and Easter and Ramadan are approaching. Occasions that typically bring families together to pray, reflect and celebrate -- fellowship needed, perhaps, now more than ever -- will look different this year as the coronavirus pandemic continues.\nThe loss of those traditions is added to a growing list of losses that Americans are facing as they endure at least another month of social distancing and with it an extended departure from routines, habits, social circles and normalcy.\nThe protracted disruption to life as it was, mental health experts say, could bring feelings of anger, depression, anxiety and even grief.\n\"There is literal grief like losing loved ones,\" said Dr. Vaile Wright, the American Psychological Association's director of clinical research and quality. \"But there is a grief of experiences that we are losing right now. There can feel like there is a lot of loss right now, a loss of freedom, a lot of things we took for granted.\"\nThe next few months may take a toll on the nation's mental health, experts say, but it is possible to mitigate the stress.\nAmericans' collective trauma\nExtended isolation and stress from the pandemic can affect everyone differently, said Dr. Dana Garfin, a health psychologist.\nIt could put strain on families, send children home to abusive situations, make those living alone feel isolated and threaten people's sense of purpose by keeping them from work, Garfin said.\nAnd those experiencing financial insecurity in the midst of the pandemic have an added stress that is difficult to resolve, said Dr. Baruch Fischhoff, a psychologist at Carnegie Mellon University.\nDespite those differences, the experience of staying home together through a pandemic can be considered a collective trauma, said Garfin, who studies collective traumas such as hurricanes, terrorist attacks and earthquakes.\nCollective traumas start at some point of impact and then ripple out to loved ones of the afflicted, witnesses to the devastation and people whose lives are disrupted.\nIn this case, many Americans fall into one or more of those categories. People in quarantine show signs of confusion, depression and anger, Garfin said.\n\"We necessarily run much of our lives by habit,\" said Fischhoff. \"We know what we have for breakfast, we know how to prepare the kids for school, and that enables us to get through the day reasonably well.\"\nBut now that many Americans aren't waking up and going to school and work, it can be difficult to know how to restructure even the most rote daily habits that won't be coming back for weeks yet.\nWhat life might look like on the other side of coronavirus\nHow long the pandemic and the isolation continue will dictate how severe the effects are on people's mental health, Garfin said.\nProlonged exposure to the traumas of coronavirus can activate the fight or flight response, which over time can cause cardiovascular problems, anxiety, depression and PTSD, Garfin said. And the extended isolation can contribute to fear, anxiety, headaches, muscle tension and difficulty concentrating, said Wright.\nFor some groups, like health care workers, those in the media and people in newly deemed \"essential jobs,\" the end result may be guilt, grief and PTSD, said Wright.\nBut, Wright and Garfin agreed, humans are resilient.\nSome may forget everything they just went through and go back to their daily lives when it is all over, Wright said, but many can come out of this with stronger relationships and a better perspective on what is important.\nHow to get through it\nThe future is uncertain, but life will be different for at least the next month and that knowledge can be the first step to making this new, temporary reality as good as it can be.\nNow that it is clear the change is for more than a couple of weeks, it is important to create a new routine -- one that includes showering, getting dressed and maintaining family meals -- not treating the time as an extended snow day or spring vacation, Wright said.\nThere is an opportunity for people to develop new habits around the disruption, which can relieve the stress of feeling like starting from scratch every day, Fischhoff said.\nAnd all three say it is important to use social media to be social, not to feed the anxiety that conflicting coronavirus information on the platform stokes.\nThey also agree that this experience is difficult, and it is important to acknowledge that and not be too critical of what one could have done before or could be doing now.\n\"I think that we need to recognize that this is totally unprecedented, and we really are just doing the best we can -- and that's OK,\" Wright said. And for people doing the best they can but struggling to work, study or care for their families, virtual mental health resources may be a crucial next step.\nAnd for those who are lonely and isolated, Garfin suggests reframing for a feeling of community within that experience.\n\"We aren't in our houses alone, we are doing something for each other for our community,\" Garfin said. \"It's a shared effort, something that we are all a part of and something we are all contributing to.\"\n\"It's going to be difficult, but it's not permanent.\"\nCORRECTION: This story has been updated to correct the name of the American Psychological Association.", "url": "https://www.cnn.com/2020/04/09/health/coronavirus-mental-health-long-term-wellness/index.html"}