{"authors": ["Becky Bohrer"], "date_download": "2020-05-04 20:13:13", "date_modify": "2020-05-04 20:13:13", "date_publish": "2020-04-08 04:14:58", "description": "JUNEAU, Alaska (AP) — The state of Alaska has placed surgical abortion on a list of procedures that could be postponed to help conserve personal protective equipment for health care workers amid...", "filename": "_6d0c86c2e10752eabe2c4dd969a57284_1588623193.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_6d0c86c2e10752eabe2c4dd969a57284_1588623193.html", "title": "Alaska says abortions can be delayed amid virus concerns", "title_page": "Alaska says abortions can be delayed amid virus concerns", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "JUNEAU, Alaska (AP) — The state of Alaska has placed surgical abortion on a list of procedures that could be postponed to help conserve personal protective equipment for health care workers amid the COVID-19 outbreak. Similar stances have spawned legal fights in other states.\nLast month, the state of Alaska issued a mandate requiring non-urgent or elective procedures be canceled or postponed for three months. An update, released Tuesday, adds detail. It requires cancellation or postponement of such procedures until June 15 and is accompanied by a list of surgeries or procedures that would fall under that category.\nUnder a section for gynecological surgeries that “could be delayed for a few weeks,” it lists surgical abortion. It says healthcare providers “are to postpone surgical abortion procedures unless the life or physical health of the mother is endangered by continuation of the pregnancy during the period of postponement.”\nDuring an evening news conference, state health Commissioner Adam Crum was asked to clarify what that period would be. He said the language leaves room for “professional judgement” on the timeframe.\nHe said most of the guidance released Tuesday follows that of the American College of Surgeons.\nBut the American College of Surgeons, on its website, cites suggestions from Temple University for handling gynecological surgeries during the COVID-19 pandemic. Under surgeries that if “significantly delayed could cause significant harm,” it includes the termination of pregnancy.\nJessica Cler, Alaska state director for Planned Parenthood Votes Northwest and Hawaii, in a statement said abortion is an “essential, time-sensitive medical procedure.”\n“It is shameful to see elected officials exploit a public health crisis to score political points and restrict abortion access,” she said.\nThe guidance released by the state also lists other procedures that could be put off, including some related to cancer, certain pediatric surgeries and gastric bypass surgery.\nCrum said the primary purpose of the revised mandate is to preserve personal protective equipment for health care workers and patient care supplies, ensure staff and patient safety and expand available hospital capacity as the state deals with the coronavirus.\nOn Monday, a federal appeals court left in place a judge’s temporary order allowing surgical abortions to continue in Ohio during the coronavirus pandemic. Oklahoma ’s attorney general said the state planned to appeal a separate, similar decision affecting that state.\nTuesday, a federal appeals court sided with Texas in allowing it to ban most abortions while that state is under an emergency order limiting nonessential surgeries.\nAlaska has reported more than 200 cases of COVID-19.", "url": "https://apnews.com/6d0c86c2e10752eabe2c4dd969a57284"}