{"authors": [], "date_download": "2020-05-04 20:24:10", "date_modify": "2020-05-04 20:24:10", "date_publish": "2020-04-14 15:00:25", "description": "TRENTON, N.J. (AP) — New Jersey's COVID-19 death toll climbed by 365 since Monday, Gov. Phil Murphy said Tuesday, the state's biggest jump to date. That brings the state's death toll to...", "filename": "_00e762c8b4069f6e89311240ddd57766_1588623850.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_00e762c8b4069f6e89311240ddd57766_1588623850.html", "title": "Virus death toll has biggest jump, up 365 to 2,805", "title_page": "Virus death toll has biggest jump, up 365 to 2,805", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "TRENTON, N.J. (AP) — New Jersey’s COVID-19 death toll climbed by 365 since Monday, Gov. Phil Murphy said Tuesday, the state’s biggest jump to date.\nThat brings the state’s death toll to 2,805, according to the governor. Murphy has said such peaks stem from the rate of information coming into the state. It doesn’t necessarily mean there has been a big overnight jump, he has said.\nThe climbing figure comes as the state seems to be entering a peak, officials have said.\nThe number of positive cases climbed to about 69,000, up from about 65,000 since Monday.\nA look at other developments:\n___\nTHE DATA\nIn addition to the new cases and fatalities, Health Commissioner Judy Persichilli said there were about 8,000 people hospitalized, up from about 7,700 the previous day. More than 2,000 people were in intensive care, up from about 1,900 Monday. Roughly 500 residents were discharged from hospitals, Murphy said, roughly the same as the previous day.\n___\nNEW LAWS\nLegislation extending the income tax deadline to July 15 and pushing the budget deadline to September will be signed into law, Murphy said.\nAnother bill would permit people caring for family members with COVID-19 to get 12 weeks of paid family leave during a two-year period without losing their job.\n___\nSTARS RAISING MONEY\nBruce Springsteen, Jon Bon Jovi and at least a dozen other New Jersey natives will be doing a COVID-19 fundraiser for vulnerable victims in the state later this month, a relief fund announced Tuesday.\nThe New Jersey Pandemic Relief Fund said the singers and celebrities will appear in videos from their homes at 7 p.m. on April 22.\nThe other stars include New York Giants running back Saquon Barkley, singer Tony Bennett, actors Danny DeVito and Whoopi Goldberg, as well as comedian Chris Rock. The celebrities will be directing people to the fund’s website so they can donate.\nThe event will air on Apple Music and AppleTV apps, but will also be broadcast live and rebroadcast five times on E Street Radio on SiriusXM, according to the statement. The program will also be carried on WABC, WPVI, WPIX, News12, NJTV and radio outlets including 1010 WINS, WCBS 880 and others.\nThe fund will provide grants to existing organizations that have a record of caring for vulnerable communities, according to the fund. All the money will go to groups that provide “essential services to those in need and to assist those on the front lines of the COVID-19 pandemic,” the fund’s statement said.\n___\nABOUT THE VIRUS\nFor most people, the virus causes mild or moderate symptoms that clear up in a couple of weeks. Older adults and people with existing health problems are at higher risk of more severe illness, including pneumonia, or death.", "url": "https://apnews.com/00e762c8b4069f6e89311240ddd57766"}