{"authors": ["Reporter", "Work Life"], "date_download": "2020-05-04 21:06:57", "date_modify": "2020-05-04 21:06:57", "date_publish": "2020-04-30 21:02:01", "description": "If you want to jog or do other exercise outside, check out these experts' advice on face masks, social distancing and how to work out safely.", "filename": "entry_outdoor-exercise-coronavirus-safely_l_5ea89f6dc5b6e7b159f8cf38_1588626417.html", "image_url": "https://img.huffingtonpost.com/asset/5ea8a13e3000002711155157.jpeg?cache=TLBefBn8TK&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_outdoor-exercise-coronavirus-safely_l_5ea89f6dc5b6e7b159f8cf38_1588626417.html", "title": "Running Outside During Coronavirus? Here's How To Do It Safely.", "title_page": "Running Outside During Coronavirus? Here's How To Do It Safely. | HuffPost Life", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Going outdoors and getting some fresh air has become a lot less simple during the coronavirus pandemic. Because COVID-19 is believed to primarily spread through respiratory droplets, every encounter with another human being is now fraught.\nYet spending time outdoors running, walking or biking is good for those of us trapped indoors and missing the sun. Proximity to nature and green spaces has been shown to decrease mental fatigue and can alleviate symptoms of stress and depression.\nBut to safely work up a sweat outdoors safely, you need to be considerate of your health and the health of those around you. Here’s how:\nKeep your distance while exercising.\nWhen exercising outside, limit your risk of exposure to this infectious disease by practicing social distancing. The Centers For Disease Control and Prevention said it believes the coronavirus spreads between people who are within about 6 feet of each other.\nThis means you should avoid falling in with other people moving at the same pace. But brief interaction ― zooming past a pedestrian on your bike or jogging past someone who is walking ― is not likely to cause much risk, said Lucy Wilson, the chair of the department of emergency health services at the University of Maryland, Baltimore County.\n“Close contact is defined as being in proximity with another person of less than 6 feet for a prolonged period of time,” Wilson said. “Running or walking past someone in an open space, like the outdoors, should pose minimal risk.”\nYes, masks are inconvenient while exercising, but they help. And better options are coming soon.\ntorwai via Getty Images Athletic companies are likely to release running masks for exercise soon.\nJust because you feel well enough to work out doesn’t mean you don’t have the coronavirus ― some people just don’t have symptoms.\n“Someone breathing heavily, panting or exerting themselves could be more likely to spray respiratory secretions, similar to coughing and sneezing,” Wilson said. “A cloth mask could decrease the spray of droplets, but may be difficult to wear during heavy exercise.”\nMasks can help decrease the risks, said Kelly Reynolds, director of the environment, exposure science and risk assessment center at the University of Arizona.\n“The risk to runners who maintain a distance of 6 feet is expected to be low, but the use of masks and greater distancing can minimize the risk further,” she said.\nThomas Russo, the chief of the infectious disease division at the University of Buffalo, said it’s OK to not wear a mask if you’re exercising in the middle of nowhere for a walk, but it’s still good to have one on you. “If you see someone is coming, you can put the mask on,” he said. “If it’s really crowded, you should wear the mask all the time.”\nAidan Walsh, the founder of Racefaster, a running coaching company and athletic retailer in New Jersey, said he predicts masks will be part of running’s future. “It’s only a matter of weeks before you see all the major brands, including us, having running masks for sale,” he said.\nIn the meantime, if you’re running where you can encounter other people, Walsh said he recommends wearing cloth masks or neck gaiters, which he said his brand has been selling a lot of. The neck gaiter sits around your neck, and you can pull it over your face if you approach someone.\n“If I see someone, I'll literally cross the street. It's like a game of Pac-Man.” - Racefaster founder Aidan Walsh\nIf you’re exercising, be considerate of when and where you do it.\nReynolds advised choosing neighborhood streets, which are generally less crowded than parks, trails and beaches, and to avoid popular public venues when possible.\nIf you are craving physical exertion but don’t want to venture to a park, you can also get creative. One athlete is staging marathon in his small backyard.\nWalsh said runners have to realize times are different and adjust accordingly. He recommends running alone and keeping a minimum of 20 feet from others, and he will inconvenience himself to do it.\n“If I see someone, I’ll literally cross the street,” he said about running in congested northern New Jersey. “It’s like a game of Pac-Man, but again, that’s what you have to do. You don’t want to A.) get yourself sick, or B.) get others sick.”\nBe aware of when outdoor spaces are more likely to be crowded and choose off-peak hours to exercise, health experts advised. To lower social interactions, Paris banned jogging between 10 a.m. and 7 p.m., for example.\nWalsh said running outdoors during a rainstorm was usually miserable before the pandemic. But when it rained during one recent run, all he could think was, “This was great, because I’ll be the only one out there.”\nWash your hands.\nLastly, remember to limit what your hands touch while exercising outdoors, including exercise equipment. “Avoid face touching or touching the cap of your water bottle with potentially contaminated hands,” Reynolds said.\nRemember to wash your hands immediately whenever you return from outdoors or after removing your potentially contaminated mask.\nDespite the new challenges runners have to consider, Walsh recommends outdoor exercise for the mental health benefits it can offer when people are losing structure in their lives.\n“They’re oversleeping, they’re staying up late, they’re eating poorly,” he said. “Their lives are upside down. And having the mental break and something ― let’s call it normal ― in their lives, is really important.”", "url": "https://www.huffpost.com/entry/outdoor-exercise-coronavirus-safely_l_5ea89f6dc5b6e7b159f8cf38"}