{"authors": ["Kevin Liptak", "Kaitlan Collins"], "date_download": "2020-05-04 16:51:32", "date_modify": "2020-05-04 16:51:32", "date_publish": "2020-04-08 12:03:56", "description": "For two days in a row, President Donald Trump has downplayed questions about whether he should distance himself from his second-in-line to guard against them both contracting coronavirus, even as other world leaders see members of their cabinets infected -- or, in the case of Britain's Boris Johnson, fall victim to the disease themselves.", "filename": "2020_04_08_politics_trump-pence-continuity-of-government_index_1588611092.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/190205231630-34-sotu-2019-unfurled-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_trump-pence-continuity-of-government_index_1588611092.html", "title": "Trump and Pence stay close even as aides ramp up guards protecting chain of command", "title_page": "Trump and Pence stay close even as aides ramp up guards protecting chain of command - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For two days in a row, President Donald Trump has downplayed questions about whether he should distance himself from his second-in-line to guard against them both contracting coronavirus , even as other world leaders see members of their cabinets infected -- or, in the case of Britain's Boris Johnson , fall victim to the disease themselves.\nInstead, Trump has placed confidence in an intensive testing regimen at the White House that has so far seen scores of officials and guests undergo an assessment before coming anywhere near him.\n\"No, I don't think so,\" Trump said Monday when asked whether he was taking any additional steps to protect the continuity of government. \"Mike (Pence) had his test couple of days ago. I had my test couple of days ago. And we're here, and here you are. So, no, I don't think so.\"\nFrom the start of the coronavirus outbreak in the United States, Trump has both downplayed the prospect that he could contract it himself and shrugged off his own government's guidelines on social distancing and wearing masks\nEven after he came into contact with several individuals who later tested positive for the virus, Trump declined to be tested. Eventually he relented and took a test, but only because he said he was coming under pressure to do so by the media.\nSome members of Trump's staff have been quietly agitating for more than a month to take further steps to guard against possible infection, including the possibility of separating Trump from Vice President Mike Pence to avoid both of them potentially becoming ill, according to people familiar with internal conversations.\nWhite House officials, including former acting chief of staff Mick Mulvaney and members of the White House Medical Unit, have assessed the situation on an ongoing basis to make determinations on how best to protect the President and vice president from being infected, according to a White House official.\nIt's not clear whether the option of separating from Pence has been formally presented to Trump himself, and he said on Monday he wouldn't avoid his number two because they'd both recently taken tests showing they were negative for coronavirus.\nAfter Pence, House Speaker Nancy Pelosi is next in the presidential line of succession. She remains at home in San Francisco and hasn't spoken to Trump in months, let alone come into contact with him.\nNew steps\nLast month, the White House began taking more noticeable steps toward preventing the virus from arriving in its hallways and meeting rooms, including canceling public tours, taking the temperature of every person who enters the complex and, as of last week, testing every person who comes into close proximity to the President. Senior staff are now tested regularly, though their aides who work in the West Wing aren't.\nThe Abbott Labs test is less invasive than other versions, which typically include a deep nasal swab that can prove uncomfortable. With the rapid test, a medical professional swabs both nostrils quickly before inserting the sample into the Abbott machine for an assessment, an official who had received it said.\nOn Tuesday, Dr. Deborah Birx, the administration coronavirus response coordinator, said she'd \"self-tested\" the last time she underwent the procedure at the White House.\n\"It can be done, it's straightforward,\" she said.\nThough the procedure utilizes a speedier test that can deliver results within 15 minutes, it is still a cumbersome alternative to avoiding in-person meetings altogether, as some other world leaders have done.\nThe White House is also now weighing administering rapid Covid-19 tests to all staff who work on the grounds, one official told CNN. The Abbott Laboratories test, which Trump took last week, provides results quickly but could prove to be a grueling task given how many officials are still coming into work.\nRight now, officials are asked to schedule their tests ahead of time and undergo the procedure outside of the West Wing. It's not clear how the White House might manage wider testing.\nPeople without symptoms are not currently a priority for testing, based on guidelines from the US Centers for Disease Control and Prevention, but the White House would justify doing so out of an abundance of caution and to ensure continuity of government, an official said.\nTrump continues to host meetings of administration officials in the West Wing, though chairs are spaced further apart to allow for six feet of distance between participants. He brought in outside executives last week for a discussion on energy issues and each was tested before meeting with Trump.\nOn Tuesday, however, the external participants in a meeting on small business were beamed in via videoconference.\nTrump has also appeared in the briefing room nearly every day for the past month to update reporters on the coronavirus response, often flanked by members of the task force.\nBirx, a senior member on the task force, said on Monday that she decided not to visit an ailing granddaughter, who developed a fever over the weekend, out of concern she might bring the virus back to the White House.\n\"Because of you two,\" she said, gesturing toward Trump and Pence. \"I mean, you can't take that kind of risk with the leaders of the country.\"\nA majority of White House complex staffers are working from home, including many of those who work in the executive residence. That's left mostly senior aides and those working directly on the coronavirus issue remaining in the office. While a few White House officials have been seen wearing masks, Trump himself has rejected for himself new CDC guidelines recommending Americans wear a face covering in situations where social distancing is difficult.\n\"I think wearing a face mask as I greet presidents, prime ministers, dictators, kings, queens, I don't know. Somehow, I don't see it for myself,\" Trump said last week.\nClose to Pence\nJUST WATCHED Trump admits telling Pence not to call governors Replay More Videos ... MUST WATCH Trump admits telling Pence not to call governors 03:54\nOn Sunday, Trump said he wouldn't take steps to physically separate from Pence to protect the continuity of government in light of Johnson's worsening condition. The top US ally fell seriously ill from coronavirus and was moved to an intensive care unit at a London hospital on Monday.\n\"I get next to him, I don't breathe. I'm only kidding,\" Trump said. \"We are sometimes forced into positions that I'd rather be away.\"\nInstead, Trump said he would ramp up testing of people around him given the relative ease and speed of new testing kits.\n\"I think we'll probably, just because of questions like that, I think we'll probably have maybe quite a few tests,\" he said on Monday. Standing alongside Trump, Pence said he was tested earlier in the day and that it came back negative.\nTrump has said he's avoiding shaking hands, a practice he says he disliked even before coronavirus rendered it taboo. A self-described germaphobe , he has always kept a bottle of hand sanitizer in close range.\nStill, he hasn't adopted the measures some other world leaders were forced into, either because they came into contact with someone who had coronavirus or because they became infected themselves.\nCanadian Prime Minister Justin Trudeau has been self-quarantining at his red brick home in Ottawa after his wife became ill from the disease last month. Without aides or staff, he's juggled the duties of a crisis-era leader with solo parenting his three children.\nGerman Chancellor Angela Merkel returned to her office last week after a 12-day quarantine at her apartment in Berlin after she came into contact with the physician who later tested positive.\nAnd Israeli Prime Minister Benjamin Netanyahu was in self-quarantine in Jerusalem after the country's health minister contracted coronavirus.\nOther leaders have been moving about more freely. French President Emmanuel Macron posed a video to his Twitter on Tuesday showing his walking around a northeastern suburb of Paris giving a thumbs up as residents of an apartment block applauded from their own self-isolation.", "url": "https://www.cnn.com/2020/04/08/politics/trump-pence-continuity-of-government/index.html"}