{"authors": ["Paul R. La Monica", "Cnn Business"], "date_download": "2020-05-04 16:53:10", "date_modify": "2020-05-04 16:53:10", "date_publish": "2020-04-08 16:09:56", "description": "McDonald's was enjoying a great start to 2020 but that all changed once the Covid-19 pandemic hit Europe and the United States.", "filename": "2020_04_08_investing_mcdonalds-earnings-sales-dividend_index_1588611190.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408101303-mcdonalds-la-0406-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_investing_mcdonalds-earnings-sales-dividend_index_1588611190.html", "title": "McDonald's sales have plunged because of coronavirus", "title_page": "McDonald's sales have plunged because of coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) McDonald's was enjoying a great start to 2020 but that all changed once the Covid-19 pandemic hit Europe and the United States.\nThe fast food giant reported Wednesday that sales at restaurants open at least a year plunged more than 22% in March, led by a nearly 35% decline in its internationally operated markets.\nSales at American restaurants open at least a year fell 13.4% in March, even though nearly all of its locations in America are still up and running.\nUS sales held up better while European sales plunged\nsaid that 75% of its restaurants worldwide are operating but that France, Italy, Spain and the United Kingdom have fully closed all restaurants.\nBefore March, McDonald's said that US comparable sales at restaurants open at least a year were up 8% during the first quarter while international sales rose more than 7%.\nBecause of the stunning drop in March, McDonald's said that US sales rose only 0.1% for the entire first quarter -- and total sales were down 3.4%.\n\"This unprecedented situation is changing the world we live in, and we will need to adapt to a new reality in its aftermath,\" said McDonald's CEO Chris Kempczinski in a statement.\nHe added that the company is now shifting to focus on more on drive-thru, take-out and delivery orders as opposed to people sitting in the restaurants to eat.\nMcDonald's had no supply chain disruptions so far, despite the outbreak. Kempczinski said.\nJUST WATCHED McDonald's isn't known for fresh food. It wanted to change that Replay More Videos ... MUST WATCH McDonald's isn't known for fresh food. It wanted to change that 03:35\nMcDonald's is continuing to receive a steady stream of food, packaging, toys for Happy Meals and other equipment and that it is \"working closely with suppliers on contingency planning.\"\nKempczinski also acknowledged that the coronavirus outbreak was hitting McDonald's small business franchisee owners particularly hard and he vowed to help support these partners.\n\"We will continue to work with franchisees around the world to evaluate operational feasibility,\" Kempcinski said.\nCutting back on expenses to support store owners\nMcDonald's said it was suspending its stock buyback program and raising $6.5 billion through debt sales. The company also plans to reduce capital spending in 2020 and open fewer restaurants in most markets around the globe.\nMcDonald's did not say it would suspend or cut its dividend payments to shareholders, however.\nThat could become a public relations problem considering that many small businesses will need government support in light of the economic slowdown caused by the coronavirus outbreak.\nStifel analyst Chris O'Cull noted in a report Wednesday that the company paid $3.6 billion in dividends last year and that \"politically, it may be difficult for McDonald's to continue to pay a hefty dividend, while its franchisees accept federal government financial support.\"\nShares of McDonald's rose slightly on Wednesday -- lagging the gains of the broader market. The stock is down more than 10% this year, but that's not as bad as the Dow's nearly 20% drop.", "url": "https://www.cnn.com/2020/04/08/investing/mcdonalds-earnings-sales-dividend/index.html"}