{"authors": ["Opinion Dr. Shahdabul Faraz"], "date_download": "2020-05-04 16:19:31", "date_modify": "2020-05-04 16:19:31", "date_publish": "2020-04-04 22:22:09", "description": "While the toll on our health care system and economy are widely discussed, we have been far too quiet about another, more insidious, problem, writes Shahdabul Faraz", "filename": "2020_04_04_opinions_mental-health-crisis-coronavirus-faraz_index_1588609171.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200402223244-03-coronavirus-0402-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_04_opinions_mental-health-crisis-coronavirus-faraz_index_1588609171.html", "title": "Health care workers face a mental health crisis", "title_page": "Health care workers face a mental health crisis (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Shahdabul Faraz is a resident physician in the Department of Surgery at Beth Israel Deaconess Medical Center, a teaching hospital of Harvard Medical School, and an incoming MBA candidate at Harvard Business School. The views expressed in this commentary belong to the author. View more opinion at CNN.\n(CNN) America has become the epicenter of the global Covid-19 pandemic, surpassing both China and Italy in the number of confirmed cases. While the toll on our health care system and economy are widely discussed, we have been far too quiet about another, more insidious, problem.\nThe virus will undoubtedly unleash an unprecedented level of psychological trauma on both health care providers and patients.\nHealth care workers have felt frustrated, anxious and vulnerable about facing patients infected with a contagious and potentially lethal disease without adequate personal protective equipment (PPE). N95 masks are in short supply, and some health care workers have even had to resort to using garbage bags as protective gowns. The PPE crisis may be in part just another political battle between President Trump and our state governors, but it has real consequences for us. Our fellow providers have been diagnosed with Covid-19 in startling numbers, and many are dying.\nAt first I read the warnings from doctors in Italy. Then, more and more people in the US started becoming infected. Now, people I personally know are getting ill. Who is next? Could it be me? If I get sick, will I infect my patients, colleagues and family members? These are the questions we ask ourselves every day. This constant state of fear quickly becomes mentally exhausting, especially in the face of increased work demands during a pandemic.\nThis is compounded by what we know about how this virus is affecting our patients. We know that, for example, by the time Covid-19 patients reach the intensive care unit, they have a remarkably high mortality rate. The Intensive Care National Audit and Research Center in the UK suggests this rate is 48% . The mortality rate is even higher -- at 66% -- for individuals requiring advanced respiratory support, such as mechanical ventilation. Even with our best efforts, we know that our sickest Covid-19 patients will likely die. This reality can drive even the most committed optimist to self-doubt and anguish.\nThe situation will only get worse. As poor as the outcomes are, ventilators are undoubtedly saving precious lives. So what happens if we don't have enough? Who gets treated and who does not ? Even asking this question is jarring, but these are decisions that will need to be made. These are decisions that Italian providers have been making.\nAnd then there is the isolation. Hospitals nowadays look much different than they did even a few weeks ago. Most health care workers not involved with direct patient care are working remotely. Even many \"essential\" departments are working at half-capacity, keeping a reserve workforce safe at home in case they have to replace their infected colleagues.\nThese policies serve an important purpose, but it also means that providers lack adequate peer support. We no longer spend as much time with our colleagues. People have stopped eating together. There are no more meetings or collective coffee breaks. To make matters worse, many of us cannot even find solace in our own homes. Some providers have taken refuge in their basements or garages or have completely moved out in the hopes of safeguarding their family members from the virus.\nIt is no surprise then that the mental health of our providers has suffered tremendously during this pandemic. A recent study in the Journal of the American Medical Association quantifies this problem. The study surveyed more than 1,250 health care workers in China who worked in hospitals with Covid-19 patients. A significant proportion reported symptoms of depression (50.4%), anxiety (44.6%), insomnia (34.0%) and distress (71.5%). Nurses, frontline workers, women, and those working in Wuhan -- the epicenter of the outbreak in China -- reported more severe symptoms.\nThe mental health of our patients is being affected as well in a profoundly heartbreaking way. Some hospitals have recently implemented strict no-visitor policies in hopes of shielding at-risk patients from the virus. Around the country, grieving loved ones have been barred from visiting their critically ill family members. The stories of patients in intensive care units spending their last few days of life alone have shocked the country.\nThis isolation will get worse in the coming weeks to months. It's possible that thousands of pregnant patients will have to give birth without their partners by their sides. Many elderly folks will have to undergo emergency surgeries without the care and support of their families. Even pediatric patients will be affected, as many children's hospitals have moved to limit visitation . During a time when our patients need as much support as they can get, they will be more isolated than ever.\nThe worsening mental health is also affecting the general population. A recent Axios-Ipsos poll showed that 22% of Americans reported that their mental health has gotten worse during this pandemic. Just one week later, that number had climbed to 35%\nWhile the short-term effects on mental health are becoming more clear, the long-term impact will only reveal itself over time. What we do know for certain is that psychological scars do not tend to disappear overnight. One suspects that these scars will linger on much longer than the virus itself.\nDespite this, all hope is not lost. My advice to others is to find solace in small gestures and little victories. Just over a week ago, someone chalked positive messages along the sidewalks of our hospital.\nOne message read, \"Just keep swimming.\" Another one said, \"Thank you for what you do.\" As I read the messages, I could not help but smile and feel a sense of overwhelming relief. I had started to wonder if people outside of our hospital walls were forgetting about us, but it made me realize that we still had their support.\nA similar gesture was made by a New Jersey man , who was holding up a sign thanking providers for saving his wife's life amidst this crisis. Moments like these are powerful for us because it reminds us why we go to work every day despite fully knowing the risks.\nAs we move forward, now is the time for hospitals to offer easily accessible mental health services to all providers and patients who need them. Some hospitals, including my own, have done an admirable job of providing such resources , including virtual counseling support and wellness workshops. Our surgical department has been hosting \"virtual hangouts,\" allowing providers from all training levels the opportunity to decompress and relax. These mental health initiatives need to be adopted more broadly with the encouragement of state and federal governments. The mental health of our providers and patients during this pandemic needs to be a top priority.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook", "url": "https://www.cnn.com/2020/04/04/opinions/mental-health-crisis-coronavirus-faraz/index.html"}