{"authors": ["Gregory Wallace"], "date_download": "2020-05-04 16:56:24", "date_modify": "2020-05-04 16:56:24", "date_publish": "2020-04-09 10:02:09", "description": "Senate Democrats are urging the Trump administration to pause non-critical work like overhauling environmental policies during the coronavirus pandemic.", "filename": "2020_04_09_politics_regulatory-rollback-coronavirus_index_1588611384.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200214121712-02-climate-and-technology-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_regulatory-rollback-coronavirus_index_1588611384.html", "title": "Democratic senators urge Trump administration to halt environmental rollbacks during pandemic", "title_page": "Democratic senators urge Trump administration to halt environmental rollbacks during pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "But the proposal is dead on arrival with the Trump administration, which said the crisis highlights the need for regulatory reform to cut red tape holding back businesses across the economy.\nIt also comes as the administration enters a critical window -- just weeks remain to formalize rules that cannot be easily overturned by Democrats, should they prevail in November's elections. By late May or early June, there is no guarantee, legal experts say.\nThe formal rulemaking process is a key avenue for presidents to leave a lasting impact, alongside pushing legislation through Congress and shaping law by arguing cases and appointing judges.\nAt stake are the Trump administration's priorities around air pollution, water quality and power plants, balanced with what Senate Democrats described in a new letter as their concerns about \"citizens' fundamental right to participate in the operations of their government.\"\nThe letter, signed by 20 Democrats and one independent who typically sides with Democrats, asks the administration to pause the development and proposal of new federal rules \"indefinitely\" while \"our nation is in the midst of a global pandemic and a worsening public health crisis.\"\nThe letter essentially proposes freezing that formal process for at least several weeks. It calls for a pause in proposing new rules; for extending the window for the public and interest groups to write and submit formal responses to proposed rules; and for rescheduling public hearings. It suggests an exception for rules directly related to the coronavirus response and recovery.\n\"It would be flat out wrong for any federal agency to take advantage of a pandemic to push through the Trump administration's controversial policy agenda when the public isn't looking,\" said Sen. Tom Udall, a New Mexico Democrat who led the letter. \"In this moment, every federal agency should be focusing resources to tackle the public health and economic crisis that is disrupting the health, safety, employment and well-being of every American.\"\nA spokesman for the Office of Management and Budget, a branch of the White House that coordinates the rulemaking process, said the agency is looking to continue President Donald Trump's \"massive deregulatory wins for the American people.\"\n\"Anyone who supports adding more government bureaucracy and roadblocks at a time of national crisis is out of touch,\" the spokesman, who declined to be named, said. \"Covid has left no industry, business, or sector of our country unscathed, and President Trump's administration has found ways to allow for a faster, more efficient responses from the (agriculture) field to the health care profession to small business.\"\nThe Senate Democrats are not alone in their request. A coalition of groups representing governors, state lawmakers and municipalities recently asked the President for a similar pause.\n\"The extreme impact on normal working and living conditions will impair the ability of not only state and local officials, but also the general public, issue experts and others to provide thoughtful and meaningful participation and involvement in potential federal government actions that directly affect millions of people,\" reads the March 20 letter , signed by the National Governors Association, the National Conference of State Legislatures, the United States Conference of Mayors and six other groups.\nThe clock is also ticking on the Trump administration's unfinished regulatory business. If Democrats win both the White House and Senate and retain control of the House in November's elections, they could use the Congressional Review Act to throw out recently formed rules.\nFrom the date a regulation is formalized, Congress has 60 legislative days when it can vote to overturn the regulation, and then seek a presidential signature or veto. Because of breaks, weekends, and other days Congress is not in session, experts say the Congress that assembles next year could reach back as far as June or late May.\nThis scenario does not become a factor if Trump wins reelection, or Republicans control at least one chamber of Congress.\nThe administration does not have time at this point to propose an entirely new rule, perform the required formal steps and avoid the possibility it is rejected by incoming Democrats, according to Caitlin McCoy, a staff attorney at the Harvard Law School Environmental and Energy Law Program.\nHer team is tracking the Trump administration's regulatory changes and says the administration may have time to finalize several of its environmental priorities before the deadline. Those include new rules on mercury emissions from power plants, removing incentives for companies to avoid killing birds under the Migratory Bird Treaty Act and overriding objections from state authorities when issuing some permits involving water pollution.\nRules that have already been finalized are likely outside of that window, such as the administration's recent overhaul to vehicle emission standards.\nJames Goodwin, who's with the Center for Progressive Reform, said he supports a regulatory pause and said that moving quickly to finalize rules \"increases the chance that they might get struck down in court later.\"\n\"A federal judge may well decide that the public didn't have an adequate chance to participate,\" he said. \"This legal deficiency could thus convince a judge to send the rule back to the agency to obtain better public feedback.\"\nHe noted the Environmental Protection Agency is working on a rule that would restrict the types of studies its experts can consider as legitimate science.\n\"The rule is currently open for public comment,\" Goodwin said. \"But all of the public health experts with the best knowledge about this rule also happen to be busy responding to the pandemic.\"", "url": "https://www.cnn.com/2020/04/09/politics/regulatory-rollback-coronavirus/index.html"}