{"authors": ["Mindy Isser", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Nicole Aschoff", "Navendu Mishra", "Shelly Hughes", "Susie Young", "David Broder"], "date_download": "2020-05-04 19:49:26", "date_modify": "2020-05-04 19:49:26", "date_publish": "2020-03-25 00:00:00", "description": null, "filename": "2020_03_coronavirus-low-wage-workers-front-lines-grocery-store_1588621766.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/25102807/GettyImages-1213575009.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_coronavirus-low-wage-workers-front-lines-grocery-store_1588621766.html", "title": "Workers Are More Valuable Than CEOs", "title_page": "Workers Are More Valuable Than CEOs", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Low-wage workers are on the front line in the battle against coronavirus. While many workers have started telecommuting — and many others have unfortunately been laid off — low-wage workers are busy cleaning our streets, making sure we have enough to eat, and, of course, nursing us back to health if we get COVID-19. Despite being linchpins of a functional society, these workers are often treated as expendable or dismissed as “unskilled.” But over the past few weeks, we’ve seen just how irreplaceable they are.\nIn California, New York, Illinois, Pennsylvania, New Jersey, and elsewhere, state governments have rolled out increasingly strict orders to enforce social distancing and close all businesses except those deemed “essential” or “life-sustaining.” While these lists vary from state to state, each includes grocery stores, laundromats, restaurants (serving takeout and delivery), factories that produce foodstuffs and other products, gas stations, pharmacies, and hospitals.\nWhat do all of these businesses have in common? They rely on the labor of low-wage workers who, in many cases, toil without benefits, unions, and workplace protections. Public workers are still on the clock, too, cleaning our streets, delivering our mail, and making sure we have access to utilities and other social services. While many government workers have unions, they are often accorded the same lack of respect as their low-wage, private-sector counterparts.\nBut imagine a global pandemic without postal workers or UPS drivers getting us our messages and packages; without cashiers and stockers keeping grocery stores up and running and full of food; without care and domestic workers providing life-saving medical and emotional support to some of society’s most at-risk people; without utility workers making sure we have a supply of water, electricity, and gas; without laundromat workers enabling us to clean our clothes, towels, and sheets; without sanitation workers collecting our trash and slowing the spread of germs.\nWhile many individuals have expressed appreciation for these frontline workers — leaving hand sanitizer out for their letter carrier; calling for an increase in teachers’ salaries after having to homeschool their kids for a few days — our society has long undervalued them, both monetarily and otherwise. That’s starting to change, thanks to the crisis and worker organizing that has turned up the heat on bosses.\nMinnesota, Michigan, and Vermont have all classified grocery store employees as emergency workers, making them eligible for childcare and other services. Stop & Shop workers have received a 10 percent pay increase and two additional weeks of paid sick leave. Safeway, Target, and Whole Foods workers won a $2-per-hour increase. And unionized workers at Kroger in Washington state have been given hazard pay, a demand taken up by many grocery and other frontline workers across the country. These victories, while small, have inched us closer to a society where low-wage workers finally get the remuneration and respect they deserve.\nBut what does it say about our country when the jobs that are most critical to sustaining life at its basic level are also some of the lowest paid and least valued? Grocery store workers and first responders are exposing themselves to a massive health crisis in order to keep the rest of us functioning as normally as possible. Many of them work for minimum wage or close to it — and without health benefits — meaning that they could contract coronavirus and get stuck with either a massive bill or no health care at all. Meanwhile, with many school districts closed indefinitely, parents are missing the critical and challenging work done every day by nannies, childcare workers, and educators of all kinds.\nThese workers have a right to higher wages, full benefits, health and safety guarantees, and strong unions — just like every other worker.\nHopefully, this crisis will not only elevate the status of low-wage workers but spark a new wave of organizing to boost standards and build power across these “essential” industries. Because it’s low-wage workers — not bankers, landlords, or CEOs — who make our society run.", "url": "https://jacobinmag.com/2020/03/coronavirus-low-wage-workers-front-lines-grocery-store"}