{"authors": ["Dan Simon"], "date_download": "2020-05-04 16:20:17", "date_modify": "2020-05-04 16:20:17", "date_publish": "2020-04-05 13:38:29", "description": "San Francisco was the first city to tell its residents to stay home to beat the coronavirus. Dan Simon reports that homeschooling, keeping far away from neighbors and a joyful lack of traffic now seem like a routine, but a very strange one.", "filename": "2020_04_05_us_san-francisco-coronavirus-diary-simon_index_1588609217.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403162859-san-francisco-lockdown-headline-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_us_san-francisco-coronavirus-diary-simon_index_1588609217.html", "title": "Three weeks into lockdown, San Francisco's new normal is very abnormal", "title_page": "California coronavirus: Three weeks into lockdown, San Francisco's new normal is very abnormal - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We are publishing personal essays from CNN's global staff as they live and cover the story of Covid-19 . Dan Simon is based in San Francisco as a correspondent for CNN.\nSan Francisco (CNN) I had a birthday last week, or wait ... was it this week? You lose track of time these days. (In case you're wondering, I turned 48.) Every family has their own birthday traditions, and for my wife and me and our three kids, we pick a favorite restaurant.\nMy kids always seem to choose Benihana. The flaming onion, much to my chagrin, never gets old to them! And we always go the same beloved bakery, Susie's, for our cakes. At some point, I'll usually get a little \"me\" time to play tennis or go for a hike.\nNone of those things happened this year, but in the midst of so much suffering and hardship, I know I should just be grateful to have had one.\nWe're in San Francisco, which on March 16 became the first US city to have a \"stay-at-home\" order, restricting all but essential activities. A few days later I'd just wrapped up a day's worth of CNN live shots talking about how people were coping, when an alert appeared on my phone -- California Gov. Gavin Newsom was telling the whole state to lock down.\nThe emails came flying. \"Get your shot back up asap. We need you for the top of Cuomo.\"\nAs Chris Cuomo and I digested the news on live TV, I rhetorically asked, \"What's that going to do to the state's economy?\"\n\"It's going to tank it,\" he shot back.\nThinking back to that moment, I don't think many had seriously entertained that, within days, similar orders would extend first to California and then to nearly the entire country -- and tank the economy nationwide. This was just a couple weeks ago.\nThe Chronicle summarizes Mayor London Breed's order to San Franciscans.\n\"If I have to attribute it to one thing, it has to be (San Francisco) Mayor London Breed's foresight in calling state of emergency early, getting people to shelter in place early, and really just wonderful messaging of social distancing,\" said Dr. Jahan Fahimi, an emergency room physician at UCSF.\nSpeaking by FaceTime, as is now customary for interviews, Fahimi said he believed the city has flattened the curve, though city officials say it's still too early to know for sure.\nSecond grader Jack Simon takes a class through Zoom, powered by Nutella on toast.\nThough nothing seems routine anymore, our house seems to have settled into one.\nMy kids, ages 13, 10 and 8, are getting comfortable with their respective schools' online curriculum. Each has found a little corner of our home -- whether it's the kitchen or dining room -- to fire up their devices and do Zoom video classes.\nWhile I continue my reporting, my wife moves from child to child, overseeing their daily online classes and workload. Like many parents across the country, she's had to become a homeschool teacher on top of all the other demands that come with being a mom.\nBeing a homeschool teacher, I quickly determined, is a much more difficult role than mine. My daughter completed a math assignment and needed to upload a picture of her work to her Google classroom page. \"How do I this?\" she asked.\nHmmm. It seems we're all trying to problem solve -- all the time.\nSeeing their teachers and friends on video, I believe, has been a huge source of comfort for all of them.\nThe proverbial \"we're all in this together\" has never been more true.\nThere has been the occasional mishap around the house. With their extra free time, my kids used some bungee cord to create a sling shot with a sled and accidentally put some big holes in our basement wall.\nAnd my wife, unable to go to the salon, tried to color her hair and was horrified by the result. Jet black.\nIf that's the worst of it, we're in really good shape!\nA near empty China Beach in view of the Golden Gate Bridge indicates that San Franciscans are abiding by the stay-at-home mandate.\nI must say getting around town is a pleasure these days. No traffic. The question is where do you go? It's heartbreaking to see the boarded-up shops and shuttered restaurants. For those that are offering take-out service, lonely staff stand outside of their eateries to let passersby know they're open for business, as I noticed the other day on Chestnut Street, one of the city's most popular destinations.\nGoing to the neighborhood Target also proved to be a surreal experience. The frozen food section was practically bare and of course, no paper towels or toilet paper. A woman who appeared to be in her 70s seemed to be having a nervous breakdown in the checkout line when the credit card machine malfunctioned. \"I just can't stay in here much longer,\" she said, her voice breaking.\nThe clerk assured her she would be on her way momentarily.\nSimon's wife Katherine makes sure to stay more than 6 feet away from anyone she sees out while walking the family dog, Coco.\nWhen it comes to running errands, I've usually been the one to go. My wife is much more hesitant to venture out and has become super cautious when taking our dog or children out on walks. When she sees someone nearby, she will dart in whichever direction to make sure there is much more than 6 feet of social distancing. I know she's not alone, but it makes me wonder how long it will take people to relinquish this habit once the \"stay-at-home orders\" are lifted.\nShe's definitely the cop.\n\"I'd wear your mask,\" she'll say referring to one of my leftovers from covering years of California wildfires. \"Have you washed your hands?\"\nTruth is I'm grateful she's following things to the letter of the law.\nSimon blows out the candles on his birthday cake, homemade and delicious.\nWe all look for silver linings in a crisis. For me, it's been spending additional time with family. We do common chores, go outside for walks and have our meals together. I hope the extra spirit of cohesion and togetherness sticks long after the crisis.\nAs for my birthday, my daughter baked me a cake. It had tons of rainbow sprinkles and M&Ms. It was delicious!", "url": "https://www.cnn.com/2020/04/05/us/san-francisco-coronavirus-diary-simon/index.html"}