{"authors": ["Madeline Holcombe", "Jen Christensen", "Joe Sutton"], "date_download": "2020-05-04 16:53:08", "date_modify": "2020-05-04 16:53:08", "date_publish": "2020-04-08 09:08:48", "description": "The US Centers for Disease Control and Prevention has removed from its website guidelines for doctors on how to prescribe two antimalarial drugs that President Donald Trump has touted as potential treatments for the novel coronavirus.", "filename": "2020_04_08_health_cdc-coronavirus-hydroxychloroquine_index_1588611188.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408041447-hydroxychloroquine-bottle-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_health_cdc-coronavirus-hydroxychloroquine_index_1588611188.html", "title": "CDC removes guidance on drugs touted by Trump to treat coronavirus", "title_page": "CDC removes guidance on drugs touted by Trump to treat coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The US Centers for Disease Control and Prevention has removed from its website guidelines for doctors on how to prescribe two antimalarial drugs that President Donald Trump has touted as potential treatments for the novel coronavirus.\nTrump has been pressing federal health officials to make the drugs -- hydroxychloroquine and chloroquine -- more widely available, despite little reliable evidence that they are effective at treating the virus.\nThe updated CDC guidance , published Tuesday, is shorter and no longer gives dosage information about the drugs.\nCNN has reached out to the CDC for comment.\nHydroxychloroquine and chloroquine have not been approved by the US Food and Drug Administration to treat coronavirus. Nevertheless, on Saturday the FDA issued an emergency use authorization to distribute the two drugs from the national stockpile to treat patients hospitalized with Covid-19.\nThe CDC says the drugs are under investigation in clinical trials.\n\"Anecdotal reports suggest that these drugs may offer some benefit in the treatment of hospitalized COVID-19 patients,\" said the US Department of Health and Human Services (HHS) in a statement Sunday.\nBut some experts, including Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, have warned the administration that the drug is unproven and that there are dangers in promoting it before data backs up its efficacy.\nThere was a heated disagreement in the White House over the weekend about the effectiveness of the unproven drugs.\nStates are accruing doses of the drugs\nEven though the drugs have not yet proven safe for preventing or treating coronavirus, some states are gathering doses for their patients.\nPharmaceutical company Amneal has donated 200,000 doses of hydroxychloroquine to the Georgia Department of Public Health, US Rep. Doug Collins said Tuesday. He described the donation as a step toward treatment.\n\"Proud to have worked with Amneal Pharmaceuticals, Inc. to help secure 200,000 doses of hydroxychloroquine for @GaDPH! This medication could potentially save thousands of lives across our state. Thank you, Amneal, for this incredible donation!\" Collins tweeted.\nFlorida is scheduled to receive a million doses of the drug Wednesday, Gov. Ron DeSantis said. DeSantis praised the drug, with the caveat that the virus is so new that there are no approved treatments yet.\nWho could benefit from them\nUnder the FDA's emergency use authorization, hydroxychloroquine can be administered to patients who are hospitalized and weigh at least 110 pounds.\nBut in a Facebook Live conversation with Mark Zuckerberg and Dr. Priscilla Chan on Tuesday, virologist and infectious disease specialist Dr. Don Ganem questioned if the drug would be more effective if given to patients with more mild symptoms.\n\"Even if it does work, is the very sick person in the ICU the best person to be using that drug?\" Ganem said.\nBy the time patients are typically transferred to the ICU, they are usually many days into the infection and viral replication is already trending down, Ganem said. It could be more effective, he reasoned, to treat patients earlier when their symptoms are mild and they are at the peak period of viral replication.\nWith so many lives at stake, Ganem said it makes sense to want to use every tool available, but he stressed the importance of doing clinical trials alongside use of the drug.", "url": "https://www.cnn.com/2020/04/08/health/cdc-coronavirus-hydroxychloroquine/index.html"}