{"authors": [], "date_download": "2020-05-04 20:07:49", "date_modify": "2020-05-04 20:07:49", "date_publish": "2020-04-16 21:38:15", "description": "DES MOINES, Iowa (AP) — Iowa Gov. Kim Reynolds refused to say Thursday whether she was asked to join with other Midwest governors in coordinating the reopening of their state economies. The...", "filename": "_2099ec48c103dfc0ee320e1b430c49db_1588622869.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2099ec48c103dfc0ee320e1b430c49db_1588622869.html", "title": "Reynolds won't say if she was invited to join 7-state pact", "title_page": "Reynolds won't say if she was invited to join 7-state pact", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Reynolds won’t say if she was invited to join 7-state pact\nDES MOINES, Iowa (AP) — Iowa Gov. Kim Reynolds refused to say Thursday whether she was asked to join with other Midwest governors in coordinating the reopening of their state economies.\nThe governors of seven Midwestern states announced they had agreed to work together to restart their economies amid the coronavirus pandemic, following similar pacts in the Northeast and West Coast.\nThe Midwest agreement includes Illinois, Ohio, Michigan, Indiana, Wisconsin, Minnesota and Kentucky. Five of the governors are Democrats and two are Republicans.\nWhen asked if she was invited, Reynolds’ spokesman Pat Garrett responded that she “will continue to participate in conversations with nearby governors as we prepare to open the state back up in the coming weeks.”\nGarrett didn’t respond when asked again if Reynolds was asked to join with the other governors.\nWhen asked about the absence of Iowa in the group, Illinois Gov. J.B. Pritzker said he wished more states had joined.\n“Iowa chose not to be part of this,” Pritzker said. “I know they don’t have a stay-at-home rule yet in place. They’ve made a lot of different decisions than we have.”\nReynolds has argued that the steps she has taken were as effective as other states, like Illinois, that have stay-at-home orders.", "url": "https://apnews.com/2099ec48c103dfc0ee320e1b430c49db"}