{"authors": ["Charles Riley", "Cnn Business"], "date_download": "2020-05-04 16:23:28", "date_modify": "2020-05-04 16:23:28", "date_publish": "2020-04-06 16:34:27", "description": "How do you restart an economy that's been shut down by a pandemic? The answer is: very, very carefully.", "filename": "2020_04_06_business_germany-coronavirus-economy_index_1588609408.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406083728-berlin-germany-0405-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_business_germany-coronavirus-economy_index_1588609408.html", "title": "How do you restart an economy? Germany has a plan", "title_page": "How do you restart an economy? Germany has a plan - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) How do you restart an economy that's been shut down by a pandemic ? The answer is: very, very carefully.\nEven as the novel coronavirus continues to spread around the world, European governments are starting to think about how to re-open factories, offices and schools while minimizing the chance of further outbreaks . Austria on Monday said it would gradually begin to reopen shops after Easter, becoming the first country in Europe to do so.\nPressure is building on governments to explain their plans because of the mounting economic costs of measures designed to contain the coronavirus. It's compounded by fears that food supplies and health care provisions could be undermined if the restrictions are in place for too long.\nWhile lockdowns are likely to remain for weeks — and in some countries, months — detailed planning done now could protect vulnerable people and help economies bounce back more quickly when restrictions are eased. Getting it wrong could lead to more outbreaks, another round of restrictions on work and public life, and much more economic pain.\nIn Germany, where 100,000 people have tested positive for coronavirus and nearly 1,600 have died, a group of economists, lawyers and medical experts are recommending a gradual revival of Europe's biggest economy that would allow specific industries and workers to resume their activities while steps are taken to prevent a resurgence of coronavirus.\nA dozen academics write in the report, which was published last week by the Ifo Institute for Economic Research, that they do not expect a vaccine or effective treatment for the coronavirus to be available before 2021. As a result, Germany should approach the fight against the disease \"more like a marathon than a sprint.\"\n\"Future measures must be designed and prepared in such a way that, on the one hand, they ensure good health care and, on the other hand, that they can be sustained over the necessary periods of time,\" the experts write. \"Planning for this transition must begin immediately in politics, administration, companies and other organizations.\"\nGermany has ordered the closure of schools, restaurants, playgrounds, sports facilities and most shops until at least April 20, pushing an economy that was already teetering on the brink of recession into a deep slump. Government spokesman Steffen Seibert said Monday that he cannot yet provide a firm timetable for lifting restrictions. Ifo has forecast a 20% hit to GDP this year if the lockdown lasts for three months.\nHow to restart an economy\nThe German government is already rolling out an economic rescue package worth up to €750 billion ($825 billion) that includes measures to spur lending to businesses, take stakes in companies and support furloughed workers. The package is among the biggest launched anywhere in the world.\nThe Ifo report suggests the country should now create a national task force of experts and public representatives that would make recommendations on how to ease restrictions on work and public life, and when industries should restart production. Going back to work would be voluntary for employees.\nIndustries such as telecommunications and auto production that add the most value to the economy should be prioritized, the report says, while work that can easily be done from home should continue to be done remotely. Nurseries and schools would open relatively quickly, because young people rarely have severe symptoms and parents cannot work if child care facilities and schools remain closed.\nA man with a mask passes by an empty street during the coronavirus crisis in Berlin, Germany.\nNo clubbing or big events\nCompanies that make health care products or components should also reopen quickly, while hotels and restaurants would only be allowed to do so in a \"very carefully and controlled manner\" because it is difficult for people to keep their distance in such establishments. Discos and clubs should remain closed for now, the report says, and events with a large number of spectators should not be held.\nThe experts say it's possible that different standards may be set in different regions. Restrictions could be eased first in places with low infection rates or reduced risk of transmission, such as rural communities. As time passes, regions where the population has built up a degree of immunity could be allowed to operate with fewer restrictions.\nThat, of course, requires coordinated and large scale testing for coronavirus. Comprehensive training on proper hygiene, and new rules mandating the use of personal protective equipment would also be necessary.\nThe experts also recommend that Germany organize a \"massive\" increase in the production of protective clothing and masks, boost its production capacity for drugs and vaccines, and establish an information technology platform that allows for strategic planning.\nAnd while the task force would make recommendations, politicians and business leaders would make the final call on when to lift restrictions. \"The attempt to centrally control the resumption of production would ... not work in practice. This resumption must be controlled primarily by the institutions and companies themselves,\" the report states.\nLooking to China\nCountries trying to jumpstart their economies while preventing a second wave of coronavirus infections may look to China for clues on what works and what doesn't.\nThe country likely suffered its first economic contraction in decades in the first quarter after the central government in Beijing imposed drastic measures to contain the spread of the coronavirus.\nChina has embarked on an aggressive plan to save its economy, launching policies and campaigns meant to push people back to work, encourage business confidence, and protect as many companies from failing as possible. Beijing is spending billions of dollars on medical supplies and treatment, and pumping money into infrastructure projects to create jobs. It's also removing road blockades and allowing people to travel more freely in areas where the virus appears to have run its course.\nBut it's too soon to sound the all-clear. New questions are being raised about whether infection data reported by Beijing can be trusted, and huge numbers of people were seen flocking to tourist sites over the weekend. Some businesses have rushed back to work too soon, complicating the recovery efforts. A top titanium producer restarted its factories in February, only to halt work again because workers were infected.\nThe need for balance\nDr. Anthony Fauci, the United States' top infectious disease expert, said recently that while public health is his top priority, keeping society and the economy on total lockdown for too long would have unintended negative consequences.\nAnd former British Prime Minister Tony Blair told BBC radio on Monday that he was \"terrified\" at the economic damage the lockdown was doing to the UK economy, estimated by the Centre for Economics and Business Research at £2.4 billion ($2.9 billion) per day.\n\"If it goes on for a long period of time ... it also affects your ability to operate your health care system effectively,\" Blair said.\nHow to strike an appropriate balance, Fauci said, is a question being considered by countries around the world as the coronavirus continues to spread.\n\"People are dependent on supply chains for nutrition, for food,\" he told the New York Times. \"They might starve. People have illnesses. If you dramatically interrupt that to the point where it no longer exists, the disruption of society can be really quite catastrophic.\"\n\"We need to make sure we keep our eye on the balance,\" he added.\n— Laura He and Stephanie Halasz contributed reporting.", "url": "https://www.cnn.com/2020/04/06/business/germany-coronavirus-economy/index.html"}