{"authors": ["Julia Horowitz", "Cnn Business"], "date_download": "2020-05-04 16:01:51", "date_modify": "2020-05-04 16:01:51", "date_publish": "2020-04-01 16:01:33", "description": "Pension funds and other investors are smarting from the worst quarter for stocks since 2008. Now many are bracing for more pain as companies slash dividend payouts in the face of a global recession that is wiping out their revenue and putting millions of their workers out of a job.", "filename": "2020_04_01_investing_dividends-coronavirus-recession_index_1588608111.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200401102128-hsbc-new-york-0329-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_investing_dividends-coronavirus-recession_index_1588608111.html", "title": "The next hit to your retirement fund: Disappearing dividends", "title_page": "Dividends are disappearing as banks and companies hang on to cash - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "London (CNN Business) Pension funds and other investors are smarting from the worst quarter for stocks since 2008. Now many are bracing for more pain as companies slash dividend payouts in the face of a global recession that is wiping out their revenue and putting millions of their workers out of a job.\nBanks have already started ditching payments worth billions of dollars, and so have companies in other industries. The cuts are a sign of just how big a hit the coronavirus has been for global businesses, which delivered a record $1.4 trillion in dividends last year.\n\"We're getting companies suspending or cutting dividends every single day at the moment,\" said Jane Shoemake, investment director on the global equity income team at Janus Henderson, an asset manager that tracks global dividends\nGoldman Sachs estimates thatdividends will decline by 25% this year. Citigroup, meanwhile, thinks dividends in Europe — which are typically more generous than in the United States — could be cut in half.\nPressure to slice dividends is coming from many sources: In the United States, companies that accept federal bailouts or loans to survive the coronavirus crisis are barred from paying dividends in the near term, while regulators are calling on banks to preserve capital so they can keep lending to businesses and offer mortgage holidays to households.\nHSBC HBCYF Standard Chartered SCBFF Lloyds LLDTF FTSE 100 UKX UK banks includingandhave halted dividend payments following a request from the country's financial services regulator. Their shares plunged on Wednesday, pushing theindex down more than 3%.\nFor the retail, hospitality and energy sectors — which have seen revenue dry up completely in some places — it's about holding onto enough cash to tide them over until the lockdowns lift and the economy can start to recover.\n\"It's all about the balance sheet right now,\" said Peter Boockvar, chief investment officer at Bleakley Advisory Group.\nA looming 'wave' of cuts\nDividend payments have exploded since the global financial crisis as steady economic growth and President Donald Trump's corporate tax cut in 2017 left companies flush with cash. Executives binged on buying back shares and boosting dividends, which reward investors while boosting the value of the company's stock.\nIn 2019, dividend payments rose by 3.5% to hit $1.4 trillion, an all-time high, according to Janus Henderson.\nCompanies usually try to preserve those payments at all costs. Shareholders can be punishing if they backpedal.\nThat's especially true in the oil sector, where dividends are the main prize keeping investors committed to an industry with limited opportunities for growth. But faced with an oil price crash, a sharp recession and the prospect of having to layoff or furlough employees, companies have few options but to retrench.\nGoldman Sachs strategists Cole Hunter and David Kostin told clients this week that \"a wave of dividend suspensions, cuts, and eliminations will result in payouts declining by 38% during the next nine months.\"\nIn Europe, dividends cuts could be even worse than during the global financial crisis, when they fell by a third, according to Citigroup strategist Robert Buckland.\nUnder pressure\nCarnival CCL Those hit the hardest by the pandemic have quickly moved to stop dividend payments in a bid to conserve cash., which is trying to tap capital markets for $6 billion as the cruise industry implodes, halted its dividend on Tuesday.\nCompanies also have public opinion to consider at a moment when shareholder handouts are politically charged. Continuing to make dividend payments while cutting employees loose would pose a major reputational risk.\n\"To be seen to be paying out a big dividend when all of this is going on, it could not be taken very well,\" Janus Henderson's Shoemake said.\nMacy's M suspended its dividend on March 20 before announcing that it would furlough most of its 125,000 employees earlier this week.\nAccess to government bailouts is a factor, too. Under the $2 trillion stimulus bill enacted by the United States last week, businesses that take advantage of a new $500 billion lending program can't issue dividends until a year after the loan has been repaid. Airlines that receive US assistance aren't permitted to make such payments through September.\nThe situation is slightly different for banks. Regulators have assured the public that lenders have the capital necessary to get them through the crash without sparking a new financial crisis. But they're encouraging banks to pause dividends anyway so they can boost lending, helping to power the economy through this vulnerable moment.\nThe European Central Bank has asked banks not to pay dividends until at least October \"to boost banks' capacity to absorb losses and support lending to households, small businesses and corporates.\"\nUniCredit UNCFF , Italy's top bank, quickly said it would fall in line.\nBig Oil holds out\nIn the oil sector, where dividends are sacrosanct, the biggest players are doing their best to stay the course despite the 63% collapse in oil prices since early January.\n\"Through the last downturn they did whatever they could to avoid cutting their dividends,\" said Anish Kapadia, director of energy at the consultancy Palissy Advisors, referring to a plunge in oil prices between 2014 and 2016.\nRoyal Dutch Shell RDSA hasn't slashed its dividend since World War II, and it's going to extraordinary lengths to avoid doing so now. The company said this week it has secured a $12 billion line of credit, which comes on top of a $10 billion credit facility obtained in December.\nBut taking on more debt at such a precarious moment could be dangerous, and it's not an option for all oil companies, Kapadia said. They could reduce spending on equipment, but they already sold a lot of what they could during the last oil shock.\nIf prices stay this low, the product of a price war between Saudi Arabia and Russia and evaporating demand, cash levels could be low enough to force Big Oil's hand.\n\"As you go on through the year, the prospect of dividend cuts becomes much higher,\" Kapadia said.\nSome companies, such as those in tech, health care and utilities, will be less affected by the coronavirus outbreak and could stay the course. But in the current environment, it's hard to say which payouts are safe — especially when the outlook is so uncertain.\n\"Even companies that could pay dividends may not do so,\" Citigroup's Buckland said. \"Better to build cash on the balance sheet to deal with potential pitfalls ahead.\"", "url": "https://www.cnn.com/2020/04/01/investing/dividends-coronavirus-recession/index.html"}