{"authors": ["Wayne Parry"], "date_download": "2020-05-04 20:16:09", "date_modify": "2020-05-04 20:16:09", "date_publish": "2020-04-08 19:27:54", "description": "ATLANTIC CITY, N.J. (AP) — Double down on Donald, or bet big on Biden? Plenty of Americans would like the chance to place a bet on the upcoming presidential election (and sports books would love...", "filename": "_0d082e3e35b4d8143697252be509cf68_1588623369.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b042e7f624ca4d06b3f029592201c95b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0d082e3e35b4d8143697252be509cf68_1588623369.html", "title": "Trump-Biden election off-limits for US bettors (so far)", "title_page": "Trump-Biden election off-limits for US bettors (so far)", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this combination of file photos, former Vice President Joe Biden speaks in Collier, Pa., on March 6, 2018, and President Donald Trump speaks in the Oval Office of the White House in Washington on March 20, 2018. For a moment, West Virginia looked like it was going to be the only state in the country to allow betting on the presidential election. The short-lived play by bookmaker giant FanDuel was approved by the state lottery board. But it was announced and nixed within the span of about two hours Tuesday, April 7, 2020 in a bizarre sequence that appeared to baffle top government officials. Republican Gov. Jim Justice said it was ridiculous and he didn't know why the lottery commission would approve such a deal. (AP Photo)\nFILE - In this combination of file photos, former Vice President Joe Biden speaks in Collier, Pa., on March 6, 2018, and President Donald Trump speaks in the Oval Office of the White House in Washington on March 20, 2018. For a moment, West Virginia looked like it was going to be the only state in the country to allow betting on the presidential election. The short-lived play by bookmaker giant FanDuel was approved by the state lottery board. But it was announced and nixed within the span of about two hours Tuesday, April 7, 2020 in a bizarre sequence that appeared to baffle top government officials. Republican Gov. Jim Justice said it was ridiculous and he didn't know why the lottery commission would approve such a deal. (AP Photo)\nATLANTIC CITY, N.J. (AP) — Double down on Donald, or bet big on Biden? Plenty of Americans would like the chance to place a bet on the upcoming presidential election (and sports books would love to take their money), but so far, it is not legal anywhere in the country.\nIt actually was permitted for about an hour in West Virginia on Tuesday as the state gave — and then quickly rescinded — permission for sports books to take bets on the election, saying it needed to study the issue further.\nWith sports betting continuing to spread in the U.S., bookmakers are taking bets on things like the Oscars that have nothing to do with sports. And with all the major sports on hiatus during the coronavirus pandemic, they’re desperately looking for new things on which gamblers can bet.\nJay Kornegay, executive vice president of operations at the Westgate SuperBook, said industry colleagues in Europe and at offshore unlicensed sports books have said they take in 10 to 15 times as much money on the U.S. presidential election as American sports books take on the Super Bowl.\n“It would be gigantic,” he said. “It would be the biggest offering we would have on the board.”\nBut no U.S. jurisdiction has yet allowed betting on elections, and several explicitly prohibit it. PredictIt, a website built by a group of researchers in New Zealand, allows people to buy and sell shares of a candidate at prices up to $1. Bets are limited to $850. (The site listed Trump at 49 cents Wednesday, and Biden at 45 cents.)\nWest Virginia had a false start Tuesday, approving bets on the presidential election before reversing itself and quickly shutting down the market.\n“It got put up as a market that is legal in West Virginia, but we hadn’t done all the research we need to do, and we pulled it down after an hour,” said John Myers, director of the West Virginia Lottery.\nDuring that time, FanDuel offered odds on the election that had Republican Donald Trump a slight favorite at -110, meaning you would need to bet $110 in order to win an additional $100. Democrat Joe Biden, who all but clinched the nomination on Wednesday when his last major competitor, Bernie Sanders, dropped out, was listed at +125, meaning a $100 bet on him would return an additional $125.\nFanDuel took one bet during the narrow window that betting was open, but it would not say who it was for or how much was involved.\n“While the markets were approved, the West Virginia Lottery has asked FanDuel to refrain from offering the markets until they have time to fully work through the implications of this new market offering,” the company said in a statement, declining to comment further.\nPresidential elections are a market most sports books would love to be able to offer in the U.S. A survey by The Associated Press of major sports books over the last six months found virtually all in favor of such betting once it is explicitly permitted.\n“It’s something we offer in other parts of the world and it’s very popular,” said Joe Asher, CEO of William Hill US. “I have made bets on the presidential election in the past, and made a recent bet on Joe Biden when I was in London a couple of months ago.”\nDraftKings offered a free-to-play political pool on a recent Democratic debate that drew more than 60,000 entries in less than a day.\nIn the U.K., American presidential elections are big business for bookmakers. Smarkets, a London-based online betting exchange where elections constitute a major part of its business, said 2019 was its biggest year ever. Elections on whether Britain should leave the European Union, commonly known as “Brexit,” generated millions of pounds in wagering, according to Sarbjit Bakhshi, the company’s head of political markets.\n“I think the potential for legal political betting in the USA is huge,” he said. “Given the extraordinary nature of politics in recent years — Brexit, Trump, coronavirus — we’ve seen a huge uplift in people visiting our site to bet and trade on politics, and I think there will be a real appetite for it when it eventually begins to open up in the States. The U.S. presidential election is always a big event over here, and with a personality like Trump involved, we are fully expecting new records for volume on our site.”\nBut American bookmakers and regulators alike doubt that will happen in time for this year’s U.S. presidential election. New Jersey, which won a U.S. Supreme Court case in 2018 clearing the way for all 50 states to offer sports betting if they choose, has no plans to approve elections betting. David Rebuck, director of the state Division of Gaming Enforcement, said the state Legislature would have to pass a measure explicitly allowing betting on elections before that could happen.\nAnd the former New Jersey state senator who spearheaded the state’s effort to legalize sports betting doesn’t want to add politics to the mix.\n“I don’t think it’s a good idea,” said Raymond Lesniak, a Democrat. “It just seems ... unseemly.”\n___\nFollow Wayne Parry at http://twitter.com/WayneParryAC", "url": "https://apnews.com/0d082e3e35b4d8143697252be509cf68"}