{"authors": ["Maegan Vazquez", "Ryan Browne", "Paul Leblanc"], "date_download": "2020-05-04 16:24:26", "date_modify": "2020-05-04 16:24:26", "date_publish": "2020-04-06 23:09:32", "description": "President Donald Trump said Monday that he granted New York Democratic Gov. Andrew Cuomo's request to treat novel coronavirus patients on a hospital ship docked off of Manhattan.", "filename": "2020_04_06_politics_navy-ho_66502d91e64deca5ff58aee4ced8e1de_index_1588609466.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200330114929-usns-comfort-coronavirus-new-york-0330-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_navy-ho_66502d91e64deca5ff58aee4ced8e1de_index_1588609466.html", "title": "Trump approves New York request to treat coronavirus patients on Navy hospital ship", "title_page": "New York request to treat coronavirus patients on Navy hospital ship approved by Trump  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN) President Donald Trump said Monday that he granted New York Democratic Gov. Andrew Cuomo's request to treat novel coronavirus patients on a hospital ship docked off of Manhattan.\nCuomo had told reporters earlier Monday that he was \"going to call the President this afternoon and ask him to shift the (USNS) Comfort from non-Covid to Covid.\"\nTrump, speaking at a White House news briefing Monday afternoon, said he \"was informed that Gov. Cuomo has already told you and announced he called me up a little while ago and asked whether or not it would be possible to use the ship with respect to fighting the virus.\"\n\"We hadn't had that in mind at all, but we're going to let him do it,\" Trump remarked.\n\"It's set for Covid,\" Trump said of the Comfort. The President also confirmed that the ship has been approved to treat New Jersey patients.\nRead More", "url": "https://www.cnn.com/2020/04/06/politics/navy-hospital-ship-comfort-coronavirus-patients/index.html"}