{"authors": ["Janie Har"], "date_download": "2020-05-04 20:28:27", "date_modify": "2020-05-04 20:28:27", "date_publish": "2020-04-11 00:21:28", "description": "SAN FRANCISCO (AP) — In the biggest outbreak at a homeless shelter in California to date, San Francisco's mayor announced Friday that 70 people have tested positive for the coronavirus,...", "filename": "_ff85d9a6f65ae1e5d4dfa1e97b0de2aa_1588624107.html", "image_url": "https://storage.googleapis.com/afs-prod/media/8ec50eb6b97748d88a34606706e9d1a3/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_ff85d9a6f65ae1e5d4dfa1e97b0de2aa_1588624107.html", "title": "Advocates furious after outbreak at San Francisco shelter", "title_page": "Advocates furious after outbreak at San Francisco shelter", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 2, 2020, file photo, a homeless person sits on the street in San Francisco. San Francisco's mayor reported Friday, April 10, 2020, that 70 people at the city's largest homeless shelter have tested positive for COVID-19, infuriating advocates of the homeless who have been pushing the city for weeks to get people out of crowded shelters and into individual hotel rooms. (AP Photo/Jeff Chiu, File)\nFILE - In this April 2, 2020, file photo, a homeless person sits on the street in San Francisco. San Francisco's mayor reported Friday, April 10, 2020, that 70 people at the city's largest homeless shelter have tested positive for COVID-19, infuriating advocates of the homeless who have been pushing the city for weeks to get people out of crowded shelters and into individual hotel rooms. (AP Photo/Jeff Chiu, File)\nSAN FRANCISCO (AP) — In the biggest outbreak at a homeless shelter in California to date, San Francisco’s mayor announced Friday that 70 people have tested positive for the coronavirus, infuriating advocates who had sought more aggressive action to protect homeless people.\nMayor London Breed said that the outbreak involving 68 residents and two shelter staff was expected.\n“We knew that those had the potential of being hot spots, so we have been preparing for that,” Breed said of the homeless shelters. “We were on top of it.”\nThe news angered homeless advocates and members of the Board of Supervisors who have been pleading with her administration to commandeer empty hotel rooms and quickly move homeless people from streets and shelters into them.\n“This is terrible, devastating and preventable,” said Supervisor Matt Haney, who represents the district, on Twitter. “We’ve been yelling and screaming for a month to get people out of these crowded shelters and protect people.”\nFor most people, the new coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia, and death.\nState and local officials have repeatedly vowed to protect California’s estimated 150,000 homeless, many of whom have health conditions, but counties have been slow and sometimes disorganized. The San Francisco Chronicle also reported Friday that 23 residents of single-room occupancy hotels with shared kitchen and bathroom facilities have also tested positive for COVID-19.\nThe debate over what to do with San Francisco’s estimated 8,000 homeless has been loud and contentious in a city long associated with tent camps and panhandlers. Earlier Friday, faith leaders hosted a virtual vigil to pray for Breed, who they say has been slow to act.\n“I know that people are asking, ‘Well, why don’t we just open the doors and let everyone who’s homeless get access to a hotel room?’ ” Breed said last week. “We don’t have the ability to force anyone to stay anywhere.”\nThe city has acquired 2,000 hotel rooms. It has moved nearly 200 vulnerable people, including the homeless, into the rooms. Earlier this week, however, the city scrapped plans to turn part of its convention shelter into a shelter with nearly 400 beds for homeless people, saying the set-up was too crowded.\nAndy Lynch, a spokesman for the mayor, said the city continues to move “as quickly as possible” on an undertaking that is unprecedented in its scale. Her administration has said it takes time to line up the cleaning, security and food services needed to house people.\n“Hundreds of city employees are working around the clock every day to make it happen,” he said.\nThe city tested more than 140 people at the 340-bed shelter in the city’s gritty South of Market neighborhood run by the St. Vincent De Paul Society, following two confirmed cases there. Three tests are still pending.\nThe city’s public health director, Dr. Grant Colfax, said the shelter will now be turned into a medical facility where some of those who tested positive will stay with round-the-clock care. He said none are seriously ill.\nJennifer Friedenbach, executive director of San Francisco’s Coalition on Homelessness, said Breed does not value the lives of people without housing as much as she does people living in homes.\n“This was completely preventable,” she said.", "url": "https://apnews.com/ff85d9a6f65ae1e5d4dfa1e97b0de2aa"}