{"authors": ["Priscilla Alvarez", "Geneva Sands"], "date_download": "2020-05-04 16:55:10", "date_modify": "2020-05-04 16:55:10", "date_publish": "2020-04-08 23:13:20", "description": "Companies will soon be blocked from exporting critical medical supplies needed by the US for the coronavirus response, unless the Federal Emergency Management Agency gives approval for overseas shipments, according to a federal draft regulation.", "filename": "2020_04_08_politics_fema-restrict-exports-critical-supplies_index_1588611310.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408144616-health-care-worker-new-york-0401-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_fema-restrict-exports-critical-supplies_index_1588611310.html", "title": "FEMA to restrict exports of critical supplies leaving US", "title_page": "FEMA to restrict exports of critical supplies leaving US - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Companies will soon be blocked from exporting critical medical supplies needed by the US for the coronavirus response, unless the Federal Emergency Management Agency gives approval for overseas shipments, according to a federal draft regulation.\nThe combined effort between FEMA and US Customs and Border Protection, which oversees trade and travel, comes as the United States seeks to shore up equipment for hospitals treating coronavirus patients.\nLate last week, White House trade adviser Peter Navarro previewed the actions, saying, \"There is a black market which you have described, where we're having people bid against each other, brokers come in, they're bidding and bidding on all this different (personal protective equipment).\"\n\"It's driving the price up and guess what? You know where it's going? The domestic sources here are being exported,\" said Navarro, the White House's Defense Production Act policy coordinator, at last Thursday's White House coronavirus task force briefing. \"We are going to crack down unmercifully,\" he added.\nIn a joint statement Wednesday , the two agencies, both of which fall under the Department of Homeland Security, said they're \"working together to prevent domestic brokers, distributors, and other intermediaries from diverting these critical medical resources overseas.\"\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/fema-restrict-exports-critical-supplies/index.html"}