{"authors": ["Amy Edelen"], "date_download": "2020-05-04 20:03:43", "date_modify": "2020-05-04 20:03:43", "date_publish": "2020-04-07 00:00:00", "description": "Area grocery chains are taking additional social distancing precautions by implementing one-way aisles and restricting the amount of customers in stores to prevent the spread of...", "filename": "_858ac1927e584a38b3096db8c6b56033_1588622623.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_858ac1927e584a38b3096db8c6b56033_1588622623.html", "title": "Area grocers limit number of customers in stores, institute additional measures to protect against COVID-19 spread", "title_page": "Area grocers limit number of customers in stores, institute additional measures to protect against COVID-19 spread", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Area grocery chains are taking additional social distancing precautions by implementing one-way aisles and restricting the amount of customers in stores to prevent the spread of COVID-19.\nSafeway and Albertsons supermarkets across the region are restricting the number of customers at a given time to 30% of each store’s capacity. Safeway and Albertsons stores are also rolling out one-way aisles, which will be marked to provide direction of travel. The safety measures will be complete by the end of this week, according to a company release.\nOn Tuesday, Kroger Co., the parent company of Fred Meyer, began limiting customers in its stores to one person per every 120 square feet. Fred Meyer is monitoring the number of customers per square foot using its QueVision technology, which provides a count of people entering and exiting stores.\n“By leveraging QueVision, our technology system that uses infrared sensors and predictive analytics, we will be able to more efficiently support our new capacity limits, creating a safer environment for our customers and associates,” Yael Cosset, Kroger’s chief technology and digital officer, said in a statement.\nIn a Facebook post Monday, Yoke’s Fresh Market announced its limiting the amount of customers in stores at a given time to five per 1,000 square feet. Yoke’s did not specify when the measure would be put in place, but indicated it will begin posting signs about the changes in stores this week.\nWalmart is allowing five customers per 1,000 square feet in its stores at a given time, representing 20% of each location’s capacity. Customers are admitted one at a time and counted by store associates, according to a company release.\nRosauers supermarkets did not respond to a request for comment on whether its stores would implement similar social distancing measures.\nThe additional measures are the latest efforts by grocery stores to enhance safety among customers and employees. Grocery chains have increased the frequency of cleaning stores, installed plexiglass barriers at checkout stands, affixed tape on floors measuring 6 feet of distance between customers and created special store hours for at-risk people to shop.\nKroger began conducting temperature checks for employees in its distribution centers several weeks ago and is now beginning to offer temperature checks for store associates.\nGrocery chains are also encouraging employees to wear protective masks to reduce the potential spread of COVID-19.\nSafeway and Albertsons stores obtained reusable and disposable masks for employees. Kroger has ordered masks for associates nationwide, with all locations expected to have a supply by the end of the week.\nThe expanded measures are a step in the right direction, said Eric Renner, president of United Food and Commercial Workers Local 1439, which represents more than 2,500 members working at Safeway, Albertsons and Fred Meyer stores in the Spokane and Coeur d’Alene area.\nRenner encourages customers to limit the number of people they bring on shopping trips, practice social distancing at self-checkout lanes and wear face masks as recommended by the Centers for Disease Control and Prevention.\n“Grocery stores are the last public meeting place right now,” Renner said, adding safety remains a concern among workers. “While everybody is sheltering in place, we are dealing with the public more than anyone else right now.”", "url": "https://apnews.com/858ac1927e584a38b3096db8c6b56033"}