{"authors": ["Alan Suderman"], "date_download": "2020-05-04 20:05:09", "date_modify": "2020-05-04 20:05:09", "date_publish": "2020-04-08 18:59:26", "description": "RICHMOND, Va. (AP) — Virginia Gov. Ralph Northam announced Wednesday that he would delay the June primary elections for Congress by two weeks because of the coronavirus. The governor said at...", "filename": "_29148c941b9fa28f41effb2ba5b305a5_1588622709.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_29148c941b9fa28f41effb2ba5b305a5_1588622709.html", "title": "Northam delays June primary elections due to coronavirus", "title_page": "Northam delays June primary elections due to coronavirus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "RICHMOND, Va. (AP) — Virginia Gov. Ralph Northam announced Wednesday that he would delay the June primary elections for Congress by two weeks because of the coronavirus.\nThe governor said at a news conference that he would use his executive authority to move the June 9 primary to June 23. Northam said he’s also planning to work with the General Assembly to delay local elections scheduled for May until November.\nNortham said the delays weren’t ideal but were necessary, and would allow election officials more time to prepare and make any necessary changes.\n“No one should have to choose between protecting their health or casting a ballot,” he said.\nVirginia has no marquee primary elections this year. The biggest race affected with be the Republican primary for U.S. Senate, though there are no well-known candidates looking to challenge Democratic incumbent Sen. Mark Warner.\nNew Jersey Gov. Phil Murphy announced a similar delay Wednesday. The moves come a day after thousands of Wisconsin voters were forced to congregate for hours in long lines with no protective gear.\nAlso on Wednesday, another death was announced at a Richmond-area nursing home that has one of the worst known outbreaks of coronavirus among long-term care facilities in the U.S. The death toll at Canterbury Rehabilitation and Healthcare is now 33, the facility’s administrator said in a statement.\nNortham said the state is trying to be “very aggressive” in isolating nursing home residents who have the virus, but said several factors — including a shortage of timely testing — are making the problem worse.\nThe state also released new figures Wednesday showing more than 3,600 coronavirus cases in Virginia, up more than 300 from the day before. The state has reported 75 virus-related deaths.\nNortham also announced that Virginia would start allowing restaurants to sell mixed drinks in addition to beer and wine for takeout and delivery. Northam has ordered many businesses, including restaurants, and places of worship to either close or dramatically alter their operations to try and mitigate the spread of the virus.\nSome of those actions are now facing legal challenges. A judge in Russell County in far southwest Virginia is scheduled to hear arguments Thursday in a case that seeks a religious exemption to the stay-home order for Easter services. Attorney General Mark Herring’s office is defending the governor’s authority to impose the ban.\nTwo other lawsuits have been filed in federal court in Alexandria. One was filed by a practicing Catholic who says the inability to receive sacraments, especially in the week leading up to Easter, infringes on his constitutional rights; the other challenges Northam’s authority for the executive order in its entirety.\nAlso Wednesday, Shenandoah National Park announced it was temporarily closing after receiving a request from the Virginia Department of Health.\n___\nAsscociated Press writers Sarah Rankin and Matthew Barakat contributed to this report.", "url": "https://apnews.com/29148c941b9fa28f41effb2ba5b305a5"}