{"authors": ["Don Thompson", "Christopher Weber"], "date_download": "2020-05-04 20:22:51", "date_modify": "2020-05-04 20:22:51", "date_publish": "2020-04-20 22:17:35", "description": "SACRAMENTO, Calif. (AP) — Hundreds of protesters lobbying to ease Gov. Gavin Newsom's tight stay-at-home orders rallied around the California Capitol on Monday, even as Newsom continued to urge...", "filename": "_42fa14f8ca2e7b208bc14112ff26a022_1588623771.html", "image_url": "https://storage.googleapis.com/afs-prod/media/08d6448950da4e27a4289a106bfb860a/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_42fa14f8ca2e7b208bc14112ff26a022_1588623771.html", "title": "California protesters push to reopen; governor urges caution", "title_page": "California protesters push to reopen; governor urges caution", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Protesters calling for the end of California Gov. Gavin Newsom's stay-at-home orders rally at the Capitol in Sacramento, Calif., Monday, April 20, 2020. Several hundred people gathered demanding that Newsom ease the restrictions and allow people return to work. (AP Photo/Rich Pedroncelli)\nProtesters calling for the end of California Gov. Gavin Newsom's stay-at-home orders rally at the Capitol in Sacramento, Calif., Monday, April 20, 2020. Several hundred people gathered demanding that Newsom ease the restrictions and allow people return to work. (AP Photo/Rich Pedroncelli)\nSACRAMENTO, Calif. (AP) — Hundreds of protesters lobbying to ease Gov. Gavin Newsom’s tight stay-at-home orders rallied around the California Capitol on Monday, even as Newsom continued to urge restraint, saying the worst thing state leaders could do is “make a decision that’s based on politics and frustration.”\nHe outlined his approval for some counties to gradually relax some restrictions aimed at slowing the spread of the coronavirus, saying he approved a plan by Ventura County in Southern California to reopen golf courses and parks.\nThat move prompted the top health official in neighboring Los Angeles County Monday to implore residents not to flood those locations as warmer temperatures arrive this week with the lure of parks, beaches and other outdoor places.\n“There is a cap in terms of the loosening at the local level,” Newsom said, praising Ventura County officials for consulting with his office before their announcement. “The cap is an expectation that they do not go beyond those state orders.”\nNewsom promised an update Wednesday on how the state is doing on the six measures he has said will be critical to reopening California.\nBut he warned that “this virus knows no jurisdiction.”\nLos Angeles County Public Health Director Barbara Ferrer urged residents not to go to neighboring Ventura County, where continuing restrictions include social distancing and reduced parking.\n“You’ll overwhelm a county that is trying to sort of relax some of their restrictions for their residents and do so in a sensible way,” Ferrer said, warning that people “could inadvertently come back infected yourself and then spread that infection to other people.”\nInfection and deaths continue to be a huge problem in Los Angeles, which on Monday began sending medical teams to the streets to screen homeless people and offer fast-result field tests. A line snaked down the block at a new pop-up testing clinic on Skid Row staffed by the Los Angeles Fire Department. Those confirmed to be infected will be offered transportation to makeshift shelters or hotels where they can be treated in isolation.\nBut preliminary results from a study by the county and the University of Southern California projected that about 4% of Los Angeles County’s adult population of 8 million have antibodies to the virus, suggesting infections are more widespread and the death rate lower than tests have shown. It also would mean more people have been carrying — and spreading — the virus without anyone knowing it.\nAt least 1,225 people have died from the new coronavirus in California as of Monday and nearly 30,000 have been confirmed to have the virus, but Newsom has acknowledged that testing has lagged in the state of nearly 40 million. Los Angeles County alone reported 17 new deaths, raising the total there to 619, more than half the state’s total.\nIn neighboring Orange County, officials similarly warned against flocking to its famous beaches as forecasts call for a heat wave, with highs in the 80s at the beaches and the first 90-degree day of 2020 in Los Angeles.\n“We expect our residents to strictly abide by social distancing orders,” said Orange County Executive Officer Frank Kim.\nSan Diego’s mayor announced the reopening of some neighborhood and community parks for passive individual use only for walking, jogging or hiking on Monday, while Riverside County reopened golf courses, with restrictions.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe life-threatening illness, including pneumonia, and death.\nMeanwhile, at least 100 vehicles circled the Capitol in Sacramento, horns blaring, as at least 200 protesters marched with signs protesting the weeks-long shutdown that has paralyzed the economy. Many marchers did not wear masks and crowded together on the sidewalk and streets, defying recommendations to minimize the spread of the virus.\nThe protest was organized by a group called Freedom Angels that has previously organized rallies against California legislation to restrict vaccine exemptions. While it was organized as a call to reopen businesses and communities, some protesters questioned whether they would be forced to be vaccinated or tested for immunity to return to work or schools.\n“Tracking + tracing = tyranny,” read one protest sign.\nCalifornia Highway Patrol officials did not respond to questions Monday about why they issued a permit for a mass gathering in the face of stay-at-home orders. Law enforcement officers kept marchers from stopping traffic, but made no move to enforce social distancing.\nIt was the latest in a series of recent protests nationwide after President Donald Trump on Friday tweeted messages that some saw as encouraging protests against stay-at-home mandates.\n“If you’re going to protest, practice physical distancing,” Newsom implored.\n___\nWeber reported from Los Angeles. Associated Press reporters John Antczak and Brian Melley in Los Angeles and Rich Pedroncelli in Sacramento contributed to this story.", "url": "https://apnews.com/42fa14f8ca2e7b208bc14112ff26a022"}