{"authors": ["Arman Azad"], "date_download": "2020-05-04 16:54:59", "date_modify": "2020-05-04 16:54:59", "date_publish": "2020-04-07 11:27:00", "description": "An influential model tracking the coronavirus pandemic in the United States now predicts that fewer people will die and fewer hospital beds will be needed compared to its estimates from last week.", "filename": "2020_04_07_health_ihme-updated-covid19-model_index_1588611299.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403180010-02-coronavirus-testing-new-york-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_ihme-updated-covid19-model_index_1588611299.html", "title": "Revised coronavirus model predicts fewer deaths, but tens of thousands in US still expected to die by August", "title_page": "Adjusted coronavirus model predicts fewer people in US will need hospitals, but 82,000 will still die by August - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) An influential model tracking the coronavirus pandemic in the United States now predicts that fewer people will die and fewer hospital beds will be needed compared to its estimates from last week.\nAs of Wednesday, the model predicted the virus will kill 60,000 people in the United States over the next four months. That's about 33,000 fewer deaths than the model estimated last Thursday.\nWhile the US is still expected to face a shortage of about 16,000 hospital beds, it will need 168,000 fewer beds than previously expected, according to the new analysis.\nNew data on the pandemic's trajectory -- from the United States and around the world -- has been fed into the model almost every day, driving the changes. And the downward adjustment suggests that social distancing may be working better than expected in some places.\nThe model's first major shift came on Sunday, when a \"massive infusion of new data\" led to changes, according to the model's maker, Dr. Christopher Murray, who serves as director of the Institute for Health Metrics and Evaluation at the University of Washington School of Medicine.\nAdditional data on the pandemic's trajectory has always been expected, along with methodological changes to fine-tune the predictions. And from the start, researchers at IHME, who built the model, have emphasized that it would change.\nBut the newest version of the model underscores just how important social distancing continues to be: It assumes those measures -- such as closing schools and businesses -- will continue through the modeled period, which is until August. And it still predicts tens of thousands of deaths.\nLifting those measures in June, after the virus' first wave is expected to be over, could lead to a resurgence in cases. But other measures could supplement or replace social distancing, including mass screening, contact tracing and selective quarantine. It's unclear how those would affect deaths, however, and the model doesn't yet have projections for them.\nWhile the IHME model has been repeatedly cited by Dr. Deborah Birx, the White House's coronavirus response coordinator, the administration's current guidelines only recommend social distancing through April 30.\nFlood of new data triggered adjustments\nThe model essentially predicts how social distancing measures will affect the trajectory of coronavirus in the US. Everyone agrees that social distancing measures will save lives, but how quickly the distancing works -- and how dramatically it reduces infections -- has not been clear.\nWhen the model was first released, the only place that had reached its coronavirus \"peak\" was Wuhan, China, according to the IHME researchers. But as of this week, seven locations in Spain and Italy appear to have reached their apexes as well, providing a flood of new data for the model to analyze.\nThose regions seem to have reached their peaks more quickly, according to the researchers. That means that some states -- such as Florida, Virginia, Louisiana and West Virginia -- are now expected to peak earlier than previously expected, potentially giving them less time to prepare.\nBeyond infusing the model with new data, researchers this week tweaked its methodology to better predict the spread of the virus in states that have seen few cases. And they also fine-tuned their analysis of social distancing measures after noticing that certain measures -- such as school closures -- appeared more impactful in some places than others.\nEvery state, and even regions within each state, have looked at the White House's guidance on non-essential travel differently, said Murray, the IHME director, at a press conference on Monday.\nBased on cell phone mobility data, for example, researchers found that \"there's variability across state[s] in how mandates are being interpreted.\" Moving forward, researchers plan to explore whether incorporating that data will further improve predictions, Murray said.\nA surge in hospitalization data\nEarly versions of the model had little data on how patients fared after being hospitalized in the United States, but the version released this week includes more granular information now available from state governments.\nResearchers looked at more than 16,000 hospital admissions, for example, and almost 3,000 deaths related to Covid-19. They then estimated that fewer hospital resources -- such as total beds, intensive care beds and ventilators -- will be needed during the virus's peak.\nHow long patients are expected to stay in the hospital has also changed: Patients in intensive care are now expected to have longer stays than previously predicted, while those with milder cases are predicted to have shorter stays.\nLast Thursday, for example, the model predicted that patients who needed intensive care would only stay in the hospital for eight days until being discharged. Now, they're expected to be hospitalized for 20. But patients who didn't need intensive care were originally thought to need a 15-day stay, compared to just over a week now.\nAs more data becomes available, those estimates -- like all of the model's projections -- will change. And importantly, they're based on the ongoing assumption that social distancing measures will continue for months, and will be implemented in places that have yet to do so.\nAccording to Murray, the model's maker, the consequences could be dire if social distancing measures are relaxed or ignored: \"The US will see greater death tolls, the death peak will be later, the burden on hospitals will be much greater and the economic costs will continue to grow.\"\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nNew York Gov. Andrew Cuomo, whose state is at the epicenter of the US outbreak, said on Saturday that the situation is \"turning\" and the \"rate of infection is going down.\" That's consistent with IHME's model, which predicts that the state will hit \"peak resource use\" -- the day hospitals are stretched the thinnest -- on Wednesday.\nBut while New York's cases have generally tracked with IHME's predictions so far, Cuomo said there is a \"danger\" in being \"over-confident.\" Other entities have made that error, he said, \"and we're not going to make that mistake.\"", "url": "https://www.cnn.com/2020/04/07/health/ihme-updated-covid19-model/index.html"}