{"authors": ["Scott Bauer"], "date_download": "2020-05-04 20:19:24", "date_modify": "2020-05-04 20:19:24", "date_publish": "2020-04-16 20:21:56", "description": "MADISON, Wis. (AP) — Gov. Tony Evers' legal counsel signaled Thursday that the May 12 special election in northern Wisconsin's 7th Congressional District will likely go on as scheduled, a week...", "filename": "_76008a2b088473cf86ae9a531f926860_1588623564.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_76008a2b088473cf86ae9a531f926860_1588623564.html", "title": "Lawyer signals delay unlikely in Wisconsin US House election", "title_page": "Lawyer signals delay unlikely in Wisconsin US House election", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MADISON, Wis. (AP) — Gov. Tony Evers’ legal counsel signaled Thursday that the May 12 special election in northern Wisconsin’s 7th Congressional District will likely go on as scheduled, a week after he said the governor was eyeing delaying it due to the coronavirus outbreak.\nEvers had pushed to stop in-person voting in the April 7 presidential primary and spring election but was blocked in court and the election went off as scheduled. Voters and poll workers wore masks and other protective equipment and there were long lines at polling places in Milwaukee and Green Bay.\nThe special election is to replace retired U.S. Rep. Sean Duffy, a Republican. The seat has been vacant for six months.\nEvers on Thursday extended until May 26 the state’s stay-at-home order that was to end on April 24. The order closed all K-12 schools through the academic year and kept most nonessential businesses closed, didn’t make any changes to the election.\nEvers’ attorney, Ryan Nilsestuen, said that the governor is keeping a “close eye” on the election, listening to clerks and public health officials in the district.\nHe emphasized differences between the special election and the one held last week. The congressional district is rural and fewer people have the coronavirus than in urban areas like Milwaukee, where people waited in line for hours to vote last week. There has also been more time for clerks to prepare for the special election and for voters to submit absentee ballots, Nilsestuen said.\nThe congressional district covers all or parts of 20 northern and northwestern Wisconsin counties and is the state’s largest congressional district, geographically.\nThe race pits Democrat Tricia Zunker, president of the Wausau school board, against Republican state Sen. Tom Tiffany. Zunker was endorsed Thursday by Democratic U.S. Sen. Tammy Baldwin. Tiffany on Thursday released a campaign ad , making a nod toward the social distancing recommendations in place due to the coronavirus outbreak.\n“While I’d prefer to shake your hand and ask for your vote, that’ll have to wait,” Tiffany said.\n___\nFollow Scott Bauer on Twitter: https://twitter.com/sbauerAP", "url": "https://apnews.com/76008a2b088473cf86ae9a531f926860"}