{"authors": ["Senior Culture Reporter"], "date_download": "2020-05-04 21:10:36", "date_modify": "2020-05-04 21:10:36", "date_publish": "2020-04-30 22:52:22", "description": "An estimated 150,000 of the pink birds have migrated to Mumbai this year. Many have infiltrated urban areas usually trafficked by humans.", "filename": "entry_flamingos-mumbai-india-coronavirus-lockdown_n_5eaae1bfc5b634687cb46397_1588626636.html", "image_url": "https://img.huffingtonpost.com/asset/5eab3f60220000700d827f5e.jpeg?ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_flamingos-mumbai-india-coronavirus-lockdown_n_5eaae1bfc5b634687cb46397_1588626636.html", "title": "Thousands Of Flamingos Take Over India's Largest City Amid Coronavirus Lockdown", "title_page": "Thousands Of Flamingos Take Over India's Largest City Amid Coronavirus Lockdown | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "Mumbai, India — under lockdown to curb the spread of COVID-19 — finds itself suddenly playing host to a massive influx of flamingos.\nThousands of the birds have descended upon the nation’s largest city in recent weeks, with many congregating in urban areas usually trafficked by humans.\nPhotos published in the Hindustan Times show a row of apartment buildings towering above wetlands overrun with the pink birds.\nHindustan Times via Getty Images The Bombay Natural History Society estimates that about 150,000 flamingos have migrated to Mumbai, India, this year.\nFlamingos traditionally migrate﻿ to Mumbai and the surrounding regions during their feeding and breeding season, which lasts from about October to March. This year, however, city residents have reported seeing an unusually high number of the birds in and around the city, likely due to an unexpected surplus of available space.\nAnd there has, in fact, been a population boom. About 150,000 flamingos have come to Mumbai this year, an increase of about 25% from 2019, according to an estimate by the Bombay Natural History Society in a report cited by CBS and other outlets.\nThe national coronavirus lockdown has also led to a decline in industrial waste and a surge in domestic sewage that have, in turn, spurred the formation of the planktons and algae that make up the flamingos’ diet, according to the BNHS.\nHindustan Times via Getty Images The national lockdown has afforded the flamingos more space to congregate and has stabilized their food supply.\n“A major reason for the large numbers is also the large flocks of juveniles moving to these sites, following the successful breeding documented two years ago,” Deepak Apte, the conservation group’s director, told the Hindustan Times. “Additionally, the lockdown is giving these birds peace for roosting, no disturbance in their attempt to obtain food, and overall encouraging habitat.”\nLast month, Indian Prime Minister Narendra Modi announced a 21-day lockdown as part of a national effort to reduce the transmission of COVID-19, the disease caused by the coronavirus. Beginning March 25, the stay-at-home order was deemed the world’s most extensive as it affected some 1.3 billion residents.\nThe national lockdown has since been extended through May 3, though some Indian states have already discussed plans to continue it further. As of Thursday afternoon, the country had confirmed a total of 33,610 COVID-19 cases and 1,075 deaths.\nHindustan Times via Getty Images India's 1.3 billion residents have been under lockdown to curb the spread of COVID-19 since March 25.\nGiven the uncertainty of the pandemic, some residents have come to view the influx of flamingos as an unexpected perk.\n“Residents are cooped up at home spending their mornings and evenings at their balconies taking photographs and videos of these relaxed birds,” Sunil Agarwal told the Hindustan Times. “The lockdown will at least prompt people to focus on what is around them, which they had been taking for granted, and hopefully this site will be declared a flamingo sanctuary soon.”\nA HuffPost Guide To Coronavirus", "url": "https://www.huffpost.com/entry/flamingos-mumbai-india-coronavirus-lockdown_n_5eaae1bfc5b634687cb46397"}