{"authors": ["Martha Bellisle"], "date_download": "2020-05-04 21:09:19", "date_modify": "2020-05-04 21:09:19", "date_publish": "2020-04-13 16:43:36", "description": "SEATTLE (AP) — Washington state will release nearly 1,000 inmates serving time for nonviolent offenses to create more space in its prisons after a coronavirus outbreak spread in one of its largest...", "filename": "_a9b8f38f42b84d550551e6206666d5c6_1588626559.html", "image_url": "https://storage.googleapis.com/afs-prod/media/27288824d558489683b7632970d617af/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a9b8f38f42b84d550551e6206666d5c6_1588626559.html", "title": "Washington to release almost 1,000 inmates amid outbreak", "title_page": "Washington to release almost 1,000 inmates amid outbreak", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this Jan. 28, 2016, file photo, a man does maintenance work between razor wire-topped fences at the Monroe Correctional Complex in Monroe, Wash. Inmates at the prison filed a motion Thursday, April 9, 2020, with the Washington state Supreme Court asking it to order Gov. Jay Inslee and Department of Corrections Secretary Stephen Sinclair to release inmates who are 60 years old or older, those with underlying health conditions, and any who are close to their release date after almost a dozen people at the prison tested positive for the new coronavirus. (AP Photo/Elaine Thompson, File)\nFILE - In this Jan. 28, 2016, file photo, a man does maintenance work between razor wire-topped fences at the Monroe Correctional Complex in Monroe, Wash. Inmates at the prison filed a motion Thursday, April 9, 2020, with the Washington state Supreme Court asking it to order Gov. Jay Inslee and Department of Corrections Secretary Stephen Sinclair to release inmates who are 60 years old or older, those with underlying health conditions, and any who are close to their release date after almost a dozen people at the prison tested positive for the new coronavirus. (AP Photo/Elaine Thompson, File)\nSEATTLE (AP) — Washington state will release nearly 1,000 inmates serving time for nonviolent offenses to create more space in its prisons after a coronavirus outbreak spread in one of its largest facilities, officials said Monday.\nThe decision came after the state Supreme Court responded to an emergency motion filed by a group of offenders. The court ordered Gov. Jay Inslee and corrections Secretary Stephen Sinclair to submit a plan by noon Monday.\n“Today, the Washington Department of Corrections takes its next steps in mitigating risk to the incarcerated population sentenced to our custody,” Sinclair said. Inslee said the plan also addresses public safety concerns.\nIt’s the latest move by governors across the nation who faced possible outbreaks in their prison systems.\nKentucky Gov. Andy Beshear has said he would release more than 900 prisoners. Ohio Gov. Mike DeWine launched a similar effort that could lead to the release of 200 inmates.\nIn Washington state, at least 14 corrections employees and eight inmates have tested positive for the virus. Tests were pending for an additional 50 inmates and more than 900 were under quarantine orders. There are about 18,000 people incarcerated in the state.\nThe state’s largest outbreak is occurring at Monroe Correctional Complex where five workers and seven offenders have COVID-19.\nMore than 10,500 people in Washington state have tested positive and 516 people have died. Inslee issued a stay-at-home and social distancing order on March 23 and later extended it into early May.\nA group of Monroe inmates asked the Washington state Supreme Court to order Inslee and Sinclair to release inmates who are 60 or older, have underlying health conditions or are close to their release date.\nAfter a demonstration turned violent last week, lawyers for the Monroe inmates asked the court for emergency help.\nOn Friday, the justices ordered Inslee and Sinclair to immediately take steps to protect the health and safety of inmates in response to the COVID-19 outbreak.\nReducing the number of people in the prisons “is the one public health action that all objective public health experts agree is essential in order to fight the coronavirus,” said Nick Allen, an attorney for the inmates.\nThe plan by prison officials focuses on releasing nonviolent offenders and those held on lower-level supervision violations, the report said. Some will have their sentences commuted, while others will be let out through a modified re-entry program.\nThe Justice Action Network had urged Inslee to release some prisoners.\n“These common sense measures will help save the lives of incarcerated individuals, correctional officers, healthcare workers, and the general public, and have been adopted in red and blue states alike, including Ohio, Kentucky, New Jersey, and New Mexico,” the group said.\nTaking action is especially important “in light of a growing wave of fear and unrest gripping our nation’s justice system,” they said.\nJaime Hawk, Legal Strategy Director for the ACLU of Washington Campaign for Smart Justice, called the action a useful first step but said it doesn’t eliminate the danger that incarcerated people face because of the COVID-19 pandemic.\n“We urge the governor and the Department of Corrections to do more to reduce state prison populations which is the only way to follow the advice of public health experts and keep those living and working in our correctional facilities safe,” Hawk said in a news release.", "url": "https://apnews.com/a9b8f38f42b84d550551e6206666d5c6"}