{"authors": ["Brian Fung", "Cnn Business"], "date_download": "2020-05-04 16:58:56", "date_modify": "2020-05-04 16:58:56", "date_publish": "2020-04-09 18:07:44", "description": "As the coronavirus pandemic has forced people to stay inside, few companies have proven themselves as essential as Amazon. From groceries to cleaning supplies, shipments from Amazon have become lifelines for many who are steering clear of supermarkets and other physical retail stores. Company executives have likened the surge in demand to the annual holiday shopping crush.", "filename": "2020_04_09_tech_amazon-dominance-coronavirus_index_1588611536.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409120745-amazon-package-delivery-0407-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_tech_amazon-dominance-coronavirus_index_1588611536.html", "title": "The pandemic is playing to almost every one of Amazon's strengths", "title_page": "The pandemic is playing to almost every one of Amazon's strengths - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN Business) As the coronavirus pandemic has forced people to stay inside, few companies have proven themselves as essential as Amazon. From groceries to cleaning supplies, shipments from Amazon ( AMZN ) have become lifelines for many who are steering clear of supermarkets and other physical retail stores. Company executives have likened the surge in demand to the annual holiday shopping crush.\nBut e-commerce isn't the only sector where Amazon is booming. Analysts say its cloud business, Amazon Web Services, faces higher demand as people turn to some of its biggest clients -- fromto-- for work and play. Amazon sells access to audiobooks and original television programs that are helping to entertain reluctant shut-ins. And with more people staying home, that's more time they have to engage with Amazon's AI-powered smart speakers\nThe breadth of Amazon's sprawling business interests, and its increasingly central place in America's fragile supply chain, underscores the company's hold on consumers — and its potential to solidify its dominance in the coming months. The longer this crisis goes on, the more formidable Amazon will become, according to James Bailey, a management professor at George Washington University's business school.\n\"Every crisis creates a void,\" said Bailey. \"And whatever force fills that void, inherits power.\"\nAmazon isn't the only company that could benefit. The crisis appears to be lifting the entire e-commerce industry, according to Bank of America research, which showed the sector grew 16% in March compared to a year ago. Those consumer habits could persist even after the crisis passes, marking a potential tidal wave of change benefiting Amazon's bottom line for years to come.\nBut thanks to its existing advantages in scale and efficiency, Amazon stands to emerge from the pandemic stronger than many of its competitors, experts say. In light of the pandemic, Amazon could pull in as much as an additional $4 billion in revenue this year, though added costs of managing the pandemic may cut into Amazon's profits, said Bank of America in an investor note last week.\nwith the White House since the outbreak began. With Amazon doing its part to smooth an already turbulent economic situation, Trump needs Bezos more than ever. Amazon's expanded importance is even being felt in Washington, where CEO Jeff Bezos, a frequent target of President Donald Trump, has been communicating oftenwith the White House since the outbreak began. With Amazon doing its part to smooth an already turbulent economic situation, Trump needs Bezos more than ever.\nBut now that it's been laid bare, the world's dependence on Amazon may only reinforce questions policymakers were asking before the current crisis about whether the company is too powerful.\nPrime positioning\nThe most visible changes in demand for Amazon services have, unsurprisingly, taken place in its core online retail business. The company that built its reputation on ultra-fast deliveries is now experiencing uncharacteristically long wait times to ship many products, including hand sanitizer, toilet paper and digital thermometers.\nAmazon spokespeople including Jay Carney, senior vice president of global corporate affairs, have compared the volume they're witnessing to peak holiday shopping periods. Last week, Amazon said in a blog post that it's nearly finished hiring an additional 100,000 workers to \"help meet demand.\"\nFor example, Amazon has had to battle price gouging on its platform. Amid questions from lawmakers and But these boom times aren't without further challenges.For example, Amazon has had to battle price gouging on its platform. Amid questions from lawmakers and attorneys general about the practice, Amazon has said it is using a mix of manual and automated reviews of its platform to catch thousands of price gougers, and reporting them to the authorities. \"Amazon has zero tolerance for price gouging,\" the company said in a blog post last month.\nThe crunch is affecting front-line workers, too, some of whom anticipate Amazon could need even more hands as workers continue to fall ill or need to quarantine themselves. More than a dozen Amazon facilities have now been hit by the coronavirus , and some workers have staged walkouts to protest what they say are insufficient protections on the job.\n\"It's getting backed up,\" one employee who works at Amazon's facility in Staten Island, JFK8, told CNN in an interview. \"There's not enough employees to move this stuff.\" The worker, who spoke on condition of anonymity for fear of losing his job, said so many of his colleagues have taken paid or unpaid coronavirus leave that the fulfillment center now resembles \"a ghost town.\"\nThe coronavirus pandemic has laid bare many consumers' dependance on Amazon for everything from grocery deliveries to streaming shows.\nAmazon didn't respond to questions about possible worker shortages, but has said in statements that its workers \"are heroes fighting for their communities and helping people get critical items they need in this crisis.\"\nMeanwhile, employees at JFK8 and other facilities around the country have complained of inconsistent temperature-check screenings, limited cleaning supplies and having to work in close quarters despite Amazon's own social distancing guidelines. The company has said it's tripled its cleaning efforts in fulfillment centers and that previously ordered facemasks are starting to become available for employees.\nThe complaints about Amazon's safety protections reflect the enormous pressure the company is under to keep delivering packages during the crisis — and how vital the platform has become.\nPowering the internet\nFor all of the focus on Amazon's e-commerce business, it's the company's cloud services unit that makes most of the company's profit. Financial filings show that Amazon Web Services — which runs the websites of many consumer-facing businesses — accounted for 63% of Amazon's operating income last year.\nNow, as usage of popular digital applications has grown amid the pandemic, that's meant added usage of the Amazon cloud platform that supports them, too.\n\"You're seeing surges in things like Slack, Zoom, Fortnite, Netflix — all clients of AWS,\" said Justin Post, an industry analyst at Bank of America. \"The activity levels for some of their clients are through the roof.\"\nLike many of Amazon's subsidiaries, AWS declined to comment for this story. But the range of businesses Amazon owns demonstrates its reach. It has invested tremendously in Whole Foods and a separate grocery delivery service, Amazon Fresh, Post said, both of which are now poised to benefit massively from a population that's increasingly avoiding brick-and-mortar supermarkets.\n\"The timing is really interesting,\" Post said.\nFilling the downtime void\nJust as Amazon faces an unprecedented kind of demand for physical goods, it also stands to benefit from a growing appetite for digital services as people seek to stay sane indoors.\nAmazon owns Audible, the audiobook marketplace. Last month, Audible made a selection of hundreds of audiobooks accessible for free as part of its response to the pandemic. Since launching Audible Stories on March 19, traffic to the site has spiked. The new offering has received \"millions of daily visitors\" from around the world, Matthew Thornton, the head of global corporate affairs for Audible, told CNN.\nMeanwhile, a surge in digital entertainment may be boosting YouTube and Netflix, but also Amazon's Twitch, the popular online platform where users can watch livestreams of other people playing video games. In recent weeks, the company confirmed to CNN, traffic and viewership on Twitch have risen across the board, particularly on channels linked to music and sports. With the cancellation of live sports, numerous professional basketball and football players have taken to streaming themselves playing games including \" Call of Duty \" and \" NBA 2K .\"\nBefore the pandemic, Twitch was already among the 10 most popular video streaming services on the entire internet, according to the market research firm Sandvine. Now, facing higher demand, the company has had to downgrade its video quality in Europe, following in the footsteps of YouTube and Facebook.\nAmazon's influence will likely exert itself in other ways, too, some more noticeable than others. Having exhausted Netflix's catalog, Americans may soon gorge themselves on Amazon's original television series, or buy more e-books for their Kindles. Cooped up inside, those with Amazon smart speakers may now be setting cooking timers more often, or asking their devices to play more music — giving Amazon even more behavioral data and speech samples it can use to hone its services to anticipate our every need.\nPlaying to Amazon's strengths\nWhat makes Amazon particularly suited for our current moment isn't just its ability to serve people's needs remotely, or its massive customer base. It's that those things help make Amazon the most well-oiled retail machine on earth, creating positive feedback loops where the more efficient it is, the more attractive it becomes.\nConsumers have little time or money to waste; that was certainly true before the pandemic, but is even more so now. That means the crisis may very well cement Amazon's power further — and at the expense of rivals that are less efficient or can't outlast the crisis, said Kevin Arquit, an antitrust lawyer at the firm Kasowitz Benson Torres.\n\"It plays right into Amazon's strengths,\" he said.\nPound for pound, Amazon is better equipped than its competitors to weather the pandemic, Arquit said, because its wealth, scale and supplier relationships translate into the most valuable trait of all in a crisis: resilience. As smaller or less nimble businesses close up shop, in some cases for good, it's large incumbents like Amazon that will likely win out, he said.\nUntil a few weeks ago, Amazon's staying power wasn't being hailed as essential. Instead, it found itself on the front lines of a very different battle — one in which policymakers like Sen. Elizabeth Warren were accusing large tech platforms of abusing their dominance. Warren and others have called for Amazon to be broken up and to face tough new regulations designed to rein in the power of Silicon Valley. She has specifically targeted Amazon, saying that by sharing its marketplace with third-party sellers, it is playing as both the umpire and the owner of the home team.\nThose concerns haven't gone away. In fact, amid the outbreak, some policymakers may be even more attuned now to Amazon's power over Americans' lives. In their recent letter to Amazon , nearly three dozen states and the District of Columbia wrote that despite the company's efforts to curb price gouging, it had failed to de-list \"unconscionably priced critical supplies\" that Americans need, such as hand sanitizer. Federal lawmakers have expressed similar worries.\nPaul Gallant, an industry analyst at the firm Cowen & Co., said in an investor note Wednesday that the pandemic has temporarily blunted the onslaught of criticism that faced Big Tech just months ago — and that many dominant platforms are now likely \"benefiting from new public awareness of how difficult remote life would be without them.\"\nBut, he warned, the federal government's scrutiny of large, dominant tech platforms continues — on Capitol Hill, at the Justice Department and the Federal Trade Commission. Those investigations may result in reports or even lawsuits that may not be favorable to those businesses, he said.\nWith Americans relying more on Amazon than ever, it's a reminder of how pervasive its influence is, and how limited the constraints are on its growth.\n\"This [pandemic] will move the status quo to even more demand for online shopping, which obviously benefits Amazon, the largest player,\" said Arquit.", "url": "https://www.cnn.com/2020/04/09/tech/amazon-dominance-coronavirus/index.html"}