{"authors": ["Michael D'Antonio"], "date_download": "2020-05-04 16:14:10", "date_modify": "2020-05-04 16:14:10", "date_publish": "2020-04-02 18:46:30", "description": "Want to feel better in this moment of crisis? Stop binge-watching the shows. Put down the ice cream. Watch or listen to Dr. Anthony Fauci, writes Michael D'Antonio", "filename": "2020_04_02_opinions_tune-in-to-dr-fauci-dantonio_index_1588608850.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331124419-02-fauci-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_tune-in-to-dr-fauci-dantonio_index_1588608850.html", "title": "Tune in to Dr. Fauci", "title_page": "Tune in to Dr. Fauci (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Michael D'Antonio is the author of the book \"Never Enough: Donald Trump and the Pursuit of Success\" and co-author with Peter Eisner of \"The Shadow President: The Truth About Mike Pence.\" The opinions expressed in this commentary are those of the author. View more opinion articles on CNN.\n(CNN) Want to feel better in this moment of crisis? Stop binge-watching the shows. Put down the ice cream. (They'll be there later.) Tune in to Tony Fauci when he appears on TV or better yet, listen to him chat with Dr. Sanjay Gupta on his CNN podcast.\nWhen you do, you'll hear the leader we need as others fail us. Dr. Fauci is a man with a scientific mind, a compassionate heart, and a Jesuitical commitment to helping others. He refuses to blame even the President, who was tragically slow to heed his counsel. And he won't stop fighting until we are safe.\nIf you don't know him by now, Anthony Fauci is the silver-haired, bespectacled physician-scientist who stands in the background at White House briefings on the coronavirus pandemic and steps up to speak when the questions get technical and, more importantly, demand precise, authoritative answers. Head of the National Institute of Allergy and Infectious Diseases since 1984, he has taken responsibility for fights against everything from HIV/AIDS to now Covid-19, and has never sought to hold the spotlight or grab credit.\nFor weeks it has been Fauci who has countered the President's hype about possible treatments and vaccines with realism. An anti-malarial drug Trump feels good about will need \"the kind of trial where you get the good information,\" Fauci said. A vaccine would be great, but won't arrive sooner than 12 to 18 months.\nAs he offers sober facts like these to counter President Trump's loose and emotional talk, Fauci performs some nearly miraculous feats. First, he manages to contradict the President without provoking his ire. Second, he gives the country reasonable hope. Lastly, he demonstrates what compassionate authority and grace under fire really look like.\nYou may be surprised to learn, as I was, that the nimble-minded, indefatigable Fauci is 79 years old. Daily exercise -- 3.5 miles of running or power-walking -- has blessed him with a level of fitness that puts many people decades younger to shame. A lifetime of engagement with high-level medical science seems to have kept his mind young in the same way.\nHowever, it is Fauci's strong character that we sense when listening to him speak with care for both the facts and the human beings who now hang on his words.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n\"I'm very much of a people person but also I'm very analytical and very scientific,\" Fauci explained to Gupta on the CNN podcast. He recalled attending a Jesuit high school and college and noted that \"the one theme always underlying our interactions was service to others.\" Put it together -- \"science, I like people, service to others\" -- and \"that's medicine.\"\nListen to Fauci talk with Gupta one-on-one, physician-to-physician, and you hear how much he cares about the people and science he is supposed to serve. Free of the tension that the President brings to the White House briefings, the podcast conversation offers Fauci unfiltered. You can feel the affection and concern he expresses for every person he mentions and for the country he serves. You can also hear a mind on fire as he describes the puzzle of Covid-19's effects on those who contract it.\nAs Fauci says on the podcast, many people suffer only mild illness before recovering fully but some endure a shocking turn for the worse. Speaking of \"the dynamics of the virus against our attempt to mitigate it\" he observes that a patient can be doing well then \"bingo, they're on a respirator. They're on ecmo (heart/lung treatment.) Then they're dead.\"\nFauci's tone is not callous but rather it echoes with the clinical fascination a general might feel for a persistent battlefield foe. \"There's something there, Sanjay, that we're missing,\" he adds, \"from the pathogenesis standpoint.\"\nThe tenacity that Fauci has displayed as a scientist was evident early in his life when, as a kid surrounded by Brooklyn Dodgers fanatics, he remained devoted to the Yankees. Though bookish, he worked construction during school vacations, and though slightly built, he was a fierce competitor on the basketball court.\nThese experiences helped him develop the skills that let him navigate around difficulty throughout his profession. He became fast friends with activists who at first vilified him during the AIDS crisis. Now he's forging a productive relationship with a President who, famously dismissive of experts and advisors, considers gut instinct to be his compass.\nSomehow Fauci seems to have won President Trump's confidence even as he has corrected him in real time. In this way the doctor has served both the President and the country while maintaining his own credibility. Neither a toady nor an attention-seeker, he has put himself in the position to tell everyone the truth, even when it's hard to hear. Fauci has been the target of criticism from some on the far right who falsely accuse him of being politically opposed to Trump.\nOn the podcast Fauci agrees that in the federal response, \"there probably were some missed opportunities.\" Considering how America has lagged behind South Korea and others, to say otherwise would be foolish.\nBut Fauci says he is more concerned about the future right now than the past.\nWhen it's over, he hopes the country will make itself better prepared for the next public health threat. In the meantime, he'll lead, with a modesty and seriousness that is refreshing in this age of Trump.\n\"I'm doing everything I can,\" he says, \"and I'm not alone.\"", "url": "https://www.cnn.com/2020/04/02/opinions/tune-in-to-dr-fauci-dantonio/index.html"}