{"authors": ["Dr. Sanjay Gupta", "Cnn Chief Medical Correspondent"], "date_download": "2020-05-04 16:22:03", "date_modify": "2020-05-04 16:22:03", "date_publish": "2020-04-05 18:26:24", "description": "Covid-19 seems to most seriously affect older people, particularly those with pre-existing conditions such as heart disease, lung disease and diabetes. But it's becoming apparent there are many younger people who still get very sick and die.", "filename": "2020_04_05_health_young-peo_96320fe9a383a929f69e00bb909053eb_index_1588609323.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200405111239-01-elmhurst-hospital-queens-0404-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_05_health_young-peo_96320fe9a383a929f69e00bb909053eb_index_1588609323.html", "title": "Why Covid-19 kills some young people", "title_page": "Why Covid-19 kills some young people  - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) When 30-year-old Ben Luderer started to feel sick, he wasn't that surprised. Just a few days earlier, his wife, Brandy, had tested positive for coronavirus , but there wasn't much to it.\nAll she had was a really low-grade temperature, one that the doctors didn't even really consider to be a fever, she said. She had some congestion, but she was on the mend. He wasn't all that worried, either, when he started feeling unwell. After all, they were both young and healthy.\nThe two worked in the Cliffside Park School District in New Jersey, both as special education teachers -- she at School #4, he at School #6. A star baseball player in high school, he continued his passion by coaching the varsity baseball team.\nFor Ben, however, his symptoms quickly became more severe. He had more shortness of breath, and by the last Friday in March, he told Brandy it was time to go to the emergency room. \"He was really concerned,\" Brandy says. \"He came into our bedroom where I was laying, and he said, you know, I've got to go, I've got to take myself to the hospital.\"\n\"Are you sure you want to go there?\" she asked him. He said \"Yes, I need to.\" Immediately, Brandy drove him to the hospital. She couldn't go in with him, though, because they weren't accepting visitors. So, she sat in the car the entire evening and they texted back and forth. \"He updated me the whole time,\" she said.\nAt the hospital, Ben received oxygen and responded well, Brandy said. They gave him fluids and Tylenol and then sent him home that same evening. \"Keep doing what you're doing at home,\" they said.\nThe following Sunday, he was feeling better and showing signs of improvement, his wife said. He got out of bed and ate dinner for the first time.\n\"Sunday was a great day. He was up moving around, talking to us,\" Brandy said. Ben was on the road to recovery, it seemed. That night, however, his symptoms returned.\nBen and Brandy Luderer taught in the same New Jersey school district.\n\"Ben always said the nights had been the worst for him, he would sweat and when he laid down a certain way,\" Brandy said. \"It was particularly hard for him to breathe.\"\nThat night, Ben had an especially hard time getting comfortable. Because Ben was sleeping in the bedroom, and Brandy on the couch, they were texting back and forth to communicate. At one point, Ben texted his wife and said, \"I'm struggling.\" Brandy asked him if he needed to go back to the ER, and Ben replied that he wasn't sure.\n\"So, I just tried to do as much as I could to make him comfortable, you know, calm down his breathing, you know, get him to cool down,\" Brandy said. She borrowed a humidifier from a friend to try that.\nOnce Ben finally settled into bed, Brandy listened through the door of their bedroom.\n\"I could hear through the door that he was still breathing, and I fell asleep,\" she said. She checked in on him again at 2 a.m, and all seemed OK. However, when she woke at 6 a.m., she found her 30-year-old husband lifeless in their bed.\n\"Whether he knew you for five minutes or he knew you for his whole entire life, he would give you the same respect and try to reach out and help you and make you laugh in any way possible. That was just the type of selfless person he was,\" remembered Brandy.\nAs I listened to Brandy tell the story, my heart broke for her. They were husband and wife, but also best friends, both working in the same school district, driving to work every day. She didn't know what she would do with herself on Monday, let alone the rest of her life.\nAnd Brandy was left with a mystery. She knew her husband was sick, but how was it possible that a young, healthy 30-year-old with no pre-existing conditions declined so swiftly?\nBen Luderer's story is one of many that have perplexed health officials around the globe. Why is it that some young people are getting sick and dying so abruptly?\nIt is true that Covid-19 seems to most seriously affect older people, particularly those with pre-existing conditions such as heart disease, lung disease and diabetes. It could be that an elderly person's immune systems may not be able to fight off the disease as well, and the virus can more easily replicate, overwhelming the body and causing multiple organ system failure.\nAnd yet, as we start to look deeper and hear more stories, it is becoming apparent there are many people like Ben, who are younger and still get very sick and die. I recently heard the story of 39-year-old Conrad Buchanan , a healthy, vivacious Florida DJ, who also died after having coronavirus despite having no underlying conditions, according to his wife.\nWe have known for some time that this new disease, Covid-19, was not only an older person's disease. It has become clear that the young and healthy are by no means immune to this infection and could become sick enough to require hospitalization.\nIn an early snapshot from the US Centers for Disease Control and Prevention , for 2,449 patients whose age was known, 18% were between age 45 and 54, and 29% were between 20 and 44 years old. Among those who were hospitalized, 18% were ages 45 to 54 and 20% were ages 20 to 44.\nYounger people are far less likely to die, but there is an unusual pattern that seems to be emerging. As Dr. Anthony Fauci told me, it is what makes the coronavirus such an \"unusual disease.\"\n\"I'm fascinated,\" he said, \" ... by what I would call the pathogenesis.\"\n\"I mean, the dichotomy between that, there's something there, Sanjay, that we're missing from a pathogenesis standpoint. And I don't think it's only if you're elderly or if you have underlying conditions. There's something else going on there that hopefully we'll ultimately figure out.\"\nSo, what could be behind it? Scientists and researchers wonder if the answer could lie in our genes and are beginning to try and understand what differentiates people who get mild cases from those who die.\nOne possibility is a gene variation in the ACE2 gene. ACE2 is an enzyme that attaches to the outer surface of cells in the lungs, as well as the heart. In an article in Science magazine , Immunologist Dr. Philip Murphy of the National Institute of Allergy and Infectious Diseases said that \"variations in the ACE2 gene that alter the receptor could make it easier or harder for the virus to get into lung cells.\"\nIt is also possible that a critical ingredient produced by the body, known as surfactant, which better allows the lungs to expand and contract, becomes depleted in some patients infected with the coronavirus. If you think of your lungs as a sponge, surfactant would be the detergent which would make them soft and pliable. Without surfactant, however, your lung becomes stiff and hard to squeeze. It may be why some patients continue to struggle even on a breathing machine.\nAnother avenue being pursued is better understanding how your body's immune system responds to viruses and bacteria in the first place. In some young, healthy people, a very reactive immune system could lead to a massive inflammatory storm that could overwhelm the lungs and other organs. In those cases, it is not an aged or weakened immune system that is the problem -- it is one that works too well. Some front line clinicians have speculated that is why steroids, an immune system suppressant, seem to offer benefit in some people.\nPerhaps it is that some younger healthier people, thinking they are not vulnerable to this disease, have been less diligent about practicing physical distancing, and as a result have been exposed to much larger viral loads from the environment.\nTo better define the underlying pathology could still take months, and may be variable in patients, no matter their age. While it is true that a significant percentage of young people may be at increased risk because Americans have such a high baseline rate of pre-existing diseases such as diabetes, it is the perfectly healthy young people, like Ben and Conrad, we need to better understand.\nFor now, no matter your age or underlying condition, the advice remains the same. Stay home, wash your hands and reduce your virus exposure as much as possible. Even if you do develop mild symptoms, it is probably best to stay home to recover.\nBut if you develop trouble breathing, persistent pain or pressure in your chest, sudden confusion or inability to arouse, or bluish lips or face, please, it is time to go to the hospital.\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\nBen Luderer's wife says doctors still can't explain exactly what happened.\n\"We don't really know,\" Brandy told us. \"I don't really know.\"\nFor now, all she can do is take things minute by minute, hour by hour and day by day to process how quickly her life changed.\n\"Ben and I were the type of couple that did everything together,\" she said. \"So, it's very hard understanding where to go with this when you don't have your partner in life that you did everything with. So, I'm still trying to wrap my head around it.\"", "url": "https://www.cnn.com/2020/04/05/health/young-people-dying-coronavirus-sanjay-gupta/index.html"}