{"authors": ["Eric Bradner", "Kate Sullivan", "Ariane De Vogue"], "date_download": "2020-05-04 16:24:48", "date_modify": "2020-05-04 16:24:48", "date_publish": "2020-04-06 18:19:04", "description": "Wisconsin's primary will go forward Tuesday, with polling places opening for in-person voting and absentee ballots required to be postmarked by Election Day, after courts halted Democratic efforts to delay the primary and extend the deadline for ballots to be returned by mail.", "filename": "2020_04_06_politics_wisconsin-primary-election_index_1588609488.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331140405-02-gov-tony-evers-file-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_politics_wisconsin-primary-election_index_1588609488.html", "title": "Wisconsin primary set to go ahead Tuesday after courts block attempts to delay voting due to coronavirus", "title_page": "Wisconsin primary set to go ahead Tuesday after courts block attempts to delay voting due to coronavirus - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Wisconsin's primary will go forward Tuesday, with polling places opening for in-person voting and absentee ballots required to be postmarked by Election Day, after courts halted Democratic efforts to delay the primary and extend the deadline for ballots to be returned by mail.\nThe state Supreme Court on Monday evening blocked Democratic Gov. Tony Evers' executive order signed Monday to delay the primary until June.\nShortly afterward, the US Supreme Court reversed a lower court ruling that had given voters six more days to turn in their absentee ballots -- ruling that only those postmarked by Tuesday and arriving by April 13 be counted. Of nearly 1.3 million absentee ballots requested, about 550,000 had not yet been returned as of Monday morning.\nThe rulings, both on ideological lines by the conservative-led courts, were victories for the Republicans who control the state Senate and Assembly and have opposed all efforts to stop in-person voting from taking place Tuesday because of the coronavirus pandemic. The Republican National Committee and the Republican Party of Wisconsin had taken over the legal battle on the GOP-led legislature's behalf, while the state and national Democratic parties had pushed for more lenient rules around absentee voting.\nThey came despite fears from state and local officials that holding an election in the middle of a pandemic could put the health of poll workers and voters at risk.\n\"Tomorrow in Wisconsin, thousands will wake up and have to choose between exercising their right to vote and staying healthy and safe,\" Evers said in a statement lambasting the GOP-led legislature and Supreme Court. \"In this time of historic crisis, it is a shame that two branches of government in this state chose to pass the buck instead of taking responsibility for the health and safety of the people we were elected to serve.\"\nVoters will decide on Tuesday the state's Democratic presidential primary between former Vice President Joe Biden and Vermont Sen. Bernie Sanders, as well as a general elections for a state Supreme Court seat and a host of local offices.\nPresident Donald Trump has endorsed Justice Daniel Kelly, a conservative on a court where Republicans currently hold a 5-2 majority.\nThe court is currently deadlocked 3-3 on a voting rights case that could result in 240,000 people being removed from Wisconsin's voter rolls ahead of November's election. Kelly's seat could represent the deciding vote, and Kelly has abstained from voting ahead of the spring election.\nAlready, municipalities were consolidating voting locations. Milwaukee is set to open just five polling places Tuesday. And Evers had prepared to dispatch the Wisconsin National Guard to man those polling places after poll workers quit.\nAn emergency meeting of the Wisconsin Elections Commission was set to take place Monday evening, as officials there sorted through the court rulings.\nThe state Supreme Court's ruling was the culmination of days of efforts by Evers to delay the primary or shift it to by-mail voting only. He had said Monday when he signed the executive order pushing the primary back to June 9 that it was his final option to prevent in-person voting from taking place Tuesday.\n\"This is it. There is not a plan B. There is not a plan C,\" he said.\nThe state Supreme Court ruling incensed some local officials who said the election should not go forward in the middle of a pandemic.\n\"Unbelievable. Wisconsin's hyper-partisan Supreme Court is barreling ahead with a reckless election that is certain to disenfranchise tens of thousands of voters,\" tweeted Satya Rhodes-Conway, the mayor of Madison.\nIn a joint statement, the state's Republican legislative leaders, Assembly Speaker Robin Vos and Senate Majority Leader Scott Fitzgerald, said the election will \"go on as planned.\"\n\"The state's highest court has spoken: the governor can't unilaterally move the date of the election,\" the two said.\nEvers had long insisted he did not have the authority to unilaterally move the election. But he changed course Monday, issuing an executive order delaying Tuesday's primary until June 9, unless he and the legislature approve of a different date. He said in the order that \"no Wisconsinite should ever have to choose between exercising their constitutional right to vote and being safe, secure, and healthy.\"\n\"I cannot in good conscience allow any types of gathering that would further the spread of this disease and to put more lives at risk,\" Evers said at a news conference after he signed the order. \"I have been advised by public health experts at the Department of Health Services that despite the heroic efforts and good work of our local election officials, poll workers, and national guard troops, there is not a sufficiently safe way to administer in-person voting tomorrow.\"\nAsked at a news conference Monday about why he believed he now had the legal authority to move the primary, Evers said circumstances had changed.\n\"We've had significant retraction as far as the number of polling places that are open. Clearly, anybody that can do basic math understands if you have fewer places to serve voters, you will have larger numbers at those sites -- numbers that will easily strain the system and frankly cause more ... negative results for people who are there,\" Evers said.\nThe state has already seen record-breaking requests for more than 1.2 million absentee ballots. The state elections commission's tally updated Monday morning showed that about 550,000 absentee ballots had been requested but not yet returned.\nWisconsin had been the only one of 11 states with April primaries that was moving forward with in-person voting, after the other 10 either delayed their primaries or shifted to by-mail only voting.\nEvers and Republican leaders of the state legislature had long resisted calls to move the state's election, which also features a battle for a state Supreme Court seat that could determine the outcome of a voting rights case in which more than 240,000 voters could be removed from the state's rolls ahead of November's general election.\nBut 11 days before the election, Evers reversed course and asked the legislature to quickly pass a law that would send an absentee ballot to every one of the state's voters.\nAfter Republicans refused, Evers late last week called them into a special session and asked them to postpone the primary. But the Senate and Assembly adjourned on Saturday without taking a vote on Evers' proposal.\nUS District Judge William Conley last week ruled that absentee ballots could be returned through April 13 -- six days after the in-person portion of the primary -- and that votes couldn't be counted until then.\nHe also implored state officials to move the primary -- but said he didn't have the power to order them to do so.\n\"This is a public health crisis that the state legislature and the governor have refused to accept as severe enough to stop this statewide election,\" Conley said in a hearing with lawyers in the case conducted last week via Zoom.\nIn an urgent letter over the weekend, the mayors of 10 of Wisconsin's biggest cities, including Milwaukee and Madison, wrote a letter to Andrea Palm, the state's top health official, urging her to \"step up\" and do what Ohio had done: Use her emergency powers to cancel in-person voting and send every voter a ballot by mail.\n\"EVERY other state that faced this issue during the pandemic has crafted a solution that respects democracy and protected the health of their citizens. We must do the same,\" the mayors wrote. \"The lives of our constituents depend on it.\"\nThis story has been updated with additional developments Monday night.", "url": "https://www.cnn.com/2020/04/06/politics/wisconsin-primary-election/index.html"}