{"authors": ["Brian Lowry", "Frank Pallotta", "Cnn Business"], "date_download": "2020-05-04 17:02:02", "date_modify": "2020-05-04 17:02:02", "date_publish": "2020-04-10 12:45:07", "description": "With Universal Pictures leading the charge, studios have moved aggressively to shift movies that were in theaters — and a smattering of upcoming releases — to on-demand platforms, serving the audience kept at home amid the coronavirus crisis.", "filename": "2020_04_10_media_trolls-world-tour-on-demand-coronavirus_index_1588611722.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408095350-01-trolls-world-tour-movie-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_10_media_trolls-world-tour-on-demand-coronavirus_index_1588611722.html", "title": "Universal leads the on-demand movie experiment as 'Trolls' jumps to streaming", "title_page": "Universal leads the on-demand movie experiment as 'Trolls' jumps to streaming - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "New York (CNN Business) With Universal Pictures leading the charge, studios have moved aggressively to shift movies that were in theaters — and a smattering of upcoming releases — to on-demand platforms, serving the audience kept at home amid the coronavirus crisis.\nSo far, the rankings of movie buys and rentals suggest that audiences are flocking to films that otherwise would have taken considerably longer to reach them at home.\nBut are studios making the kind of money that would appreciably offset lost ticket sales?\nScanning the Fandango charts, for example, and you find movies that had their theatrical release cut short on the standings, including \"The Invisible Man,\" \"Onward\" and \"Sonic The Hedgehog.\" Each of those titles were released in February or March, not long before theaters began closing.\nIn fact, eight of the top 10 titles on FandangoNow, the video-on-demand service of the online ticket-seller, are films that would've likely still been in theaters if not for the coronavirus shuttering the industry around the world.", "url": "https://www.cnn.com/2020/04/10/media/trolls-world-tour-on-demand-coronavirus/index.html"}