{"authors": ["Ken Miller"], "date_download": "2020-05-04 20:15:01", "date_modify": "2020-05-04 20:15:01", "date_publish": "2020-04-15 16:50:00", "description": "OKLAHOMA CITY (AP) — Oklahoma Gov. Kevin Stitt said Wednesday that he is looking to reopen shuttered businesses as the curve is flattening in the number of coronavirus cases in the state. A...", "filename": "_cbc7a34c9df0a4e2cd610681ec9ba48d_1588623301.html", "image_url": "https://storage.googleapis.com/afs-prod/media/56addfa42a31413297996fa332897518/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_cbc7a34c9df0a4e2cd610681ec9ba48d_1588623301.html", "title": "Stitt hopeful but 'we're not out of the woods'; deaths up 15", "title_page": "Stitt hopeful but 'we're not out of the woods'; deaths up 15", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Stitt hopeful but ‘we’re not out of the woods’; deaths up 15\nRegistered nurse Brooke Pruitt hands a mask into a person to be tested at a mobile testing site for COVID-19 at the Murray County Expo Center in Sulphur, Okla., Tuesday, April 14, 2020. The testing was performed by staff from District Eight of the Oklahoma State Department of Health. (AP Photo/Sue Ogrocki)\nRegistered nurse Brooke Pruitt hands a mask into a person to be tested at a mobile testing site for COVID-19 at the Murray County Expo Center in Sulphur, Okla., Tuesday, April 14, 2020. The testing was performed by staff from District Eight of the Oklahoma State Department of Health. (AP Photo/Sue Ogrocki)\nOKLAHOMA CITY (AP) — Oklahoma Gov. Kevin Stitt said Wednesday that he is looking to reopen shuttered businesses as the curve is flattening in the number of coronavirus cases in the state.\nA ban on elective surgeries will be lifted April 24, Stitt said, and his Safer at Home order that shut down non-essential businesses and banned gatherings of more than 10 people expires six days later, although he is extending the order to the elderly and those most vulnerable to the virus.\n“We are working on plans to reopen our state, but let me be clear, we’re not out of the woods yet,” Stitt said.\nSocial distancing and safety measures such as frequent hand washing should continue, Stitt said, and that he is conferring with state health officials on reopening businesses such as restaurants, barber shops and museums.\nStitt said he is basing his decision on a decline in the number of hospitalizations during the past two weeks.\n“That number peaked at 560 on March 30 and has slowly gone down ... it was I think 420 or so (Tuesday),” according to Stitt.\n___\nCORONAVIRUS NUMBERS\nThere were 15 additional deaths in the state due to COVID-19 and 2,263 confirmed cases, the Oklahoma State Department of Health reported Wednesday.\nA total of 123 people have now died as a result of COVID-19. The agency said 100 of the deaths were people who were 65 years old or older.\nThe number of deaths and total cases are up from 108 and 2,184, respectively, reported Tuesday.\nFor most people, the coronavirus causes mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia.\n___\nLEGISLATURE-GOVERNOR-DISPUTE\nStitt said “it’s just disappointing” that members of the Oklahoma Legislature, including House Speaker Charles McCall and Senate President Pro Tem Greg Treat have asked the state Supreme Court to order the Board of Equalization to meet and declare a revenue failure for the current fiscal year.\nThe Legislature last week approved three bills to fill a projected $416 million budget hole for the fiscal year ending June 30. But one bill does not protect one of Stitt’s priorities, the state’s new digital transformation office, from cuts and the governor abruptly canceled a meeting of the board.\nThe bill passed without Stitt’s signature, but it requires the declaration of a revenue failure by the board to access the reserve funds.\nStitt said Wednesday he met earlier in the day with McCall and Treat, but is focuses on responding to the coronavirus.\n“We’ve got plenty of time, we fully funded April,” though a shortfall still looms for May and June, Stitt said. “We’ve got all the way until May to call a Board of Equalization meeting and work out an agreement with the House and the Senate.”", "url": "https://apnews.com/cbc7a34c9df0a4e2cd610681ec9ba48d"}