{"authors": ["Keith Ridler"], "date_download": "2020-05-04 20:04:45", "date_modify": "2020-05-04 20:04:45", "date_publish": "2020-04-06 23:06:02", "description": "BOISE, Idaho (AP) — Idaho officials on Monday extended the statewide school closure because of the coronavirus through the end of the academic year, or until social distancing requirements are...", "filename": "_e40238235776bb460c4f25dc0802998c_1588622685.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9ee1a74f3c1a481daf1019e9e63c5bdd/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_e40238235776bb460c4f25dc0802998c_1588622685.html", "title": "Idaho officials extend statewide school closure", "title_page": "Idaho officials extend statewide school closure", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Small business owner, Liyah Babayan tapes up a sign while getting set up to donate masks to those that need them Monday, April 6, 2020, on Main Avenue in Twin Falls, Idaho. Babayan and her family spent three days making around 200 masks to give out to the community, though donations are encouraged so they can continue to make masks. (Drew Nash/Times-News via AP)\nSmall business owner, Liyah Babayan tapes up a sign while getting set up to donate masks to those that need them Monday, April 6, 2020, on Main Avenue in Twin Falls, Idaho. Babayan and her family spent three days making around 200 masks to give out to the community, though donations are encouraged so they can continue to make masks. (Drew Nash/Times-News via AP)\nBOISE, Idaho (AP) — Idaho officials on Monday extended the statewide school closure because of the coronavirus through the end of the academic year, or until social distancing requirements are lifted.\nThe Idaho State Board of Education voted unanimously to extend school closures past the April 20 date for possible re-opening.\nStudents will still be taught online.\nHealth officials say the number of people contracting the virus in Idaho is expected to peak in late April and early May. The school closures are based on guidelines for social distancing set by the U.S. Centers for Disease Control and Prevention.\nMeanwhile, more Idahoans have been signing up for healthcare insurance through Medicaid expansion as the economy has collapsed, and others who have lost jobs due to the coronavirus could qualify for the state-run insurance market, officials say.\nMore than 45,000 workers lost employment in the last several weeks as the state’s economy shed jobs at a record rate.\nMedicaid expansion numbers have climbed more steeply over that same period and are approaching 70,000.\nYour Health Idaho insurance exchange officials say some workers who lost jobs could get health insurance there if they qualify. About 89,000 residents signed up before the mid-December deadline.\nBut Idaho is the only state running its own insurance exchange that hasn’t re-opened enrollments to help people get health insurance during the pandemic.\n“That’s something they are looking at,” said Jennifer McClelland, a spokeswoman for the Idaho Department of Insurance.\nBecause numbers are changing so rapidly, it’s difficult to determine how many have turned to Medicaid.\n“If they’re not able to find a different job, I think it’s reasonable to expect that a good number of those people would end up being enrolled in the expansion or traditional Medicaid,” said Niki Forbing-Orr, spokeswoman for the Idaho Department of Health and Welfare.\nThe Affordable Care Act’s health insurance marketplaces operating in 38 states with HealthCare.gov and the state-run insurance markets in 12 states normally limit enrollment to a regular sign-up window that starts each fall.\nBut losing a job along with health insurance in some circumstances triggers an opening that allows people to purchase a plan.\nYour Health Idaho spokeswoman Meghan McMartin in an email to The Associated Press said loss of employment alone is not considered a qualifying event that would open an enrollment opportunity.\n“However, if someone lost their job and lost their employer-sponsored health insurance as a result, they would be eligible for a Special Enrollment Period,” she said.\nShe said Your Health Idaho has not yet seen a significant increase in requests, but traffic to the website for special enrollment and loss of coverage has increased 10% compared to last year.\nShe said restrictions to sign up include that workers who lost jobs had to have prior coverage that met minimum requirements under the Affordable Care Act.\nIdaho also allows what are called Enhanced Short-Term plans, which don’t meet minimum requirements of the Affordable Care Act. Those plans are available for purchase year-round. They typically have high deductibles and generally exclude pre-existing health conditions. Critics of such plans contend they are essentially worthless because of the high deductibles.\nOf the 12 states with a state-run insurance market, according to HealthCare.gov, Idaho is the only one that hasn’t opened a special enrollment period due to the coronavirus and resulting job losses.\nThe federal government hasn’t opened a special enrollment period either. But last month’s $2.2 trillion rescue package set aside $100 billion in funding for hospitals to handle uncompensated care and other coronavirus-related losses.\nIdaho has 1,101 confirmed cases and 10 deaths because of the virus, according to a Johns Hopkins University tally on Monday afternoon.\nThe coronavirus mainly is spread through coughs and sneezes. For most people, it causes mild or moderate symptoms, such as fever and cough, that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including pneumonia and death.", "url": "https://apnews.com/e40238235776bb460c4f25dc0802998c"}