{"authors": ["Tamara Qiblawi"], "date_download": "2020-05-04 17:00:10", "date_modify": "2020-05-04 17:00:10", "date_publish": "2020-04-09 10:59:58", "description": "Many US citizens in Lebanon have declined a recent embassy offer for repatriation, citing skyrocketing cases in the US. \"It's safer in Beirut,\" some said.", "filename": "2020_04_09_middleeast_us-citizens-lebanon-coronavirus-intl_index_1588611610.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409113311-06-lebanon-coronavirus-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_middleeast_us-citizens-lebanon-coronavirus-intl_index_1588611610.html", "title": "US citizens in Lebanon decline repatriation offer, saying it's \"safer\" in Beirut", "title_page": "US citizens in Lebanon decline repatriation offer, saying it's \"safer\" in Beirut - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Beirut, Lebanon (CNN) Carly Fuglei was with a group of Danish friends in Beirut last month when she first considered moving back to the United States. They were preparing to leave Lebanon amid fears of a major coronavirus outbreak there, and tried to convince her to do the same.\nBut the 28-year-old humanitarian consultant from Montana decided to stay. After Lebanon closed its borders on March 19 to stem the spread of the global pandemic, she began furnishing her rooftop terrace. Her time in Beirut, she realized, would be indefinite.\n\"I made that decision for a combination of personal reasons and calculations about the virus that we're all making,\" says Fuglei. \"I think that I am probably safer here.\"\nIt's a decision that several US citizens in Beirut who CNN spoke to have echoed, citing skyrocketing cases in the US . When the US government last week said it would fly its citizens and permanent residents to the US on a chartered flight for $2,500 per person, some Americans took to Twitter to publicly decline the offer.\n\"And no, Mom, I'm not going,\" Beirut-based freelance journalist Abby Sewell wrote in a tweet about the US embassy announcement.\nResponding to her tweet, a Lebanese journalist said: \"For once I'm like no America is not safer than here.\" Sewell's mother, Meg Sewell, replied: \"Actually, for the moment I might have to agree.\"\nSewell tells CNN she never considered taking the US embassy's offer.\n\"From everything I'm reading, the situation is worse in the US, in terms of the number of cases, prevention measures or lack thereof, and how overburdened the health system is,\" she says.\n\"Also, since I've been living overseas for years, I don't have health insurance in the US now, so if I did go back and then got sick, I would be looking at paying thousands of dollars out of pocket.\"\nLebanese soldiers, wearing protective equipment, stand guard at Beirut international airport on April 5, ahead of the arrival of returning nationals.\nOn the morning of April 5, the US embassy flew 95 US citizens out of Lebanon, according to a US State Department official. It is estimated that thousands of Americans live in Lebanon -- many of whom also hold Lebanese citizenship.\n\"The Department of State has no greater priority than the safety and security of US citizens overseas,\" the official told CNN. \"We are rising to meet the historic challenge posed by the Covid-19 pandemic, every day, all over the world.\"\nWhen asked about Americans suggesting that Beirut is, for once, safer than the US, the official declined to comment.\nA rapid outbreak back home\nDaryn Howland, 27, is hunkered down in her Beirut apartment, diving into her work as a consultant. \"My plan is to stay here for the indefinite future,\" says the Boston native.\n\"The fact that things are so bad in the US means it's one of the first times where it's safer to be in Lebanon than in the US,\" Howland also echoes. \"Despite the (Lebanese political and economic) situation ... I think my odds are better here.\"\n\"All of my American friends here have decided to stay,\" she adds.\nWhen the first novel coronavirus case was reported in Lebanon on February 21, the country was already awash with crises.\nNationwide protests erupted against the country's political elite last October, toppling the government of former Prime Minister Saad Hariri and deepening a political crisis. Already under increasing pressure, the country's currency tanked. Last month, Beirut announced its first ever debt default.\nUnder widespread pressure from activists and media, the freshly-minted government of Prime Minister Hassan Diab vowed not to take any chances with the virus, despite the toll any measures might take on the already troubled economy.\nSanitary workers disinfect the desks and chairs of the Lebanese Parliament on March 10.\nEight days after that first case, on February 29, the country closed its schools and universities. On March 6, it shuttered restaurants and cafes, ahead of several western European countries, such as Italy, in enforcing such a measure. The government then announced a lockdown on March 15.\nIn recent weeks, the spread of the coronavirus in Lebanon has slowed, according to the World Health Organization's Lebanon office. Medical professionals have offered cautious praise for the country's relatively early steps to enforce the lockdown.\n\"We're not at a stage where we have to decide who gets a ventilator and who doesn't. That is because we are staying at home and the borders are closed,\" tweeted Dr. Firass Abiad, head of the government's Rafik Hariri University Hospital, which has been dealing with the majority of coronavirus cases in Beirut. His tweet linked to a New York Times opinion piece about ventilator shortages in the US.\nAs of April 9, there are more than 430,000 Covid-19 cases and 14,000 deaths in the US, with 576 cases and 19 fatalities in Lebanon, according to Johns Hopkins University figures.\nJust under 12,000 tests for coronavirus have been carried out so far in Lebanon. That equates to around 0.1% of the population (by contrast, roughly 0.3% of the population in Britain, and 1.1% of the population of Germany have been tested). As a result, the ministry of public health believes it is underestimating the scale of its outbreak. It has urged more people to get tested.\nLebanon's ministry of public health has vowed to boost the number of screenings to as many as 2,000 a day. It says anyone with mild to severe symptoms is entitled to be tested.\nIn a recent video address, Director General of the Public Health Ministry Walid Ammar blamed the social stigma around COVID-19 for low levels of screening in the country: \"If a citizen feels that your reaction will be bad, then they won't go and get tested,\" said Ammar. \"You all should be afraid of people who won't get tested because they're afraid of you. These are the people who will infect you.\"\nMore people are showing up for tests, but the medical sector -- which was dealt a heavy blow by the country's financial crisis -- lacks the resources to conduct mass screenings, medical professionals say.\nMedics say that the country's proactive lockdown measures have helped the health sector avoid the pandemonium seen in many other countries ravaged by the virus.\n\"The more we test, the better, but we have to realize that our resources are limited and need to use it strategically,\" tweeted Hassan Zaraket, a virologist and assistant professor at the American University of Beirut. \"If we had been missing many cases we would have explosion at ER & ICU.\"\nLebanese security forces stop cars at a highway checkpoint north of Beirut on April 6, as authorities implemented further measures restricting the movement of vehicles.\nWhile it may be too soon to say if the spread of coronavirus will continue to slow, Howland says she has taken comfort in Lebanon's strict measures. \"The government got ahead of the problem and so far (the number of cases) hasn't escalated,\" she says.\nThe White House's response, she argues, stands in sharp contrast with that of her crisis-ridden adopted country.\nUS President Donald Trump has come under fire for being slow to act in stopping the rapid spread of the disease there. The country now has the highest number of reported cases and deaths from the virus globally, and a prominent model that tracks the coronavirus in the US predicted on Wednesday that more than 60,000 people will die due to Covid-19 by August.\n\"Watching how Trump has handled this crisis ... it just seems that people are not really aware of what's going on and not taking the proper decisions,\" says Howland.\nEmployees work while wearing protective face shields and gloves at a store in the northern Lebanese city of Batroun on March 23.\nFears of long-term pain in Lebanon\nOthers believe that cash-strapped Lebanon has yet to see the worst of the coronavirus outbreak.\nWhen Lebanese-American Hana Murr received an email with the US embassy's offer for repatriation last week, she saw it as an opportunity to flee a deepening economic crisis.\n\"We've always had a weak state and we're going to get affected greatly by that as a result,\" says Murr. \"The government now has to play catch-up. They're doing a pretty decent job. I am surprised. My expectations were very low, and they've exceeded them.\"\nBut she adds: \"The downward spiral of the economy and the dangers that coronavirus pose make me very afraid, and I want to get out before it all comes to a head.\"\n\"I'm happy, heartbroken, relieved, depressed and it changes every 10 minutes,\" says Murr, hours before boarding a flight back to her home state of Florida.\nSpeaking from her Beirut apartment, Montana-native Fuglei says she may have been tempted to return to the US, had she had more faith in its leadership.\n\"To be honest, if we still had an Obama administration or any kind of confidence then maybe we (Americans in Beirut) would have felt differently,\" she says. \"They probably would have enacted something where I had a clear healthcare plan going back, or where housing was being compensated, or having a clear package of benefits that I could have come back to,\" Fuglei adds.\n\"I just have zero trust.\"", "url": "https://www.cnn.com/2020/04/09/middleeast/us-citizens-lebanon-coronavirus-intl/index.html"}