{"authors": [], "date_download": "2020-05-04 20:20:37", "date_modify": "2020-05-04 20:20:37", "date_publish": "2020-04-09 19:22:42", "description": "NUEVA YORK (AP) — Mort Drucker, el caricaturista de la revista Mad que durante décadas parodió amorosamente a políticos, celebridades y la cultura popular, falleció el jueves. Tenía 91...", "filename": "_806df11a6bf446ee896fd5f8894b1e12_1588623637.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_806df11a6bf446ee896fd5f8894b1e12_1588623637.html", "title": "Mort Drucker, ilustrador de revista Mad, muere a los 91 años", "title_page": "Mort Drucker, ilustrador de revista Mad, muere a los 91 años", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "NUEVA YORK (AP) — Mort Drucker, el caricaturista de la revista Mad que durante décadas parodió amorosamente a políticos, celebridades y la cultura popular, falleció el jueves. Tenía 91 años.\nDrucker se sintió enfermo la semana pasada, con dificultad para caminar y algo de dificultad para respirar, dijo su hija, Laurie Bachner, a The Associated Press. No especificó la causa de muerte, pero dijo que no le habían hecho la prueba del coronavirus. El artista falleció en su casa en Woodbury, Nueva York, con su esposa por más de 70 años, Barbara, a su lado.\n“Creo que mi padre tuvo la mejor vida que cualquiera podría pedir”, dijo Bachner. “Se casó con la única mujer a la que amó y pudo ganarse la vida haciendo lo que adoraba”.\nLa revista Mad fue una institución cultural para millones de personas de la generación de la posguerra, y Drucker fue una institución en Mad. Nacido en la ciudad de Nueva York, se unió a la publicación en sus primeros días, a mediados de la década de 1950, y trabajó para ella hasta entrado el siglo XXI. Pocos sucesos o figuras públicas importantes escaparon de las sátiras de Drucker, quien plasmó desde “Star Trek” (“Viaje a las estrellas”) y “The Godfather” (“El padrino”) hasta Steve Martin y Jerry Seinfeld. Con grandes pinceladas, reprodujo cada arruga, fisura y rasgo llamativo. Las mandíbulas pronunciadas de Kirk Douglas y Jay Leno lucían aún más grandes; las orejas de Barack Obama parecían alas a punto de tomar vuelo. Ser dibujado por Drucker llegó a ser una especie de rito iniciático en la industria del espectáculo: en una ocasión Michael J. Fox le dijo al entrevistador Johnny Carson que supo que había triunfado cuando apareció en una caricatura de Drucker.\nLos admiradores de Drucker también incluyeron al creador de “Peanuts” (“Snoopy”) Charles M. Schulz y al realizador de “Star Wars” George Lucas, que en la década de 1970 le escribió una carta a Mad como un fan incluso mientras sus abogados amenazaban con demandar por una caricatura de la revista. (La demanda nunca fue presentada).\nAdemás de Mad, Drucker dibujó para la revista Time, DC Comics, una campaña publicitaria de frutas y verduras y la banda de rock metálico Anthrax, que le comisionó un diseño para la portada de su álbum “State of Euphoria”.\nAlgunas ilustraciones de Drucker, incluida una de Richard Nixon y Mao Zedong jugando tenis de mesa para la portada de Time, terminó en la Galería Nacional de Retratos en Washington. En 2017, Drucker fue incorporado al Salón de la Fama de la Sociedad de Ilustradores.\n“Cuando la revista Mad se convirtió en una voz establecida (aunque absurda) del mainstream cultural de la nación, muchos de los maestros visuales que resaltaron el contenido escrito de la revista con el tiempo se convirtieron en íconos en y por sí mismos”, dice una cita del Salón de la Fama. “Ciertamente, Mort Drucker demostró ser uno de los artistas más populares del grupo que colectivamente llegó conocerse como la ‘Pandilla Habitual de Idiotas’”.", "url": "https://apnews.com/806df11a6bf446ee896fd5f8894b1e12"}