{"authors": ["Opinion Gil Eyal"], "date_download": "2020-05-04 16:14:02", "date_modify": "2020-05-04 16:14:02", "date_publish": "2020-04-02 17:11:06", "description": "Gil Eyal writes that Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, is so far winning in the battle for America's trust. But, he warns, the coronavirus crisis is a critical moment for all public health experts involved. Their handling of this crisis will either mark a restoration of the public's trust in experts -- or be the nail in their coffins.", "filename": "2020_04_02_opinions_fauci-covid-19-winning-public-trust-eyal_index_1588608842.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331124203-01-fauci-0317-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_fauci-covid-19-winning-public-trust-eyal_index_1588608842.html", "title": "Why Fauci is winning the battle for public trust", "title_page": "Why Fauci is winning the battle for public trust (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Gil Eyal is a professor of sociology at Columbia University. His book, \" The Crisis of Expertise ,\" was published by Polity Press in 2019. The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) During a White House briefing on March 20, Dr. Anthony Fauci, the director of the National Institute of Allergy and Infectious Diseases, respectfully pushed back against President Donald Trump's claim that an anti-malaria drug would successfully treat coronavirus patients. The evidence was only anecdotal at that point, Fauci cautioned. Yet, just this week, the FDA provided \"emergency use approval\" to prescribe the drug to coronavirus patients.\nOn a different front, Trump said last week that he wanted the nation \"opened up and just raring to go by Easter,\" but later backed off, in part, after Fauci called this an \"aspirational projection\" and presented him with the likely estimates of fatalities.\nAs these exchanges unfolded in front of the press, it became clear that the President and the nation's foremost public health expert were battling, however politely, over who the American people should trust. While the scales may be tipping in Fauci's favor at the moment, the battle is far from won.\nThe Covid-19 epidemic is a critical moment for the nation's public health experts. It is their credibility, no less than the political leaders', that is now on the line. And after years of declining levels of trust in experts, their handling of this crisis will either mark a restoration of the public's trust in experts -- or be the nail in their coffins.\nThe Trump administration is known for its distrust of many experts. According to the Union of Concerned Scientists, the administration has sidelined independent experts' advice and often created a hostile working environment for government scientists whose research conflicted with its agenda. Defenders of the administration argue that the science in question -- for example, that on climate change and the regulations designed to slow its pace -- is inconclusive and that they are merely encouraging an intellectually honest approach. Yet it is hard to find many mainstream scientists who agree with that argument.\nNone of this is particularly surprising. Populists like Trump often detest experts. They call them \" elitists \" and \"globalists\" -- and imply that experts cannot be trusted. The irony of this moment -- with a world under siege by a lethal virus -- is that the legitimacy of populist politicians now depends on the professionalism and competence of the very experts they have denounced.\nYet skepticism about experts predates the Trump administration. One survey, documented in an Administrative Law Review paper, found that trust in the US Food and Drug Administration declined from 80% in the 1970s to 36% in 2006. And the assessments of experts regarding climate change, environmental pollution or vaccines have been fiercely contested for years.\nIn other words, there is a systemic crisis of mistrust in experts. While it has multiple causes, it can be traced principally to interaction between two factors. First, experts are called upon to provide advice on contested matters that advantage some groups, while disadvantaging others. For example, when the FDA fast-tracks approval of one drug, it can enrich a pharmaceutical company and its investors -- as well as benefit a specific group of patients. At the same time, rejection can bankrupt another company and deny the hopes of other patients. In such a scenario, those who find themselves on the \"losing\" side may grow distrustful of the decision makers.\nSecond, unlike the exploratory nature of basic scientific research, government experts are tasked with formulating binding rules like \"acceptable levels\" of a pollutant. These are based on estimates that may reflect the state of the scientific art at one point in time -- but can quickly become obsolete. Initially, for example, the US Centers for Disease Control and Prevention discouraged Americans from wearing masks to combat the pandemic, and yet the CDC is now set to be reconsidering that initial recommendation.\nIn public perception, the combination of these two factors is potentially explosive. It can appear as if rules that allocate winners and losers were formulated on the basis of arbitrary cut-offs, or worse, are formulated to favor one group over another.\nBut a crisis does not have to mean the \"death\" of expertise. Whatever problems beset expertise, the alternatives are worse.\nA key issue now is who gets tested for Covid-19. Because tests are still scarce in some places, these decisions are made by infectious diseases experts. They take calls from clinicians, decide in each case whether to prioritize testing and revise guidelines as more kits become available. This is exactly how we would want such decisions to be made. An epidemic requires careful stewardship of scarce resources (such as ventilators and N95 masks) on the basis of expert assessments of relative risk.\nYet for patients waiting in a long line only to be told that they cannot be tested, the decision can appear arbitrary. Most importantly, even when experts make decisions based on the best available evidence, inescapably they will sometimes be wrong, and when they do so, they will further undermine trust.\nAnother case in point: the FDA's restrictive guidelines that in the early days of the epidemic allowed labs to conduct tests only for patients who met specific criteria, such as having recently traveled to Wuhan. In retrospect, it appears the guidelines may have caused many people carrying the virus and complaining about symptoms to go untested, and thereby masked the degree of community spread already taking place.\nBut before we jump to denounce this as another case of rigid bureaucracy, we should realize that while the restrictions in this case may have been too strict, we need to have a set of guidelines to assist health care workers in their decision-making during an epidemic. If, in the early days of the virus, we did not have any guidelines, doctors may have given out tests to too many people who were suffering from allergies, the flu or other potentially less severe illnesses. And we could have found ourselves with no tests at all -- and an even harder time tracking an epidemic.\nUS public health experts are therefore entering this moment handicapped by the systemic crisis of mistrust in expertise. And, in the absence of trust, critics are ready to pounce at the slightest impression of political bias, either for the administration or against it\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nOn the other hand, the epidemic may work in the experts' favor, because in a moment of emergency we are predisposed to look to them for reassurance. And a skilled communicator like Fauci should be able to use this opportunity.\nHis performance up till now has reminded people that, despite the misgivings evoked by the administration's clumsy messaging, there are deep wells of professionalism, integrity and competence from which to draw among American public health experts. Reliance on them is our best bet, even if they make some mistakes", "url": "https://www.cnn.com/2020/04/02/opinions/fauci-covid-19-winning-public-trust-eyal/index.html"}