{"authors": ["Meg Kinnard"], "date_download": "2020-05-04 20:24:08", "date_modify": "2020-05-04 20:24:08", "date_publish": "2020-04-20 20:21:02", "description": "WEST COLUMBIA, S.C. (AP) — South Carolina's governor is rolling out details of a program that his office says will allow the state's economy to “recover more quickly than any other state's in the...", "filename": "_3ba1601cc5426deab74f5ff36cadd58a_1588623848.html", "image_url": "https://storage.googleapis.com/afs-prod/media/b22461c14d33444badc3bcf89243463b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_3ba1601cc5426deab74f5ff36cadd58a_1588623848.html", "title": "SC gov rolls out plans for post-outbreak economic reopening", "title_page": "SC gov rolls out plans for post-outbreak economic reopening", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "WEST COLUMBIA, S.C. (AP) — South Carolina’s governor is rolling out details of a program that his office says will allow the state’s economy to “recover more quickly than any other state’s in the country” from the new coronavirus outbreak.\nGov. Henry McMaster on Monday announced the details of “Accelerate South Carolina,” which includes several key leaders in the state including mayors, presidents of institutions of higher learning, business owners and health care professionals. The group is headed up by James Burns, an attorney and former Defense Department deputy legal counsel who also served as chief of staff to former Gov. Nikki Haley. Its first meeting is scheduled for Thursday, with plans to hold multiple sessions over the next 30 days.\nMcMaster has repeatedly stressed his desire for a swift, yet safe, reopening of the state’s economy, noting the severe toll the outbreak has had on individual workers and businesses. Establishments including restaurants, bars, manufacturers, dentist offices and a number of others have closed for a variety of reasons, including mandatory orders from McMaster issued in an effort to stem the outbreak.\n“To do so too quickly would be reckless,” the governor said last week, of resuming normal activity levels, noting several times he felt sure the economy would be “humming” by the end of June.\nDuring a media briefing, McMaster acknowledged that, even though the virus continues to spread, he saw it as crucial to both manage the outbreak and shore up the economy in hopes of avoiding disastrous, long-lasting effects.\n“We are still in a very serious situation,” McMaster said. “People want to work, they need to work ... and we’re going to do all that we can do to see that they can do that, and continue with their lives, as much as possible.”\nThus far, South Carolina public health officials have reported a total of more than 4,400 COVID-19 cases, which have resulted in 124 deaths statewide. For most people, the coronavirus that caused this year’s pandemic causes mild or moderate symptoms. For some, it can cause severe illness such as pneumonia, or even death.\nLast week, nearly 88,000 people filed for unemployment, bringing the statewide total of those who live or work in South Carolina saying they lost their jobs because of the outbreak to more than 268,000 - more than 10 percent of the state’s total labor force of nearly 2.4 million.\nOn Monday, McMaster also began loosening those economic restrictions, allowing businesses previously deemed non-essential — department stores, flea markets, florists, bookstores and music shops — to reopen their doors. The governor’s official stay-at-home order remains in place, although that mandate already allowed the patronage of essential businesses such as grocery stores, pharmacies, home improvement stores and medical facilities, as well as thousands of others that received waivers from state officials.\nThat follows his decision last week to begin reopening public boat ramps that have been closed for several weeks and encouraging anyone on the state’s waterways to practice social distancing. Public beach access points were also set to reopen, although the governor said ultimate reopening decisions will rest with local officials. Already, some coastal municipalities have said they “intend to maintain the entry checkpoints and access restrictions.”\nOfficials have said they expected South Carolina’s outbreak to peak next month. On Sunday, Corrections Department officials announced the first positive COVID-19 test on one of the state’s more than 17,700 inmates, noting the 69-year-old man - who is serving a life prison sentence - has been in isolation since Friday and was being treated at a hospital.\nAsked about White House recommendations that a state see 14 days of declining positive tests before loosening restrictions, McMaster said those “good guidelines” were not requirements. Dr. Linda Bell, South Carolina’s state epidemiologist, said that, while there had been a “potential leveling off” in the state’s cases, there was no consistent decline.\n“We all obviously want to see an economic recovery,” Bell said. “But at the same time, we have to ... give the message that the risk of exposure remains for everyone.”\n___\nMeg Kinnard can be reached at http://twitter.com/MegKinnardAP\n___\nFollow AP coverage of the virus outbreak at https://apnews.com/VirusOutbreak and https://apnews.com/UnderstandingtheOutbreak .", "url": "https://apnews.com/3ba1601cc5426deab74f5ff36cadd58a"}