{"authors": ["Erica Orden"], "date_download": "2020-05-04 16:19:03", "date_modify": "2020-05-04 16:19:03", "date_publish": "2020-04-03 15:46:46", "description": "The National Rifle Association of America sued New York state's governor and economic development arm in federal court on Thursday for closing gun stores during the coronavirus epidemic by deeming them non-essential businesses.", "filename": "2020_04_03_politics_nra-new-york-gun-store-non-essential_index_1588609143.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200403114541-nra-file-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_nra-new-york-gun-store-non-essential_index_1588609143.html", "title": "NRA suing New York for deeming gun stores non-essential businesses during coronavirus pandemic", "title_page": "NRA suing New York for deeming gun stores non-essential businesses during coronavirus pandemic - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The National Rifle Association of America sued New York state's governor and economic development arm in federal court on Thursday for closing gun stores during the coronavirus epidemic by deeming them non-essential businesses.\nIn the lawsuit , filed in the Northern District of New York, the NRA claimed that New York Gov. Andrew Cuomo has \"effectively and indefinitely suspended a key component of the Second Amendment to the United States Constitution\" by forcing gun stores across the state to temporarily shutter their doors.\nAs states around the country issued stay-at-home orders amid the coronavirus pandemic, some, like New York, didn't deem firearm and ammunition retailers to be essential, forcing those businesses to close.\nThe federal government designated firearm and ammunition retailers as an \"essential service,\" according to its updated guidance, but those guidelines are advisory, meaning states can \"add or subtract essential workforce categories based on their own requirements and discretion.\"\nThe NRA sued the Democratic governor in both his official and personal capacity, as well as New York's Empire State Development agency and its acting commissioner.\n\"By closing federally licensed dealers, Defendants have cut off the only way of legally purchasing firearms in the State,\" the lawsuit says. \"As a result of the government's overreach, most New Yorkers have no legal way to exercise the constitutional right to purchase arms or ammunition.\"\nIn its filing, the NRA also suggested that the pandemic could be a time of heightened need for a firearm.\n\"The current public health emergency does not justify impeding the exercise of Second Amendment rights,\" the lawsuit says, \"especially during a time when many New Yorkers have valid concerns about the ability of the government to maintain order—and criminals are being prematurely released from jails.\"\nOn Saturday, Cuomo addressed the legal challenge during a news conference on coronavirus.\n\"I think I've been sued by the NRA, must be a dozen times. I didn't even know I was sued this time. You become sort of lawsuit immune. I wish I could become immune to this virus the way I've become immune to NRA lawsuits,\" he said.\nKris Brown, the president of the pro-gun-control group Brady, called the lawsuit \"another attempt by the NRA to jeopardize life-saving responses to stop the spread of this deadly virus that is killing thousands of New Yorkers.\"\nShe said Cuomo is \"well within his authority\" to close the stores in an effort to address the virus's spread.\n\"The Second Amendment, like all amendments in the Bill of Rights, is balanced by concerns of public safety and health,\" she added. \"Right now, those concerns necessitate the closure of many businesses, including the need to forbid large gatherings, which are rights otherwise protected by the First Amendment. The Second Amendment does not supersede the First, nor does it override the need to stop the spread of coronavirus.\"\nThis story has been updated to include comment from Gov. Andrew Cuomo.", "url": "https://www.cnn.com/2020/04/03/politics/nra-new-york-gun-store-non-essential/index.html"}