{"authors": ["Jason Hanna", "Christina Maxouris"], "date_download": "2020-05-04 16:34:07", "date_modify": "2020-05-04 16:34:07", "date_publish": "2020-04-07 07:12:54", "description": "The number of deaths from the novel coronavirus continued to reach grim milestones, with more than 800 fatalities reported Tuesday in New York City, according to city health officials.", "filename": "2020_04_07_health_us-coronavirus-tuesday_index_1588610047.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407124913-03-us-coronavirus-deaths-0403-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_us-coronavirus-tuesday_index_1588610047.html", "title": "New York City reports a record 800-plus deaths in one day", "title_page": "New York City reports a record 800-plus deaths in one day - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) The number of deaths from the novel coronavirus continued to reach grim milestones, with more than 800 fatalities reported Tuesday in New York City, according to city health officials.\nThe national daily total of 1,858, according to Johns Hopkins University, also reached a record high.\nIt is unclear whether the New York City figure of 806 was used in compiling the US total.\nStill, the distressing numbers came as some officials expressed hope that some areas of the country were reaching the peak of the curves of cases, hospitalizations and deaths.\nEarlier New York Gov. Andrew Cuomo had said the numbers of hospitalizations in his state was reaching a plateau but residents still needed to be disciplined.\n\"We have to be smart. We have to be safe. ... We do that by staying at home,\" he told reporters.\nThe majority of people in the US are \"doing the right thing\" by staying home and following other mitigation measures to help fight the coronavirus pandemic, US Surgeon General Dr. Jerome Adams told ABC's \"Good Morning America.\"\n\"I'm seeing mitigation work,\" Adams said. \"I know I've said it a couple times with Washington and with California. Their public health officials there should be applauded because they've given us the blueprint for how we deal with this and the rest of the country.\"\nNew York has reported almost 140,000 positive cases -- a large chunk of the almost 400,000 coronavirus cases in the US, according to a tally by Johns Hopkins.\nThe way the city reports its deaths soon will include possible coronavirus deaths at homes.\nHealth officials count people who test positive for the coronavirus whether they die in a facility or at home, according to Stephanie Buhle, a spokeswoman for the city's Department of Health and Mental Hygiene said.\nPeople who have passed away at home and likely had the disease but didn't have a positive coronavirus test could be added to the reports.\n\"The Office of the Chief Medical Examiner is sending us reports of \"probable\" Covid-19 cases,\" Buhle said. \"We're working together to include these cases in future reports.\"\nRecent developments\n• The director of the Centers for Disease Control and Prevention told an Arizona radio station that more people are engaging in social distancing and that means the final death toll from the virus could be much lower than had been modeled.\n• Rhode Island Gov. Gina Raimondo told residents to keep a log of the people they have had contact with in recent days. \"The discussion we are having now is that we are not going to let folks get testing unless they show up with a contact notebook. I am not announcing that today, I want you to know how serious this is,\" she said.\n• New Jersey, the state with the second most reported cases (more than 41,000), will close all state parks and forests and county parks to \"further social distancing,\" Gov. Phil Murphy said\n• Major League Baseball says it is trying to work through plans to get back to playing, including possibly having games at a central location , once the coronavirus pandemic has improved.\n• Wisconsin is holding its primary election Tuesday despite the pandemic. The US Supreme Court allowed the vote, but a dissenting Justice Ruth Bader Ginsburg said the decision \" boggles the mind.\n• Adams, the surgeon general, told NBC's \"Today\" show that Wisconsin voters should maintain distances of 6 feet from others and wear face coverings as they go to the polls.\n• White House trade adviser Peter Navarro warned the White House in January of a \"full-blown pandemic, imperiling the lives of millions of Americans\" from the coronavirus, The New York Times reports.\n• Michigan's largest health care system, Beaumont Health, has a bout 1,500 of its more than 38,000 employees staying home with symptoms consistent with Covid-19, spokesman Mark Geary said.\n• Delta Air Lines is donating 200,000 pounds of food that would have expired to medical facilities and food banks, the company said.\nBack to class?\nMany parents have already written off the thought of their child or children going back to school before fall. Dr. Anthony Fauci said that while it is still too early to know, he is optimistic the country will be in good shape come next school year.\n\"I fully expect, though I'm humble enough to know that I can't accurately predict that by the time we get to the fall that we will have this under control enough, that it certainly will not be the way it is now where people are shutting schools,\" he told reporters at the White House.\nFauci, the director of the National Institute of Allergy and Infectious Diseases, said he has a daughter who is a school teacher and she is wondering when the kids can go back.\nThe doctor said it depends on how soon we get to the downside of the curve and the development of things like how we better identify people who have the disease and what the data from antibody tests reveals in how far and how much coronavirus got into communities.\nKnowing who is protected and who is vulnerable will help communities make decisions about using classrooms again.\n\"My optimistic side tells me that we'll be able to renew to a certain extent but it's going to be different. Remember now, because this (disease) is not going to disappear,\" he said.\nVirus hits African American communities\nAs states employ more tests to identify carriers of the virus, data has begun to show African Americans make up a large number of victims in the country.\nIn Chicago, 72% of the people who have died from coronavirus are black, though they make up 30% of the population, officials said.\nIn Louisiana, where nearly 33% of the population is African American, those residents account for 70% of the state's coronavirus deaths.\nDr. Celine Gounder, a CNN medical analyst and clinical assistant professor of infectious diseases, on Tuesday offered possible reasons for this, including:\n• African Americans may be disproportionately likely to work in essential jobs that can't be done at home, such as grocery jobs.\n• African Americans are disproportionately likely to have underlying health conditions that would make someone more likely to have severe Covid-19 illnesses.\nAdams, the surgeon general, made similar arguments to \"CBS This Morning.\"\n\"When you look at being black in America, No. 1, people unfortunately are more likely to be of low socioeconomic status, which makes it harder to social distance. No. 2, we know that blacks are more likely to have diabetes, heart disease, lung disease,\" Adams told CBS.\n\"I and many black Americans are at higher risk for Covid. It's why we need everyone to do their part to slow the spread.\"", "url": "https://www.cnn.com/2020/04/07/health/us-coronavirus-tuesday/index.html"}