{"authors": ["Rachel La Corte"], "date_download": "2020-05-04 20:05:29", "date_modify": "2020-05-04 20:05:29", "date_publish": "2020-04-09 19:00:21", "description": "OLYMPIA, Wash. (AP) — More than 170,000 people filed new claims for unemployment benefits in Washington last week, bringing the total number of initial claims filed in the state to nearly half a...", "filename": "_1b8b7185df4a9369f2f7a850f3f80758_1588622729.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_1b8b7185df4a9369f2f7a850f3f80758_1588622729.html", "title": "Surge in unemployment benefit claims continues in Washington", "title_page": "Surge in unemployment benefit claims continues in Washington", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "OLYMPIA, Wash. (AP) — More than 170,000 people filed new claims for unemployment benefits in Washington last week, bringing the total number of initial claims filed in the state to nearly half a million since mid-March, when businesses started closing or limiting operations due to the coronavirus outbreak.\nEmployment Security Department Commissioner Suzi LeVine said Thursday that while claim numbers for the week of March 29-April 4 were down slightly from the previous week, she said she expected claims to surge again in the coming weeks as previously ineligible employees — like independent contractors and part-time employees who work fewer than 680 hours — can start applying for benefits under the expansion of unemployment benefits passed by Congress.\n“Think of this leveling off as the water receding slightly prior to a tsunami,” she said.\nThe state has been working to update their system by April 18 to begin receiving and processing applications at that time from the newly eligible workers.\n“We are preparing for hundreds of thousands, but we don’t know exactly how many people may avail themselves of it,” she said.\nLeVine said that by the end of next week, the agency will have nearly 500 customer service agents — up from 300 — available to help through phone lines or virtual chat, and they plan to double that number the following week. She said that $150 million in benefits have been paid out in the state since mid-March.\nBut she encouraged people to first go to the agency’s website , in order to use the online eligibility checker and checklist.\n“We know that the initial implementation of this new federal program will be a little clunky,” she said. “The primary goal right now is to get more people their money and to get it to them faster.”\nThe federal economic rescue package also added $600 a week in jobless aid, on top of what recipients receive from their states and extends 13 additional weeks of benefits beyond the six months of jobless aid that most states offer. In Washington state, where the maximum weekly benefit is $790 a week, the additional money will start being paid out after April 18, but will be paid retroactive back to March 29, officials said.\nWashington Gov. Jay Inslee last week extended the state’s a stay-at-home order through May 4, saying that social distancing measures must stay in place an additional month in order to minimize the spread of COVID-19.\nIn the past three weeks, 16.8 million Americans nationwide have filed for unemployment aid due to the economic impacts of the coronavirus.", "url": "https://apnews.com/1b8b7185df4a9369f2f7a850f3f80758"}