{"authors": ["Opinion Sujit Sharma", "Ann Chahroudi", "Gregory Sysyn"], "date_download": "2020-05-04 16:17:52", "date_modify": "2020-05-04 16:17:52", "date_publish": "2020-04-04 02:06:59", "description": "These two back-to-back ice storms in 2014 led to more than seven days of emergency declarations, and effectively kept people in their homes. In the hospitals where we were working, we noted what appeared to be a shortening of the flu season following the snowstorm and the subsequent shutdown.", "filename": "2020_04_03_opinions_social-_93ceb419c745822a4633342444656c2e_index_1588609072.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/140129103843-aerials-of-atlanta-ice-and-snow-road-conditions-00000430-story-top.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_opinions_social-_93ceb419c745822a4633342444656c2e_index_1588609072.html", "title": "What Atlanta's snowmageddon teaches us about social distancing", "title_page": "What Atlanta's snowmageddon teaches us about social distancing (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Dr. Sujit Sharma is a pediatric emergency medicine physician with Pediatric Emergency Medicine Associates in Atlanta, Georgia. Dr. Ann Chahroudi is an associate professor and associate division chief for Basic/Translational Research, Division of Infectious Diseases in the Department of Pediatrics, Emory University School of Medicine. Dr. Gregory Sysyn is an intensive care physician with Pediatrix Medical Group, in Atlanta, Georgia. The views expressed in this commentary belong to the authors. View more opinion at CNN.\n(CNN) On Wednesday, Georgia Gov. Brian Kemp announced a state-wide order to shelter in place. While some skeptics remain unconvinced that this is the right move, two 2014 snowstorms in Georgia may prove otherwise.\nAs physicians in Atlanta, Georgia, we are encouraged to see the number of people who appear to be taking the call for social distancing seriously. However, some states have yet to fall in line , and with no contemporary precedent for the pandemic here in the US, there are still plenty of those who question the effectiveness of widespread isolation and distancing.\nIn 2014, Winter Storm Leon kicked off a real-world social distancing experiment here in Georgia. While northern transplants may poke fun at how southerners respond to half an inch of snow, the ice and snowstorms that year were no joke . Thousands of commuters abandoned their vehicles on highways and side roads due to massive gridlock — and people spent the night sleeping in the aisles of grocery and convenience stores. Once they were able to make it to their homes, the only real option became clear — shelter-in-place.\nLess than two weeks later, another storm hit. These two back-to-back ice storms, starting at the end of January, led to more than seven days of emergency declarations by then-Gov. Nathan Deal, and effectively kept people in their homes, in the hopes of avoiding the catastrophic experience of day one. Offices were closed, and schools were shut; the conditions were like what millions of us are experiencing right now. Frozen roads made even trips to the grocery store or pharmacy a challenge, unless people were able to make it on foot in the hopes that the stores were open.\nWhat does this have to do with our current situation with the novel coronavirus?\nIn the hospitals where we were working, we noted what appeared to be a shortening of the flu season following the snowstorms and the subsequent shutdowns. By reviewing 10 years of publicly available surveillance information from the Centers for Disease Control and Prevention , we wanted to see whether the data supported our suspicions: that involuntary (and widespread) social distancing for metro Atlanta in 2014 could impact the burden of flu illnesses that year in our region.\nWhile the typical flu season is known to last about four to five months with 20-30% positive influenza tests at peak, the state of Georgia dropped to less than 5% positive tests — typically only seen at the very beginning or end of influenza seasons — in the first half of March, more than two months ahead of the national trend. In other words, we saw a substantial shortening of the flu season in Georgia compared to both the national trend in 2014, and the otherwise natural pattern of flu spreading throughout our large metropolitan area in other years.\nNow, before we interpret this as saying that widespread isolation for just seven days should then be enough to make an impact on the spread of coronavirus, we should consider a couple of differences between influenza and coronavirus. Specifically, seasonal flu is not nearly as infectious nor as deadly as what we appear to be seeing with Covid-19. A study of Chinese patients indicates the coronavirus is about twice as infectious as seasonal flu. The fatality rate of Covid-19 in Georgia, while likely to be inflated due to low testing rates, stands at approximately 3% — 30 times greater the 0.1% fatality rate for seasonal flu.\nWhile it is too soon to assess the effectiveness of shelter-in-place guidelines in Georgia, Dr. Anthony Fauci, a member of the White House coronavirus task force and the director of the National Institute of Allergy and Infectious Diseases, believes this may be the best line of defense that we have. Speaking broadly about the effects across the country, Fauci told CNN's Jim Sciutto , \"We're [even] starting to see glimmers that that is actually having some dampening effect.\"\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\nAlthough we can't use the 2014 storms as a direct comparison to where we are today, it does give a sense of optimism that somewhat extreme isolation and distancing strategies will work. In the end, knowingly or not, more than 6 million people across the Atlanta metropolitan area participated in a practice run for social distancing.\nThe lesson is clear: The more we can adhere to social distancing in this time of crisis, the less time we'll need to keep doing so — and the sooner we can return to a semblance of normalcy.", "url": "https://www.cnn.com/2020/04/03/opinions/social-distancing-atlanta-covid-19-sharma-chahroudi-synyn/index.html"}