{"authors": [], "date_download": "2020-05-04 20:07:49", "date_modify": "2020-05-04 20:07:49", "date_publish": "2020-04-16 21:14:18", "description": "IOWA CITY, Iowa (AP) — An Iowa lawmaker wants to persuade younger people to sign up to be election workers because the retirees who typically staff the polls are more at risk of complications if...", "filename": "_782610a602cf49054b7644716f32aa4a_1588622869.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_782610a602cf49054b7644716f32aa4a_1588622869.html", "title": "Younger people urged to work polls in Iowa because of virus", "title_page": "Younger people urged to work polls in Iowa because of virus", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "IOWA CITY, Iowa (AP) — An Iowa lawmaker wants to persuade younger people to sign up to be election workers because the retirees who typically staff the polls are more at risk of complications if they contract the conronavirus.\nState Sen. Zach Wahls, a Coralville Democrat, said his “strong preference” is that people vote by mail in the June 2 primary. But he said that “obviously there are people who will want to vote in person,” the Iowa City Press-Citizen reports.\nHe said he is signing up to work the polls — something he is allowed to do because he’s not on the ballot — and is hoping his peers will, too.\n“In order for our democracy to happen, we need young people who aren’t at elevated risk to come forward and be part of this process,” Wahls said.\nWahls encouraged businesses to give employees who offer to serve as election workers the day off. Johnson County poll workers earn $15 an hour, with overtime after 8 hours in a day.\nOther efforts are in the works to keep polls safe, including providing polling locations with tape-measurers and tape to create social distancing floor markings for the voter lines.", "url": "https://apnews.com/782610a602cf49054b7644716f32aa4a"}