{"authors": ["Martine Orange", "Mike Davis", "Liza Featherstone", "Peter Frase", "Seth Ackerman", "Chris Maisano", "Jedediah Britton-Purdy", "David Broder", "Dawn Foster"], "date_download": "2020-05-04 19:58:26", "date_modify": "2020-05-04 19:58:26", "date_publish": "2020-03-13 00:00:00", "description": null, "filename": "2020_03_european-central-bank-ecb-coronavirus-stock-markets_1588622306.html", "image_url": "https://images.jacobinmag.com/wp-content/uploads/2020/03/13213838/25122632374_e30a4b9302_b.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/jacobinmag.com/2020_03_european-central-bank-ecb-coronavirus-stock-markets_1588622306.html", "title": "Europe Is Saving the Financial Markets, But Not Coronavirus Victims", "title_page": "Europe Is Saving the Financial Markets, But Not Coronavirus Victims", "title_rss": "NULL", "source_domain": "jacobinmag.com", "maintext": "Our spring issue, “Pandemic Politics,” is on its way from the printer and will be released soon. Get a discounted subscription today !\nOn Thursday, March 12, the coronavirus outbreak in Europe reached a fresh milestone, with the one-thousandth death in Italy — today the country with the most new cases. This is the latest indicator of the depth of the crisis, which has also brought a far-reaching shutdown of the Italian economy. This is anything but a purely domestic issue — and other European states look to be headed in the same direction. In a press release on Tuesday, focused on the economic fallout of the crisis, the European Commission noted in dry bureaucratese that “Coronavirus has a very significant human dimension.” Yet as Martine Orange writes for Mediapart , European authorities have narrowly focused on steadying the financial markets — while doing nothing to show that “European solidarity” extends to the population itself.\nThe ECB Has the Wrong Priorities A lot of generals have the habit of refighting the last war. And faced with the coronavirus, political and monetary authorities give the impression that they’re falling into the same trap. In their minds, they’re dealing with a financial crisis comparable to 2008, when what we’re really going through is an unprecedented public health crisis, hitting the heart of the real economy. And neither public health nor the real economy needs the same responses as the markets do. You wouldn’t know as much from the actions of the political and monetary authorities. For weeks they have concentrated all their attention on the financial markets. It’s true, there’s been an impressive collapse. Twice in one week, the circuit breakers were pulled out to try to prevent the stock exchanges tumbling spectacularly as soon as they opened. But to no avail. On Thursday, the Paris, Frankfurt, London, Milan, and New York stock exchanges lost between 10 and 16 percent of their value — Wall Street’s worst day of trading since 1987, when it plunged by 26 percent. If this isn’t a crash, it’s beginning to look awfully like one. Since February 20, when the financial world woke up to the dangers of COVID-19, the various markets have lost between 26 and 35 percent; more than $9 trillion has been wiped off their value. Nothing has been spared in trying to save the stock markets from collapse and restore confidence among financiers. Already last week the Fed pulled out its monetary weapon and reduced its benchmark rate by 0.5 percent. In a further bid to reassure finance, it pumped vastly increased liquidity into the money (repo) market, which has shown growing signs of difficulty ever since September. The Fed has increased its liquidity injections from $100 billion to over $150 billion a day. Immediately after this, the Bank of Japan announced that it would also resume its quantitative easing policy and start buying up bond securities on the markets. The Bank of England followed suit, cutting its base rate by 0.5 percent on March 11. In such a climate, there was a lot of expectation surrounding the European Central Bank’s decision this Thursday, March 12. This was, indeed, considered something of a baptism of fire for Christine Lagarde, who became the ECB president in November. She unleashed the monetary “bazooka” that everyone had been expecting. While the ECB did not change its (already negative) benchmark rate of minus 0.5 percent, it was ready to use all the other tools available to it. Its bond purchase policy (i.e., quantitative easing), previously amounting to €20 billion a month, will be increased by a further €120 billion by the end of 2020. Banks, which already enjoy exceptional refinancing conditions, will be further aided through the TLTRO III (targeted longer-term refinancing operations) program, in order to provide the financial system with unlimited liquidity. Thanks to these exceptional circumstances, the world of finance has finally got what it’s long been asking for. The prudential and regulatory constraints which had been put in place after the 2008 crisis are now going to be loosened, in order to encourage the banks to lend. Seeking to boost the impact of these measures, Christine Lagarde called on governments to implement an “ambitious and coordinated fiscal policy response.” Sensitive to criticisms regarding the failure of their policy after the 2008 financial crisis and the subsequent eurozone crisis, Europe’s officials have collectively promised they won’t repeat the same mistakes. This time, they said, they were all ready to act together, to use “all possible tools” to deal with the epidemic and the economic collapse which it risks prompting. In Europe, then, monetary policy and budget policy are going to march hand in hand. This coming Monday, Europe’s finance ministers are set to outline a common approach to countering the damage caused by the coronavirus epidemic. Even before this meeting, on March 11 Angela Merkel announced her intention to review Germany’s zero-deficit rule, engraved in marble in its constitution and considered one of the main obstacles to a European fiscal stimulus. “We will put in the money necessary to fight the epidemic, and we’ll look at the deficit afterward,” the German chancellor indicated. All this ought to have pleased or at least reassured financial circles, restoring confidence. Yet after the ECB announcements, the European markets — the only ones open at the time — in fact fell further. It was just like what happened when the Fed lowered its rates last week or when the Bank of England did so on Wednesday. The German DAX index, which had already been well down, lost more than 2 percent within a few minutes of the ECB announcements. Some analysts explained these reactions by noting that the ECB’s interventions were considered insufficient. Others explained that central bankers’ actions were feeding investors’ worries, already heightened by the decisions taken by Donald Trump. But the malaise doubtless goes rather deeper. For many have come to recognize that having been the world’s great order-givers for over four decades, central banks are today powerless faced with coronavirus. They cannot respond to this any more than five-year stimulus plans or tax breaks for business can resolve the paralysis that has taken over the world economy.\nThe Need for Public Policy Reminding us that macroeconomic policy can’t do everything, the economist Barry Eichengreen explained: monetary policy can’t mend broken supply chains. . . . Fed Chair Jerome Powell can’t reopen factories shuttered by quarantine . . . monetary policy will not get shoppers back to the malls or travelers back onto airplanes, insofar as their concerns center on safety, not cost. Rate cuts can’t hurt, given that inflation, already subdued, is headed downward; but not much real economic stimulus should be expected of them. The same is true, unfortunately, of fiscal policy. Tax credits won’t get production restarted when firms are preoccupied by their workers’ health and the risk of spreading disease. Payroll-tax cuts won’t boost discretionary spending when consumers are worried about the safety of their favorite fast-food chain. Eichengreen is very much a liberal. But this academic, like many economists (for instance those at the Bruegel think tank), recognizes that the priority is to free up all possible means to treat the ill, hold back the epidemic, and support health systems. In a word, the priority is public policies oriented toward health care, and to make the state take suitable action. For them, this is the only appropriate response in the immediate. After all, the more the epidemic spreads, the longer it will last, and the more the world economy will be damaged. But given that the coronavirus has already spread across Western countries, the most striking thing has been the public authorities’ lack of response. Doubtless, this is what is making the financial world panic: the mounting paralysis of all activity, the lack of sufficient state responses, and the risk that this will prompt a general collapse — all the more violent and devastating given that the system has built up mountains of debts (and other ills) over the last decade. Except for Italy — which has accepted that it has to endanger its economy in order to contain the epidemic — European leaders’ main concern has been to keep up economic activity, to support businesses, to ensure everything continues like before — and not to prepare the necessary means for dealing with this public health crisis. Except for Italy — which has directed several billion euros toward fighting the epidemic, buying medicine and materials, and recruiting care staff — the other European states have announced nothing. Showing its oh-so-great sense of responsibility, the European Commission announced on March 7 that it would take an “understanding” approach toward Italy, even if it did not entirely respect its budget deficit targets. This once again showed the Commission’s dogmatism — and its inability to identify what the real priorities are. In this COVID-19 crisis European solidarity has once again shown its true colors. Far from bringing aid to Italy in this unprecedented crisis, everyone has preferred to keep their medicine and material to themselves (countries including France and Germany have banned the export of masks). It is China — not Italy’s European partners — which has provided the country with respirators, medication, and other aid.", "url": "https://www.jacobinmag.com/2020/03/european-central-bank-ecb-coronavirus-stock-markets"}