{"authors": ["John Seewer"], "date_download": "2020-05-04 21:06:22", "date_modify": "2020-05-04 21:06:22", "date_publish": "2020-04-16 18:32:42", "description": "TOLEDO, Ohio (AP) — Carmen Williamson, who in the 1940s and ’50s was a top U.S. amateur boxer and then in 1984 became the first black boxing referee and judge at the Olympic games, has died. He...", "filename": "_afebc0e7a4736ef5029652075b4c5e08_1588626382.html", "image_url": "https://storage.googleapis.com/afs-prod/media/87e91fc4089046f890344461ca815a6f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_afebc0e7a4736ef5029652075b4c5e08_1588626382.html", "title": "Pioneering boxing ref dies, sport's 1st black Olympic judge", "title_page": "Pioneering boxing ref dies, sport's 1st black Olympic judge", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "In this July 20, 2012 file photo, Carmen Williamson, the first black boxing referee and judge at an Olympic games, poses with his honorary gold medal in his hometown of Toledo, Ohio. Family members say Williamson died from COVID-19 complications on April 8, 2020 at a hospital in Toledo. (Zack Conkle/The Blade via AP)\nIn this July 20, 2012 file photo, Carmen Williamson, the first black boxing referee and judge at an Olympic games, poses with his honorary gold medal in his hometown of Toledo, Ohio. Family members say Williamson died from COVID-19 complications on April 8, 2020 at a hospital in Toledo. (Zack Conkle/The Blade via AP)\nTOLEDO, Ohio (AP) — Carmen Williamson, who in the 1940s and ’50s was a top U.S. amateur boxer and then in 1984 became the first black boxing referee and judge at the Olympic games, has died. He was 94.\nWilliamson died of COVID-19 complications on April 8 at a hospital in Toledo, one of his daughters said Thursday. He was just three weeks away from receiving his college degree from the University of Toledo — a pursuit he began nearly 20 years ago, she said.\n“He loved education, the process, the classes,” said Celia Williamson, the youngest of his four surviving daughters. “He sat in the front row and would always arrive early.”\nIn addition to refereeing, he traveled the world in the 1980s, teaching the sport to young people, using a training program he had developed, she said.\n“He would take assignments in dark, warn-torn countries where white trainers wouldn’t go, like Sierra Leone,” Celia Williamson said. “He wanted to teach. It gave you something positive to do through exercise and discipline. He wanted young men around the world to stand honorably.”\nWilliamson didn’t talk much about his boxing career, she said, and years passed before she and her sisters found out that he had been awarded an honorary gold medal after officiating at the 1984 Olympics in Los Angeles.\nThey did, though, see photos of him with boxing royalty, including Muhammad Ali, Evander Holyfield and Sugar Ray Leonard.\nWilliamson, who lived in Toledo nearly all of his life, fought as a featherweight and finished with a record of 250-14. He served in the Navy and worked more than 40 years at the Army’s automotive tank division in Warren, Michigan.\nDuring his retirement, he began taking college classes and it wasn’t until just recently that he realized he was close enough to get a liberal studies degree.\nHe was taking three classes this semester when he was diagnosed with the coronavirus, his daughter said. University of Toledo officials will ask the school’s trustees to award his degree posthumously.\n“That’s the one thing he didn’t have,” his daughter said.", "url": "https://apnews.com/afebc0e7a4736ef5029652075b4c5e08"}