{"authors": [], "date_download": "2020-05-04 16:16:33", "date_modify": "2020-05-04 16:16:33", "date_publish": "2020-04-03 19:28:46", "description": null, "filename": "2020_04_03_cnn-underscored__cb5cd13268f9ba155d23e2142a70bf52_index_1588608993.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200313132112-homeworkoutlead-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_cnn-underscored__cb5cd13268f9ba155d23e2142a70bf52_index_1588608993.html", "title": "Upgrade your home workout with this top-rated fitness gear", "title_page": "Upgrade your home workout with this top-rated fitness gear - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "While the past few weeks have seen us all start to continuously sanitize everything we come into contact with, as well as wash our hands for at least 20 seconds, the most recent effort to stop the spread of coronavirus has involved companies asking their employees to work from home, as well as cities encouraging people to stay home as much as possible.\nWhether this has affected you personally yet or not, people who regularly hit the gym are starting to think: Well, what now? How are we supposed to get in the workouts we're used to without going to the gym?\nThankfully there are plenty of workout products that you can order to your front door to make the next few weeks as active as humanly possible. The problem with buying at-home equipment online, however, is that it can be difficult to judge what is actually worth it. Even if it's something as simple as a yoga mat or a resistance band, it can take time to find the right one for you.\nSo, to help, we rounded up some of the highest-rated home workout items around. If you're someone who loves the idea of keeping active during this time, these picks are for you.\nBest home workout equipment\nLetsfit Resistance Loop Bands (starting at $10.90; amazon.com)\nLetsfit Resistance Loop Bands\nNot only can these super-light bands be used to build muscle on your arms or legs via resistance, but they're ideal for stretching, too. Have a trip coming up? These won't add more than a few ounces to your carry-on. And if you are tempted to binge-watch a whole season on Netflix, put these on and work out at the same time.\n_______________________________________________________________________________\nSynergee Core Sliders ($9.95, originally $29.95; amazon.com)\nSynergee Core Sliders\nOnce you've progressed from newbie to experienced workout enthusiast, you'll need to elevate your workouts so your progress doesn't stagnate. One easy and effective way to add more difficulty is through sliders. Pint-sized and lightweight, they force you to engage your core in a different way. Whether you place them under your feet or hands during burpees, pushups or other moves, you'll feel the burn.\n_______________________________________________________________________________\nStamina WIRK Under Desk Exercise Bike ($129.99, originally $179.99; dickssportinggoods.com)\nStamina WIRK Under Desk Exercise Bike\nIf you're a remote worker, you know how difficult it can be to get your daily steps, since so much of your routine involves sitting at a desk. To ensure you stay active, consider this highly rated Under Desk Exercise Bike. As you go through emails, choose from eight resistance settings and pedal, pedal, pedal!\n_______________________________________________________________________________\nPerfect Fitness Perfect Pushup Elite ($27.39; amazon.com)\nPerfect Fitness Perfect Pushup Elite\nIf this is the year you want to finally perfect your pushup, these handles are a must. While encouraging proper form, these force your body to engage every muscle involved in the workout move — from your shoulders to your lower abs. If you struggle with any sort of hand or wrist discomfort, the ergonomic grips also help reduce pressure.\n_______________________________________________________________________________\nCanDo Vinyl Coated Dumbbell 10-Piece Set with Floor Rack ($138.99; overstock.com)\nCanDo Vinyl Coated Dumbbell 10-Piece Set with Floor Rack\nWhile you would love to have a whole extra room for your home gym, your current pad may not have the space. To the rescue is this small yet mighty set of dumbbells that are compact and versatile.\n_______________________________________________________________________________\nArboleaf Digital Scale ($39.99, originally $50.95; amazon.com)\nArboleaf Digital Scale\nSmart scales use a low-level electrical signal called BIA to measure more than just weight. Although they're not recommended for pregnant women, young children, or people who have pacemakers or some other medical devices due to this, they can help track your body fat and body water levels. This scale in particular is nice because it pairs with numerous third party apps like Fitbit, Apple Health and Google Fit. If you want to learn more about smart scales, check out our favorites here.\n_______________________________________________________________________________\nXterra Fitness Folding Exercise Bike ($129.99, originally $179.99; amazon.com)\nXterra Fitness Folding Exercise Bike\nIf your budget doesn't quite allow for a Peloton bike, but you still love to spin, consider this budget option. It comes with hundreds of five-star reviews and is beloved for its ability to fold up, making it ideal for an apartment or small living area. Though it won't break the bank, it has everything you want from an at-home exercise bike, including resistance levels, adjustable seats and a quiet, smooth ride.\n_______________________________________________________________________________\nTriggerPoint GRID Foam Roller ($31.39; amazon.com)\nTriggerPoint GRID Foam Roller\nAsk any fitness professional and they'll speak volumes about the importance of stretching before and after workouts. Foam rolling is an effective way to ensure your muscles receive the TLC they need. With this multidimensional surface, your body can experience improved oxygen flow and faster healing within your tissues, encouraging circulation, balance, mobility and flexibility.\n_______________________________________________________________________________\nAmazonBasics Medicine Ball, 12 pounds ($36.99; amazon.com)\nAmazonBasics Medicine Ball\nWith a textured finish that's easy to grip and a rubber design so you can bounce the ball off hard surfaces, this medicine ball is a super versatile workout tool. It's small and compact, and you can do all sorts of upper body exercises. This ball comes in 7 different sizes, ranging from 4 to 20 pounds.\n_______________________________________________________________________________\nGaiam Yoga Mat ($23.99, originally $29.98; amazon.com)\nGaiam Yoga Mat\nNo matter if you're a yogi at heart or simply enjoy the stretch that various poses provide, a yoga mat is a must for at-home workouts. In addition to getting you through a sweaty vinyasa flow, this option from the leader Gaiam also serves as a soft, cushion-y surface for burpees, squats, pushups and more.\n_______________________________________________________________________________\nNordic Track NTL17915 t 6.5 S Treadmill ($599; amazon.com)\nNordic Track NTL17915 t 6.5 S Treadmill\nSure, it's pricey. But if you happen to live in a region of the country that makes it difficult to run outdoors — or even walk — during the winter, it's worth the investment. It's more compact than other options and allows runners to choose from studio workout programs led by trainers. You can also go at your speed and set your own goals.\n_______________________________________________________________________________\nNike Free RN 5.0 ($49.97, originally $100; nike.com)\nNike Free RN 5.0\nNike's Free RN series is one of the best all around exercise shoes due to its lightweight yet supportive build. Your feet can really take a beating when working out inside, especially if you have hardwood floors. So make sure you have some appropriate footwear before you start breaking a sweat. Tip: Leave these bad boys inside so you don't track in any dirt.\n_______________________________________________________________________________\nTrideer Exercise Ball (starting at $13.99; amazon.com)\nTrideer Exercise Ball\nA lot of folks lack ample room for gym products in their homes, so any piece of multipurpose gear is appreciated. Enter: an exercise ball that can be used for — you guessed it — fitness, but also posture. When you sit on this inflatable ball while watching TV or working from home, you can experience less back pain and grow a stronger core.\n_______________________________________________________________________________\nGlofit Freedom Workout Gloves (starting at $17.99; amazon.com)\nGlofit FREEDOM Workout Gloves\nProtect your hands from your new brutal at-home workouts with these workout gloves. With a perforated, micro-fiber design, these gloves stay breathable so your hands won't feel hot and sweaty. Plus, they feature a cushioned pad with anti-slip points on the palms, so you can hold on longer and get stronger.\n_______________________________________________________________________________\nBosu Balance Trainer ($99.99; walmart.com)\nBosu Balance Trainer\nWith a major Instagram and YouTube following, Bosu has created much chatter around stability and balance. With this one piece of gym equipment providing an unstable surface, you can work up your heart rate, strengthen your overall muscle tone and build your endurance.\n_______________________________________________________________________________\nDegol Skipping Rope ($11.89; amazon.com)\nDegol Skipping Rope\nRemember those childhood afternoons playing hopscotch, racing each other across the playground and trying your luck at double Dutch? Have a throwback-inspired workout with this jump rope. Though you probably didn't realize as a kid that you were working up quite a sweat and burning mega calories, this simple move is effective and, well, easy! With 6-inch memory foam handles, work your way up to 1,000 jumps.\n_______________________________________________________________________________\nThe Step Original Circuit Size Aerobic Platform ($42.47; walmart.com)\nThe Step Original Circuit Size Aerobic Platform\nYou may have visions of Jane Fonda or Richard Simmons circa the '80s when you see a step — but don't forget there's a reason they were so popular. Simply stepping up and down works your lower body and your abs and builds your cardio health. This at-home step supports up to 275 pounds and can be adjusted from 4 to 8 inches, depending on your fitness level and height.\n_______________________________________________________________________________\nTRX All-in-One Suspension Training ($144.95; amazon.com)\nTRX All-in-One Suspension Training\nFrom the upper to the lower body, suspension training is not only an effective way to meet strength goals, but it's fun. After all, you're using your body weight to move through various moves including pulls, planks and beyond. Be sure to read the instructions carefully when assembling this all-in-one set at home.\n_______________________________________________________________________________\nReehut Durable Ankle/Wrist Weights (starting at $10.99; amazon.com)\nREEHUT Durable Ankle/Wrist Weights\nIf you really want to take your in-home workouts to the next level, try out these weights you can wrap around your ankles or wrists. Strap them onto your ankles and jump roping, jogging and biking gets way harder. Or, attach them to your wrists for more intense crunches and upper body workouts. Choose from six weights from 1 to 10 pounds and kick your workout up a notch.\n_______________________________________________________________________________\nPure Fitness Adjustable Weight Bench ($139.99; bedbathandbeyond.com)\nPure Fitness Adjustable Weight Bench\nThere are endless calorie-burning and strength-building exercises you can do on a fitness bench, from chest presses to tricep dips and beyond. If you don't have a ton of room, consider this popular option, which offers two adjustable positions so you can get in a sweat sesh at 90 or 180 degrees.\n_______________________________________________________________________________\nStamina 36-inch Folding Trampoline ($47.88, originally $69.99; amazon.com)\nStamina 36-inch Folding Trampoline\nTrampoline workout classes are trendy, but the act of jumping? You probably haven't bounced since you were in kindergarten. This foldable trampoline is ideal for indoor or outdoor use, and can hold up to 250 pounds. It also comes with a safety pad to keep the base in place so you can burn calories, sans worry.\n_______________________________________________________________________________\nSonic Handheld Percussion Massage Gun ($174.99; amazon.com)\nSonic Handheld Percussion Massage Gun\nAfter a tough boot camp, your joints may need a jolt to disengage and relax. This percussion massage gun is exactly what its name suggests: a targeted way to relieve pressure and stimulate relaxation, exactly where you need it. Start at a low speed and drive up the intensity as you become more comfortable with the sensation.\n_______________________________________________________________________________\nStamina X Adjustable Kettle Versa-Bell ($137.23; walmart.com)\nStamina X Adjustable Kettle Versa-Bell\nIf you don't want dumbbells, kettlebells provide a wide variety of full body workouts as well. And this set touts adjustable technology, allowing you to go from 16 to 36 pounds in a second.\n_______________________________________________________________________________\nIgnite By Spri Pull Up Bar ($24.99; target.com)\nIgnite By Spri Pull Up Bar\nIf one of your all-time fitness goals is to be able to do a dozen chin-ups or pull-ups, it's time to bring a bar into your home. And nope, not the one that serves cocktails, but this highly rated product that features steel, foam and grips. It not only protects your door frames but it can support up to 300 pounds, just make sure your frame measures less than 32 inches wide to ensure a secure fit.\n_______________________________________________________________________________\nPerfect Fitness Ab Carver Roller ($26.99, originally $29.99; walmart.com)\nPerfect Fitness Ab Carver Roller\nAb rollers aren't exactly a new invention, but they are an effective way to build core strength. This option has adjustable resistance levels so you can customize your workout's intensity between easy, medium and hard.\n_______________________________________________________________________________\nNote: The prices above reflect the retailer's listed price at the time of publication.", "url": "https://www.cnn.com/2020/04/03/cnn-underscored/best-home-workout-equipment-outbrain-2/index.html"}