{"authors": ["Manu Raju", "Senior Congressional Correspondent"], "date_download": "2020-05-04 16:56:29", "date_modify": "2020-05-04 16:56:29", "date_publish": "2020-04-09 02:31:10", "description": "Rep. Diana DeGette, a veteran Democrat, said that President Donald Trump's announcement that he would send 100 ventilators to Colorado smacks of a political favor to vulnerable GOP Sen. Cory Gardner after the federal government had not fulfilled the delegation's request for the devices.", "filename": "2020_04_08_politics_degette-gardner-trump-ventilators-favor_index_1588611389.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/130404134144-degette-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_08_politics_degette-gardner-trump-ventilators-favor_index_1588611389.html", "title": "Colorado Democrat believes Trump awarded ventilators as political favor to vulnerable GOP senator", "title_page": "Colorado Democrat believes Trump awarded ventilators as political favor to vulnerable GOP senator - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Rep. Diana DeGette, a veteran Democrat, said that President Donald Trump's announcement that he would send 100 ventilators to Colorado smacks of a political favor to vulnerable GOP Sen. Cory Gardner after the federal government had not fulfilled the delegation's request for the devices.\n\"I think this thing that happened with Sen. Gardner and President Trump is very disturbing,\" the Colorado Democrat told CNN Wednesday evening. \"What is the process here?\"\nDeGette said that while she wants the state to get every ventilator it can -- after initially requesting 10,000 -- the process employed by the White House shows that the President appears to be doling out the ventilators to his allies at a time when the virus is affecting people of all political persuasions.\n\"It seems that way to me,\" DeGette said when asked if it appeared to be a political favor to Gardner. \"I was totally outraged.\"\nDeGette said that the decision to award 100 ventilators followed a tortured process after the state's delegation and Democratic Gov. Jared Polis had been asking for 10,000 ventilators.\nRead More", "url": "https://www.cnn.com/2020/04/08/politics/degette-gardner-trump-ventilators-favor/index.html"}