{"authors": ["Se Cupp"], "date_download": "2020-05-04 16:08:51", "date_modify": "2020-05-04 16:08:51", "date_publish": "2020-04-02 11:30:20", "description": "It seems like the rule about not making big decisions while hormonal and pregnant probably applies during the emotionally charged and mentally fraught time of coronavirus, writes SE Cupp. But she's been thinking...", "filename": "2020_04_02_opinions_in-pandemic-to-baby-or-not-to-baby-cupp_index_1588608531.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/130304140504-generic-nursery-babies-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_opinions_in-pandemic-to-baby-or-not-to-baby-cupp_index_1588608531.html", "title": "In a pandemic, to baby or not to baby?", "title_page": "In a pandemic, to baby or not to baby? (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "SE Cupp is a CNN political commentator and the host of \" SE Cupp Unfiltered .\" The views expressed in this commentary are solely hers. View more opinion articles on CNN.\n(CNN) \"There's never a good time to start a family,\" as the saying goes.\nIt's meant to reassure anxious would-be parents that there's rarely a feeling of confident preparedness that precedes having children -- and there isn't. But the aphorism takes on a new meaning in the age of a pandemic, in which life has radically changed and the future is uncertain.\nThe questions are weighty and limitless: How would coronavirus and the strain on hospitals affect my pregnancy? Will we have enough money to afford kids when this is over? Will we have jobs? Would growing a family add to or alleviate some of the anxieties of life in the time of corona? Is loneliness a good enough reason to have a child?\nThere are also less existential, but nonetheless important, questions, like: Will adding a screaming baby to a 900-square-foot apartment just ensure my marriage's untimely demise?\nFamily planning in the time of a pandemic is a complicated, unmanageable Pandora's box, an endless stream of unanswerable what-ifs and worst-case scenarios. And with so many unknowns and a continual stream of unsettling coronavirus news, it's hard to imagine why anyone would choose to have a child now.\nAnd yet, these things are hard to rationalize.\nI have a 5-year-old, and after wrestling for years, practically since the day he was born, with whether or not we'd have another, we decided just this past summer that our family felt complete.\nWe came up with all the good reasons not to do it. The time when adding to our family would have given our son a playdate had passed -- they'd be a full six years apart, and what 10-year-old wants to play with a 4-year-old?\nI am also approaching an increasingly risky age to have a healthy child, not to mention an age when the prospect of 2 a.m. feedings, potty training, and nap battles feel no less challenging than climbing Mt. Everest, and no more rewarding than eating a cat hair casserole.\nJUST WATCHED Acts of kindness amid coronavirus pandemic Replay More Videos ... MUST WATCH Acts of kindness amid coronavirus pandemic 01:58\nAnd finally, we like our work-life balance. We both enjoy working full-time, and still get to spend plenty of quality time together and with our son. Why would we disrupt this admittedly enviable situation?\nBeing stuck at home (I know, I know ... \"safe at home\") with my husband and son has been challenging in the predictable ways. Working from home with a five-year-old requires a lot of discipline, creativity and, as it turns out, bribery.\nA longing sneaks up\nMy husband and I are learning fun new things about each other. He's handier at building projects than I knew. I'm better at cleaning than he knew. And conversely, there are new questions. Have I always been this impatient? Has he always breathed this loudly? And, whom did he delight with 1,000 questions a day before all this started?\nBut despite these adjustments, all this family time has had one unexpected consequence. I find myself suddenly longing for a second child.\nI shared this alarming thought with a friend, who also has one child a little older than ours. And he said that he too, for the first time ever, questioned whether they should have had another.\nI've decided that this could be due to a unique and unprecedented set of circumstances that's physiologically influencing my biological clock -- I'm calling them corona hormones -- in ways only this moment in time could.\nFor one, fear can make a mother preternaturally focused. When confronting the reality that some, perhaps many, people around us will die, procreating becomes an evolutionarily appealing act of rebellion. While the smallness of our family feels thrifty and well-suited to hunkering down in a pandemic, it also somehow feels too small for the scope of it. Strength in numbers seems the better biological approach.\nThat primal rationalizing is coupled with a more emotional sense of urgency. I've loved stripping away the non-essential and indulgent concerns of pre-corona life to the immediate concerns of right now. We always said nothing's more important than family, but this experience has practically turned that into a dare. I find myself mentally bargaining with coronavirus, saying, \"Take anything you want from me -- money, comfort, convenience -- just leave my boys alone.\" If family is everything, why wouldn't I want more of it?\nOddly, the obstacles that we routinely cited earlier feel less important now, even though their validity hasn't diminished at all. Can we afford another kid? Are we physically up to the challenge? Can we cut back on work? Can we do it all again? Pre-corona me was worried sick about these questions. Post-corona me feels unrealistically and undeservedly brave.\nCorona-hormones?\nI wonder if I'm alone. In the early weeks of coronavirus spread, a rash of headlines about an inevitable baby boom infected the internet. Some experts suggested that the increase in forced intimacy would naturally lead to actual intimacy.\nDr. Sheri Jacobson, clinical director at Harley Therapy, a clinic in London, told The Times, \"Lack of sex is a common problem between overworked couples, and remote working often has the benefits of accommodating other activities. In this early period, staying home might feel like a break from the norm, creating a short holiday effect. Couples could also be bonding over the unfolding trauma.\"\nJUST WATCHED Fear, panic as women navigate pregnancy during a pandemic Replay More Videos ... MUST WATCH Fear, panic as women navigate pregnancy during a pandemic 02:59\nBut sex out of boredom or opportunity isn't necessarily the same thing as desire for a bigger family. And in fact, others are predicting the coming baby boom will only look like a small blip.\nIn The Washington Post, Richard W. Evans, director of the Open Source Economics Laboratory, suggests that the highly contagious nature of coronavirus could stifle intimacy urges in many cases, leading to no more than a 2% increase in births this winter. Hardly a boom.\nIt's unlikely we can predict how coronavirus will impact family planning on a global or even national scale. So much of what is happening now is unprecedented.\nSo, I spoke to some of my friends to get a sense of where they were, mentally and emotionally.\nAlyssa is a 34-year-old, single PR and marketing executive in Washington, DC. When we were younger, we often talked about our ambivalence toward marriage and family, but now she says the pandemic has \"made me feel my desire to start a family more acutely.\"\nDon't you feel relieved, though, that you're not dealing with kids on top of everything else right now, I ask?\n\"I have had plenty of moments of gratitude that I'm the only person I have to worry about ... it makes things relatively simple that way,\" she says. \"But the flip side of that has also been something I've had to process; the isolation can feel extra isolating as a single person who lives alone, and it's hard not to notice the space that could be filled with a family.\"\nTim, a single, gay 41-year-old tech professional in Palo Alto, CA, echoed the conflicting sentiments. \"I feel exhausted taking care of myself and calming myself down during this time of pandemic,\" he admits, and \"I worry about the responsibility of having to do it for others. But I also understand that having to care for someone other than oneself can be mentally beneficial. I do find myself yearning for my own crew during this lock-down.\"\nUrgency ... and worry\nWhile fear and anxiety have prompted an urgency in me to have another child, it's also an understandable impediment for others. Pamela, a 30-year-old unmarried communications professional in New York City, had hoped to start a family soon.\nNow, she says, she has new fears. \"I'm scared of the unknown and what this means for us all weeks, months or even years from now. I can't imagine starting a family in the midst of all this, considering the financial responsibilities.\" When I ask how she'd feel if she found out she was pregnant right now, she says \"bittersweet\" -- \"blessed, but concerned.\" She feels connected to her nieces and nephew more than ever.\nOthers didn't have the luxury of planning around coronavirus. One friend who has a child already and another on the way, says she would like to have waited to have her second kid until after there was a readily available coronavirus vaccine.\nFor others, the road to pregnancy hasn't been easy to begin with, and coronavirus is another complicating layer.\nMeghan McCain, a co-host of The View, is expecting her first child at age 35. Last year she suffered a painful miscarriage and admits that the path to motherhood \"was by no means a straight line -- physically, emotionally, in all ways.\"\nNow, the stress is even more acute, she told me. \"I have had to bump back scans and appointments because they were scheduled at a big hospital in the city and I didn't feel comfortable going there right now,\" she says. \"I don't know when I will be able to shop for anything baby-related, let alone get a nursery ready. I was really worried about the pharmacy running out of prenatal vitamins. Things like that make it very difficult.\"\nBut being pregnant during a pandemic has also awakened a maternal instinct in Meghan, when it came time to decide to work from home instead of going into a New York City studio every day for her show. \"I had to think of the health implications, not only for me but my child. It really is the first time I have made a career choice thinking of someone other than myself.\"\nAnd for some, still, coronavirus has had little impact on family planning. Brooks and his husband already have the two young children they always wanted. While the challenges of the pandemic have made them feel more connected to and grateful for the community of Sunday school teachers, pre-school teachers, and friends that they relied on as parents before social distancing, he says they feel \"blessed where we are,\" and have no plans to add to their family.\nFollow CNN Opinion Join us on Twitter and Facebook\nAs for me, I'm still assessing. It's hard to trust my feelings right now.\nIt seems like the rule about not making big decisions while hormonal and pregnant probably applies during the emotionally charged and mentally fraught time of corona.\nTo that end, we are leaning toward expanding our family at least in one way -- we've applied to adopt a shelter dog.", "url": "https://www.cnn.com/2020/04/02/opinions/in-pandemic-to-baby-or-not-to-baby-cupp/index.html"}