{"authors": ["Michael R. Sisak", "John Minchillo"], "date_download": "2020-05-04 20:18:15", "date_modify": "2020-05-04 20:18:15", "date_publish": "2020-04-09 20:11:55", "description": "NEW YORK (AP) — As New York City deals with a mounting coronavirus death toll and dwindling morgue space, the city has shortened the amount of time it will hold unclaimed remains before they are...", "filename": "_72024270f1b284e1b47415bf0c707f91_1588623495.html", "image_url": "https://storage.googleapis.com/afs-prod/media/2e35e4e8a1b44009ada6c0c680b8f55b/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_72024270f1b284e1b47415bf0c707f91_1588623495.html", "title": "As virus kills, NYC shortens deadline for claiming dead", "title_page": "As virus kills, NYC shortens deadline for claiming dead", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Workers wearing personal protective equipment bury bodies in a trench on Hart Island, Thursday, April 9, 2020, in the Bronx borough of New York. On Thursday, New York City’s medical examiner confirmed that the city has shortened the amount of time it will hold on to remains to 14 days from 30 days before they will be transferred for temporary internment at a City Cemetery. Earlier in the week, Mayor Bill DeBlasio said that officials have explored the possibility of temporary burials on Hart Island, a strip of land in Long Island Sound that has long served as the city’s potter’s field. (AP Photo/John Minchillo)\nWorkers wearing personal protective equipment bury bodies in a trench on Hart Island, Thursday, April 9, 2020, in the Bronx borough of New York. On Thursday, New York City’s medical examiner confirmed that the city has shortened the amount of time it will hold on to remains to 14 days from 30 days before they will be transferred for temporary internment at a City Cemetery. Earlier in the week, Mayor Bill DeBlasio said that officials have explored the possibility of temporary burials on Hart Island, a strip of land in Long Island Sound that has long served as the city’s potter’s field. (AP Photo/John Minchillo)\nNEW YORK (AP) — As New York City deals with a mounting coronavirus death toll and dwindling morgue space, the city has shortened the amount of time it will hold unclaimed remains before they are buried in the city’s public cemetery.\nUnder the new policy, the medical examiner’s office will keep bodies in storage for just 14 days before they’re buried in the city’s potter’s field on Hart Island.\nNormally, about 25 bodies a week are interred on the island, mostly for people whose families can’t afford a funeral, or who go unclaimed by relatives.\nIn recent days, though, burial operations have increased from one day a week to five days a week, with around 24 burials each day, said Department of Correction spokesman Jason Kersten.\nAerial images taken Thursday by the Associated Press captured workers digging graves on the island, a one-mile, limited-access strip off the Bronx that’s the final resting place for more than a million mostly indigent New Yorkers.\nAbout 40 caskets were lined up for burial on the island on Thursday, and two fresh trenches have been dug in recent days.\nInterments are typically done by inmates from the city’s Rikers Island jail complex, but during the coronavirus pandemic the job has been taken over by contractors.\nCity officials haven’t explained whether the increase in burials is due to pressure on mortuaries to dispose of bodies more quickly. The virus has been killing hundreds of New York City residents each day this week.\nOverwhelmed hospitals have been placing bodies in refrigerated trucks parked outside their doors.\nMayor Bill de Blasio said this week officials were looking into temporarily burying coronavirus victims on Hart Island if morgues and temporary storage units fill up.\nThe Democratic mayor told TV station NY1 that under such a contingency plan bodies of COVID-19 victims would be buried individually — not in mass graves — so families could later reclaim them.\nA spokeswoman for the medical examiner’s office said Thursday that it “does not currently anticipate reaching morgue capacity.”\n“However, as the mayor has said, the city may explore the option of temporary burials in Hart Island if necessary,” said the spokeswoman, Aja Worthy-Davis.\nDe Blasio has said no inmate labor will be used for the temporary burial of coronavirus victims.\nThe city’s 2008 Pandemic Influenza Surge Plan states that Hart Island would be used as a temporary burial site in the event the death toll reaches the tens of thousands and other storage is full.\nBrooklyn undertaker Thomas Cheeseman said funeral homes are so backed up , some people will inevitably end up being temporarily interred.\nCheeseman said the new deadlines are putting a strain on funeral homes as more and more families seek arrangements for loved ones fallen by coronavirus.\n“We, the funeral directors, are overwhelmed,” Cheeseman said. “We’re inundated. The crematory can’t even take bodies for two weeks. The funeral homes don’t have refrigerated trucks parked out front.”\n___\nAP video journalist Robert Bumsted contributed to this report.", "url": "https://apnews.com/72024270f1b284e1b47415bf0c707f91"}