{"authors": [], "date_download": "2020-05-04 20:21:34", "date_modify": "2020-05-04 20:21:34", "date_publish": "2020-04-14 12:38:16", "description": "SANTA FE, N.M. (AP) — Homes on the market hit a record low in New Mexico’s Capital amid a slowdown and the spread of COVID-19. The Santa Fe New Mexican reports the number of single-family...", "filename": "_7ce3d7f4ae5ca5752ff60c06ea603e96_1588623694.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_7ce3d7f4ae5ca5752ff60c06ea603e96_1588623694.html", "title": "Group: Santa Fe homes on market hit record low", "title_page": "Group: Santa Fe homes on market hit record low", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "SANTA FE, N.M. (AP) — Homes on the market hit a record low in New Mexico’s Capital amid a slowdown and the spread of COVID-19.\nThe Santa Fe New Mexican reports the number of single-family homes on the market in Santa Fe County in the first quarter was the lowest it’s been since officials began keeping such data in 2005.\nThe Santa Fe Association of Realtors says record-low new listings reinforced the record-low inventory of 358 homes for sale in Santa Fe County during the first three months of 2020 in the fourth quarter of 2019 and the first quarter of 2020.\nIn peak real estate times, Santa Fe County had more than 2,000 homes on the market in 2008 and 1,000 new listings in one quarter in 2007.\nGenerally, the inventory of homes for sale was more than 600 each quarter over the past three years, but the inventory has dropped every quarter since the second quarter of 2019.\n“They are going down and down because more people are buying and sellers are more resistant to list,” said association President Susan Orth.\nAlthough interest rates have fallen and agents are moving toward electronic means of showing a home, Orth said the lack of a deep inventory remains problematic.", "url": "https://apnews.com/7ce3d7f4ae5ca5752ff60c06ea603e96"}