{"authors": ["Andrew Welsh-Huggins"], "date_download": "2020-05-04 20:23:26", "date_modify": "2020-05-04 20:23:26", "date_publish": "2020-04-08 15:20:29", "description": "COLUMBUS, Ohio (AP) — Gov. Mike DeWine announced the coronavirus-related death of a state prison guard, while the number of prison employees with COVID-19 jumped to 48, along with 17 inmates....", "filename": "_a915624c02f8ddf1effbe61ec75eb75b_1588623806.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f9c51ccdffb848248d1593409103f191/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_a915624c02f8ddf1effbe61ec75eb75b_1588623806.html", "title": "Ohio governor announces coronavirus death of prison guard", "title_page": "Ohio governor announces coronavirus death of prison guard", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Corey Stacey casts his fishing line on the shores of Lake Erie at Wildwood Park, Tuesday, April 7, 2020, in Cleveland. (AP Photo/Tony Dejak)\nCorey Stacey casts his fishing line on the shores of Lake Erie at Wildwood Park, Tuesday, April 7, 2020, in Cleveland. (AP Photo/Tony Dejak)\nCOLUMBUS, Ohio (AP) — Gov. Mike DeWine announced the coronavirus-related death of a state prison guard, while the number of prison employees with COVID-19 jumped to 48, along with 17 inmates. DeWine also urged institutions with surgical masks not to throw them away because a new sanitizing process can provide up to 20 reuses.\nA look at coronavirus-related developments in Ohio on Wednesday:\n___\nCORRECTIONAL FACILITIES\nMarion Correctional Institution guard John Dawson, 55, has died of COVID-19, DeWine said.\nDawson had worked since 1996 at Marion, where the prison system’s first positive case was reported this month. He had some underlying health conditions, the governor said.\nThe governor said 48 employees and 17 inmates have now tested positive at seven different prisons. The process is underway for a limited release of just over 200 Ohio prisoners, including pregnant inmates or women with children with them behind bars, inmates over 60, and prisoners eligible for early release because their sentences are nearly done.\nNo violent or sex offenders would be released, nor would inmates with poor prison records or domestic violence convictions, or those who were previously imprisoned. Ohio houses about 49,000 inmates.\n___\nCARE\nDeWine urged institutions with surgical masks not to throw them away, but to arrange for them to be sanitized by Battelle, a private research company in Columbus that has developed a technology allowing masks to be reused up to 20 times.\nApple CEO Tim Cook has donated 100,000 N95 masks for health care workers, the governor announced. Cook is giving the virtual commencement address at Ohio State next month.\nThe Ohio Hospital Association released guidelines for how hospitals can allocate scarce resources, including ways to implement a triage group to determine who should receive resources when they’re not available for all patients.\nIn central Ohio, 44 staff members agreed to live in two assisted-living facilities, The Inn at Chapel Grove in Heath and The Inn at SharonBrooke in Newark, to reduce the risk of exposure to residents, The Advocate reported.\n“I never thought in my whole nursing career that this would even happen, but I came to realize that in my entire nursing career, this is the time that they’re going to need me the most,” nurse Alisha Disbennett told the newspaper.\n___\nCASES\nMore than 5,100 people in Ohio have tested positive for the virus and 193 have died, with nearly 1,500 hospitalizations as of Wednesday, according to the state health department. Health Director Dr. Amy Acton is now predicting about 1,600 cases a day at the epidemic’s anticipated peak later this month. The state has now tested more than 53,000 people.\nMahoning County leads the state with 28 deaths, followed by much larger Cuyahoga County with 23. Men continue to make up 66% of deaths, compared with 34% of women.\nFor most people, COVID-19 displays mild or moderate symptoms, such as fever and cough that clear up in two to three weeks. For some, especially older adults and people with existing health problems, it can be more severe, causing pneumonia or death.\n___\nECONOMY\nDeWine asked the state insurance fund for injured workers to rebate $1.6 billion to employers to ease the impact of the economic shutdown.\nOhio has paid more than $124 million so far to more than 195,000 people who have filed unemployment claims, said Kimberly Hall, director of the state’s human services agency. Lt. Gov. Jon Husted said that even as unemployment ranks swell, nearly 500 employers have posted more than 33,000 jobs including healthcare, protective equipment manufacture, and food distribution positions.\nWith state revenue falling, Agriculture Director Dorothy Pelanda said the crisis will force a reevaluation of Gov. Mike DeWine’s H2Ohio program, which was to begin offering farmers financial incentives this year to voluntarily adopt new agriculture practices to improve water quality throughout Ohio. Nearly 2,000 farmers applied to enroll more than 1.1 million acres, Pelanda said.\nFollowing their mid-March closures, the state’s casinos and racinos reported a $112 million revenue drop in March compared with one year ago, a 61% drop-off, according to the lottery and casino control commissions.\n___\nTHE NEW NORMAL\nDeWine said he continues to receive questions about churches ignoring Acton’s stay-at-home order. The Republican governor said he’s not going to violate people’s First Amendment rights by banning worship, but urged churches not to gather in-person, saying he’s not aware of any religion that supports putting others in danger. “We just ask everyone to love your neighbor,” DeWine said.\nThe city of Blue Ash in suburban Cincinnati joined a long list of communities canceling events into mid-June, including the city’s Memorial Day parade and a children’s theater production.\n___\nAssociated Press writer Mark Gillispie in Cleveland contributed to this report.", "url": "https://apnews.com/a915624c02f8ddf1effbe61ec75eb75b"}