{"authors": [], "date_download": "2020-05-04 20:06:47", "date_modify": "2020-05-04 20:06:47", "date_publish": "2020-04-06 16:22:21", "description": "HELENA, Mont. (AP) — Montana's health department is concerned that the sharp decline in the number of calls to the child abuse and neglect hotline since schools were closed to decrease the spread...", "filename": "_0700468782bd54122b79944a600f9e2c_1588622807.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_0700468782bd54122b79944a600f9e2c_1588622807.html", "title": "Montana concerned with decline in child abuse hotline calls", "title_page": "Montana concerned with decline in child abuse hotline calls", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "HELENA, Mont. (AP) — Montana’s health department is concerned that the sharp decline in the number of calls to the child abuse and neglect hotline since schools were closed to decrease the spread of the coronavirus might be masking the danger children are in, the agency said Monday.\nFrom March 8-14, 765 calls were made to the hotline at 1-866-820-KIDS (5437). Gov. Steve Bullock announced school closures starting on March 17. Since then, the number of calls dropped to an average of 425 per week, a 45% decrease.\n“This decrease in calls is very concerning because teachers and school staff are mandatory reporters of child abuse and neglect, and we know they are one of the main sources of calls to the hotline,” said Sheila Hogan, director of the Department of Public Health and Human Services. “With schools closed, it’s important for all us to take an active role by calling the hotline if you suspect abuse or neglect.”\nThe agency is also asking residents to reach out to family, friends and neighbors who might be struggling with social isolation and financial uncertainty because stress can lead to child abuse.\n“If someone is struggling, urge them to ask for help if they need it by talking to a close a friend or relative, a local community provider they’ve been in contact with before, law enforcement, home visitor or a (Child and Family Services Division) caseworker to request assistance. There are services in the community that can help.”\nFor most people, the virus causes mild or moderate symptoms that clear up in a few weeks. For some, especially older adults and people with existing health problems, it can cause more severe illness, including life-threatening pneumonia.\nIn other coronavirus-related developments:\n— Montana is reporting 319 positive coronavirus tests just over three weeks since reporting its first cases. The health department says 27 people have been hospitalized and six people have died. A Missoula County resident who died over the weekend was the latest death. Gallatin County’s 118 cases are 37% of the state’s total.\n—The U.S. Customs and Border Patrol is temporarily reducing the hours of operation at six Montana ports of entry from Canada due to decreased traffic following the “essential only” travel order put in place on March 21, the Great Falls Tribune reported. The Port of Raymond in eastern Montana, which has been open 24 hours a day, is reduced to 6 a.m. to 10 p.m. The Port of Piegan, just east of Glacier National Park, will have its hours shortened to 8 a.m. to 6 p.m. The ports of Opheim, Morgan, Turner and Del Bonita are reduced to 9 a.m. to 5 p.m. Monday through Friday. They will be closed on the weekends until April 30 or until the federal government lifts its current travel restrictions.\n— After two previous warnings, a Butte resident was cited Sunday night for having about 15 people at a house party, violating the state’s directive prohibiting nonessential gatherings of more than 10 people if they can’t be separated by a distance of at least 6 feet (2 meters), The Montana Standard reported.", "url": "https://apnews.com/0700468782bd54122b79944a600f9e2c"}