{"authors": ["Stephanie Elam"], "date_download": "2020-05-04 16:23:07", "date_modify": "2020-05-04 16:23:07", "date_publish": "2020-04-06 16:36:36", "description": "After the sun sets beyond the California coast, the iconic Ferris wheel on the Santa Monica Pier still lights up -- its dancing colors mimicked on the surface of the Pacific Ocean below. It's an eerie reminder of what life should be like in Los Angeles right now. But despite the light show, the pier is blocked off and silent -- no games, no vendors, no rides. No tourists posing for selfies. This is California at war with the coronavirus.", "filename": "2020_04_06_us_los-angeles-coronavirus-diary-elam_index_1588609387.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331082753-los-angeles-empty-street-0330-super-tease.jpg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_us_los-angeles-coronavirus-diary-elam_index_1588609387.html", "title": "In Los Angeles, friendly waves help fill the empty spaces of social distancing", "title_page": "In Los Angeles, friendly waves help fill the empty spaces of social distancing - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "We are publishing personal essays from CNN's global staff as they live and cover the story of Covid-19. Stephanie Elam is based in Los Angeles as a correspondent for CNN.\nLos Angeles (CNN) After the sun sets beyond the California coast, the iconic Ferris wheel on the Santa Monica Pier still lights up -- its dancing colors mimicked on the surface of the Pacific Ocean below. It's an eerie reminder of what life should be like in Los Angeles right now. But despite the light show, the pier is blocked off and silent -- no games, no vendors, no rides. No tourists posing for selfies. This is California at war with the coronavirus.\nIt's been about two weeks since Governor Gavin Newsom put California under a stay-at-home order -- the first state in the union to tell its nearly 40 million residents to do so. He also said the state's coronavirus cases are expected to peak in May. Even with more than 15,000 current cases in California, this is expected to be the calm before the storm.\nLos Angeles Mayor Eric Garcetti reiterated the governor's call, demanding that all non-essential businesses close their doors temporarily.\n(I grapple with the word \"nonessential.\" A business may offer products that are not essential during a pandemic lockdown, but I'm pretty sure the workers would argue those paychecks they get for their work are very much needed.)\nSince the stay-at-home order, Garcetti has continued to add pressure behind his call for social distancing, telling Angelenos that we are likely just 14 days behind where New York City is now. Most recently, he recommended that people here start wearing some sort of homemade face covering to help prevent the spread of respiratory droplets when in public. It seems this has made an impact -- fewer people are out, and more people are wearing scarves, bandanas or masks to cover their noses and mouths.\nRead More", "url": "https://www.cnn.com/2020/04/06/us/los-angeles-coronavirus-diary-elam/index.html"}