{"authors": ["Alicia Lee"], "date_download": "2020-05-04 16:01:40", "date_modify": "2020-05-04 16:01:40", "date_publish": "2020-04-01 17:13:26", "description": "From an ICU nurse in Twin Cities, Minnesota, to an ER doctor in Lynchburg, Virginia, RVs 4 MDs has matched dozens of health care workers with RVs, trailers and campers in their area.", "filename": "2020_04_01_us_coronavirus-rvs-4-mds-healthcare-isolate-trnd_index_1588608100.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331210530-coronavirus-rvs-for-mds-healthcare-isolate-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_01_us_coronavirus-rvs-4-mds-healthcare-isolate-trnd_index_1588608100.html", "title": "RVs 4 MDs: Facebook group matches health care workers to RVs so they can self-isolate near home", "title_page": "RVs 4 MDs: Facebook group matches health care workers to RVs so they can self-isolate near home - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) For Mark Quale, an emergency room physician in Burlington, North Carolina, coming home after a long day at the hospital was as stressful as work itself. With two young boys, a wife and elderly mother-in-law at home, he knew that if he wasn't cautious, he could spread the novel coronavirus to his own family.\nSo just as he arrived home from work, he would strip off his scrubs on the front porch, walk the specific route to his bathroom that was cordoned off by a tarp and wash all the germs off in the shower.\nBut today, Quale's mind is more at peace because he's able to isolate himself in a 31-foot travel trailer, and it's all thanks to a Facebook group called RVs 4 MDs , which matches health care workers to local RV owners.\nIt started with a Facebook post\nFrom an ICU nurse in Twin Cities, Minnesota, to an ER doctor in Lynchburg, Virginia, RVs 4 MDs has matched dozens of health care workers with RVs, trailers and campers in their area. The Facebook group has already racked up nearly 3,000 members, an incredible number given the fact that the group was created just one week ago.\nEmily Phillips, her husband, Dr. Jason Phillips and their son, Beau. Emily started RVs for MDs to help connect health care workers with RVs so they could stay self-isolate while staying near their homes.\nLast Monday, Emily Phillips, a mother of three from Celina, Texas, had posted on her Facebook asking if anybody had an RV her family could borrow as her husband was an ER doctor in the Dallas-Fort Worth area. A woman named Holly Haggard replied saying that Phillips could borrow hers.\n\"Before the RV, I was a nervous wreck. Every time my husband walked in the door or put his hand on something, I thought we were going to get (Covid-19), including my baby,\" Phillips said. \"But now that he's in that RV, I'm back to my life, focused on my full-time job and my kids, and it's completely changed our situation.\"\nKnowing that there were countless other families in similar situations as hers, Phillips took on Haggard as her business partner and the two created RVs 4 MDs, which went live last Tuesday night.\nIn a matter of one week, the two Texan moms have built the simple Facebook group into a robust volunteer organization, complete with a board of directors and network of volunteers spanning across the nation.\nKindness from complete strangers\nQuale and his family were one of the first to be matched with an RV from a pair of kind strangers named Kelsey and Tim Webb. The two families had never met before, but Tim drove his trailer for 2.5 hours to Quale's home, gave Quale's wife, LaRayne, the keys and told her that they could use it for as long as they needed.\nTim Webb drove 2.5 hours to temporarily donate his travel trailer to LaRayne Quale (right).\n\"It was such an emotional thing to go through and to have someone offer up their RV completely for free, I felt so blessed,\" LaRayne, who now volunteers with RVs 4 MDs said. \"I asked if they wanted us to cover the insurance, but they wanted nothing... They said that they are praying for us and rooting for us.\"\nKelsey, who normally makes money by renting out the trailer, said donating it to the Quales was a \"no-brainer.\"\n\"This family was in need and this was the one way we could help,\" Kelsey told CNN. \"You can't put a price tag on this... It just makes my heart happy that we're able to do this for them and give them peace of mind.\"\nQuale said he was extremely proud of his fellow health care workers on the front lines of this pandemic, but he added that this virus isn't something that can be defeated by the medical professionals alone.\n\"(RVs 4 MDs) demonstrates that there is so much more to fighting the coronavirus than what happens at the hospital. There are layers upon layers of people fighting this in different ways. The reason I'm able to fight this right now is because of my wife and the work that these people are doing so we can focus on the medical portion and not have to worry about the rest,\" Quale said.\nMore volunteers are needed\nEvery hour, there are new posts on the Facebook page from spouses and family members looking to be matched with an RV.\n\"Looking for an RV in Grapevine Texas. Wife is camping out on the apt patio,\" one post reads.\n\"ER Doc in Rochester NY has been living in the garage for 3 weeks to protect our 3 kids and me,\" another post reads.\nBut with each new request, there's an equal amount of posts from RV owners saying that they want to help.\n\"I have never seen anything like this in my entire life,\" Phillips said. \"The amount of people that are stepping up to help with a project where they aren't even getting a dime in return is unbelievable.\"\nDr. Jason Phillips (left) and Dr. Craig Reese Brockman with a donated camper that Brockman will use to prevent the risk of passing along the coronavirus to his family.\nTo keep up with this project that has spread like wildfire, Phillips has recruited the help of attorneys, people in insurance and IT, but what she needs the most right now are more volunteers, she said.\n\"We need more volunteers to head up the different states,\" Phillips said. \"A lot of people are out there with nothing to do. Well, we got something to do and it can really help a lot.\"\nPhillips and her team hope to expand the program into Canada, set up an official website, and even keep it going after the coronavirus crisis is over.\n\"We're going to keep it running until there's not one person left on the planet that needs an RV or needs shelter,\" Phillips said. \"Whether it's a storm or whatever the case is, we'll have this organization for the next crisis because there's always going to be a need for shelter.\"", "url": "https://www.cnn.com/2020/04/01/us/coronavirus-rvs-4-mds-healthcare-isolate-trnd/index.html"}