{"authors": ["Overnight Editor"], "date_download": "2020-05-04 20:16:47", "date_modify": "2020-05-04 20:16:47", "date_publish": "2020-04-28 09:24:35", "description": "Audrey Whitlock, one of the organizers of demonstrations against stay-home orders, has been in quarantine.", "filename": "entry_reopen-north-carolina-protester-coronavirus_n_5ea7d5eec5b6a30004e7b662_1588623407.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7dc0d250000bb0feb073e.jpeg?cache=fx4mhb5kuv&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_reopen-north-carolina-protester-coronavirus_n_5ea7d5eec5b6a30004e7b662_1588623407.html", "title": "'Reopen North Carolina' Protester Says She Tested Positive For Coronavirus", "title_page": "'Reopen North Carolina' Protester Says She Tested Positive For Coronavirus | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "One of the organizers of a group protesting North Carolina’s restrictions meant to stop the spread of the coronavirus infection has reportedly tested positive for the disease.\nAudrey Whitlock told public radio station WFAE that she has been in quarantine and has not attended the group’s rallies, but will do so on Tuesday since her quarantine ended on Sunday.\nIn a post on ReOpenNC’s private Facebook page obtained by several local media outlets, Whitlock described herself as “asymptomatic.” She said she had an antibody test done out of curiosity.\n“The test came back positive for COVID and negative for the antibodies, so I had a CDC test performed,” which found she carried the infection, she wrote.\n“It has been insinuated by others that if I go out, I could be arrested for denying a quarantine order,” Whitlock wrote, adding that she believes such an arrest would be a violation of the Americans With Disabilities Act.\nFellow protesters confirmed Whitlock did not attend the group’s two past events.\n“She never left her house during her quarantine so she has not been at any rally or any of the functions that we’ve done,” fellow organizer Ashley Smith told WRAL, the NBC station in Raleigh.\nSmith said she is protesting for liberty.\n“I’m not afraid of the virus,” she said. “I’m more afraid of losing my constitutional rights and losing my livelihood than I am of the virus.”\nThe COVID Tracking Project says more than 9,000 people in North Carolina have tested positive for the infection and 306 have died from it.", "url": "https://www.huffpost.com/entry/reopen-north-carolina-protester-coronavirus_n_5ea7d5eec5b6a30004e7b662"}