{"authors": ["Trends Reporter"], "date_download": "2020-05-04 20:15:51", "date_modify": "2020-05-04 20:15:51", "date_publish": "2020-04-28 04:47:56", "description": "Giving taxpayer money to a $4.4 billion franchise doesn't seem like aid to a small business.", "filename": "entry_los-angeles-lakers-small-business-aid-46-million-returning-coronavirus_n_5ea799f7c5b6dd3f9089cd86_1588623351.html", "image_url": "https://img.huffingtonpost.com/asset/5ea7b019240000bf008e9d56.jpeg?cache=vopp65k2vz&ops=1778_1000", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/huffpost.com/entry_los-angeles-lakers-small-business-aid-46-million-returning-coronavirus_n_5ea799f7c5b6dd3f9089cd86_1588623351.html", "title": "Fatcat Los Angeles Lakers Returning $4.6 Million In Taxpayer Stimulus Funds", "title_page": "Fatcat Los Angeles Lakers Returning $4.6 Million In Taxpayer Stimulus Funds | HuffPost", "title_rss": "NULL", "source_domain": "huffpost.com", "maintext": "The Los Angeles Lakers, one of the most lucrative franchises in the National Basketball Association, is returning $4.6 million in federal stimulus funds amid the COVID-19 crisis.\nNews of the eye-popping check comes amid mounting controversy over the taxpayer-funded program pitched by federal lawmakers as intended to help small businesses struggling during the health emergency. Surprise recipients have included successful restaurant chains and other publicly traded corporations that grabbed hundreds of millions of dollars while actual small businesses were left out in the cold as funds were quickly depleted.\nThe Lakers collected the funds in the first round of the Paycheck Protection Program, ESPN was the first to report. The loans are forgiven if recipients use the money for certain expenditures, such as wages and rent.\n“Once we found out the funds from the program had been depleted, we repaid the loan so that financial support would be directed to those most in need,” the team said in a statement to ESPN. “The Lakers remain completely committed to supporting both our employees and our community.”\nLakers managers have vowed not to lay off any employees, and senior staff took a 20% payroll deferral earlier this month.\nBefore the COVID-19 outbreak, the Lakers were valued at $4.4 billion, according to Forbes. The Lakers have the most lucrative broadcast contract in the league, bringing in more than $150 million a year in revenue, ESPN reported. Three of the team’s minority partners are billionaires, according to ESPN. Tens of millions of dollars in income are now at risk amid the coronavirus outbreak, but the team could easily borrow extra funds.\nThe Payment Protection Program, which is being administered by the Small Business Administration, is part of the $2.2 trillion economic stimulus package, called the CARES Act, to provide support for businesses and workers during the pandemic. The program ran out of funds in less than two weeks. A second round of money is now available, though applicants reported serious glitches Monday with uploading paperwork.", "url": "https://www.huffpost.com/entry/los-angeles-lakers-small-business-aid-46-million-returning-coronavirus_n_5ea799f7c5b6dd3f9089cd86"}