{"authors": ["Kevin Liptak"], "date_download": "2020-05-04 16:17:32", "date_modify": "2020-05-04 16:17:32", "date_publish": "2020-04-03 21:02:35", "description": "President Donald Trump said Friday his administration was now recommending Americans wear \"non-medical cloth\" face coverings, a reversal of previous guidance that suggested masks were unnecessary for people who weren't sick.", "filename": "2020_04_03_politics_trump-white-house-face-masks_index_1588609052.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331180942-04-coronavirus-presser-0331-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_03_politics_trump-white-house-face-masks_index_1588609052.html", "title": "Trump announces new face mask recommendations after heated internal debate", "title_page": "Trump announces new face mask recommendations after heated internal debate - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) President Donald Trump said Friday his administration was now recommending Americans wear \"non-medical cloth\" face coverings, a reversal of previous guidance that suggested masks were unnecessary for people who weren't sick.\nTrump said the recommendations, which came after a week of heated deliberations inside the White House, were voluntary and that he would not partake.\n\"I don't think I'm going to be doing it,\" he said, going on to suggest it was hard to envision such a thing in the Oval Office: \"Wearing a face mask as I greet presidents, prime ministers, dictators, kings, queens — I just don't see it.\"\nAfter weeks of insisting Americans should not wear face masks to prevent the spread of coronavirus -- and even suggesting their use could increase the chance of infection -- administration officials this week engaged in an internal debate over reversing course, according to people familiar with the matter.\nBehind the scenes, officials were divided about the wisdom of advising Americans to cover their faces in public, which some fear could cause a lapse in the social distancing efforts that remain officials' best hope of preventing further spread.\nAt stake was another turnabout for a White House that has sown confusion with its response to the coronavirus pandemic sweeping the nation. The debate over masks has come to encapsulate a federal effort marked by repeated reversals, conflicting recommendations, low stockpiles and competing internal interests that often lead to muddled messaging.\nSpeaking at the White House briefing on Friday, the US surgeon general acknowledged the change in position had stoked some uncertainty.\n\"It has been confusing to the American people,\" Dr. Jerome Adams said. He described the change as spurred by new information suggesting people without symptoms may account for a significant amount of transmission.\nThe guidelines, Adams said, would suggest Americans wear cloth face masks in public settings where social distancing guidelines are difficult to maintain, such as grocery stores.\nSenior officials at the CDC told the White House this week that stronger guidelines were necessary to prevent the virus from spreading between asymptomatic people, according to people familiar with the internal discussions.\nThe agency sent memos to the White House outlining their recommended guidance this week, people familiar with the documents said. They made clear that cloth face coverings -- not medical-grade masks -- were being recommended.\nBut after receiving them, some of Trump's advisers cautioned a nationwide recommendation might have negative side effects and advocated something more limited in scope, potentially only in areas that are hardest hit.\nThe debate played out in meetings of the coronavirus task force in the White House Situation Room, where the issue first arose again early this week. Officials engaged in a \"serious discussion\" of the topic, according to a source close to the conversations.\n\"That is being discussed really very actively. We were discussing it actively today in the task force and I can assure you, it's going to be on the agenda tomorrow,\" Dr. Anthony Fauci said on CNN on Thursday evening. \"Given the fact that we know that asymptomatic people are clearly transmitting infection, it just makes commonsense that it's not a bad idea to do that.\"\nUnderpinning the internal back-and-forth was the persistent shortage of medical grade masks for front-line hospital workers, which states and the federal government have scrambled to resolve through patchwork shipments and appeals to the private sector. Some White House officials feared a blanket recommendation for Americans to use face coverings might cause a rush on the badly needed medical masks, aggravating the already-grave situation for hospital workers and first responders.\nWhile the CDC guidelines advocate something short of a medical mask, there was still a fear among some officials that any kind of guidance on face coverings could lead to Americans seeking out the type of masks still needed in hospitals.\nAnd while Trump has publicly suggested using alternatives, the White House has not issued guidelines on which fabrics are best or how to properly tie loose cloth so that it covers the mouth and nose.\nDebate over recommendation\nThe debate spilled into public view on Thursday as Trump offered his thoughts on mask-wearing followed by words of caution from the White House coronavirus response coordinator Dr. Deborah Birx , who has been a leading internal opponent of nationwide mask recommendations on the President's task force.\n\"If people wanted to wear them, they can,\" Trump said when asked about potential new guidelines on wearing masks in public. \"If people wanted to use scarves, which they have, many people have them, they can.\"\nBirx stepped to the podium afterward to offer a more guarded view, saying she had concerns that masks could lull some people into a false sense of security, leading them to ignore other guidelines.\n\"We don't want people to feel like, 'Oh, I'm wearing a mask, I'm protected and I'm protecting others,' \" she said. \"You may be protecting others. But don't get a false sense of security that that mask is protecting you exclusively from getting infected, because there are other ways that you can get infected, because of the number of asymptomatic and mild cases that are out there.\"\nShe said a debate was \"continuing\" about masks, and added whenever a new advisory is issued it would be \"additive\" to the social distancing guidelines, which Trump this week extended to April 30.\nThe notion of the general public wearing masks had appeared a settled matter as recently as last weekend after the administration spent days earlier in the crisis insisting they were unnecessary for most Americans.\nThe CDC said on its website as of last month that it \"does not recommend that people who are well wear a face mask to protect themselves from respiratory diseases, including Covid-19.\"\nAnd officials were vocal that Americans not go out to purchase masks.\n\"It is not necessary for Americans to go out and buy masks,\" Vice President Mike Pence said during an appearance on CNN on March 1. In late February, the Surgeon General tweeted: \"Seriously people -- STOP BUYING MASKS! They are NOT effective in preventing general public from catching #Coronavirus, but if health care providers can't get them to care for sick patients, it puts them and our communities at risk!\"\nOfficials said those entreaties reflected a concern inside the administration that average Americans would begin stockpiling surgical masks or N95 respirators, making it difficult for hospital workers to access necessary gear.\nOther opinions\nIn other instances, some administration officials went as far as suggesting wearing a mask could increase the risk of infection for the wearer.\n\"You can increase your risk of getting it (coronavirus) by wearing a mask if you are not a health care provider,\" Adams said during an interview on Fox & Friends on March 2. \"Folks who don't know how to wear them properly tend to touch their faces a lot and actually can increase the spread of coronavirus.\"\nThose concerns about hoarding masks haven't necessarily changed, officials said, and the risks of infection to wearers remain. What has changed is new information suggesting higher levels of asymptomatic spread, which CDC Director Robert Redfield said this week had led to the new look into mask-wearing recommendations.\nThe previous guidance, Redfield said, was \"being critically re-reviewed, to see if there's potential additional value for individuals that are infected or individuals that may be asymptomatically infected.\"\nThe White House was also moved to reexamine the mask issue after the American Enterprise Institute published a white paper last weekend offering a \"road map to reopening\" the country after the outbreak, including a recommendation on masks.\n\"People will initially be asked to wear fabric nonmedical face masks while in the community to reduce their risk of asymptomatic spread,\" stated the paper, which was co-authored by Dr. Scott Gottlieb, Trump's former Food and Drug Administration commissioner who has continued to informally advise the White House during the coronavirus outbreak.\nAmong the issues discussed by the task force this week have been how best to teach Americans to wear masks and how to calibrate the public messaging to prevent a rush on medical-grade equipment.\nThere has been some consideration of whether to call the recommended face coverings \"masks.\" Some have suggested referring to them simply as \"face coverings\" or \"courtesy masks\" to distinguish them from the medical masks needed by professionals.\nAnd officials have weighed the cultural shift that recommending masks would represent, since Americans (unlike citizens of some Asian countries) are not accustomed to wearing masks in public.", "url": "https://www.cnn.com/2020/04/03/politics/trump-white-house-face-masks/index.html"}