{"authors": ["Julia Horowitz", "Cnn Business"], "date_download": "2020-05-04 16:25:57", "date_modify": "2020-05-04 16:25:57", "date_publish": "2020-04-07 12:06:35", "description": "Global stocks are pushing higher again as investors exhibit growing optimism.", "filename": "2020_04_07_investing_premarket-stocks-trading_index_1588609557.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200407110913-lse-0323-restricted-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_investing_premarket-stocks-trading_index_1588609557.html", "title": "Markets are surging. Here's why experts are still wary", "title_page": "Premarket stocks: Markets are surging. Here's why experts are still wary - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here\nWhat's happening: S&P 500 futures are up 3.5% after the index surged 7% on Monday. The FTSE 100 has jumped 2.8% in London even though UK Prime Minister Boris Johnson, who is battling a coronavirus infection, has been moved into intensive care\nThe MSCI All Country World Index is up 5.5%. And the CNN Business Fear & Greed Index , which tracks market sentiment, has moved out of the \"extreme fear\" range, suggesting the mood is improving.\nThe rally, which was triggered by trillions of dollars in global stimulus and signs that outbreaks in Italy, Spain and New York may be losing steam, is providing some relief. The VIX, a measure of stock market volatility, is at its lowest level in a month.\nBut market strategists are warning that the trajectory of the crisis remains unpredictable. And they note that it remains difficult to price assets in certain markets.\n\"Behind the tentative stability in asset prices, economies and markets are nowhere near normal,\" John Normand, head of cross-asset fundamental strategy at JPMorgan, told clients in a note on Friday.\nNormand observed that market depth, or the amount and breadth of open orders, \"remains unusually poor, even for a recession.\" While liquidity always drops during a recession, it dissipated during the current crisis even faster than in the 2008, he said.\nJPMorgan has said that conditions are right to start slowly increasing exposure to some riskier assets, citing recession-like prices, lighter selling pressure and extraordinary fiscal stimulus.\nBut the bank still sees the coronavirus itself as a huge wildcard. Normand noted that even though the infection rate in Italy and the rest of Europe is slowing, it \"remains too high to have much confidence on the duration of lockdowns [and] social distancing and therefore the duration and depth of the recession.\"\nHis takeaway: \"Risky markets will remain volatile as long as infection rates preserve growth and earnings uncertainty.\"\nOthers are urging caution, too.\n\"We believe it is too early to definitively call for a turn in the pandemic, and\ninvestors should continue to expect heightened volatility,\" Mark Haefele, chief investment officer at UBS Global Wealth Management, told clients Tuesday. \"However, this week's rebound offers a further reminder of the importance of staying invested.\"\nEurope clashes over how to support Spain and Italy\nThe European Union, battling a deep recession, is scrambling to come up with a plan to provide fresh economic support to the countries hit hardest by the coronavirus pandemic. But old divisions threaten hopes for unprecedented fiscal cooperation.\nOn the agenda: EU finance ministers will meet Tuesday by video conference. They're expected to discuss a rescue package that could include a €100 billion ($109 billion) initiative aimed at discouraging layoffs.\nYet a push from France, Spain and Italy for the European Union to issue so-called corona bonds , which would raise long-term financing for all member states, could expose rifts. The idea has faced opposition from German Chancellor Angela Merkel, who is backed by the leaders of Austria and the Netherlands.\nThese countries have long been against the issuance of debt at the EU level for fear that it would effectively mean their taxpayers are underwriting spending by poorer member states.\nHolger Schmieding, chief economist at Berenberg Bank, has warned clients that the stakes are extremely high.\n\"A perceived lack of ... solidarity could jeopardize the long-term cohesion of the EU and the Eurozone,\" he told clients in a recent note.\nHow do you restart an economy? Ideas take shape\nSigns that the pandemic could be easing in Italy, Spain and New York are sparking a fierce discussion among health experts, economists and investors: How and when should lockdowns be lifted?\nWhat's happening: Pressure is building on governments to explain their exit plans because of the mounting economic costs of measures designed to contain the coronavirus, my CNN Business colleague Charles Riley reports. Austria on Monday said it would gradually begin to reopen shops after Easter, becoming the first country in Europe to do so.\nBut restarting economic activity without allowing a resurgence of the novel coronavirus is a huge challenge.\nOne proposal: In Germany, where 103,000 people have tested positive for coronavirus and more than 1,800 have died, a group of economists, lawyers and medical experts are recommending a revival that would allow specific industries and workers to gradually resume their activities.\nWe're not there yet. The German government has said it's too soon to provide a timetable for lifting restrictions. And countries are still enacting fresh protective measures, with Japanese Prime Minister Shinzo Abe declaring a state of emergency on Tuesday.\nUp next\nEurope's finance ministers will hold a conference call to discuss the coronavirus pandemic at 9 a.m. ET.\nLevi Strauss LEVI Also today:reports earnings after US markets close.\nComing tomorrow: The US Federal Reserve releases the minutes from its meeting on March 15, when the central bank decided to slash its key interest rate close to zero.", "url": "https://www.cnn.com/2020/04/07/investing/premarket-stocks-trading/index.html"}