{"authors": ["Madeline Holcombe"], "date_download": "2020-05-04 15:58:26", "date_modify": "2020-05-04 15:58:26", "date_publish": "2020-03-31 09:13:53", "description": "As cases of and deaths from Covid-19 continue to climb in the United States, officials are implementing travel restrictions to try to stop the coronavirus from spreading.", "filename": "2020_03_31_us_states-travel-restrictions-list_index_1588607906.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200331023912-rhode-island-travel-0327-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_03_31_us_states-travel-restrictions-list_index_1588607906.html", "title": "Here are the states restricting travel from within the US", "title_page": "Here are the states restricting travel from within the US - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As cases of and deaths from Covid-19 continue to climb in the United States, officials are implementing travel restrictions to try to stop the coronavirus from spreading.\nOn the national level, the Centers for Disease Control and Prevention issued a travel advisory urging residents of New York, New Jersey and Connecticut to refrain immediately from non-essential travel for 14 days. It is up to those states to implement the advisory.\nMeantime, states across the country -- some of which have already issued stay-at-home orders to residents -- are now creating measures to restrict the movement of visitors, too.\nHere are the states that currently have travel restrictions in place:\nAlaska\nUnless it is to support critical infrastructure or for critical personal needs, all travel in the state between communities is prohibited. The restrictions apply to residents, workers and visitors.\nTravel-related businesses are not obligated to verify the criteria and will rely on travelers assurances that they are eligible to travel.\nThose who do travel for critical reasons will be subject to automatic quarantine or isolation except as allowed under Alaska statutes or health mandates.\nDelaware\nTravelers entering Delaware from other states for an extended stay will now be required to self-quarantine for 14-days, according to an order from Gov. John Carney.\nFlorida\nFlorida was the first state to launch a large-scale attempt to impose self-quarantine for domestic travelers when Gov. Ron DeSantis issued an order for a 14-day self-quarantine for travelers entering the state's airports from New York, New Jersey and Connecticut.\nThe state has now begun stopping drivers at its borders with Alabama and Georgia.\nHawaii\nGov. David Ige asked travelers to postpone their visits to the island for the next 30 days. All arriving residents and visitors will immediately go into a 14-day quarantines upon entering the state.\nIn a March 26 news conference, Ige said flights to Hawaii were down 87% in that week, compared with the same week in 2019.\nKansas\nTravelers from Colorado and Louisiana must quarantine when they arrive in Kansas, a news release from the Kansas Department of Health and Environment said. Kansas has also placed quarantine requirements on travelers from Florida, Washington, California, New York, New Jersey and Illinois.\nKentucky\nGov. Andy Beshear issued an executive order requiring anyone returning to that state to quarantine for 14 days and banning travel to other states. Travel exceptions include: job-required travel, those who live on the border and need necessities, travel for health care reasons, travel to care for a loved one, and court orders, according to the LaTasha Buckner, Beshear's chief of staff.\nMaryland\nAmong a series of new actions including limiting gatherings to 10 people and ordering closures of shopping malls, Gov. Larry Hogan said that access to the BWI Marshall Airport terminal would be restricted and residents were urged to use transit for essential travel only.\n\"Some people are treating this like a vacation or a spring break with parties, cookouts, and large gatherings,\" said Hogan. \"Let me be very clear -- if you are engaged in this, you are in violation of state law and you are endangering the lives of your fellow Marylanders.\"\nMassachusetts\nWith the exception of heath care workers, public health workers, public safety workers, transportation workers and designated essential workers, all travelers arriving to Massachusetts are instructed to self-quarantine for 14 days. Visitors are instructed not to travel to the state if they are displaying symptoms.\nNevada\nNevada Gov. Steve Sisolak issued a travel advisory, asking everyone entering the state to self-quarantine for 14 days, even if they have no symptoms of Covid-19.\nThe advisory does not apply to essential workers, including in the health care and food supply industries.\nNorth Dakota\nAll travelers arriving to North Dakota from international locations and states with widespread coronavirus outbreaks must quarantine immediately for 14 days, according to the North Dakota Department of Health website. Essential infrastructure workers are exempt.\nOklahoma\nGov. Kevin Stitt issued an order requiring travelers from New York, New Jersey, Connecticut, California, Louisiana and Washington to undergo a 14-day quarantine.\nThe order also requires delivery personnel to submit to screenings upon request at health care facilities and protects health care workers from discrimination in housing and childcare.\nRhode Island\nGov. Gina Raimondo ordered that all out-of-state travelers will be stopped at the border and told to quarantine for 14 days if they intend to stay in the state. She said the order originally applied only to travelers from New York but was extended to all states because of the rate of infection in other areas, mentioning New Jersey, Connecticut and New Hampshire by name.\nSouth Carolina\nTravelers from New York, New Jersey, Connecticut and the city of New Orleans will be ordered to isolate or self-quarantine for 14-days or the duration of their trip. The order does not apply to people employed by airlines, performing or assisting with the military, health care or emergency response.\nTexas\nGov. Greg Abbott first ordered that people flying into Texas from New York, New Jersey, Connecticut, and the city of New Orleans be quarantined for 14 days. He later expanded the order to include anyone driving from Louisiana to Texas, and flying from the cities of Miami, Detroit, Chicago, Atlanta. Also included in the order are the states of Washington and California.\nVermont\nGov. Phil Scott announced an order instructing anyone who enters Vermont from another state to self-quarantine for 14 days.\n\"That means heading directly to where you're going with no stops in-between,\" Scott said in a news conference.\nWest Virginia\nWest Virginia State Police will be monitoring state roads and highways to enforce an executive order from Gov. Jim Justice that requires out-of-state citizens to self-quaratine for 14 days.\nThe order is aimed at places that have substantial spread of the virus, and Justice named Louisiana, New York, New Jersey, Connecticut, Italy and China.\nA North Carolina county\nA North Carolina county is taking extreme measures to prevent coronavirus from spreading in its community.", "url": "https://www.cnn.com/2020/03/31/us/states-travel-restrictions-list/index.html"}