{"authors": ["Arpit Gupta", "David Sraer For Cnn Business Perspectives", "David Sraer For"], "date_download": "2020-05-04 16:58:20", "date_modify": "2020-05-04 16:58:20", "date_publish": "2020-04-09 16:47:51", "description": "Implementing selective containment once we get past the first peak of the epidemic would allow a fraction of households to resume normal activity while the rest of the population remains in quarantine, write Arpit Gupta, assistant professor of finance at the NYU Stern School of Business, and David Sraer, associate professor at the UC Berkeley Haas School of Business.", "filename": "2020_04_09_perspectives_eco_9c372d2422fefa247af413631e7eaadb_index_1588611500.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409095804-apartment-building-residents-containment-0403-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_perspectives_eco_9c372d2422fefa247af413631e7eaadb_index_1588611500.html", "title": "The best way to get Americans back to work faster", "title_page": "The best way to get Americans back to work faster (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Arpit Gupta is an adjunct fellow at the Manhattan Institute and an assistant professor of finance at the NYU Stern School of Business. David Sraer is an associate professor at the UC Berkeley Haas School of Business. The opinions expressed in this commentary are their own.\nThe Covid-19 pandemic has paralyzed the US economy, with millions of Americans being urged to stay home and many businesses shuttered. Now that the stimulus package has passed, our policymakers should be working on a credible and feasible way to reduce the length of the lockdown and get the economy back on its feet.\nPublic health experts are unanimous in their belief that it's too soon to let Americans go back to work. With limited hospital capacity, lifting all restrictions immediately would result in a new spike in coronavirus cases and put excessive strain on our health care system. But at the same time, we cannot simply \"flatten the curve\" for long enough that it becomes safe for everyone to go back to work at once: The economic costs would be enormous due to the sheer length of the resulting lockdown.\nImplementing selective containment once we get past the first peak of the epidemic could help get many Americans back to work faster while keeping the most vulnerable populations safe. This approach would allow a fraction of households to resume normal activity while the rest of the population remains in quarantine. Three simple principles should guide how we decide which households are \"released\" earlier.\n1. First, release individuals who are at the lowest risk of developing severe cases of the coronavirus. Young individuals without pre-existing conditions could return to work, while the elderly and those with conditions such as cardiovascular disease, diabetes, chronic respiratory disease and compromised lung function (for instance, due to asthma or smoking) continue to stay home.\n2. The second principle of selective containment is it needs to be adapted locally. Hospital capacity differs across states and cities. Areas with fewer ICU beds per capita need to more stringently quarantine to avoid exceeding hospital capacity. Age distribution also matters: In cities with a higher concentration of older households, a lower age cutoff for containment would prevent health systems from becoming overwhelmed.\nRead More", "url": "https://www.cnn.com/2020/04/09/perspectives/economy-working-americans-coronavirus/index.html"}