{"authors": ["Opinion Van Jones"], "date_download": "2020-05-04 16:27:39", "date_modify": "2020-05-04 16:27:39", "date_publish": "2020-04-06 22:17:22", "description": "Van Jones writes the myth that African Americans -- especially younger ones -- cannot get coronavirus is dangerous and must be exposed for the fallacy it is. Prominent figures with the African American, including pastors, commentators and influencers, can take lead in calling attention to the crisis.", "filename": "2020_04_06_opinions_african-americans-covid-19-risk-jones_index_1588609659.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406150847-african-american-coronavirus-patient-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_06_opinions_african-americans-covid-19-risk-jones_index_1588609659.html", "title": "Black America must wake up to this viral threat", "title_page": "Black America must wake up to this viral threat (opinion) - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "CNN host Van Jones is the CEO of the REFORM Alliance, a criminal justice organization for which Jessica Jackson serves as the chief advocacy officer. The views expressed in this commentary are his own. View more opinion on CNN.\n(CNN) At the start of any pandemic, early information can mislead . Unfortunately, for vulnerable populations, false assumptions can have deadly consequences.\nAfrican Americans are about to learn this awful truth -- in devastating ways.\nTwo data points converged at the start of this crisis to make a lot of black folk shrug and think, \"Coronavirus is not our problem.\"\nMyth #1: Covid-19 is a white disease.\nThe Americans who were initially diagnosed with the virus were mostly white. At the beginning of the epidemic, the media understandably focused on affluent white people who had traveled overseas, especially to Asia. The impact of this news coverage had African Americans joking among ourselves that perhaps we were somehow immune to the virus. As crazy as it sounds, a rumor took off that this was a disease that kills only white people.\nIt got so bad that Idris Elba, one of the first famous black victims of coronavirus, had to post a video begging black people to believe that people of African descent could get it, too.\nAnd yet, when I warned my family of the coming pandemic, my highly educated cousin told me, with great confidence: \"No, we got the antibodies for that!\"\nMy cousin's reaction reminded me of the early days of the HIV epidemic, when people thought of AIDS as a \"white, gay\" disease. The first visible victims were gay white men. But the illness soon devastated black communities and African nations. Today, AIDS is largely associated with poverty and race.\nCovid-19 is likely to follow the same trajectory. The perception that the disease impacts older, more affluent and whiter populations will soon give way to a heartbreaking realization: the virus is crushing poorer and blacker populations , and it's affecting young people , too.\nMyth #2: Younger people are safe.\nAnd yes -- I did say \"younger.\" The second data point was that (in Asia and Europe) this disease has mostly killed older people . Since communities of color are statistically much younger than the white population, many thought this disease posed no particular threat to people of color.\nHowever, it's important to keep in mind, first, that younger people -- even healthy ones -- are at risk of contracting and spreading the virus. In states like New York, about one in five hospitalizations are occurring in people under the age of 44, according to the city's health department. And the numbers appear even grimmer in parts of the South\nIn addition, younger African Americans are already dying at higher rates from diabetes, HIV and cancer than white populations of the same age, according to the Centers for Disease Control and Prevention. And people who contract Covid-19 and are already immunocompromised appear at greater risk of complications from the virus, should they contract it.\nFurthermore, obesity rates are significantly higher among both African American children (17 and under) and adults (18 and older), according to the Department of Health and Human Services. And obesity puts them at greater risk of those underlying immunocompromising illnesses such as diabetes and high-blood pressure\nFact: Black communities are already reeling.\nIn fact, as the virus smashes into black communities, it is actually one epidemic jumping on top of several other epidemics. The sad fact is too many African Americans are not healthy or adequately insured on a good day. In polite company, we speak delicately about \"disproportionate health outcomes.\" But this antiseptic term does not capture the truth. Black people are sicker than white people across the board.\nAnd this virus may be especially fatal to people who have out-of-control hypertension -- a disease that is nearly at epidemic levels in the black community. While focusing on the elderly population, the media underreported the risk to people with hypertension or high-blood pressure.\nJUST WATCHED Surgeon general: This week will be 'Pearl Harbor moment' Replay More Videos ... MUST WATCH Surgeon general: This week will be 'Pearl Harbor moment' 00:48\nIn addition to poor health, African Americans are disproportionately low-income. And low-income people are often trapped or crowded into situations where the sheer population density makes it hard to \"social distance.\" Therefore, the virus will likely spread quickly in housing projects, homeless shelters, prisons and jails -- adding to the risk and pain for those black Americans who are stuck in poverty.\nThe hard truth: At this rate, Covid-19 is going to devastate black America.\nBased on the arguments above, Covid-19 will kill black people in shockingly massive numbers. We should expect to see black people dying at much younger ages and in much larger numbers than the nation's leaders have been suggesting. And now the anecdotal evidence is pouring in.\nIn New York City, data from the Association for Neighborhood & Housing Development is showing the communities hit hardest by the pandemic are the lower-income communities in the outer boroughs, where a higher percentage of the population is black or brown and many residents work service industry jobs.\nIn Michigan (one of the few states tracking data on Covid-19 and race) so far, African Americans account for 33% of cases and 40% of deaths.\nAccording to the Charlotte Observer, data from Mecklenburg County (which houses Charlotte) shows approximately 44% of the population with Covid-19 is African American, while the county itself is only 33% black.\nMilwaukee County is 27% black, yet the first eight people who died in the area because of coronavirus were African American. As of Friday, 81% of the 27 deaths in the county were black people. Almost half of the 945 cases are African American.\nIn Memphis, most of the screening is missing the poor, black communities and instead is focused in affluent suburbs according to a heat map that shows where coronavirus testing is taking place.\nIn Philadelphia, the highest percentages of positive tests are consistently coming from ZIP codes that have a large minority population.\nConclusion: It's time to sound the alarm.\nWhile some black media and influencers are starting to speak up about this, it's not nearly enough. We need to crank up the volume in black communities across the nation urgently and immediately.\nHere are the things black media, influencers and leaders can call for:\n1. Warn black people the threat to their health is significant.\nThis is not a drill. Influential figures in black communities need to unite and overcorrect for the misinformation running rampant about African Americans being immune to Covid-19. Due to centuries of mistrust, we need to take it upon ourselves as leaders to ensure all of our friends, family members and communities know the truth: Black people are in far greater danger of dying from this illness due to preexisting health conditions, living environments, professions and limited access to health care.\n2. We need to demand racial data.\nWhile Covid-19 may not discriminate based on race, US health care certainly does. History shows us that if you are poor and black or brown, you aren't going to be first in line for support. Without data on who is getting testing and treatment, we will not be able to hold the system accountable. Democrats in Congress are already demanding data from the federal government about the racial disparities in the nation's response to the coronavirus pandemic. We all need to support these efforts.\n3. Call for people to be released from prisons and jails.\nIncarcerated people are in prisons and jails, not on another planet -- corrections officers enter and leave these facilities every day, and approximately 200,000 people flow into and out of jails every week. We must call on our elected officials to take drastic action in two directions immediately and simultaneously: depopulate jails and prisons safely, and surge medical and sanitation supplies into these institutions.\nGet our free weekly newsletter Sign up for CNN Opinion's new newsletter. Join us on Twitter and Facebook\n4. Black churches should stop holding services, and offer our houses of worship as shelter for people seeking refuge.\nToo many black pastors are continuing to hold church services , even while Rev. Al Sharpton and other black church leaders call for pastors to discontinue in-person services until the epidemic passes.\nIt's crucial for pastors to heed this call. Of course God asks us to have faith in Him. But we should also respect the laws by which He has ordered the universe. For example, gravity is real. Few Christians would dare to jump off a 100-story building and expect to be saved by the power prayer alone. It would be just as foolhardy to ignore the scientific warnings about the dangers of this virus. One can have faith in God and respect for this virus at the same time.\nBlack churches can play a powerful role. They can protect the well by postponing in-person worship services until the pandemic ends. And they can help the sick and uncertain -- by letting people self quarantine in their sanctuaries.", "url": "https://www.cnn.com/2020/04/06/opinions/african-americans-covid-19-risk-jones/index.html"}