{"authors": ["Rob Harris"], "date_download": "2020-05-04 20:29:01", "date_modify": "2020-05-04 20:29:01", "date_publish": "2020-04-20 17:18:43", "description": "Arsenal manager Mikel Arteta and his players agreed to reduce pay by 12.5% on Monday for the next year to help their club deal with the financial impact of the coronavirus. No games have...", "filename": "_2c4555b9ab14d38d61491ccd98551398_1588624141.html", "image_url": "https://storage.googleapis.com/afs-prod/media/9a03da81c84a4f89b7ca30c92696a64f/3000.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_2c4555b9ab14d38d61491ccd98551398_1588624141.html", "title": "Arsenal players, coaches agree to 12.5% pay cuts for year", "title_page": "Arsenal players, coaches agree to 12.5% pay cuts for year", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "Closed gates at Arsenal's London Colney training ground in London, Friday, March 13, 2020. Arsenal manager Mikel Arteta has tested positive for the coronavirus. It has forced the club to close its training complex, put the entire first-team in self isolation and for its Premier League match against Brighton on Saturday to be postponed. (Bradley Collyer/PA via AP)\nClosed gates at Arsenal's London Colney training ground in London, Friday, March 13, 2020. Arsenal manager Mikel Arteta has tested positive for the coronavirus. It has forced the club to close its training complex, put the entire first-team in self isolation and for its Premier League match against Brighton on Saturday to be postponed. (Bradley Collyer/PA via AP)\nArsenal manager Mikel Arteta and his players agreed to reduce pay by 12.5% on Monday for the next year to help their club deal with the financial impact of the coronavirus.\nNo games have been played in the English Premier League for six weeks and the competition is not likely to resume until at least June due to the national lockdown and social distancing.\n“There has been a clear appreciation of the gravity of the current situation,” Arsenal said, “and a strong desire for players and staff to show their backing for the Arsenal family.”\nThe voluntary reduction in annual earnings by the players and coaches will come into effect next month once the paperwork is completed this week.\n“If we meet specific targets in the seasons ahead, primarily linked to success on the pitch, the club will repay agreed amounts,” Arsenal club said. “We will be able to make those repayments as hitting these targets, which the players can directly influence, and will mean our financial position will be stronger.”\nThe north London club has 10 games remaining and is eight points from fourth place with a game in hand on Chelsea as it chases a first Champions League qualification in four years.\nArsenal did reach the Europa League final last season, losing to Chelsea, helping the club generate an annual income of almost 400 million pounds ($500 million). But the the business did lose 32.2 million pounds.\nWhen the Premier League eventually resumes, games are likely to be held without fans — denying clubs millions of pounds in revenue.\nThe league remains in talks with the government about when player training and games can restart, with the national lockdown in place until at least May 7.\n“We have been clear throughout all of it that the government will not consent to events taking place unless we can be sure it is safe to do so,” said Culture Secretary Oliver Dowden, whose cabinet brief covers sport.\n___\nMore AP soccer: https://apnews.com/Soccer and https://twitter.com/AP_Sports", "url": "https://apnews.com/2c4555b9ab14d38d61491ccd98551398"}