{"authors": ["Dana Bash", "Bridget Nolan", "Cassie Spodak"], "date_download": "2020-05-04 16:58:54", "date_modify": "2020-05-04 16:58:54", "date_publish": "2020-04-09 18:37:12", "description": "Tulsa, Oklahoma, Mayor G.T. Bynum says one of the worst days of his life was the day he decided to shut down the restaurants.", "filename": "2020_04_09_politics_tulsa-mayor-dana-bash-interview_index_1588611534.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200409135805-tulsa-mayor-gt-bynum-dana-bash-coronavirus-mh-orig-00003812-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_tulsa-mayor-dana-bash-interview_index_1588611534.html", "title": "This Republican mayor is taking a more aggressive approach to stop coronavirus than his GOP governor", "title_page": "This Republican mayor is taking a more aggressive approach to stop coronavirus than his GOP governor  - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) Tulsa, Oklahoma, Mayor G.T. Bynum says one of the worst days of his life was the day he decided to shut down the restaurants .\nBynum, a former city councilor, was elected Tulsa's mayor some three years ago. Like local officials across the country , he now finds himself on the front lines of implementing strict policies to stop the spread of coronavirus\nThe Republican leader said he understood the economic peril his decision would cause the people in his city -- even some of his good friends. But the alternative, the science and public health experts told him, was that people would risk getting coronavirus and the hospitals could get overrun.\n\"I ran for mayor because I didn't feel like our city was aiming high enough,\" he told CNN in a virtual interview from his home, which he has turned into his Covid-19 command center. \"I thought we ought to be aspiring to be greater than we were, and one of the sectors that I drew inspiration from in our community were the entrepreneurs that built up this great restaurant scene here. Many of them young professionals who risked everything that they had and put everything into these businesses.\n\"And to have to knowingly put in place an order that I knew would cause thousands of people, who are wonderful people, to lose their jobs -- and to close down those dreams of so many people I admire -- it was terrible, but the alternative was worse.\"\nIt's the same choice leaders at the federal, state and local levels had to make across the country. What made it even more challenging is that Oklahoma's Republican governor, Kevin Stitt , has mandated that vulnerable citizens stay home, but is resisting the kind of shelter-in-place order that the vast majority of governors have implemented.\nIt's put in Bynum in a difficult position of being out of step in terms of messaging with his governor and fellow Republican.\n\"Just to be candid, yes, it makes it harder as a mayor when I'm telling my neighbors that we have to sacrifice in these ways to close businesses and that we need to be sheltering in place when the pushback I get from a lot of people is, 'Okay, we're willing to do this, but we don't want our bed in the hospital taken up by somebody in an outlying county that didn't do these things. And so, don't ask us to sacrifice here in Tulsa when there are people in other parts of the state who don't have to make the same sacrifices who could get one of our ICU beds and somebody in my family wouldn't have access to it.' And I think that's a fair concern for people,\" he said.\nStitt faced national backlash last month by sending a now-deleted tweet: \"Eating with my kids and all my fellow Oklahomans at the @collectiveOKC. It's packed tonight!\"\nTulsa's mayor says that was \"hard\" because it was the same day, he began to limit public events in his city, one of Oklahoma's biggest.\n\"That night, that picture popped up on social media for a while. And that's hard because it's sending mixed messages to people from their elected leadership as to what they ought to be doing,\" Bynum said.\nBut he also says it was understandable.\n\"He has the same concern that I do, and I think any elected official should, which is worry about what's the impact on the economy going to be and when is the right time to start putting in these social distance practices? I just got there, I think, maybe earlier than he did in the decision-making process as far as putting those types of practices in place,\" Bynum said.\nBynum's decisions sometimes also run against residents who are resistant to abandoning a culture that takes pride in protecting personal freedoms.\n\"Dealing with a public health emergency like this, it creates a great challenge when you're trying to tell people everything they can't do,\" Bynum said.\nSince he first began implementing restrictions in mid-March, some Tulsa constituents were so angry, they even compared him to Adolf Hitler.\n\"I was shutting down businesses and telling people where they had to be and that they couldn't leave their homes except for particular instances. And so, most people react to that in a pretty stoic, calm way, but when you have this level of stress, there are always going to be some people that can't handle it. And their outlet for that is to accuse me of being some sort of authoritarian dictator when the only power I have as a mayor is derived from the citizens who elect me to protect them,\" Bynum said.\nLeaning on fellow mayors\nLike other mayors CNN has spoken to who are trying to navigate this unprecedented situation, Bynum says he is in constant touch with his counterparts in other cities, many of whom he has met through groups like the US Conference of Mayors, or the Bloomberg Harvard City Leadership Initiative.\nIn fact, Bynum became friends with Seattle Mayor Jenny Durkan, a Democrat, who was one of the first to have a novel coronavirus hotspot in her city. He says he reached out to her for guidance on how to proceed in Tulsa, based on her experience.\n\"It gave us the opportunity to adjust earlier in the process simply because I could see what my colleague, my friend, was dealing with in another city,\" Bynum said.\nHe says he relies the most heavily on his counterpart in Oklahoma City, a longtime friend, who is also putting strict restrictions in place.\n\"I cannot imagine having navigated this event over the last month without the partnership that I have with Mayor [David] Holt. We're really lucky because he and I, we've been friends for 20 years. We both started out as a low-level rookie staffers on the Hill and became friends back then,\" Bynum said.\n\"I'll also say, just from a purely human standpoint, it's a lot easier to make a really hard decision when you know that your colleague in your sister city is going to make the same decision,\" he added.\nDismantling swing sets on playgrounds\nBynum says that when he was elected Tusla's mayor, one of his campaign promises was to overcome increasing isolation from one another -- from shrinking church and civic engagement to people spending more time on social media than in public spaces.\nOne of his proudest accomplishments in Tulsa is a $500 million park called the Gathering Place, which opened last year. He says that makes the pain of having to close all parks and playgrounds right now even more sharp.\nOne of the heartbreaking images the mayor's office sent to CNN shows city officials dismantling basketball hoops and taking apart swing sets.\nBynum said they had to take that extreme step because residents were still using it all, despite orders to the contrary.\n\"As both a mayor and as a dad of two kids, that's tough when you see people so badly wanting to come together and be together and know that the best way to protect them is to take away and to disincentivize those things that are drawing them together,\" he said\nWorking from home\nAlthough he does leave home every so often to join local leaders for a press conference, or check in at city hall, for the most part, Bynum is fighting this virus by working the phones morning until night from his house.\nIt is a deliberate decision he knows may be perceived as extreme or paranoid, but that's fine with him.\n\"We have a city workforce of 4,000 employees of a metro area of over a million people, and they require a mayor who has their wherewithal and their judgment and their health to make decisions that can protect them. And you can't do that if you've contracted the virus and are laid up,\" the Tulsa mayor said.\nHe keeps in touch with residents largely via social media, which he says he has always done himself \"for better or worse.\"\nThe comments on his Facebook page -- many of which he replies to -- are largely positive, thanking him for what he is doing in this time of crisis. But there is also some tough criticism, like from a resident who wrote: \"The stupidest thing you've done so far is to close the golf courses. You must think we're stupid and unable to take care of our own situations.\"\nBynaum said he gets that a lot.\n\"Some of the angriest people I've dealt with in the course of this have been golfers, which I think is ridiculous. And as I've told them, we're trying to save people's lives here. If you're arguing about your ability to play golf, then you're clearly not taking this seriously,\" he said, noting that golfers have been more upset with him than restaurant owners who are suffering tremendously economically.\nTulsans are used to natural disasters. The Mayor calls Covid-19 much worse\nTulsa is in tornado alley. It is a city prone to flooding and ice storms.\nBut, just like Tampa Mayor Jane Castor told CNN about their history with hurricanes, Tulsa's mayor says its frequent natural disasters are nothing compared to the way Covid-19 is hitting the city.\n\"In each of those challenges, usually the event happens very quickly and then we pull together as a community to solve that and help one another. In this case, it's a more slow rolling challenge,\" the mayor said.\n\"The best thing that we can do for one another is to stay away from each other, he added.\nWhat keeps him up at night, more than anything else?\n\"How we get back to normal. I think that's probably the biggest one that I'm trying to think through. When testing is not readily available at every drug store and doctor's office, how do people get the confidence, not just governmentally how do we lift orders, but how do everyday people get restored confidence that they can go out and go to a movie theater or go to a restaurant or go to a concert? And that is something that I think, in my mind, is a real challenge for us so long as testing is so limited in supply and is really only available for those who are the most ill,\" he said.\nBut, he insists, being a mayor now means he doesn't have the luxury of philosophizing about what went wrong. Not yet.", "url": "https://www.cnn.com/2020/04/09/politics/tulsa-mayor-dana-bash-interview/index.html"}