{"authors": ["Adrian Sainz"], "date_download": "2020-05-04 20:13:55", "date_modify": "2020-05-04 20:13:55", "date_publish": "2020-04-16 18:31:07", "description": "MEMPHIS, Tenn. (AP) — Knox Phillips, the son of renowned music producer Sam Phillips and an enthusiastic ambassador of Memphis music who worked on records by Jerry Lee Lewis, Willie Nelson and...", "filename": "_8b75bc9c2f306ea4676773705b8c12b6_1588623235.html", "image_url": "https://apnews.com/images/ShareLogo2.png", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_8b75bc9c2f306ea4676773705b8c12b6_1588623235.html", "title": "Music industry mainstay Knox Phillips dies in Memphis", "title_page": "Music industry mainstay Knox Phillips dies in Memphis", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "MEMPHIS, Tenn. (AP) — Knox Phillips, the son of renowned music producer Sam Phillips and an enthusiastic ambassador of Memphis music who worked on records by Jerry Lee Lewis, Willie Nelson and John Prine during more than 50 years in the industry, has died. He was 74.\nPhillips’ brother, Jerry Phillips, told The Associated Press that his older sibling died Monday at home, with his wife. Knox Phillips previously suffered from cancer and battled serious illnesses in recent years, his brother said in a phone interview.\nKnox Phillips had a friendly personality and a welcoming demeanor, backed by his trademark, bushy mane of hair. He seemed to take joy in shaking hands, and chatting with friends and strangers alike, during music events.\n“He was the ultimate Memphis music ambassador, a politician for Memphis music,” Jerry Phillips said.\nPhillips was instrumental in bringing a chapter of a National Academy of Recording Arts and Sciences to Memphis in the early 1970s. He’s also in the Memphis Music Hall of Fame.\nHis love of Memphis music began when he was a child.\nKnox Phillips grew up at Sun Studio, the recording capital founded by his father, Sam Phillips. Some of American music’s most popular artists — Elvis Presley, Carl Perkins, Johnny Cash, Roy Orbison and Lewis — recorded at the Memphis studio.\nAs a boy, Knox Phillips hung out at Presley’s house. Later in life, he became a producer, engineer, studio owner and unabashed promoter of his father’s legacy.\n“Sometimes, being in the shadow of somebody like Sam Phillips, it’s a little hard to get your own footing, you know?” Jerry Phillips said. “But he was able to do that.”\nPhillips co-produced Prine’s 1979 album “Pink Cadillac” with his brother Jerry, according to a biography on the Memphis Music Hall of Fame’s website. Prine died on April 7 from complications from the coronavirus.\n“Knox coaxed father Sam to the studio telling him that this guy’s voice was so bad, he’d love him,” said the Hall of Fame’s biography by author Robert Gordon.\nHe worked on the Amazing Rhythm Aces’ “Third Rate Romance,” a Grammy winner. Phillips also engineered parts of Willie Nelson’s “Shotgun Willie” and Jerry Jeff Walker’s “Mr. Bojangles.”\nHe also worked on several albums by Lewis and, at Sam Phillips Recording Studio in Memphis, Phillips brought in producers and musicians like Jim Dickinson and Big Star’s Alex Chilton.\nKnox Phillips give musicians free studio time and financial help if they needed it, his brother told the AP.\n“He never met a stranger,” Jerry Phillips said. “He always was more concerned with you than him.”\nElvis Presley Enterprises CEO Jack Soden said Phillips promoted “all aspects of the Memphis music legacy.”\n“We are devastated by the news of the passing of our dear friend Knox Phillips,” Soden said in a statement.", "url": "https://apnews.com/8b75bc9c2f306ea4676773705b8c12b6"}