{"authors": ["The Associated Press"], "date_download": "2020-05-04 20:28:42", "date_modify": "2020-05-04 20:28:42", "date_publish": "2020-04-07 06:18:43", "description": "A survey of 15 golf writers voted on the top Masters in history. They are being republished this week because the Masters has been postponed due to the coronavirus pandemic. The 1954 Masters was...", "filename": "_d6730bc5bbc2f7e5338e78e381a39fd5_1588624122.html", "image_url": "https://storage.googleapis.com/afs-prod/media/f17b13b3c7c843929e35db541683f7fe/2794.jpeg", "language": "en", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/apnews.com/_d6730bc5bbc2f7e5338e78e381a39fd5_1588624122.html", "title": "Snead tops Hogan in playoff to win '54 Masters", "title_page": "AP Was There: Snead tops Hogan in playoff to win '54 Masters", "title_rss": "NULL", "source_domain": "apnews.com", "maintext": "FILE - In this April 12, 1954, file photo, Sam Snead, White Sulphur Springs, W. Va., tees off in an 18-hole Masters playoff at Augusta National Golf Club in Augusta, Ga. Snead and Ben Hogan, standing behind, second from left, tied the day before in the championship. In what was voted the sixth-best Masters, Snead won his third green jacket. (AP Photo/File)\nFILE - In this April 12, 1954, file photo, Sam Snead, White Sulphur Springs, W. Va., tees off in an 18-hole Masters playoff at Augusta National Golf Club in Augusta, Ga. Snead and Ben Hogan, standing behind, second from left, tied the day before in the championship. In what was voted the sixth-best Masters, Snead won his third green jacket. (AP Photo/File)\nA survey of 15 golf writers voted on the top Masters in history. They are being republished this week because the Masters has been postponed due to the coronavirus pandemic. The 1954 Masters was voted No. 6. The following story moved on April 12, 1954.\n___\nAUGUSTA, Ga. (AP) — Sam Snead gambled with the “graveyard of the Masters,” the tortuous thirteenth hole, and beat Ben Hogan by a stroke in an 18-hole playoff for the Masters golf title Monday.\nSnead won by a score of 70 to Hogan’s 71 in a duel that carried right up to the final green. They had finished the regulation 72 holes Sunday with scores of 289, highest ever to win a Masters tournament.\nThe victory made Snead the second man ever to win the Masters three times, putting him even with Jimmy Demaret. And it deprived Hogan of the same honor and preserved the tradition that no Masters champion ever repeats the next year.\nHogan had won last year with a record 274 score and before that in 1951. Snead’s previous victories had come in 1949 and 1952. Demaret, completing his triple in 1950, was the only player to break the mastery these two have held over the huge, testing Augusta National course in six years.\nIt was the first head-to-head meeting between these two since 1950.\nSnead was the one who got it — on the thirteenth hole, where many fine golfers have blown themselves right out of the tournament.\nIt was on the thirteenth Sunday that Billy Joe Patton, the amateur sensation of this year’s tournament, took a painful seven that cost him a victory. Patton was a member of Monday’s gallery of some 7,000.\nPar for the Augusta National course, with its 6,800 yards of landscaped fairways, is 36-36_72. Snead with 35-35_70 was just two under while Hogan had 35-36_71. The scores were in keeping with the unusually high 72-hole total.\nWhile the scoring wasn’t sensational, the tense duel between these two great golfers kept the sweating, hurrying spectators on edge right to the finish. The thirteenth was the deciding hole and when Hogan three-putted the short sixteenth, Sam’s victory seemed assured. But it wasn’t until Snead came out of a trap within putting distance of the last hole that the crowd really relaxed.\nAfter they had turned the first nine all even, Snead went ahead for the first time when he holed a sensational chip shot from off the edge of the tenth green. Hogan got that one back on the twelfth and they came to the “graveyard” thirteenth.\nThis is a 470-yard, par five hole with a sharp dogleg around some woods to the left. A creek winds in a deep ditch along the left side of the fairway, crosses in front of the green and bends around the right side of it.\nHogan, hitting first, elected to play safe. He drove to the right of the fairway and played a safe shot short of the creek. But Sam elected to gamble. He slammed his drive close to the trees on the bend, took an iron and fired a long, low shot to the green some thirty-five feet past the pin. Hogan’s chip was weak and stopped on the front fringe of the green.\nSnead, who has a reputation as a shaky putter and who admitted to the worst case of “yips” in his career before this tournament started, made an almost perfect putt. It came so close to dropping for an eagle that his caddy, holding the pin, bent down to the ball and waved it on.\nHogan, putting from the fringe, couldn’t get down and Sam tapped his one-footer in for a birdie that put him ahead to stay.\nWhen they halved the seventeenth in par fours, Snead’s face finally relaxed into a smile. But it wasn’t entirely settled. On the last hole Snead’s second shot went into the trap while Ben was on the green. Sam played a beautiful explosion shot to within six feet of the cup. Hogan’s putt was barely short and he got down for his four. Snead missed his first putt, but it didn’t matter. He was close enough to get the winner.\nAP surveyed 15 golf writers on the top Masters in history. We begin our countdown with the 1954 Masters, voted No. 6 by our panel.\nRead the original story: https://t.co/6dVfgb9g2b pic.twitter.com/L5LtO3NYIZ — AP Sports (@AP_Sports) April 8, 2020\nFor a while on the front nine, Snead was close to succumbing to the jitters. He saw Hogan make a beautiful recovery from a trap to halve the 555-yard second in birdie fours and then Sam had three-putted the 220-yard fourth to go one down.\nThis was the second Masters playoff which Hogan had lost. Byron Nelson beat him by a stroke in 1942.\nThis time the stakes were a lot higher. With the guaranteed purse increased by 150 per cent at the end of the tournament, the winner’s share was $5,000 and the loser’s was $3,175.\nThe only other Masters playoff took place in 1935 when Gene Sarazen beat Craig Wood in a 36-hole duel.\nSnead and Hogan now have clashed three times in two-man duels and the score stands 3-0 in Snead’s favor. He beat Hogan in the San Francisco match play tournament before the war and again in the playoff for the Los Angeles Open title in 1950.\n___\nThe panel of voters: Jeff Babineau, Morning Read; Michael Bamberger, golf.com; Mark Cannizzaro, New York Post; Iain Carter, BBC; Steve DiMeglio, USA Today; Doug Ferguson, Associated Press; Bob Harig, espn.com; Rex Hoggard, golfchannel.com; Derek Lawrenson, The Daily Mail; Tod Leonard, golfdigest.com; Jim Litke, Associated Press; Jim McCabe, pgatour.com; Bill Pennington, New York Times: Dave Shedloski, golfdigest.com; John Strege, golfdigest.com.", "url": "https://apnews.com/d6730bc5bbc2f7e5338e78e381a39fd5"}