{"authors": ["Gregory Wallace"], "date_download": "2020-05-04 16:27:35", "date_modify": "2020-05-04 16:27:35", "date_publish": "2020-04-07 18:00:41", "description": "The union representing flight attendants for American Airlines says about 100 flight attendants have tested positive for the coronavirus.", "filename": "2020_04_07_business_america_7f542e7e9281cdf880c9570add816b5e_index_1588609655.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323120505-american-airlines-0320-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_business_america_7f542e7e9281cdf880c9570add816b5e_index_1588609655.html", "title": "American Airlines union says 100 flight attendants have coronavirus", "title_page": "American Airlines union says 100 flight attendants have coronavirus - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Washington (CNN Business) The union representing flight attendants for American Airlines says about 100 flight attendants have tested positive for the coronavirus.\nThe Association of Professional Flight Attendants, representing more than 27,000 flight attendants, disclosed the figure in a message to its membership and said the airline has \"agreed to start providing face masks for frontline team members while at work should you choose to wear one.\" The union said masks are being distributed this week.\nAPFA president Julie Hedrick said Tuesday the union has \"been pushing the company since January\" to provide personal protective equipment for flight attendants.\n\"We have consistently advocated for Personal Protective Equipment (PPE) for all of our flight attendants to be available on every aircraft, for social distancing between passengers and crew jump seats, for thermal scanning in the airports, and to receive immediate notification of flight attendants who have tested positive for the virus,\" Hedrick said. \"Flight attendants are aviation's first responders, who are transporting medical personnel and supplies into COVID-19 hotspots, and they need to be treated and protected as such.\"\nAmerican would not comment directly on the union's claim of flight attendants testing positive for the virus at the world's largest airline.\nRead More", "url": "https://www.cnn.com/2020/04/07/business/american-airlines-flight-attendants-coronavirus/index.html"}