{"authors": ["Melissa Merrick Phd", "Robert Sege Md"], "date_download": "2020-05-04 16:26:07", "date_modify": "2020-05-04 16:26:07", "date_publish": "2020-04-07 07:43:32", "description": "Two child abuse experts say parents and caregivers need to talk with their children, try to reduce their own stress and stay connected to their community, to reduce abuse in a time of great upheaval.", "filename": "2020_04_07_health_child-abu_d88a9cf3e56461325408aecc86ec5975_index_1588609567.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200406155554-mother-discipline-child-stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_07_health_child-abu_d88a9cf3e56461325408aecc86ec5975_index_1588609567.html", "title": "Parents have a right to be stressed. But don't take it out on your kids", "title_page": "Parents have a right to be stressed. But don't take it out on your kids - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Melissa Merrick, PhD, is the president and CEO of Prevent Child Abuse America. Robert Sege, MD, PhD , is a pediatrician at Floating Hospital for Children at Tufts Medical Center in Boston and on the board of Prevent Child Abuse America.\n(CNN) Just as prior generations were deeply affected by the Great Depression, the assassinations of Martin Luther King and the Kennedys and the horrors of 9/11, the Covid-19 pandemic may well be the defining moment in the lives of today's children.\nThat's why we owe it to our children to focus on positive experiences during these difficult times, while minimizing adverse experiences that can wound children for a lifetime.\nWe already know that positive experiences, especially close relationships, promote healthy child development and allow us to withstand the ups and downs of life beyond the current pandemic.\nAt the same time, adverse experiences such as child abuse, neglect and family challenges -- particularly in the absence of protective factors -- can cause lasting damage to mental and physical health.\nWhile many parents aren't thinking about child abuse, raising awareness during this health crisis is key. That's because the increased stress we're seeing in families due to the virus can increase children's risk of abuse at the hands of their loved ones.\nChildren who are usually in school are now learning at home. Their parents may be working from home, working at essential jobs (without good childcare options) or may have lost their jobs.\nChildren who are being abused or neglected are more likely to go unnoticed without teachers and others to help them. (Anyone worried about the possibility of abuse or neglect can still contact the national child abuse hotline: 1-800-422-4423 or childhelphotline.org . Crisis counselors answer calls 24/7 and provide crisis intervention, information, and referrals.)\nSome families will find that heightened stress can result in domestic violence which itself deeply affects children. If there is a gun in the home there may be greater risk, and local police are trained to help. (call the national domestic violence hotline at 1-800-799-7233 or by chat at thehotline.org .)\nApril is Child Abuse Prevention Month , a perfect time to raise awareness and take actions to support children and create experiences that will help them understand, grow, and be resilient in this unprecedented time.\nTalking with children\nAsk children about their feelings. Try to listen without judgment. Just being heard strengthens your important relationships with your children.\nChildren need to know that they matter. Explain why physical distancing, staying at home, not playing outside with their friends, and canceling school are personal sacrifices that they (and we) make for the good of all of us. Understanding and talking about this as a shared sacrifice builds their foundations for empathy.\nAddress children's fears. Children old enough to see the news may worry, without understanding the meaning of what they view. While the news is scary, we can be both honest and reassuring by explaining how social distancing is helping and how scientists around the world are working together to help solve the crisis.\nCoping with stress\nMany families are financially stressed, even more than usual. It's okay to talk with kids about your experience and what you're doing about it. Find resources to make it through this difficult period. Fortunately, communities; local, state, and federal governments; and many businesses and nonprofits are helping meet basic needs.\nSome of us have work we can do at home. While this is a blessing, it's also confusing for children, and stressful for us. For younger children, establish routines so they know when you can be interrupted, and activities to do when you're not.\nBe kind to yourself. It's simply not possible to have both normal work productivity and be constantly available to your children. If you need to turn the TV on and have kids watch a movie or play a video game to give you time to focus, it's OK!\nParents sometimes need a time out, too. It's fine to take a moment for a deep breath, or even step inside a locked bathroom or outside patio to decompress. Our kids are watching and learning how to best deal with stress. Try to stay calm and unapologetic about taking time for yourself so that you have something left to give your kids when you're in the right head space.\nReaching out and maintaining community\nKindness toward families. We are seeing an outpouring of kindness to families with children at home. Neighbors are dropping off diapers for economically stressed families, writing uplifting messages in sidewalk chalk, and putting teddy bears in their windows for toddlers and young children to find on neighborhood walks. Think about what you can do for families in your community.\nMore technology is OK. Maintaining our own social connections and those of our children means more reliance than ever on the web. Parents might relax their rules about internet use and allow children frequent contact with their friends online over Skype, Zoom, FaceTime or the like. Similarly, having a virtual cup of coffee with a friend can reduce our own isolation.\nExpect to have times of depression or anxiety. Those of us who have dealt with these conditions in the past may want to seek help early. If you, or a friend or family member, is considering harming themselves, respond immediately and get help. Turn to your doctor or mental health provider, or call the national suicide prevention hotline at 1-800-273-8255 or visit Those of us who have dealt with these conditions in the past may want to seek help early. If you, or a friend or family member, is considering harming themselves, respond immediately and get help. Turn to your doctor or mental health provider, or call the national suicide prevention hotline at 1-800-273-8255 or visit suicidepreventionlifeline.org for 24/7 access to a trained counselor.\nPhysically distancing ourselves is critical to prevent infection and the spread of the virus. At the same time, social connections are more important than ever to preventing child abuse and negle\nDuring child abuse prevention month and beyond, we can all focus on making sure that our children will have good stories to tell their grandchildren.", "url": "https://www.cnn.com/2020/04/07/health/child-abuse-prevention-coronavirus-wellness/index.html"}