{"authors": ["Kaitlan Collins", "Kevin Liptak", "Jim Acosta", "Vivian Salama"], "date_download": "2020-05-04 16:57:42", "date_modify": "2020-05-04 16:57:42", "date_publish": "2020-04-09 14:52:47", "description": "President Donald Trump is preparing to announce a second coronavirus task force solely focused on reopening the nation's economy, multiple sources told CNN.", "filename": "2020_04_09_politics_trump-economy-task-force_index_1588611462.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200408191448-trump-task-force-briefing-4-8-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_09_politics_trump-economy-task-force_index_1588611462.html", "title": "Trump preparing to announce second task force focused on economic recovery", "title_page": "Trump preparing to announce second task force focused on economic recovery - CNNPolitics", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "Senior aides such as Treasury Secretary Steven Mnuchin and National Economic Council Director Larry Kudlow have been solely focused on the issue of restarting a wounded American economy for weeks , along with a coterie of aides.\nBut in recent days, inside and outside advisers have appealed to Trump to formally create a separate task force in order to streamline the process so it can focus primarily on reopening the economy. This task force would likely include senior staff from the Treasury Department, the National Economic Council, the Labor Department and the Department of Commerce.\nBut it wouldn't only have administration officials involved. There has been outreach to figures such as Gary Cohn, Blackstone CEO Steve Schwarzman, Art Laffer and even major sports teams and well-known athletes.\nOther Trump allies have proposed naming a recovery \"czar\" from the private sector to oversee efforts to revive the consumer economy and address unemployment after coronavirus forced the closure of businesses across sectors.\nInfluential conservatives have floated Laffer as the leader of the task force, and he has presented some ideas to senior White House aides on a plan to revive the economy. His plans have included a proposal to tax nonprofits, cut the pay of some public officials and offer a payroll tax holiday.\nTrump awarded Laffer a presidential medal of freedom last year, but the White House hasn't yet offered him a position on a new panel, according to a senior administration official.\nOver the past week, Trump's economic team has had several meetings with him where they advised that even if the economy doesn't open up all at once on May 1 -- a date advisers have circled as a potential reopening date -- the administration should at least announce an estimated timeline with guidance for how to transition the economy back to normal.\nThey have told the President he needs to issue economic guidelines in addition to ones about best health practices. Some members of the President's team have begun weighing guidelines on when states can return to normal, including a sustained 14-day period with a reduction in cases and hospitals returning to pre-crisis conditions.\nTrump has expressed interest in a \"big bang\" reopening, where the entire country comes back online at once. But health experts have cautioned that certain areas will be further along than others by the end of the month.\nSome aides expect the debate over how and when to reopen the economy to lead to clashes between Trump's health and economic teams. The formation of a second task force -- separate from the health-focused body led by Vice President Mike Pence -- could aggravate the impression of opposing factions.\nHow much power Trump has to \"reopen\" the economy remains limited. The federal government only issued recommendations on social distancing and business closures, and it will be up to individual governors to reverse the mandatory orders.", "url": "https://www.cnn.com/2020/04/09/politics/trump-economy-task-force/index.html"}