{"authors": ["Dakin Andone"], "date_download": "2020-05-04 16:09:35", "date_modify": "2020-05-04 16:09:35", "date_publish": "2020-04-02 20:51:07", "description": "As video conference app Zoom surges in popularity due to increased usage amid the coronavirus pandemic, federal officials are now warning of a new potential privacy and security concern called \"Zoombombing.\"", "filename": "2020_04_02_us_fbi-warning-zoombombing-trnd_index_1588608575.html", "image_url": "https://cdn.cnn.com/cnnnext/dam/assets/200323113529-zoom-cloud-meeting-app---stock-super-tease.jpg", "language": "de", "localpath": "/Users/petermehler/news-please-repo//data/2020/05/04/cnn.com/2020_04_02_us_fbi-warning-zoombombing-trnd_index_1588608575.html", "title": "FBI warns video calls are getting hijacked. It's called 'Zoombombing'", "title_page": "FBI warns video calls are getting hijacked. It's called 'Zoombombing' - CNN", "title_rss": "NULL", "source_domain": "cnn.com", "maintext": "(CNN) As video conference app Zoom surges in popularity due to increased usage amid the coronavirus pandemic, federal officials are now warning of a new potential privacy and security concern called \"Zoombombing.\"\nThe term refers to a form of cyber harassment reported by some app users, who have reported that some of their calls have been hijacked by unidentified individuals and trolls who spew hateful language or share graphic images.\n\"Zoombombing\" has become so prevalent that this week the FBI issued a news release to warn people of the threat.\nThe FBI received \"multiple reports\" of video conference calls being interrupted by \"pornographic and/or hate images and threatening language,\" the agency said in its release\nA spokesperson for Zoom told CNN in an email on Thursday that the company is aware of the FBI's recent press release and \"appreciates all efforts to raise awareness around how to best prevent these kinds of attacks.\"", "url": "https://www.cnn.com/2020/04/02/us/fbi-warning-zoombombing-trnd/index.html"}